{
    "id": 5727,
    "date": "2024-05-26T15:00:00",
    "date_gmt": "2024-05-26T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5727"
    },
    "modified": "2024-06-28T16:52:51",
    "modified_gmt": "2024-06-28T13:52:51",
    "slug": "%d7%aa%d7%9c-%d7%90%d7%91%d7%99%d7%91-%d7%9e%d7%95%d7%aa%d7%a7%d7%a4%d7%aa-%d7%9e%d7%a8%d7%a4%d7%99%d7%97-%d7%95%d7%94%d7%90%d7%9e%d7%aa-%d7%a2%d7%9c-%d7%a4%d7%a1%d7%99%d7%a7%d7%aa-%d7%91%d7%99%d7%aa",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/he/israeli-citizen-spokesperson/%d7%aa%d7%9c-%d7%90%d7%91%d7%99%d7%91-%d7%9e%d7%95%d7%aa%d7%a7%d7%a4%d7%aa-%d7%9e%d7%a8%d7%a4%d7%99%d7%97-%d7%95%d7%94%d7%90%d7%9e%d7%aa-%d7%a2%d7%9c-%d7%a4%d7%a1%d7%99%d7%a7%d7%aa-%d7%91%d7%99%d7%aa/",
    "title": {
        "rendered": "תל אביב מותקפת מרפיח והאמת על פסיקת בית הדין הבינלאומי | תדריך יומי עם אילון לוי"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Tel Aviv Under Attack from Rafah &amp; the Truth About the ICJ Ruling | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/RLMnluX9RX0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p><strong>שלום וברוכים הבאים למשרד דוברות האזרחים של ישראל.</strong></p>\n\n\n\n<p>אני אילון לוי. היום ה-26 במאי 2024. זה היום ה-233 למלחמת ה-7 באוקטובר.</p>\n\n\n\n<h3 class=\"wp-block-heading\">התפתחויות אחרונות</h3>\n\n\n\n<p>רק בשעה האחרונה חמאס ירה רקטות מרצועת עזה לעבר אזור תל אביב רבתי, מה שגרם לצופרים לפעול. הרקטות נורו מהעיר רפיח, כשחמאס משתמש ברפיח כבסיס לתקוף את ישראל. יש קמפיין בינלאומי אינטנסיבי להכריח את ישראל להפסיק את פעולותיה הצבאיות ברפיח וליצור אזור בטוח לחמאס להמשיך לתקוף את תושבי ישראל, אבל קמפיין זה אינו מבוסס בחוק או בעובדות.</p>\n\n\n\n<h3 class=\"wp-block-heading\">החלטת בית הדין הבינלאומי לצדק</h3>\n\n\n\n<p>אני רוצה לספק לכם חדשות על רפיח שעשויות להפתיע אתכם. בית הדין הבינלאומי לצדק (ICJ) פסק ביום שישי האחרון שישראל יכולה להמשיך לרדוף את משטר הטרור של חמאס בכל מקום בעזה, כולל ברפיח. אולי שמעתם שההיפך קרה, שכן אלו היו הכותרות לפני יומיים בלבד:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>ניו יורק טיימס:</strong> &#8220;בית הדין העליון של האו&#8221;ם מורה לישראל להפסיק את ההתקפה על רפיח&#8221;</li>\n\n\n\n<li><strong>וושינגטון פוסט:</strong> &#8220;בית הדין העליון של האו&#8221;ם פוסק שישראל חייבת להפסיק מיד את ההתקפה ברפיח&#8221;</li>\n\n\n\n<li><strong>CNN:</strong> &#8220;בית הדין העליון של האו&#8221;ם מורה לישראל להפסיק מיד את הפעולה ברפיח&#8221;</li>\n</ul>\n\n\n\n<p>הכותרות האלו שגויות. התקשורת טעתה. הנה מה שבאמת קרה ב-ICJ: ממשלת דרום אפריקה ביקשה מה-ICJ לדרוש מישראל להפסיק את הפעולות הצבאיות בעזה ולסגת מכוחותיה, מה שישאיר את חמאס על רגליו ואת החטופים שם. ה-ICJ דחה את בקשת דרום אפריקה. עם זאת, בית הדין השתמש בשפה מעורפלת בהחלטתו, stating כי ישראל חייבת &#8220;להפסיק מיד את המתקפה הצבאית וכל פעולה אחרת במחוז רפיח אשר עלולה לגרום לתנאי חיים לפלסטינים בעזה שיכולים להביא להשמדתם הפיזית, חלקית או מלאה.&#8221;</p>\n\n\n\n<p>תגובת ישראל הייתה ברורה: אנחנו לא נוקטים פעולה שיכולה ליצור תנאים כאלה. למעשה, אנחנו שולחים כמות עצומה של סיוע הומניטרי לעזה כדי להימנע ממציאות כזו, ואנחנו מפצירים בפלסטינים להתפנות ממעוזי חמאס. זו מלחמה נגד חמאס, לא נגד תושבי עזה.</p>\n\n\n\n<h3 class=\"wp-block-heading\">פירושים מוטעים וביקורות</h3>\n\n\n\n<p>ה-ICJ הזהיר את ישראל לא לעשות משהו שהיא לא עושה בכל מקרה והיא מחויבת לא לעשות. זה לא רק דעתי. שניים מהשופטים שהצביעו בעד ההחלטה, שופט נטר מגרמניה ושופט ארסו מרומניה, הבינו את ההחלטה שלהם עצמם כך שהיא לא מתייחסת לפעולות ישראליות שאינן מסכנות את אמנת הג&#8217;נוסייד. אף אחת מפעולות ישראל לא מסכנת זאת.</p>\n\n\n\n<p>אחד השופטים המתנגדים, השופטת ג&#8217;וליה סבוטינדה מאוגנדה, הייתה אף יותר ביקורתית. היא הזהירה שהניסוח של החלטת בית הדין עלול להיות מובן או מפורש כהוראה להפסקת אש חד-צדדית בלתי מוגבלת וביקרה את בית הדין על ניהול המלחמה בעזה, מה שאינו תפקידו.</p>\n\n\n\n<h3 class=\"wp-block-heading\">המשך הפעולות הישראליות</h3>\n\n\n\n<p>במילים אחרות, ה-ICJ לא הורה לישראל להפסיק את הקמפיין באופן חד-צדדי. השופט אד-הוק אהרון ברק מישראל גם כתב דעה מתנגדת, stating שישראל אינה מנועה מלהמשיך את הפעולה ברפיח נגד חמאס ולהחזיר את החטופים, כל עוד הפעולה של ישראל אינה מפרה את אמנת הג&#8217;נוסייד, מה שהיא כמובן אינה עושה. הוא ביקר את דרום אפריקה על כך שלא הזכירה את האיום שמציב חמאס או את מצב החטופים, מה שמראה שדרום אפריקה פועלת כזרוע המשפטית של ארגון הטרור של חמאס.</p>\n\n\n\n<h3 class=\"wp-block-heading\">טעויות תקשורת והטיית ה-ICJ</h3>\n\n\n\n<p>ה-ICJ לא אמר לישראל להפסיק את הקמפיין להורדת חמאס ולהחזרת החטופים, אבל הוא נתן תחמושת לאלו שדורשים שישראל תיצור אזור בטוח לחמאס להמשיך את הזוועות שלו. חמאס קרא את הכותרות האלו והוקרן להמשיך לתקוף את ישראל מרפיח, כפי שהוכח מהתקפת הטילים האחרונה על תל אביב.</p>\n\n\n\n<h3 class=\"wp-block-heading\">השלכות משפטיות ופוליטיות</h3>\n\n\n\n<p>לישראל יש את הזכות להגן על עצמה מפני איום זה. זה אינו סביר להציע שעכשיו לא חוקי לישראל לנטרל את איום הטילים על תל אביב או לחלץ את החטופים. פירוש זה של החלטת ה-ICJ אינו סביר. עם זאת, מיליוני אנשים עכשיו חושבים שה-ICJ פסק שישראל אין לה זכות לחלץ את חטופיה ברפיח או לרדוף את משטר הטרור של חמאס. טעות זו חייבת להיות מתוקנת.</p>\n\n\n\n<h3 class=\"wp-block-heading\">ה-ICJ וההטייה של השופט סלאם</h3>\n\n\n\n<p>ה-ICJ הפך למשפט ראווה מוטה פוליטית. דוגמה א&#8217;: נשיא בית הדין, השופט נביל אלעראבי. השופט אלעראבי הוא דיפלומט לבנוני לשעבר והיה שגריר לבנון באו&#8221;ם. הוא היה צריך לפסול את עצמו בשל הטייתו הפומבית נגד ישראל. הוא הביע את דעתו על ישראל פעמים רבות, אמר שקרים על ישראל וקידם את הדעות של מרוואן ברגותי, טרוריסט פלסטיני שמרצה עונשי מאסר עולם בכלא הישראלי.</p>\n\n\n\n<h3 class=\"wp-block-heading\">השלכות של החלטת ה-ICJ המוטה</h3>\n\n\n\n<p>שופט שתקף את הנאשם בפומבי אינו יכול להיות שופט הוגן בכל בית משפט. השופט אלעראבי חייב לפסול את עצמו מיד. כל האנשים המדברים בהגינות ומדינות חייבים לדרוש שהוא יפסול את עצמו ממשפט הראווה הזה. המוניטין של ה-ICJ נמצא בסכנה.</p>\n\n\n\n<h3 class=\"wp-block-heading\">מציאות מבצעית ברפיח</h3>\n\n\n\n<p>החלטת ה-ICJ דרשה מישראל לשמור את מעבר רפיח פתוח. עם זאת, מצרים סגרה את מעבר רפיח וחסמה סיוע מלחדור לעזה. החלטת ה-ICJ לא התייחסה לתפקידה של מצרים. ביום שישי האחרון, מצרים הסכימה תחת לחץ אמריקאי לאפשר לסיוע להיכנס לעזה, אבל לא דרך רפיח. במקום זאת, היא אפשרה לסיוע להגיע לישראל כדי לשלוח אותו דרך מעבר כרם שלום, שחמאס תוקף באופן קבוע.</p>\n\n\n\n<h3 class=\"wp-block-heading\">השלכות אסטרטגיות של החלטת ה-ICJ</h3>\n\n\n\n<p>ה-ICJ למעשה נותן לחמאס עצה אסטרטגית צבאית. ה-ICJ צריך ללחוץ על חמאס, לא על ישראל. ישראל לא תפסיק את המלחמה הצודקת שלה כדי להחזיר את החטופים, להשמיד את יכולות הצבא של חמאס ולהבטיח שעזה לא תוכל לאיים שוב על ישראל.</p>\n\n\n\n<h3 class=\"wp-block-heading\">קריאה לפעולה</h3>\n\n\n\n<p>תודה שאתם עוקבים אחרינו ביוטיוב, אינסטגרם, טוויטר ובפלטפורמות מדיה חברתיות אחרות. נעבור עכשיו לשאלות. אנא שלחו את שאלותיכם בתגובות.</p>\n\n\n\n<h3 class=\"wp-block-heading\">שאלות ותשובות</h3>\n\n\n\n<p><strong>שאלה מרנדי פרי באינסטגרם:</strong> <em>כמה זמן ייקח לחפש ולהשמיד את כל משגרי הרקטות מרפיח או מעזה בכלל?</em></p>\n\n\n\n<p><strong>תשובה:</strong> צה&#8221;ל מאמין שרפיח הוא המקום האחרון בעזה שבו יש לחמאס מלאי רציני של נשק. לוח הזמנים של המבצע אינו קבוע, אבל המטרות ברורות: להשמיד את יכולות המשטר של חמאס ולהחזיר את החטופים. ישראל מחויבת לחוק הבינלאומי ולשמור על האזרחים בטוחים.</p>\n\n\n\n<p><strong>שאלה מאינסטגרם:</strong> <em>מה קורה בגבול הצפוני?</em></p>\n\n\n\n<p><strong>תשובה:</strong> מאז ה-8 באוקטובר, חזבאללה תוקף את צפון ישראל יום-יום, מה שמכריח פינוי של אלפי אזרחים ישראלים והרס בתים. ישראל מותקפת בכמה חזיתות, כולל מחבלים פלסטינים, פרוקסי איראניים וחזבאללה. ישראל מזהירה את חזבאללה להתרחק או שתאלץ להשתמש בלחץ צבאי.</p>\n\n\n\n<p><strong>שאלה מבוב לאק באינסטגרם:</strong> <em>מהם התמריצים שמובילים את מצרים לשמור את מעבר רפיח סגור?</em></p>\n\n\n\n<p><strong>תשובה:</strong> מצרים לחצה על ישראל לא להיכנס לרפיח, וישראל גילתה 50 מנהרות שעוברות מרפיח לשטח מצרי. מצרים נהנית מקומיסיות מושחתות על משאיות סיוע, מה שגורם להם להיות לא מרוצים מפתיחת מעברים חדשים. העולם לא ביקר את מצרים על חסימת רפיח כמו שביקר את ישראל.</p>\n\n\n\n<p><strong>שאלה משירי באינסטגרם:</strong> <em>מה דעתך על הוונדליזם של קולנוע בבריטניה לפני הקרנת סרט על טבח פסטיבל המוזיקה בנובה?</em></p>\n\n\n\n<p><strong>תשובה:</strong> זה מזעזע לראות אנשים שמנסים להסתיר את הראיות לזוועות של חמאס. מאז ה-7 באוקטובר, המון פרו-חמאסי מכחיש או מהלל את הזוועות. עלינו להראות את האמת כדי להבטיח תמיכה במאבק של ישראל נגד חמאס ולמנוע זוועות בעתיד.</p>\n\n\n\n<p><strong>שאלה מקלודיה:</strong> <em>איך יכולים לא-יהודים לתמוך בישראל ולהראות סולידריות?</em></p>\n\n\n\n<p><strong>תשובה:</strong> תודה, קלודיה. רבים מישראלים ויהודים מרגישים מבודדים ונבגדים. אנו צריכים יותר תומכים לעמוד לצידנו. תמכו בישראל על ידי שיתוף הסיפורים שלנו, פרסום במדיה חברתית ודיבור בעד הזכות של ישראל להגן על עצמה. עזרו לחברים היהודים שלכם, הצטרפו לשיחות והפיצו את האמת.</p>\n\n\n\n<p><strong>שאלות נפוצות:</strong> <em>איך אתם מרגישים? איך אפשר לתמוך בכם? איך אפשר להצטרף למשרד דוברות האזרחים של ישראל?</em></p>\n\n\n\n<p><strong>תשובה:</strong> תודה על התמיכה שלכם. התחברו כל יום ב-3:00 אחה&#8221;צ שעון ישראל, 8:00 בבוקר שעון מזרח, והגבירו את המסר שלנו. אם אתם בישראל ומתעניינים בהצטרפות, שלחו קורות חיים למשרד דוברות האזרחים של ישראל באינסטגרם ובטוויטר. אנו צריכים את עזרתכם להפיץ את האמת.</p>\n\n\n\n<h3 class=\"wp-block-heading\">סיכום</h3>\n\n\n\n<p>תודה שהצטרפתם אלינו. נמשיך עם תדרוך נוסף מחר. אנא עקבו אחרינו ביוטיוב, אינסטגרם, טוויטר, פייסבוק ולינקדאין. הישארו בטוחים. תודה.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>תל אביב מותקפת מרפיח והאמת על פסיקת ה-ICJ 26 במאי 2024, לציון יום 233 למלחמת ה-7 באוקטובר</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2643,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 367,
        "footnotes": ""
    },
    "categories": [
        367
    ],
    "tags": [
        369
    ],
    "class_list": [
        "post-5727",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "he",
    "translations": {
        "he": 5727,
        "en": 2635
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5727",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5727"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5727/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5730,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5727/revisions/5730"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2643"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5727"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5727"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5727"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}