{
    "id": 3203,
    "date": "2024-05-04T20:10:04",
    "date_gmt": "2024-05-04T17:10:04",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9618/"
    },
    "modified": "2024-05-04T20:10:04",
    "modified_gmt": "2024-05-04T17:10:04",
    "slug": "9618",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9618/",
    "title": {
        "rendered": "&#8220;IDF Chief&#8217;s Message to Troops in Gaza: Endurance, Determination, and Duty Amid Ongoing Operations&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson&#8217;s Office: </p>\n<p>&#8220;The Chief of Staff in the Gaza Strip: The IDF operates in many zones, we still have many tasks ahead. </p>\n<p>To those in reserves: We have a duty to those who left their homes on October 7th and came here &#8211; to take care of them, compensate and appreciate.</p>\n<p>The Chief of Staff, Major General Herzi Halevi, visited the central Gaza Strip on Friday evening, and held a situational assessment and tour with the Commander of Southern Command, General Yaron Finkelmann, the Commander of the 99th Division, Brigadier General Barak Hiram, and the reserve forces operating in the Sderot area central Gaza.</p>\n<p>Attached is a video of the Chief of Staff&#8217;s speech: https://bit.ly/4bkyqph</p>\n<p>Attached is a video on the subject: https://bit.ly/3ycQGCA</p>\n<p>Attached are photos on the subject: https://IDFANC.activetrail.biz/ANC8673</p>\n<p>The Chief of Staff&#8217;s full Statement:<br />\n&#8216;We are going to have two weeks of significant days here. Holocaust Remembrance Day, and Remembrance Day and Independence Day the week after that. We are a year after many victims in the IDF, many citizens killed in these events, with a very big responsibility for us as an army and much memory and thought towards learning in the future, how we get stronger from here onwards and also with understanding, the price we paid with learning together is a price we have to be ready to pay to exist here, so anyone around understands our strong determination to be here. The IDF operates in many areas &#8211; north, south, Judea and Samaria, with Ground Forces, we operate further and in many more ways. Operating in many areas, we still have many tasks ahead. We need endurance, we will swap, we will rest, we will bring people back refreshed. But we will maintain a strong spirit that I receive from you very clearly. We will keep much national determination, IDF&#8217;s determination, and with these things, I think we will reach the right results in the end.<br />\nWe, I mean the State of Israel, with much work of the IDF, the Personnel Directorate, invest huge sums of money to take care of the reservists. A lot of it was allocated this week, it is meant to assist people, it is meant to assist in the future and it is meant to assist people who also lost their place of work. And I&#8217;m telling you, collect also the problems we have and we will deal with it, also with employers and in legislation this is very important. We owe a debt to people who on October 7th left their homes, came here, we have a duty to look after them, to return to them, to compensate, to appreciate, and truly the appreciation is endless.&#8217;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>&#8217;s Office: &#8220;The Chief of Staff in the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip: The IDF operates in many zones, we still have many tasks ahead. To those in reserves: We have a duty to those who left their homes on October 7th and came here &#8211; to take care of them, compensate and appreciate. The Chief of Staff, Major General Herzi Halevi, visited the central Gaza Strip on Friday evening, and held a situational assessment and tour with the Commander of Southern Command, General Yaron Finkelmann, the Commander of the <a  href=\"https://iron-swords.co.il/t/99th-division/\">99th Division</a>, Brigadier General Barak Hiram, and the reserve forces operating in</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3203",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3203
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3203",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3203"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3203/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3203"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3203"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3203"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}