{
    "id": 3103,
    "date": "2024-05-13T16:06:54",
    "date_gmt": "2024-05-13T13:06:54",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9720/"
    },
    "modified": "2024-05-13T16:06:54",
    "modified_gmt": "2024-05-13T13:06:54",
    "slug": "9720",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9720/",
    "title": {
        "rendered": "&#8220;Unveiling IDF&#8217;s Triple-Pronged Strike: Comprehensive Breakdown of Anti-Terror Operations in Gaza&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The IDF is operating in three zones simultaneously in the Gaza Strip: The Air Force has attacked more than 120 terror targets in the past day. </p>\n<p>Forces from Brigade 162, including combat teams from Givati and 401 brigades, fighting in the east of Rafah and on the Gaza side of the Rafah Crossing, continued to operate overnight towards additional terror targets.<br />\nThe combat team of the Givati brigade launched a focused brigade-level attack on Hamas targets in the Rafah area. During the attack, the forces eliminated a number of terrorists in face-to-face confrontations, located weaponry and missile launchers, which were all confiscated and the launchers were destroyed.</p>\n<p>The combat team of Regiment 401 conducted a targeted operation on the local terror infrastructure and destroyed terror infrastructures and confiscated weapons found in a school in the area. </p>\n<p>Forces from Brigade 98 are fighting in the Jabalia area, including combat teams from Regiments 7 and 460, who neutralized a number of terrorists after close-range battles. In coordination with the Air Force, underground infrastructures and many combat zones in the area were destroyed.<br />\nIn one of the attacks, a military building was destroyed in which a Hamas cell was assembled.</p>\n<p>In the Zaytoun quarter where Brigade 99 is operating, the fighters have located weaponry and various terror infrastructures in the area. In a cross-dimensional unit operation, a weapons warehouse was found in an active Hamas house, and in one of the attacks, the forces, in cooperation with the Air Force, eliminated a sniper who ambushed the fighters in the area.</p>\n<p>Attached is documentation of IDF attacks in the Strip: https://bit.ly/4dzN7qv</p>\n<p>Attached is documentation of the activities of Brigade 162 forces in the Rafah area: https://bit.ly/3WFAfZY</p>\n<p>Attached is documentation of the activities of Brigade 98 forces in the Jabalia area: https://bit.ly/4bzMyuT</p>\n<p>Attached is documentation of the activities of Brigade 99 forces in the Zaytoun area: https://bit.ly/3UH60zf</p>\n<p>Attached are pictures of IDF forces activities in the Gaza strip: https://IDFANC.activetrail.biz/ANC13052458</p>\n<p>Attached are pictures of rocket launchers and weaponry located by the Givati combat team in the Rafah area: https://IDFANC.activetrail.biz/ANC12345</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The IDF is operating in three zones simultaneously in the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip: The Air Force has attacked more than 120 terror targets in the past day. Forces from Brigade 162, including combat teams from Givati and 401 brigades, fighting in the east of Rafah and on the Gaza side of the Rafah Crossing, continued to operate overnight towards additional terror targets. The combat team of the <a  href=\"https://iron-swords.co.il/t/givati-brigade/\">Givati brigade</a> launched a focused brigade-level attack on <a  href=\"/hamas\">Hamas</a> targets in the Rafah area. During the attack, the forces eliminated a number of terrorists in face-to-face confrontations, located weaponry and missile launchers,</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3103",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3103
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3103",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3103"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3103/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3103"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3103"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3103"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}