{
    "id": 2920,
    "date": "2024-05-28T12:13:39",
    "date_gmt": "2024-05-28T09:13:39",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9905/"
    },
    "modified": "2024-09-04T21:48:51",
    "modified_gmt": "2024-09-04T18:48:51",
    "slug": "9905",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9905/",
    "title": {
        "rendered": "&#8220;IDF Divisions Thwart Terrorism: Inside the Coordinated Operations Against Hamas in Jabalia and Rafah&#8221;"
    },
    "content": {
        "rendered": "<p>IDF spokesperson:</p>\n<p>Division 98 in cooperation with the Air Force eliminated a cell that fired at our forces in Jabalia; Division 99 forces are expanding their operations in the center of the Strip simultaneously; Division 162 is thwarting terrorism in the Rafah area.</p>\n<p>As part of Division 98&#8217;s operations in the north of the Strip, the combat teams of paratroopers, 460 and 7, eliminated terrorists and located weapons in the area. The fighters destroyed dozens of terrorist infrastructures in the last day in the Jabalia area, including underground tunnels, observation posts, a weapons warehouse, and a military building from which <a href=\"https://iron-swords.co.il/hamas/\"  data-wpil-monitor-id=\"15\">Hamas</a> conducted warfare.<br />\nIn one of the operations, the forces of the division directed the Air Force&#8217;s fighter jets that closed a circle and eliminated a terrorist cell that fired rockets at the fighters operating in the area.</p>\n<p>The combat teams of Division 162, joined by an armored bulldozer, continue operations in the Rafah area.<br />\nThe fighting teams of the 401 and Nachal brigades operated overnight on the Philadelphia route opposite terrorist targets and infrastructures and are operating in the area precisely following intelligence information indicating the presence of terrorist targets in the place.</p>\n<p>The operation is carried out while making efforts to avoid harming non-involved persons.<br />\nThe forces are fighting terrorists, locating underground tunnels in the area, alongside other means of warfare and additional terrorist infrastructures.</p>\n<p>The forces of Division 99 led by the combat team of brigade 679 are expanding their operations in the center of the Strip.<br />\nDuring the last day, the forces identified terrorists residing in a building near them, a short time later a fighter jet attacked the building and eliminated the terrorists. Meanwhile, the forces continue targeted raids on terrorist targets in the area. In one of the completed raids, the forces located a weapons warehouse.</p>\n<p>Attached is documentation from the IDF forces&#8217; operations in the Strip: https://bit.ly/3UYTJWP</p>\n<p>Attached are photos from the IDF forces&#8217; operations in the Strip: https://IDFANC.activetrail.biz/ANC280520244297428</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a>: Division 98 in cooperation with the Air Force eliminated a cell that fired at our forces in Jabalia; Division 99 forces are expanding their operations in the center of the Strip simultaneously; Division 162 is thwarting terrorism in the Rafah area. As part of Division 98&#8217;s operations in the north of the Strip, the combat teams of paratroopers, 460 and 7, eliminated terrorists and located weapons in the area. The fighters destroyed dozens of terrorist infrastructures in the last day in the Jabalia area, including underground tunnels, observation posts, a weapons warehouse, and a military building from which</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-2920",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 2920
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2920",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=2920"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2920/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17437,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2920/revisions/17437"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=2920"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=2920"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=2920"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}