{
    "id": 2646,
    "date": "2024-05-27T20:21:17",
    "date_gmt": "2024-05-27T17:21:17",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=2646"
    },
    "modified": "2024-09-04T21:48:33",
    "modified_gmt": "2024-09-04T18:48:33",
    "slug": "daily-briefing-idf-strikes-in-rafah-hamas-wants-to-destroy-israel",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/daily-briefing-idf-strikes-in-rafah-hamas-wants-to-destroy-israel/",
    "title": {
        "rendered": "Daily Briefing: IDF Strikes in Rafah &amp; Hamas wants to destroy Israel"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Daily Briefing: IDF Strikes in Rafah &amp; Hamas wants to destroy Israel\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/15WcCDG6vWk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello, I&#8217;m Daniel Rubenstein. It&#8217;s May 27th, 2024. This is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. If you&#8217;re watching live online, you can start submitting questions. If I can&#8217;t answer you live, I will go through all the comments later.</p>\n\n\n\n<p>Today is day 234 of the October 7th War. Yesterday afternoon, Hamas fired a barrage of rockets from the city of Rafah towards the greater Tel Aviv area. A few hours later, the IDF carried out a precision strike in Rafah against two senior <a href=\"https://iron-swords.co.il/hamas/\"  data-wpil-monitor-id=\"10\">Hamas</a> terrorists, Yasin Rabia and Khaled Nagar. According to the IDF, Rabia managed all of Hamas&#8217;s terrorist activity in the Judea and Samaria region, funding, planning, and carrying out numerous attacks in the West Bank that killed Israelis. Nagar was a senior official in Hamas&#8217;s West Bank headquarters, directing shooting attacks, transferring funds for Hamas&#8217;s military in Gaza, and carrying out several deadly attacks that killed Israelis.</p>\n\n\n\n<p>The IDF acknowledged reports indicating that the strike resulted in a nearby fire that caused harm to civilians. The incident is under review, and the top IDF prosecutor is investigating the circumstances of the strike. This operation against two senior Hamas terrorists responsible for attacks in the West Bank comes only weeks after senior Hamas leader Osama Hamdan revealed that Hamas was planning to massacre many more Israelis in the West Bank. Despite the shift in focus to Gaza, the threat from Hamas in the West Bank remains real, including rocket fire and the potential for more atrocities similar to those of October 7th.</p>\n\n\n\n<p>There has been an intense international campaign to force Israel to end its military operations in Rafah. This pressure comes from NGOs, international courts, many governments around the world, and sympathetic media. Essentially, this pressure sends a message to Hamas that if they carry out barbaric attacks, hide among civilians in their hometowns, and continue their terror activities, the international community will protect them. Hamas sees this pressure on Israel and believes its strategy is working. They move with civilians in Gaza to wherever the civilians evacuate, using them as human shields.</p>\n\n\n\n<p>Nearly eight months after the October 7th massacre, many people have forgotten or never learned what Hamas truly is. Hamas is a barbaric terrorist organization with zero concern for human life. The Hamas Charter states that &#8220;Israel will exist and will continue to exist until Islam abolishes it as it abolished that which was before it.&#8221; It also says, &#8220;The hour of judgment shall not come until the Muslims fight the Jews and kill them, so that the Jews hide behind the trees and stones, and each tree and stone will say, &#8216;Oh Muslim, oh servant of Allah, there is a Jew behind me; come and kill him.'&#8221;</p>\n\n\n\n<p>In other words, Hamas seeks to destroy Israel and annihilate the Jewish people. It has been openly genocidal for nearly 40 years. Here are a few quotes from Hamas leaders: Mahmoud al-Zahar said, &#8220;Allah willing, their expulsion from Palestine in its entirety is certain to come. We are no weaker or less honorable than the peoples that expelled and annihilated the Jews. The day we expel them is drawing near.&#8221; Hamas cleric Yunis al-Astal said, &#8220;The Jews are brought in droves to Palestine so that the Palestinians and the Islamic nation behind them will have the honor of annihilating the evil of this gang. Bacteria are far less dangerous than the Jews.&#8221; Week after week, genocidal sermons are broadcast from Hamas mosques in Gaza. One Hamas preacher said, &#8220;Our doctrine in fighting you, the Jews, is that we will totally exterminate you. We will not leave a single one of you alive.&#8221;</p>\n\n\n\n<p>Indoctrination in Gaza starts at a young age. On a children&#8217;s show, a little girl says, &#8220;I will shoot the Jews.&#8221; The host asks, &#8220;All of them?&#8221; The girl replies, &#8220;Yes,&#8221; and the host responds, &#8220;Good.&#8221; The October 7th massacre was the fulfillment of the Hamas dream. For many Palestinians, it was the happiest day of their lives. Thousands of civilians followed the Hamas fighters into Israel on October 7th, murdering, raping, looting, taking hostages, and bragging about it.</p>\n\n\n\n<p>This is why Israel is at war. The Hamas Charter states that there is no solution to the Palestinian problem except by Jihad. For nearly 40 years, Hamas has lived up to the values it put forth in its Charter. In the 1990s and early 2000s, Hamas carried out suicide bombings on buses, in restaurants, cafes, malls, nightclubs, and hotels, leaving blood in the streets of Israel. Hamas became more popular as a result. In 2005, Israel withdrew its soldiers and civilians from Gaza, and Hamas gained more support. It won the Palestinian parliamentary elections in 2006, and in 2007, Hamas seized power in Gaza, violently overthrowing its rival, the Palestinian Authority.</p>\n\n\n\n<p>Hamas turned Gaza into a base for launching attacks against Israel, with tens of thousands of rockets, tunnels crossing under the Israeli border, and incendiary balloons that ignited Israeli fields. There were wars with Hamas in 2008, 2012, 2014, and 2021. Now, Israel is at war with Hamas again. Hamas chose the time and place of this war, and it is responsible for the consequences of its decision to pursue a war of annihilation against Israel. Don&#8217;t let anyone forget it.</p>\n\n\n\n<p>Let&#8217;s now take some questions from our viewers across social media—Twitter, Instagram, and YouTube.</p>\n\n\n\n<p><strong>Saul on Twitter:</strong> Did Hamas change its Charter? I read that Hamas was willing to accept a Palestinian state.</p>\n\n\n\n<p><strong>Daniel Rubenstein:</strong> This is a great question and one that I get a lot. Hamas did not change its Charter. In 2017, Hamas published a new policy document, and many newspapers reported that Hamas had dropped its call for the destruction of Israel. However, this was false. The 2017 document states that &#8220;Hamas believes that no part of the land of Palestine shall be compromised or conceded, irrespective of the causes, the circumstances, and the pressures, and no matter how long the occupation lasts.&#8221; It rejects any alternative to the full and complete liberation of Palestine from the river to the sea. While it mentions accepting a Palestinian state along the 1967 lines as a formula of national consensus, it does so without compromising its rejection of the Zionist entity or relinquishing any Palestinian rights. In other words, Hamas sees this as just a phase in its ongoing war against Israel, not a genuine change in its ultimate goal of destroying Israel.</p>\n\n\n\n<p><strong>Viewer:</strong> Can peace happen with Arab states? What is the future of the Abraham Accords in the aftermath of the October 7th War?</p>\n\n\n\n<p><strong>Daniel Rubenstein:</strong> Peace with Arab states is possible. Israel has peace agreements with Egypt and Jordan, which, while not a warm peace, are better than a hot war. Israel has always sought to expand the circle of peace with other Arab countries. The Abraham Accords, which saw the UAE, Bahrain, Morocco, and Sudan establish relations with Israel, were a significant step forward. One of the reasons Hamas invaded Israel on October 7th was to disrupt the Abraham Accords and prevent their expansion to include countries like Saudi Arabia. Time will tell if Hamas succeeded in this goal, but the potential for peace remains.</p>\n\n\n\n<p><strong>Alon Levy:</strong> How did you enjoy giving your first live briefing?</p>\n\n\n\n<p><strong>Daniel Rubenstein:</strong> Thank you for the question, Alon. I enjoyed it very much and may do it again soon. I want to remind all our viewers that we are live every day, Sunday to Thursday, at 3 p.m. Israel time (8 a.m. Eastern time). We take questions via social media and try to answer them. Please tell your friends, family, and social media followers to join us. The more we build our audience, the more people we can reach with our important message. Thank you for watching and goodbye.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Daily Briefing: IDF Strikes in Rafah &#038; <a  href=\"/hamas\">Hamas</a> wants to destroy <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> May 27th, 2024.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2648,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-2646",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 2646
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2646",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=2646"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2646/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17432,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2646/revisions/17432"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2648"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=2646"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=2646"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=2646"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}