{
    "id": 2797,
    "date": "2024-05-30T18:59:15",
    "date_gmt": "2024-05-30T15:59:15",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=2797"
    },
    "modified": "2024-05-30T18:59:56",
    "modified_gmt": "2024-05-30T15:59:56",
    "slug": "episode-1-unrwa-deep-dive-with-dr-einat-wilf",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/episode-1-unrwa-deep-dive-with-dr-einat-wilf/",
    "title": {
        "rendered": "Episode #1 UNRWA | Deep Dive with Dr. Einat Wilf"
    },
    "content": {
        "rendered": "\n<div class=\"section-wrapper\" data-id=\"oVpReY\"><section class=\"wp-block-gutenverse-section guten-element guten-section guten-oVpReY layout-boxed align-stretch\"><div class=\"guten-background-overlay\"></div><div class=\"guten-shape-divider guten-shape-divider-top\"></div><div class=\"guten-shape-divider guten-shape-divider-bottom\"></div><div class=\"guten-container guten-column-gap-default\">\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-wcZt57\"><div class=\"guten-background-overlay\"></div><div class=\"sticky-wrapper\" data-id=\"wcZt57\"><div class=\"guten-column-wrapper\">\n<figure class=\"guten-element guten-video guten-8B5jJJ\"><div class=\"guten-video-wrapper\" data-property=\"{&quot;url&quot;:&quot;https://youtube.com/watch?v=OpOuZVtU35s&quot;,&quot;class&quot;:&quot;guten-video-background&quot;,&quot;width&quot;:&quot;100%&quot;,&quot;height&quot;:&quot;500px&quot;,&quot;controls&quot;:true,&quot;playsinline&quot;:true,&quot;style&quot;:{},&quot;config&quot;:{&quot;youtube&quot;:{&quot;playerVars&quot;:{}}}}\"></div></figure>\n</div></div></div>\n\n\n\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-GfL5UK\"><div class=\"guten-background-overlay\"></div><div class=\"sticky-wrapper\" data-id=\"GfL5UK\"><div class=\"guten-column-wrapper\">\n<h2 class=\"wp-block-heading\">Introduction</h2>\n\n\n\n<p>Did you know that out of the 5.9 million that UNRWA, the UN Relief and Works Agency, registers as refugees, barely 5% would be considered refugees or stateless by any international standard? Had they been treated like all other refugees in the world more than 70 years ago, none of them would be refugees today. Except for a thin layer of donor-facing high-level management, all of UNRWA&#8217;s employees and administration are Palestinians. UNRWA is not what you imagine when you hear a UN agency or the letters UN; it is actually a thinly disguised, fully Palestinian organization managed by Palestinians, catering to Palestinians, and devoted to the Palestinian vision of return.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Vision of Return</h2>\n\n\n\n<p>In case any of you think that when Palestinians speak of return, it is an innocent idea, a nostalgia for a great grandmother&#8217;s long-lost home, October 7th is the minute-by-minute play of the Palestinian vision of return. Look into Arab Palestinian texts from the &#8217;50s and &#8217;60s; the way they describe the vision of return is violent and brutal. &#8220;We will tear out the hearts from the bodies, take out the fingernails.&#8221; This is why you saw so much exhilaration on October 7th among Palestinians. Contrary to the lie that Hamas doesn&#8217;t represent the Palestinians, Hamas operated on behalf of the deepest Palestinian ethos: that of return and revenge.</p>\n</div></div></div>\n</div></section></div>\n\n\n\n<h2 class=\"wp-block-heading\">Historical Context</h2>\n\n\n\n<p>To understand why UNRWA is so critical to the Palestinian ethos, it&#8217;s important to go back a bit in history. In the beginning of the 20th century, most of the world was divided between empires. By the end of the 20th century, much of the world was divided between states. In the process of that violent transition from empires to states, tens of millions of people became refugees as new countries emerged, delineating new borders, typically in the course of war. These tens of millions of refugees, Hindus and Muslims, Germans, Ukrainians, Poles, Hungarians, Italians, Turks, Greeks, and Jews, none of them are considered refugees today. Their hundreds of millions of descendants are not considered refugees today, except one group: Arab refugees from the war now known as Palestinians.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Unique Case of Palestinian Refugees</h2>\n\n\n\n<p>The reason that only Palestinians claim to be refugees from a war that ended more than 76 years ago is they didn&#8217;t get the memo. The memo for all these other refugees after World War II was tough, tragic, but move on. This is the vector of history: there are now new states and new borders, but wherever you are is where you stay. Maybe you go somewhere else, but there is no going back. The Arabs, as they themselves declared, found it more important that the Jews would not have a state anywhere in the land rather than them having a state in part of the land. We could have been celebrating 76 years of an Arab state next to a Jewish state based on the UN partition plan, living in peace and prosperity. Instead, they went into an unnecessary war, and in the course of that war, people became refugees. Jews and Arabs became refugees; Jews were absorbed by Israel within the ceasefire lines, many Arabs were left in what became the state of Israel and became its citizens. But the Arabs who fled or were expelled became refugees and were to be settled by a temporary agency called UNRWA, established by the UN General Assembly for 18 months. It was understood that within 18 months, all these hundreds of thousands of refugees would be settled, except that the Arab refugees themselves refused to settle.</p>\n\n\n\n<h2 class=\"wp-block-heading\">UNRWA&#8217;s Role and Impact</h2>\n\n\n\n<p>What they did is essentially hijack this temporary agency, ensuring that it was called UNRWA, having the letters UN, creating the false impression this is really an international, neutral organization. They made sure that it did not settle a single Arab refugee. They ensured that it got a legal loophole whereby it could define refugees and inflate their numbers, not based on international standards, and that it would never close so that generation after generation, they would keep alive the illusion that they don&#8217;t have to come to terms with the existence of a Jewish state. They can persist in the belief that the Jewish state is a mere aberration in the region. That&#8217;s what UNRWA does. All the other things that UNRWA does are in the service of perpetuating this illusion, funded with American and Western money. They are literally funding a forever war against a Jewish state, raising generation after generation of Arabs, now known as Palestinians, who believe that it is their noble duty to fight to the last a Jewish state in any part of the land.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Misconception of the Two-State Solution</h2>\n\n\n\n<p>A few days ago, I wrote a post that went viral, saying to all the countries now recognizing Palestine, claiming they are doing it to promote a two-state solution, it is high time they check if one of those two states is actually the Jewish state. During all those years when Palestinian leaders said they support a two-state solution, we made the crazy assumption that one of those two states is the Jewish state. In retrospect, we had to check because when Arabs and Palestinians say two states, they mean an Arab state in the West Bank and Gaza and another Arab state to replace Israel through this mechanism of refugee return. Again, they are not refugees by any international standard. Forty percent of the inflated number that UNRWA claims live in the West Bank and Gaza. They are not refugees from Palestine; they have lived there all their lives. Another 40% are Jordanian citizens. Nowhere in the world are you a citizen of a country and then a refugee of a country in which you never existed. Those who claim to be refugees in Syria and Lebanon, most of them, two-thirds, have long left, got citizenship of other countries. By any international standard, if you&#8217;re a citizen of another country, you&#8217;re no longer a refugee.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>So I said, Norway, Ireland, Spain, you want to recognize Palestine? By all means, go ahead. But then also make it clear that since you want to promote a two-state solution and you&#8217;re not from the river to the sea people, in case your two-state vision does mean that one of the two states is Jewish, it&#8217;s high time you defunded UNRWA. Make it clear that Palestinians living in Palestine that you just recognized cannot simultaneously be refugees from Palestine. They certainly possess no right to settle in another sovereign country of which they were never citizens and breach that sovereignty in the name of an idea of return. If they make that clear, we know they&#8217;re serious.</p>\n\n\n\n<p>UNRWA, from the beginning, in the words of the Arabs themselves, was established as the counterweight to the existence of the Jewish state. It was going to be the sword, the question mark that hangs above the Jewish state, making it clear that its permanence is not accepted by the Arabs. If we are truly to finally move forward like all the other people in the world, the Palestinians need to finally get the memo that all these tens of millions of refugees got. It&#8217;s tough, it&#8217;s tragic, and you move on.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a> registers 5.9 million Palestinian refugees, but only 5% meet international criteria. Unlike other refugees, Palestinians haven&#8217;t resettled for over 70 years, perpetuating the idea of &#8220;return&#8221; and opposing <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s existence. UNRWA, primarily Palestinian-run, maintains this stance, funded by international support, hindering a two-state solution.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2799,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-2797",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 2797
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2797",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=2797"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2797/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 2800,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2797/revisions/2800"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2799"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=2797"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=2797"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=2797"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}