{
    "id": 2791,
    "date": "2024-05-30T18:49:16",
    "date_gmt": "2024-05-30T15:49:16",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=2791"
    },
    "modified": "2024-05-30T18:53:24",
    "modified_gmt": "2024-05-30T15:53:24",
    "slug": "fighting-for-survival-on-seven-fronts-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/fighting-for-survival-on-seven-fronts-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "Fighting for Survival on Seven Fronts | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Israel: Fighting for Survival on Seven Fronts  | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/EYiqDSe2CSs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Introduction</h3>\n\n\n\n<p>Hello everyone, I&#8217;m Eylon Levy, and welcome to the live Daily Briefing of the Israeli Citizen Spokesperson&#8217;s Office. It is Thursday, May 30th, day 237 of the October 7 War. Send us your questions, please, whatever platform you&#8217;re watching from, and we&#8217;ll have a live Q&amp;A at the end. Anything you want to know.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Current Situation</h3>\n\n\n\n<p>A short while ago, sirens sounded in Northern Israel. The reason? A long-range cruise missile was fired at Israel, apparently from Iraq. The government of Iraq is not firing missiles at Israel; it is Iranian proxies in Iraq. It is Iran in Iraq that has been firing missiles and UAVs at Israel, joining the war that Hamas started on October 7. The IDF intercepted the missile and, thankfully, this time no injuries or damage were reported.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Fight for Survival</h3>\n\n\n\n<p>Israel is fighting for its survival against a coalition of Iranian proxy armies on seven fronts: Gaza, the West Bank, Lebanon, Syria, Iraq, Yemen, and Iran itself. This is not a local conflict between Israel and the Palestinian terrorist group in Gaza. It is a regional conflict in which Israel is under attack from every direction by terrorist forces loyal to the Islamic Republic.</p>\n\n\n\n<p>The conflict in Gaza is only one part of a much bigger war that Hamas started on October 7. Hezbollah joined that war from Lebanon on October 8 and has been firing rockets at Israel every single day, including today, with non-stop sirens in Northern Israel. I could say that Israel is fighting Iranian terrorist proxies on eight fronts if I include American campuses. I wish I were joking, but I&#8217;m not.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran&#8217;s Influence</h3>\n\n\n\n<p>The Supreme Leader of Iran, Ayatollah Ali H, just published a letter expressing solidarity with the students who are intimidating and assaulting Jewish students on college campuses. He called the students in the college TTIF a branch of the resistance front. That means that Iran considers them the same as Hamas, Hezbollah, and the Houthis. He praised them for their &#8220;honorable struggle&#8221; against the brutal Zionist regime because when Iran hears students on campuses calling to globalize the intifada, it knows they mean globalizing violence against Jews and Israelis, and terror attacks in the west. When Iran hears them chanting &#8220;From the River to the Sea,&#8221; it knows they want the violent destruction of Israel and not some peaceful secular democracy for everyone.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Call for Global Action</h3>\n\n\n\n<p>The whole world needs to put pressure on the Islamic regime in Iran to stop its seven-front war against Israel and choose peace instead. In Gaza, IDF operations continue. The IDF now has control over the border area between Gaza and Egypt. This strip of land is known as the Philadelphia Corridor. Israeli control of this area is critical to stop Hamas from rearming. The corridor was Hamas&#8217;s lifeline. It is full of tunnels that go underground from Gaza into Egypt. So far, the IDF has located around 20 tunnels just in the narrow strip of land along the Gaza-Egypt border. Hamas used these tunnels to smuggle the weapons it used against Israelis on October 7 and in decades of rocket fire on Israeli communities before the massacre.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF Operations in Rafah</h3>\n\n\n\n<p>The IDF is now systematically dismantling Hamas&#8217;s underground highway network along the Egyptian border and also under the city of Rafah. In eastern Rafah, the IDF found an underground tunnel that was 1 and a half kilometers long. It found an entrance just 100 meters from the Rafah border crossing. Now, that tunnel entrance branched out into many different tunnel routes. The IDF went into these tunnels and found several blast doors, hiding spaces, and toilets. It found a huge supply of weapons in the tunnel network: anti-tank missiles, AK-47s, grenades, and other explosives. Israel is going into Rafah to destroy the last four Hamas battalions because you don&#8217;t put out three-quarters of a fire.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217;s Strategy</h3>\n\n\n\n<p>The Hamas battalions that remain in Rafah will now have a much harder time hiding from the IDF and launching attacks from within and under civilian areas. And it&#8217;s not just tunnels that the IDF is finding. Just a few steps away from the Egyptian border, the IDF found dozens of rocket launchers loaded and ready to fire. In recent weeks, Hamas has fired about 70 rockets and mortars from the Rafah area, including out the Kerem Shalom Crossing, disrupting humanitarian aid deliveries into Gaza. Hamas put the launchers right on the border with Egypt because it knows that Israel does not want to strike an area so close to the Rafah border crossing, through which humanitarian aid was entering Gaza until Egypt closed that border.</p>\n\n\n\n<p>That is Hamas&#8217;s strategy: to attack and draw fire to humanitarian aid crossings. Why? Because that will force Israel to close the crossings. Hamas wants to engineer a humanitarian crisis in Gaza because it knows that the images of suffering on TV screens are good for its war against Israel, and it wants the world to play along. Hey, Hamas&#8217;s strategy seems to be working. There is an enormous gap between the facts on the ground about what is going on in Gaza and the totally insane things that politicians around the world are saying about what is happening in Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Misinformation and Media Accountability</h3>\n\n\n\n<p>Yesterday, I saw a tweet from Senator Bernie Sanders. It said, &#8220;Israel&#8217;s military offensive in Rafah has crippled the delivery of humanitarian aid. Children are starving. No food, no water, no medicine, no fuel is getting to people in desperate need.&#8221; Senator Sanders is making things up. He is either lying, or he has no idea what he is talking about. Those are the only two options. Here are the facts: 335 humanitarian aid trucks went into Gaza yesterday, far more than at any point before the war. Five tankers with 267,000 liters of fuel went into Gaza yesterday as Bernie Sanders was saying nothing went in. And this fuel will be used to operate essential infrastructure in Gaza, such as hospital facilities—the same hospitals, by the way, from which Hamas launches attacks on Israel.</p>\n\n\n\n<p>The day before yesterday, a record 465 humanitarian aid trucks were transferred into Gaza. Definitely not a trickle, definitely not nothing. Record numbers. And all of this information is publicly available. It&#8217;s available from COGAT, the Israeli army unit that operates the border crossings. And I served in this unit just after the last Gaza war in 2014. It&#8217;s disgraceful that politicians are making things up or lying about Israel and advancing Hamas&#8217;s propaganda war against Israel.</p>\n\n\n\n<p>Someone should also send a memo to Samantha Power, the administrator of USAID. She tweeted, &#8220;Our humanitarian partners working in Gaza tell us that conditions now are worse than ever before. Israeli military operations and closed crossings are making it extremely difficult to distribute aid.&#8221; Samantha Power doesn&#8217;t say who closed the crossings. Did you notice that? It&#8217;s as if they closed themselves. Egypt closed the Rafah Crossing, one of the major crossings through which aid was entering Gaza. Egypt stopped aid going from the El Arish port into Kerem Shalom. It only backed down under American pressure, but it receives not a word of public criticism for blocking aid into Gaza.</p>\n\n\n\n<p>It&#8217;s time that world leaders start telling the truth and exercising responsibility instead of amplifying the lies of the terror organization that perpetrated October 7th and is threatening to do it again.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Rafah Incident Investigation</h3>\n\n\n\n<p>Finally, an update on the tragic fire in Rafah. Ed O&#8217;Keefe is the White House correspondent for CBS. During a press conference on Tuesday, he asked John Kirby, the National Security Council spokesman, &#8220;How many more charred corpses does the president need to see before he considers a change of policy?&#8221; Now, that exchange with Kirby went viral. O&#8217;Keefe was reacting to an incident that the IDF is investigating. Here&#8217;s what we know so far: The IDF used small munitions to carry out a precision strike against two Hamas arch terrorists. It didn&#8217;t drop 2,000-pound bombs. It used the same types of munitions that the Biden Administration has been urging Israel to use in Rafah because, as the White House says, the enduring defeat of Hamas is a shared goal and something, perhaps, Hamas munition stored nearby near civilians sparked a fire 600 feet away, and that fire spread into a civilian encampment. The images were terrible, but O&#8217;Keefe is asking the wrong question. He&#8217;s asking how many more uninvolved Palestinian civilians in Gaza need to die, not before Hamas surrenders and releases the hostages from its terror dungeons, but before President Biden demands that Israel abandons its citizens in the Hamas terror dungeons and leaves the Hamas rapist regime in power, able to plan more October 7th massacres. That cannot and will not happen. Not only for Israel but also for the fate of the West and the whole free world fighting radical terror.</p>\n\n\n\n<p>The real question is this: How much more must the people of Gaza suffer before the government of Gaza, Hamas, decides it&#8217;s too much? Is there a number? Because this war can end immediately if Hamas surrenders. If it lays down its arms and gives us back all the hostages—125 are still stuck in Gaza. Hamas can end the war it started, and world leaders have said repeatedly, it is impossible to have a sustainable ceasefire while Hamas is still in power in Gaza because Hamas exists for the sake of war, for the sake of peace. Hamas must go.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Objective</h3>\n\n\n\n<p>Israel isn&#8217;t going into Rafah for fun. Israel is paying a heavy price for this war that Hamas started. Our soldiers are dying, but the bottom line is clear:</p>\n\n\n\n<p>This war cannot end with Hamas continuing to shoot rockets at Israelis. That&#8217;s why it&#8217;s so important that Israel secure the border between Gaza and Egypt so Hamas cannot smuggle the rockets that it has used for over 20 years to rain rockets on Israeli communities. Israel will continue to target members of the Hamas rapist regime until that regime is no more and every single Israeli hostage is freed from the Hamas terror dungeons because the alternative to fighting this barbaric enemy in a war we didn&#8217;t want, a war we didn&#8217;t start, a war we didn&#8217;t even expect, is to abandon our hostages in the hands of Hamas. And nobody can allow that to happen.</p>\n\n\n\n<p>That&#8217;s the end of today&#8217;s briefing. I&#8217;ll now take any questions you have. As a reminder, you are welcome before the briefing, during the briefing, to drop questions wherever you are following on. We are live on YouTube, Facebook, Instagram, Twitter, TikTok. Feel free to leave questions. My team is going through them here. We&#8217;ll take your questions here in real time.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p><strong>Questioner</strong>: Oh, Shon on Instagram asks, &#8220;Why isn&#8217;t Israel addressing the Rafah incident and by doing that, letting the misinformation be accepted as truth?&#8221;</p>\n\n\n\n<p><strong>Eylon Levy</strong>: Thank you. Israel is addressing the facts around Rafah. In fact, the IDF spokesperson, Daniel Hagari, gave a briefing. It went live. He had maps and pictures behind him. The IDF has been tweeting it. The information is out there now. It takes time for Israel to check the facts. We&#8217;ve seen this pattern before. Hamas tells a lie; it spreads around the world while Israel does the responsible thing of checking the facts before we tell the world what happened. It happened at the beginning of the war. Hamas claimed that an Israeli airstrike hit the Al-Ahi hospital in Gaza, killed 500 people. The word went around the world until Israel checked the facts, and it turned out that it was an Islamic Jihad rocket, a piece of shrapnel that hit the car park in the hospital, and far fewer people were killed. By the way, Hamas claimed 500 people were killed; it was a lie, but that&#8217;s still part of the official Hamas casualty figures.</p>\n\n\n\n<p>It takes time for Israel to check the facts, but we&#8217;re sharing it with the world. And what we&#8217;re doing here at the Israeli Citizen Spokesperson&#8217;s Office is to amplify the accurate official information from Israel. The question we need to be asking isn&#8217;t &#8220;Why isn&#8217;t Israel sharing the information?&#8221; but &#8220;Why isn&#8217;t the media responding to it?&#8221; Why did journalists who fell for Hamas&#8217;s scam right at the beginning, quoting Hamas officials, keep covering up the fact they made a terrible mistake in amplifying that propaganda instead of checking the fact? We need accountability from the global media. We cannot have this recurring pattern that Hamas tells tells a lie, and it goes all the way around the world before Israel can check the basic facts.</p>\n\n\n\n<p><strong>Adena</strong>: asks on Instagram live, &#8220;Is there a hostage deal?&#8221;</p>\n\n\n\n<p><strong>Eylon Levy</strong>: Adena, at the moment, there is no hostage deal. Uh, Israel wants to see a deal that will enable us to get the hostages back. There is no time left for them. An update on the numbers: We have 125 hostages still trapped in Gaza. Of those, we know at least 39 are dead, either killed in captivity or murdered on October 7th and their bodies taken into Gaza. We don&#8217;t have live information about the rest of them. From time to time, Hamas puts out a proof of life video, but that doesn&#8217;t mean it&#8217;s keeping the hostages alive afterwards, and we fear that it is starving and torturing and raping and executing them in the Hamas terror dungeons.</p>\n\n\n\n<p>Israel wants to see a deal that will enable us to get the hostages out, but at the moment, it&#8217;s not happening. And it&#8217;s not happening because Hamas has no reason to let the hostages go. And we think that every government in the world that wants to increase the chances of a hostage deal needs to take steps that will strengthen Israel and weaken Hamas because every time the world criticizes Israel or a fake story does the rounds, Hamas sits back, rubs its hands with glee, and sees the world doing its work for it. And that gives Hamas a reason to want to drag this war out for as long as it can because it thinks that Israel is paying a price for it. No, Hamas must pay a price for this war. We need the world to put pressure on Hamas and its backers—Turkey, Qatar, and Iran—demand that pressure from your government so that Hamas has a reason to let the hostages go, and we can get to a negotiated agreement that will see a pause in the fighting in exchange for those hostages being reunited with their families. It&#8217;s been 237 days, nearly eight months. There is no time left for them.</p>\n\n\n\n<p><strong>Michael</strong>: on Instagram live asked, &#8220;Do you think it is possible that Hamas already smuggled hostages into Egypt?&#8221;</p>\n\n\n\n<p><strong>Eylon Levy</strong>: Michael, that&#8217;s a terrifying possibility. Um, that is not something the IDF has said publicly, and I&#8217;m sure that it is closely monitoring with all the intelligence it has. Unfortunately, if tunnels exist between Gaza and Egypt, that is not something that anyone can conclusively rule out, and that only stresses the importance of Israel destroying the tunnels so that Hamas cannot smuggle anyone out of Gaza. By the way, the prospect of Hamas or terrorists being able to smuggle hostages out of territory shows the importance of pushing Hezbollah away from the border in the north. There are tens of thousands of Israeli citizens who have been displaced in Northern Israel because Hezbollah is shelling their homes, and the threat is not only rockets on their houses. It&#8217;s another hostage crisis on the northern border on a much larger scale, and everyone understands that if Israeli civilians are abducted by the Iranian proxy army called Hezbollah in Lebanon, they can easily be smuggled to Iran by the afternoon. And that is why it is critical that Hezbollah be pushed away from the northern border, preferably through a diplomatic agreement, but if not, Israel will have to push Hezbollah away by force. And it&#8217;s important that the world understand why and what the threat and the risks are.</p>\n\n\n\n<p><strong>Question</strong>: What do you think of the &#8220;All Eyes on Rafah&#8221; campaign that went viral on Instagram?</p>\n\n\n\n<p><strong>Alon Levy</strong>: I&#8217;ll say something that may surprise you. We want the eyes of the world on Rafah because if all the eyes of the world are on Rafah, that might help us find the hostages we know are still languishing in the Hamas terror dungeons under Rafah. We want all eyes on Rafah because then you&#8217;ll see the truth of the IDF&#8217;s precision campaigns against Hamas terrorists and not the propaganda that is being spread because people aren&#8217;t watching the situation closely. We want all eyes on Rafah so people can see how much aid Israel is letting into Gaza instead of believing the statements that Israel is somehow choking off Gaza. We want all eyes on Rafah so people can see the tunnels that Hamas has been using in order to smuggle weapons in from Egypt into Gaza to continue attacking Israelis.</p>\n\n\n\n<p>It&#8217;s important people see the facts. But I&#8217;ll say this: the fact that that campaign went viral around the world while Israel supporters, Jews, and allies were struggling to get the counter campaign, &#8220;Where were your eyes on October 7th,&#8221; shows that we are outnumbered, outgunned, and outmanned in the information war. And that is why it is so important that all of Israel&#8217;s supporters around the world—Jews and allies who understand what this means for the world, for the free world, and for the West—be as loud, creative, and united as possible. You cannot expect hasbara—public diplomacy—to come just from the government. It&#8217;s far too important to leave in the hands of the government. That&#8217;s why we&#8217;ve set up this Citizen Spokesperson&#8217;s Office here with an All-Star team, so we can keep making Israel&#8217;s message around the world and try to fight back against the fact that we&#8217;re simply outnumbered and outgunned. We have to be as loud, as creative, as united as possible. We need everyone to keep sharing the message, having the tough conversations with their friends, not shying away from it because Israel cannot afford to lose this war and leave Hamas on its feet and the hostages in Gaza.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Closing remarks</h2>\n\n\n\n<p>Okay, that&#8217;s all we have time for today. Uh, we will be back on Sunday, uh, Sunday through to Thursday, every day with a live Daily Briefing, not just from me, from the rest of the citizen spokesperson team, some of them we&#8217;re presenting over the last few days. As always, please submit questions in advance and also live—YouTube, Instagram, Twitter, TikTok, Facebook, any other platforms that you&#8217;re on. Thank you very much, everyone. Keep safe and Shabbat shalom. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Alon Leevy, spokesperson for the Israeli Citizen&#8217;s Office, discusses <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s defensive actions against Iranian proxies across multiple fronts. He highlights IDF operations in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, misinformation spread globally, and the urgent need for truthful media reporting. The briefing concludes with a Q&#038;A session addressing misconceptions and emphasizing factual dissemination.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2794,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-2791",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 2791
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2791",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=2791"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2791/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 2796,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2791/revisions/2796"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2794"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=2791"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=2791"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=2791"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}