{
    "id": 2738,
    "date": "2024-05-29T16:40:11",
    "date_gmt": "2024-05-29T13:40:11",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=2738"
    },
    "modified": "2024-05-30T17:09:39",
    "modified_gmt": "2024-05-30T14:09:39",
    "slug": "hamass-lies-about-the-rafah-fire",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamass-lies-about-the-rafah-fire/",
    "title": {
        "rendered": "Hamas&#8217; Survival Strategy: Endangering Their Own Civilians | Daily Briefing with Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas&#039; Survival Strategy: Endangering Their Own Civilians | Daily Briefing with Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/oTGQg2Ye6QQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I&#8217;m Deron Spielman. This is the live Daily Briefing of the Israeli Citizen Spokesperson&#8217;s office. Please submit questions through whichever platform you are watching, and I&#8217;ll answer them at the end.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Addressing Misinformation</h3>\n\n\n\n<p>Once again this week, many people, including journalists, world leaders, and commentators, were happy to read from the script that Hamas wrote for them. They played directly into Hamas&#8217;s hands. This is what I&#8217;m talking about:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Reuters</strong> said, &#8220;Israeli air strikes kill and wound dozens in Gaza area designated as a space for displaced people,&#8221; citing &#8220;officials say.&#8221; The officials mentioned are from Hamas.</li>\n\n\n\n<li><strong>Bloomberg</strong> reported, &#8220;Dozens killed as Israel strikes Gaza City in Rafah assault.&#8221;</li>\n\n\n\n<li>Even <strong>Piers Morgan</strong>, a friend of Israel and accurate reporter, this time got it wrong. He tweeted, &#8220;I&#8217;ve defended Israel&#8217;s right to defend itself after October 7th, but slaughtering so many innocent people as they cower in a refugee camp is indefensible.&#8221;</li>\n\n\n\n<li>The <strong>Prime Minister of Belgium</strong> tweeted, &#8220;A so-called safe Zone outside of Rafah was bombed by Israel, killing tens of women and children.&#8221;</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">The Facts</h3>\n\n\n\n<p>All of these statements share one thing in common: they are wrong. This is what really happened: The IDF carried out a Precision strike against two Hamas Arch terrorists who were hiding in a Hamas compound in Rafah, a mile away from a humanitarian Zone. These Arch terrorists had carried out attacks against Israelis in the past and they were planning attacks against the Israeli civilian population in the future. They were legitimate military targets under international law.</p>\n\n\n\n<p>The Israeli Air Force struck the Hamas compound with two bombs, each having only 17 kg (37 pounds) of explosives. There were no civilians in the area of the target. For reasons that nobody knows yet, a fire ignited 600 feet away from the target, and that fire spread, unfortunately, to a civilian encampment. There were many casualties in that fire. The IDF&#8217;s light munitions that it used in the strike, a distance of two football fields away, could not have been the direct cause of such a fire. It is not yet known what caused the fire so far away from the target, but it looks like Hamas weapons stored may be the reason.</p>\n\n\n\n<p>The IDF released an intercepted phone call of two men in Gaza; they said, and you can see this online, that the fire was caused by Hamas ammunition that was stored near the target that Israel struck. Investigations are ongoing.</p>\n\n\n\n<p>Hamas does not care at all if people get killed; in fact, their strategy from the beginning was that their people would get killed and that, in response, the international community would call for a ceasefire that allows Hamas to remain intact. Ensuring that their own civilians get killed is Hamas&#8217;s survival strategy. I want to say that again: Ensuring that their own civilians get killed is Hamas&#8217;s survival strategy.</p>\n\n\n\n<p>The journalists who spread fake news that Israel bombed a safe place for displaced people and that Israel bombed a tent city should apologize immediately and issue corrections and say the truth that they got it wrong. The world leaders who got it wrong should apologize publicly.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Realities of Conflict</h3>\n\n\n\n<p>There is a pattern here; we all remember in October when the headlines screamed that Israel bombed the hospital Al-Aqsa in Gaza and killed 500 people. The source for the claim was Hamas. The truth that came out was that a misfired rocket fired by terrorists in Gaza struck the hospital parking lot and killed their own people. Hamas and Islamic Jihad killed their own people.</p>\n\n\n\n<p>For Hamas, the truth does not matter. The point of Hamas&#8217;s media campaigns is very simple: to increase international pressure on Israel to end this war with Hamas still in power and our people, our men, women, and children, stuck as hostages underneath Gaza.</p>\n\n\n\n<p>I understand the people who want the war to stop. On October 6th, no one in Israel was looking for war. We don&#8217;t want to send our sons and daughters to war. However, leaving Gaza with Hamas still in power and our hostages trapped in the dungeons underneath the ground is not an option. It&#8217;s not an option for us in Israel, it wouldn&#8217;t be an option for you if they were your children, and it&#8217;s not an option for any other self-respecting nation either.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section</h3>\n\n\n\n<div class=\"guten-element guten-accordions guten-wDS0xr\">\n<div class=\"accordion-item\"><div class=\"accordion-heading\"><div class=\"accordion-icon\"><span class=\"accordion-icon-open\"><i class=\"fas fa-minus\"></i></span><span class=\"accordion-icon-closed\"><i class=\"fas fa-plus\"></i></span></div><span class=\"accordion-text\"><strong>Can you explain the challenges that IDF soldiers are facing in Rafah and how this connects to all the other news that we&#8217;ve been hearing about Rafah?</strong></span></div><div class=\"accordion-body\"><div class=\"accordion-content\">\n<p>There were three IDF soldiers who were killed yesterday in Rafah, and a number of others that were wounded, and this is tragic for the state of Israel which is a small family, and every time one of our soldiers gets killed, we know about it in our neighborhoods. This is really one family that is fighting to defend themselves, the Israeli people.</p>\n\n\n\n<p>We have to understand that Israel is fighting in Rafah right now as John Spencer said, and John Spencer is the number one expert for soldiers that are fighting in urban areas, including the US. He says, and others agree with him, that Rafah is the most difficult urban fighting ever experienced by an army anywhere in the world.</p>\n\n\n\n<p>We have to understand, Israel is working to get the Gazan citizens out of the way while we go after Hamas terrorists. Hamas is trying to put their Gazan civilians in the way around every corner of these buildings where you still have women and children. Hamas terrorists, holding RPGs, come out of tunnels and they&#8217;re safely underground, eating the humanitarian aid that they stole from the people of Gaza.</p>\n\n\n\n<p>We know the price, the price that we are paying is for one reason: Hamas says that they will carry out the October 7th attack again and again, and again, and we have no doubt that if they&#8217;re able to, they will do so. The only reason that we are in Rafah and in Gaza and risking our own soldiers&#8217; lives is to keep the Israeli civilian population safe, and we will continue to do so.</p>\n</div></div></div>\n\n\n\n<div class=\"accordion-item\"><div class=\"accordion-heading\"><div class=\"accordion-icon\"><span class=\"accordion-icon-open\"><i class=\"fas fa-minus\"></i></span><span class=\"accordion-icon-closed\"><i class=\"fas fa-plus\"></i></span></div><span class=\"accordion-text\"><strong>Does the IDF follow international law and what does international law permit and what does it forbid?</strong></span></div><div class=\"accordion-body\"><div class=\"accordion-content\">\n<p>Lisa, Israel follows international law. Every unit has a lawyer that is attached to that unit that knows international law. There have been countless strikes where there were military targets, verified military targets of terrorists that could have saved people that were called off because of international law, and Israel going to the extreme of international law to try to prevent civilian casualties. Let me say this again, in many cases, even when international law would allow Israel to strike terrorists as legitimate targets, Israel has called off hundreds of these attacks because of civilians in the area.</p>\n\n\n\n<p>We will, and the record will show, when this war is over, that other armies around the world will look to Israel and will ask, how did you conduct a war against a terrorist army that follows no rules while adhering to international law? That&#8217;s the truth, and that&#8217;s what we are doing.</p>\n</div></div></div>\n\n\n\n<div class=\"accordion-item\"><div class=\"accordion-heading\"><div class=\"accordion-icon\"><span class=\"accordion-icon-open\"><i class=\"fas fa-minus\"></i></span><span class=\"accordion-icon-closed\"><i class=\"fas fa-plus\"></i></span></div><span class=\"accordion-text\"><strong>What is the situation with the American floating piers that is no longer working off the coast of Gaza? It was delivering humanitarian aid and now there are headlines saying that it has stopped. What do you know about this?</strong></span></div><div class=\"accordion-body\"><div class=\"accordion-content\">\n<p>The United States built a pier to provide humanitarian aid to the people of Gaza. Israel facilitated this. Israel has facilitated humanitarian aid entering Gaza from all four directions, from the north and south, east and west. The only area it&#8217;s not entering is along the Egyptian border of Rafah where they&#8217;re not allowing trucks to go into that area.</p>\n\n\n\n<p>The pier is a very important element to this; however, weather conditions since this is the first, knocked the pier apart, and a number of that aid had dropped into the ocean. But we should know, the greatest threat to the aid in Gaza is not because of the weather, it&#8217;s because of Hamas themselves.</p>\n\n\n\n<p>Hamas targets those humanitarian aid shipments, they have shot and killed their own people as we&#8217;ve seen, and they will do anything to take that flour, that medicine, and that medical aid that is geared for women and children and bring it underneath the ground where their terrorists are hiding. This is the challenge, Israel is allowing aid and encouraging aid to enter into Gaza, Hamas is manipulating the public, stealing that aid, starving their own people and hoping that they&#8217;ll convince the world that Israel&#8217;s at fault.</p>\n</div></div></div>\n\n\n\n<div class=\"accordion-item\"><div class=\"accordion-heading\"><div class=\"accordion-icon\"><span class=\"accordion-icon-open\"><i class=\"fas fa-minus\"></i></span><span class=\"accordion-icon-closed\"><i class=\"fas fa-plus\"></i></span></div><span class=\"accordion-text\"><strong>How can we do a better job making the Case for Israel? We see the lies online, we want to do a better job of talking to other people about Israel, what is your advice to people around the world?</strong></span></div><div class=\"accordion-body\"><div class=\"accordion-content\">\n<p> First of all, Ethan, Suzanne, and Jeffrey, I appreciate the question, how can you be more helpful? We get these questions all the time in Israel from people around the world that are concerned about Israel.</p>\n\n\n\n<p>We have to understand the reality; while the terrorists and those who are supporting them, either willingly or unwillingly, and marching along the streets calling for the ethnic cleansing of Israel, while they sound like they are the majority, they are not.</p>\n\n\n\n<p>If you were standing in an auditorium of a thousand people and 10 people stand up and shout loud, everyone will hear them because the rest of that auditorium is quiet. We know just most recently from the Eurovision Music Festival, the judges voted against Israel, but all the polls showed that the people of Europe voted for Israel, because the average person understands the justification of the Israeli case.</p>\n\n\n\n<p>However, the work that we have to do, and where we need the world community, is don&#8217;t be a person sitting in that auditorium staying silent, stand up, teach your teachers, teach your friends, educate, spread the word, go online, hold events, if there&#8217;s a protest, stand on the other side standing proudly with Israel, and allow your voice to be heard.</p>\n\n\n\n<p>This is the time when there&#8217;s a line that&#8217;s been drawn on the in the sand, those who are with Israel and those who are against Israel, in the future, history will show that those who stood against Israel were standing for evil, and those who were standing with Israel were standing for good.</p>\n\n\n\n<p>This is your opportunity to stand up with courage and support the Israeli people.</p>\n</div></div></div>\n\n\n\n<div class=\"accordion-item\"><div class=\"accordion-heading\"><div class=\"accordion-icon\"><span class=\"accordion-icon-open\"><i class=\"fas fa-minus\"></i></span><span class=\"accordion-icon-closed\"><i class=\"fas fa-plus\"></i></span></div><span class=\"accordion-text\"><strong>Has Egypt commented on the tunnels crossing from Rafah into Egypt and, in general, what&#8217;s the situation with Egypt?</strong></span></div><div class=\"accordion-body\"><div class=\"accordion-content\">\n<p>Tunnels crossing from Israel to Egypt is an embarrassment for the Egyptian Army and the Egyptian government. Since Israeli troops entered into Rafah in search of Hamas terrorists, we found more than a dozen tunnels going from Gaza directly underground into Egypt. These were used for funneling people, for funneling weapons, drugs; this was something that the Egyptian government and the Egyptian Army, which are the official, uh, care, the people that are in charge of the Egyptian side of the border, that are monitoring that border, and that are now, as we can see, not allowing a single person to leave, must have known about.</p>\n\n\n\n<p>This is obviously an embarrassment for Egypt. We haven&#8217;t heard anything, but it just shows, while the world was saying, and world leaders were saying, don&#8217;t go into Rafah, you can&#8217;t succeed in Rafah, just underneath their feet, Hamas was laughing at them, we have tunnels, as long as the world tells Israel not to go into Rafah, we can try to smuggle through our tunnels.</p>\n\n\n\n<p>The truth is being told now that the Israeli forces are in Rafah. There are four brigades of soldiers, Hamas terrorist soldiers, still hiding in Rafah, there are hostages in Rafah, there are ammunitions and rockets that went from Rafah to Israel yesterday, and there are tunnels that were cynically used to F people in and out, hopefully not our hostages, in and out of Gaza.</p>\n\n\n\n<p>Israel is here in Gaza to defend our people. We&#8217;re in Rafah, we have a right to be there, as any nation in the world has a right to defend its people, and we will continue to do so until the Israeli people, every mother and father, can put their child to sleep at night without them being afraid.</p>\n</div></div></div>\n</div>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>Closing comments, or are people watching, I want to thank everybody who&#8217;s watching this station right now. Now, I know not everybody agrees with what I&#8217;m saying, those of you who don&#8217;t agree, I would ask you to actually check your facts, don&#8217;t allow your emotions just to control you.</p>\n\n\n\n<p>My emotions also go out when I see women and children killed that are Gazan. I don&#8217;t want that to happen, but emotions have got to be put aside for logic and truth of who&#8217;s causing that destruction. Hamas is manipulating everyone in the world, in fact, this fire that broke out on Rafah, if you look at the map of where Hamas say is Israel shot, they lied, that&#8217;s not where Israel shot. Israel shot two football fields away from those tents in Rafah. Why did they lie? Because that is what they do, they lie so that you will believe them.</p>\n\n\n\n<p>My calling out to you is that everyone should check their conscience, ask yourself if you&#8217;re following the truth, be brave, if you&#8217;ve been convinced, and you&#8217;ve fallen into the Trap of Hamas, stand up, change your way, and stand for the truth. The truth here is with Israel.</p>\n\n\n\n<p>Thank you.</p>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Deron Spielman from the <a  href=\"https://iron-swords.co.il/c/israeli-citizen-spokesperson/\">Israeli Citizen Spokesperson’s office</a> refuted media claims blaming <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> for civilian casualties in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, stating that IDF strikes targeted <a  href=\"/hamas\">Hamas</a> terrorists, not civilians. He highlighted misinformation spread by <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> to gain international sympathy and emphasized IDF&#8217;s strict adherence to international law to minimize civilian harm. Spielman urged the global community to recognize and counteract Hamas&#8217;s tactics.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2745,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-2738",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 2738
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2738",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=2738"
            }
        ],
        "version-history": [
            {
                "count": 5,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2738/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 2792,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2738/revisions/2792"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2745"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=2738"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=2738"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=2738"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}