{
    "id": 4863,
    "date": "2024-05-11T20:00:00",
    "date_gmt": "2024-05-11T17:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=4863"
    },
    "modified": "2024-06-02T16:25:23",
    "modified_gmt": "2024-06-02T13:25:23",
    "slug": "idf-spokesman-update-11-05-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-11-05-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 11.05, evening"
    },
    "content": {
        "rendered": "\n<h4 class=\"wp-block-heading\"><strong>Fallen Soldiers</strong></h4>\n\n\n\n<p>Over the weekend, we mourned the fall of the fighters Sergeant Itai Livni, Sergeant Yosef Desse, Sergeant Rimas Rimas Mukra, Sergeant Daniel Levy, and First Sergeant Ariel Zim, may their memory be a blessing. They fought bravely in the battle in the Zeitoun area in Gaza and fell as a result of an explosive device and terrorist actions. We accompany the bereaved families and share in their sorrow during these difficult times.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Ongoing Combat in Gaza</strong></h4>\n\n\n\n<p>IDF forces continue to fight throughout the Gaza Strip, in areas where we have not yet operated and in places where we identified Hamas attempting to rebuild and reestablish itself. In northern Gaza, fighter jets are currently attacking terror targets across Jabalia. This morning, we began a temporary evacuation process from the Jabalia area towards the center of the Strip as part of our preparations for military action in the area. In recent weeks, we have identified Hamas&#8217;s attempts to restore its military capabilities in Jabalia, and we are working there to dismantle these efforts.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Military Operations in Various Areas</strong></h4>\n\n\n\n<p>This afternoon, forces from the Gaza Division began an assault against terrorist infrastructures in the Beit Hanoun and Beit Lahia areas near the fence in the central Strip. Forces from the 99th Division are in the midst of a broad operation in the Zeitoun area. The forces have eliminated about three terrorists and found dozens of weapons in a school in the area. They continue to operate there and have recently discovered a significant underground route through which terrorists planned an attack on our forces in the southern Strip. Forces from the 162nd Division continue to attack terror targets in eastern Rafah. This is a focused intelligence-based operation against the terror infrastructures in the area.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Hamas Rocket Attacks</strong></h4>\n\n\n\n<p>Yesterday, terrorists from the area and the central Strip fired 14 rockets towards Be&#8217;er Sheva. One of the launches hit a children&#8217;s playground. Hamas deliberately targeted a civilian population center, which could have ended in disaster. Shortly after, IDF forces attacked the launch sites and additional terrorist operatives in the area. So far, we have eliminated dozens of terrorists in the eastern Rafah area, found significant underground routes, and many weapons. This morning, we coordinated the temporary evacuation of the population to several additional neighborhoods in eastern Rafah near the combat zone. Hamas will continue trying to restore its military capabilities, and we will continue to act and dismantle Hamas&#8217;s capabilities wherever we have intelligence on such attempts.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Northern Border Incidents</strong></h4>\n\n\n\n<p>Returning to the northern border, recently, alerts were triggered following the infiltration of an unmanned aircraft from Hezbollah. The aircraft fell near Beit Hillel without causing casualties. Today, we also attacked southern Lebanon, continuing the air and ground attacks carried out over the past week. In these attacks on Tyre, we targeted more than 120 Hezbollah sites, including weapon storage facilities and positions planned for use against our citizens near the border. During these attacks, we killed over ten terrorists.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Response to Hezbollah Rocket Fire</strong></h4>\n\n\n\n<p>Last night, after several of our attacks in Lebanon and the elimination of two terrorists, Hezbollah fired rockets that caused fires near Kiryat Shmona and damage at several sites in the city. In response, IDF attacked the areas from which the rockets were fired and the forces that carried out the launches.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Memorial Day and Independence Day</strong></h4>\n\n\n\n<p>Tomorrow we will mark the eve of Memorial Day for the fallen IDF soldiers and victims of terrorism, and later this week, we will celebrate Israel&#8217;s 76th Independence Day in the shadow of the war. IDF soldiers and commanders visited the cemeteries; beside each grave, a soldier stood to support the bereaved families. Many IDF fighters who are currently on the battlefield will also be there, ensuring this day is observed safely for all. Since October 7th, almost every Israeli citizen has experienced loss and grief closely. The war for our home and the return of the hostages is present in every household in Israel. Memorial Day carries with it a command to remember and to fight—to fight for our lives here, for all those who sacrificed their lives.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Supporting Bereaved Families and Wounded</strong></h4>\n\n\n\n<p>IDF forces are deployed across all fronts in attack and defense, fighting to protect our security here. We embrace the bereaved families who have paid the heaviest price. We support the wounded, those physically injured, and those emotionally scarred. We will continue to fight to create a security situation that will allow the residents of the north and the south to return home safely. Even at this moment, every soldier and commander on the battlefield keeps the hostages in their thoughts, fighting to bring them home. The 132 hostages from the IDF and all security organizations are in our hearts, and we are committed to bringing them home safely.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF mourns fallen soldiers, continues combat in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> and Lebanon, dismantles <a  href=\"/hamas\">Hamas</a> and <a  href=\"/hezbollah\">Hezbollah</a> infrastructure, supports bereaved families and <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-4863",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 4863
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4863",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4863"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4863/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 4864,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4863/revisions/4864"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4863"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4863"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4863"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}