{
    "id": 4861,
    "date": "2024-05-19T20:00:00",
    "date_gmt": "2024-05-19T17:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=4861"
    },
    "modified": "2024-06-02T16:19:05",
    "modified_gmt": "2024-06-02T13:19:05",
    "slug": "idf-spokesman-update-05-29-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-05-29-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 05.29, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 29.05, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/KSFUNPDllQQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Operational Control Over Philadelphia Route</strong></h4>\n\n\n\n<p>In recent days, IDF forces have gained operational control over the Philadelphia Route on the border between Egypt and Rafah. The Philadelphia Route served as Hamas&#8217;s lifeline through which Hamas consistently smuggled weapons into the Gaza Strip. This achievement is the result of an operational move led by the 162nd Division, which has been fighting in the Rafah area in recent weeks.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Detection and Neutralization of Threats</strong></h4>\n\n\n\n<p>Our forces have detected dozens of observers, tunnels, and rocket launch pits along the route from which Hamas has fired rockets and mortar shells into Israeli territory. Hamas exploited the Philadelphi area, building these infrastructures just tens of meters from the Egyptian border to prevent Israeli attacks. This was at a distance of between 10 to 40 meters from the border, specifically to prevent Israel from attacking near the fence with Egypt.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Hamas&#8217;s Recent Attacks and Tunnel Discoveries</strong></h4>\n\n\n\n<p>I remind you that in recent weeks, Hamas has fired about seven rockets and mortar shells from the Rafah area. So far, our forces have detected around 20 tunnels in the Philadelphi Route area. We are investigating these tunnels and neutralizing them. Simultaneously, the forces continue with raids based on reliable information in the area.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Uncovering Underground Terror Infrastructure</strong></h4>\n\n\n\n<p>In recent weeks, our forces uncovered a substantial underground terror infrastructure in eastern Rafah, stretching one and a half kilometers. The entrance shaft to this infrastructure was located about 100 meters from the Rafah crossing. The path branched into several sub-paths and was used by Hamas operatives for movement, transferring weapons, and executing terror attacks. Inside, we found numerous weapons, including anti-tank missiles, Kalashnikov rifles, explosives, and grenades. The combat team of the 401st Brigade operated in the area and destroyed it.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Chief of Staff&#8217;s Visit</strong></h4>\n\n\n\n<p>Today, the Chief of Staff visited the fighters in Rafah, was impressed by their determination and professionalism, and discussed the many operational achievements that contribute to dismantling Hamas, with an emphasis on creating the conditions for the return of the hostages. We will continue to work with all efforts to create the conditions for the return of all 125 hostages home. We do not forget them for a moment. The forces are fighting in a complex environment with many terrorists in the area. Unfortunately, these battles exact a heavy and painful price.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Fallen Soldiers</strong></h4>\n\n\n\n<p>Sergeant First Class Amir Galilov, Sergeant First Class Uri Braur, and Sergeant First Class Ido Afl, may their memory be a blessing, fell yesterday during operational activity in the Dana-Shafia area. Three other soldiers were seriously injured. I want to convey my condolences to the families during their most difficult time. We embrace them and will continue to support them.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>False Reports by Hamas</strong></h4>\n\n\n\n<p>Yesterday, Hamas issued a false report about an incident in the Mawasi area. This is a lie. Our forces did not operate in the area. Hamas continues to spread lies to the world. Today, we revealed materials showing how Hamas terrorists stole money from Palestinian citizens in Gaza from the Bank of Palestine during the war—about 400 million shekels. This is another reminder that we are fighting a boundless terrorist organization that exploits its population, hides beneath it, within it, and even steals its money from bank accounts. This is a terrorist organization with no limits that will do anything to ensure its survival.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Incident in Central Command Area</strong></h4>\n\n\n\n<p>Earlier today, in the Central Command area, a directed fire was carried out from Tulkarem towards the Bat Hefer settlement. Upon receiving the report, IDF forces conducted extensive searches and an intelligence effort to close the circle and locate the terrorists, an effort that continues to this hour. We thwart dozens of terror attempts in the Judea and Samaria area every week, in the roads and settlements. We will continue with a strong deployment in defense and attack to thwart terror and ensure the security of the residents.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q&amp;A</strong></h2>\n\n\n\n<p><em>Yoav Bubby, Channel 11:</em> What do you have to say to the residents of Bat Hefer who see daily shooting from the direction of Tulkarem and are afraid of disaster? And a second question, does the IDF already know if any hostages were transferred to Rafah?</p>\n\n\n\n<p><em>Response:</em> We are operating in Judea and Samaria and the Tulkarem area with dozens of operational activities every night, targeting terrorist cells. Following the report and documentation, we did not detect any hits in any settlement or on the fence. We will pursue these terrorists. We do this every night and will continue to do so to maintain the security of the residents.</p>\n\n\n\n<p>Regarding the issue of hostages in Rafah, I do not address such matters. When I have updates about our operational activities, I will inform the public.</p>\n\n\n\n<p>Today, it was reported that 20 cross-border tunnels were exposed in the Rafah area as part of the operation there, along with 82 shafts in the Philadelphi area. Can the army say whether these tunnels reach Egypt?</p>\n\n\n\n<p>According to the intelligence information at our disposal, we do not know of any hostages transferred there. It is important to remember that there is also extensive Egyptian activity in the area to protect their national interests. We, of course, inform them of every tunnel we uncover. We are investigating all these tunnels. I cannot currently confirm that all these tunnels reach Egypt. We will investigate this, pass on the intelligence information, destroy, and neutralize them. The shafts you mentioned are near the Egyptian border, both in structures and homes. Each shaft will be investigated and handled. We will clear this area to address all the terror infrastructure established in the Philadelphi Route.</p>\n\n\n\n<p><strong>Closing</strong></p>\n\n\n\n<p>Thank you very much. Good evening.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF gains control over Philadelphia Route, uncovering <a  href=\"/hamas\">Hamas</a> tunnels and weapons, with efforts focused on dismantling terror infrastructure and rescuing <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-4861",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 4861
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4861",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4861"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4861/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 4862,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4861/revisions/4862"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4861"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4861"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4861"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}