{
    "id": 2351,
    "date": "2024-05-13T08:22:51",
    "date_gmt": "2024-05-13T05:22:51",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=2351"
    },
    "modified": "2024-05-13T09:50:40",
    "modified_gmt": "2024-05-13T06:50:40",
    "slug": "the-nation-of-israel-will-remember",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/the-nation-of-israel-will-remember/",
    "title": {
        "rendered": "The nation of Israel will remember"
    },
    "content": {
        "rendered": "\n<p>The nation of Israel will remember its loyal and brave sons and daughters. It will remember the women and men, the girls, the boys, the young women and young men, the elderly women and elderly men. Israel will remember the burnt homes, the bloodstains on the floors, the entire families who, just moments before, smiled at the camera. Israel will remember those who sat in bomb shelters for hours pleading for help, and Israel will remember that no one came. Israel will remember the babies, the naked women, the families murdered in embraces, the severed heads, the silent laid tables.</p>\n\n\n\n<p>Israel will remember the dancers, the energy, the freedom and innocence, the music replaced by sirens, the attempts to escape, the convoy of cars. Israel will remember the bomb shelters, the gunshots, the women left helpless, their bodies telling what they no longer can. Israel will remember all those who risked their lives trying to save strangers, just to ensure no one was abandoned. Israel will remember the prayers, the panicked phone calls, the trembling voices, the pleas.</p>\n\n\n\n<p>Israel will remember the soldiers, both male and female, the police officers, the reservists, the career servicemen, the intelligence and security personnel, and the commanders, both male and female. Israel will remember the watchmen, the heroes who fought until their last breath, courageously, at outposts, bases, and kibbutzim, doing everything for their country, mobilizing even before receiving an order, just from understanding how dire the situation was, and who entered Gaza to retaliate and lost themselves. Israel will remember the spirit of battle, the devotion, the sensitivity, the humanity behind every name cleared for publication, the void and the immense, endless pain. Israel will remember the injured, both mentally and physically, those who lost limbs and friends and underwent multiple surgeries, and continue to fight to recover and heal their wounds.</p>\n\n\n\n<p>Israel will remember the hostages, those released and those still held, those whose bodies are kept, and those who are believed to still be alive. Those who were injured and survived the injury and those who perished and were murdered underground. Israel will remember the children snatched from their beds, the elderly taken without wheelchairs or medication. Israel will remember the tunnels, the testimonies, the bruised faces, the limps, the vacant eyes, the torn families, the sexual assaults, the rapes and the horrors faced at gunpoint. Israel will remember the men waiting to breakdown on a familiar shoulder, the young women left there alone, the families who cannot wait another day for their return.</p>\n\n\n\n<p>Israel will remember the displaced from the north and the south, those who left home, toys, beds, and a sense of security. Israel will remember all those who have lived in a hotel for seven and a half months, those who just want to go home and no one knows when, those who have wandered too much. Israel will remember those murdered in cold blood in traffic jams on the way to work, at gas stations, or on the way to a wedding. Israel will remember those who left home in the morning and never returned because they were murdered by terrorists in cold blood.</p>\n\n\n\n<p>Israel will remember. The sirens, the screams, the orphans, the widows, the parents with sunken faces, the mothers who have not hugged their children for 7 months. The smoke rising from the kibbutzim. The residents of Sderot and Ofakim. The white ambulances driving undisturbed in cities. The heartless and merciless monsters. The pain, the terror, the allowed publication, the fighting.</p>\n\n\n\n<p>Israel will remember October 7th and the months that followed. It will not forgive. It will not forget. It will be worthy. So that all this will not be in vain. It will do everything to retrieve those kidnapped and to rescue them from hell. It will think of the hostages before going to sleep. It will unite. It will mourn. It will strengthen those in need. It will ask for forgiveness. It will hold onto faith. That other days will come. That there is still hope. To be a free people in our land. The land of Zion and Jerusalem.</p>\n\n\n\n<h2 class=\"wp-block-heading\">© <a href=\"https://www.instagram.com/shirifadlon\">Shiri Fadlon Miller</a></h2>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> will remember October 7th and the months that followed. Israel will remember its loyal and brave sons and daughters. Israel will remember </p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2353,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        118
    ],
    "class_list": [
        "post-2351",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-yom-hazikaron-2024"
    ],
    "lang": "en",
    "translations": {
        "en": 2351
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2351",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=2351"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2351/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 2354,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2351/revisions/2354"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2353"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=2351"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=2351"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=2351"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}