{
    "id": 2215,
    "date": "2023-10-07T06:30:00",
    "date_gmt": "2023-10-07T03:30:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=2215"
    },
    "modified": "2024-05-12T21:42:59",
    "modified_gmt": "2024-05-12T18:42:59",
    "slug": "amer-abu-sabila",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/victims/amer-abu-sabila/",
    "title": {
        "rendered": "Amer Abu Sabila"
    },
    "content": {
        "rendered": "\n<p>Amer Abu Sabila, a 25-year-old from the Bedouin dispersed community in Abu Talul, tragically lost his life near a police station in Sderot while trying to save a mother, Odia Swisa, and her two daughters, aged 3 and 6. Amer, who was married and a father of two young children aged four and two, was identified and brought to rest after his family received the heartbreaking news of his death. Hamas killed him in the October 7 massacre as he heroically attempted to rescue the Swisa family after the father, Dolav, had been murdered while they were trying to escape the city.</p>\n\n\n\n<p>Amer, who worked for a foundation drilling company, was visiting his brothers who worked as security guards at a construction site in Sderot on Saturday, October 7th. The Swisa family, attempting to flee Sderot in their car, became targets. The father, Dolav, was shot and critically injured and later succumbed to his injuries after being rushed to an emergency station. The mother and her daughters re-entered the car to hide. During this chaotic moment, Officer Shmuel Golumiah in a civilian vehicle directed the mother to follow him.</p>\n\n\n\n<p>Realizing the mother was unable to drive, Amer courageously stepped into their car and drove after the officer. Upon nearing the police station, Golumiah, Odia, and Amer were fatally shot. The children, hiding under the seats, survived the attack.</p>\n\n\n\n<p>The chief of police of Sderot, Ronen Gabai, along with a civil defense classmate, arrived at the scene where they heard the children screaming for help. They managed to rescue the girls and brought them to safety, ensuring they survived the horrific attack. Amer Abu Sabila&#8217;s bravery and tragic death highlight the grave risks individuals sometimes take to save others.</p>\n\n\n\n<p>Amer is an Israeli hero, who left everything to help those who were in trouble, no matter Jews or Arabs, and was finally murdered and became another victim of the massacre on October 7. Amer left behind a wife and two children, aged 25 at the time of his death. May Allah have mercy 🕯</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Amer Abu Sabila, a 25-year-old from the Bedouin dispersed community in Abu Talul, tragically lost his life near a police station in <a  href=\"https://iron-swords.co.il/t/sderot/\">Sderot</a> while trying to save a mother, Odia Swisa, and her two daughters, aged 3 and 6. Amer, who was married and a father of two young children aged four and two, was identified and brought to rest after his family received the heartbreaking news of his death. <a  href=\"/hamas\">Hamas</a> killed him in the October 7 massacre as he heroically attempted to rescue the Swisa family after the father, Dolav, had been murdered while they were trying to escape</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2218,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-october-7th-victims",
    "format": "standard",
    "meta": {
        "wds_primary_category": 21,
        "footnotes": ""
    },
    "categories": [
        21
    ],
    "tags": [
        42
    ],
    "class_list": [
        "post-2215",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-victims",
        "tag-sderot"
    ],
    "lang": "en",
    "translations": {
        "en": 2215
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2215",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=2215"
            }
        ],
        "version-history": [
            {
                "count": 5,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2215/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 2222,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2215/revisions/2222"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2218"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=2215"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=2215"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=2215"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}