{
    "id": 15464,
    "date": "2023-10-07T06:30:27",
    "date_gmt": "2023-10-07T03:30:27",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=15464"
    },
    "modified": "2024-08-17T14:57:25",
    "modified_gmt": "2024-08-17T11:57:25",
    "slug": "amit-esther-buskila",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/hostages/amit-esther-buskila/",
    "title": {
        "rendered": "Amit Esther Buskila"
    },
    "content": {
        "rendered": "\n<div class=\"section-wrapper\" data-id=\"yb7lIZ\"><section class=\"wp-block-gutenverse-section guten-element guten-section guten-yb7lIZ layout-boxed align-stretch\"><div class=\"guten-container guten-column-gap-default\">\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-QkXy10\"><div class=\"guten-column-wrapper\" data-id=\"QkXy10\"></div></div>\n\n\n\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-hkn4N9\"><div class=\"guten-column-wrapper\" data-id=\"hkn4N9\">\n\n\n<div class=\"guten-element gutenverse-text-editor guten-1Bk5JE\"><div class=\"text-content-inner\">\n<p>Amit was kidnapped from the Mefalsim area, where she fled while trying to escape the terrorists. She was shot in the hand. That Saturday morning, Amit called Shimon, the uncle who raised her almost like a daughter. &#8220;She told me, &#8216;Shimon, there are terrorists around me, I&#8217;m hiding under a vehicle,'&#8221; he recalled. &#8220;Then she was exposed to the terrorists, who shot her. She screamed on the phone that she had been shot in the hand and that she loved us.&#8221; She celebrated her 28th birthday in captivity. On May 17, 2024, in a special operation by the IDF and Shin Bet, her body was recovered from Gaza, and it was revealed that she had been murdered on October 7th.</p>\n</div></div>\n</div></div>\n</div></section></div>\n\n\n\n<div class=\"section-wrapper\" data-id=\"b2tdaG\"><section class=\"wp-block-gutenverse-section guten-element guten-section guten-b2tdaG layout-boxed align-stretch\"><div class=\"guten-container guten-column-gap-default\">\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-T326W4\"><div class=\"guten-column-wrapper\" data-id=\"T326W4\">\n<h3 class=\"wp-block-gutenverse-heading guten-element guten-9k8Loy\">My Story</h3>\n\n\n\n<div class=\"guten-element gutenverse-text-editor guten-tKaPUu\"><div class=\"text-content-inner\">\n<p>Amit Esther Buskila, a 28-year-old woman from Ashdod, Israel, was full of life, dreams, and aspirations. She was in the early stages of building her career and was known for her vibrant personality and love for life. Amit had a successful styling business and was also a talented chef and fashion consultant. She was excited about her upcoming audition for the popular cooking show &#8220;MasterChef,&#8221; a dream she had been working towards with dedication and passion.</p>\n\n\n\n<p>On October 7th, during the Simchat Torah holiday, Amit attended the Nova Festival near Kibbutz Re&#8217;im, a celebration that quickly turned into a nightmare. That day, Hamas, a terrorist organization, launched a brutal and coordinated attack on the festival. Amid the chaos and terror, Amit managed to make a chilling phone call to her uncle Shimon, who had been like a father to her after her own father left the family. In that final conversation, she told him, &#8220;Shimon, I’ve been shot in the hand, Shimon, I’m dying. I love you all.&#8221; These words would be the last her family would hear from her, as the sounds of gunfire and screams surrounded her.</p>\n\n\n\n<p>Amit&#8217;s kidnapping by Hamas marked the beginning of an agonizing period for her family, who were left in the dark about her fate. Weeks passed without any contact or information, and significant evidence in her case was lost in the ensuing chaos. Despite the lack of communication, Amit was eventually classified as a hostage, but no further details about her situation were known.</p>\n\n\n\n<p>Throughout this harrowing time, her uncle Shimon tirelessly advocated for her, moving from one media studio to another to raise awareness about her plight. He called for the return of all kidnapped women and even appealed to the King of Morocco to intervene and help. Amit’s mother, Ilana, expressed her frustration and anger over the failures that led to her daughter&#8217;s kidnapping but also turned to faith for strength. She reminded Amit in spirit to be strong, recalling a conversation they had about a movie and urging her to apply that strength in her current situation.</p>\n\n\n\n<p>As the weeks turned into months, the uncertainty and fear took a toll on Amit&#8217;s family. Ilana, who was facing the threat of eviction from her public housing, found solace in her faith, thanking God for the privilege of being Amit&#8217;s mother, despite the heartbreaking circumstances. She saw her daughter&#8217;s kidnapping as a test of faith and prayed for her safe return.</p>\n\n\n\n<p>Unfortunately, Amit&#8217;s story did not have a happy ending. After more than 100 days without any information, the Israeli Defense Forces (IDF) located her body during an operation in the Gaza Strip. Amit&#8217;s remains were returned to Israel, and she was laid to rest in the Kiryat Gat cemetery. Her brother, Sial, gave a heart-wrenching eulogy, thanking God for the 28 years he had with his sister, whom he described as a &#8220;ray of sunshine.&#8221; He spoke of her strength and determination, recalling how she had fought through life’s challenges with resilience.</p>\n\n\n\n<p>Amit’s mother, Ilana, also spoke at the funeral, expressing her deep sorrow and pride in her daughter. &#8220;My magnificent flower, a once-in-a-lifetime child, you wrapped me in endless love, you are my inspiration,&#8221; she said. The pain of losing Amit was compounded by the knowledge that her life was taken simply because she was a proud Jew. Her family vowed to keep her memory alive, despite the unbearable loss.</p>\n\n\n\n<p>Amit Esther Buskila was a young woman with a bright future, filled with love, ambition, and the desire to make her mark on the world. Her life was tragically cut short by the senseless violence of Hamas, but her memory will continue to inspire those who knew her. Her story is a poignant reminder of the preciousness of life and the devastating impact of terrorism. Her family, and all who loved her, will forever remember her as a symbol of strength, love, and the unbreakable spirit of a young woman who had so much more to give.</p>\n</div></div>\n</div></div>\n</div></section></div>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "",
        "protected": false
    },
    "author": 1,
    "featured_media": 15465,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-hostages-single",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1302,
        "footnotes": ""
    },
    "categories": [
        1302
    ],
    "tags": [
        122,
        34
    ],
    "class_list": [
        "post-15464",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-hostages",
        "tag-ashdod",
        "tag-nova"
    ],
    "lang": "en",
    "translations": {
        "en": 15464
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15464",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=15464"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15464/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15466,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15464/revisions/15466"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/15465"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=15464"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=15464"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=15464"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}