{
    "id": 3790,
    "date": "2024-03-01T15:35:11",
    "date_gmt": "2024-03-01T13:35:11",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9013/"
    },
    "modified": "2024-03-01T15:35:11",
    "modified_gmt": "2024-03-01T13:35:11",
    "slug": "9013",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9013/",
    "title": {
        "rendered": "&#8220;Enhancing IDF Readiness: Inside Look at Central Command&#8217;s Advanced Training for Escalation Scenarios&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Decoy ambushes, settlement defense, and public order disruption scenarios for escalation readiness: Central Command-wide learning training for all commanders completed. </p>\n<p>A Central Command instructional training led by the Judaea and Samaria Division took place this week in &#8216;Lachish&#8217; training base, led by the Chief of Staff, Major General Herzl Halevi and Central Command Manager, General Yehuda Fox, and with the participation of the Central Command deputy Chief of Staff, Judaea and Samaria Division Manager, Brigade Commanders, Battalion Commanders, in regular and reserve service. </p>\n<p>As part of the training, the battalion commanders passed through several stations led by brigade commanders, demonstrating various scenarios and how to cope with them. At each station, a learning process takes place, reviewing the lessons from recent events, to planning and analyzing operational responses, up to practicing with VR glasses.</p>\n<p>The training is intended to improve the readiness and proficiency of the command&#8217;s commanders for escalation scenarios.</p>\n<p>From the words of the Chief of Staff, Major General Herzl Halevi: &#8220;The strong activity of the IDF together with the ISA to thwart terror in the West Bank prevents security escalation and allows us to focus on fighting in Gaza and Lebanon, bringing qualitative achievements there. You have a great responsibility in the West Bank to achieve war goals, to arrive prepared and strong for each mission. This is even more important on the eve of Ramadan. We could not have achieved these without the wonderful reservists here, I highly appreciate your significant contribution in all sectors.&#8221;</p>\n<p>From the words of the Central Command Manager, General Yehuda Fox: &#8220;Readiness for escalation is a substantial event, you need to improve your condition every day for the next one. There might be an event, whether real or not, that could cause tens of thousands to take to the streets, and this thing needs to be visualized and prepared for in every aspect. I would like to express great appreciation to all who worked hard on this important, meaningful and educational day we had.&#8221;</p>\n<p>Attached video on the topic: https://bit.ly/48zyGir</p>\n<p>Attached pictures on the topic: https://IDFANC.activetrail.biz/ANC414158</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Decoy ambushes, settlement defense, and public order disruption scenarios for escalation readiness: Central Command-wide learning training for all commanders completed. A Central Command instructional training led by the Judaea and Samaria Division took place this week in &#8216;Lachish&#8217; training base, led by the Chief of Staff, Major General Herzl Halevi and Central Command Manager, General Yehuda Fox, and with the participation of the Central Command deputy Chief of Staff, Judaea and Samaria Division Manager, Brigade Commanders, Battalion Commanders, in regular and reserve service. As part of the training, the battalion commanders passed through several stations led by brigade</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3790",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3790
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3790",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3790"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3790/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3790"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3790"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3790"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}