{
    "id": 3782,
    "date": "2024-03-03T09:16:17",
    "date_gmt": "2024-03-03T07:16:17",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9021/"
    },
    "modified": "2024-03-03T09:16:17",
    "modified_gmt": "2024-03-03T07:16:17",
    "slug": "9021",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9021/",
    "title": {
        "rendered": "&#8220;Revolutionizing Warfare: IDF&#8217;s Rapid Airstrike Neutralizes 50 Terror Infrastructures in Khan Yunis&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>An airstrike hitting approximately 50 terror infrastructures in less than 10 minutes; 98th division forces launched another assault tonight in the Khan Yunis area.</p>\n<p>Tonight, the maneuvering forces and the fire center of the 98th division launched a broad brigade-level assault in western Khan Yunis to deepen the operational achievement, while destroying terror infrastructures, and eliminating terrorists in the Hamas terror organization who operate from civilian facilities in the heart of the built-up area. </p>\n<p>The brigade-level operation began with a rapid opening airstrike, in which air force fighter planes attacked approximately 50 terror targets in 6 minutes with the help of artillery forces. Among the targeted were underground infrastructures, military buildings, mortar launch sites, booby-trapped buildings, and gathering points of terrorists that posed threats to the forces in the area.</p>\n<p>The extensive airstrike was intended to create favorable conditions for the ground forces, and following it, the brigade’s combat teams began a surprise onslaught on the area, during which the soldiers overran terror targets and eliminated terrorists; the forces continue to operate intensively in the area.</p>\n<p>Over the past day, Nahal Brigade combat team soldiers eliminated dozens of terrorists in the Gaza Strip&#8217;s central region and located combat means. In one operation, the brigade’s compound fire identified a cell of terrorists loading combat means and moving towards the soldiers in the area. In response, an aircraft attacked and eliminated the cell.</p>\n<p>Footage from the airstrike in Khan Yunis is attached: https://bit.ly/4bR5RRk</p>\n<p>Footage from IDF strikes in the strip is attached: https://bit.ly/3T0Mmgz</p>\n<p>Photos from the forces&#8217; activities in the Gaza Strip are attached: https://IDFANC.activetrail.biz/ANC03032024859387390</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: An airstrike hitting approximately 50 terror infrastructures in less than 10 minutes; 98th division forces launched another assault tonight in the Khan Yunis area. Tonight, the maneuvering forces and the fire center of the 98th division launched a broad brigade-level assault in western Khan Yunis to deepen the operational achievement, while destroying terror infrastructures, and eliminating terrorists in the <a  href=\"/hamas\">Hamas</a> <a  href=\"https://iron-swords.co.il/t/terror-organization/\">terror organization</a> who operate from civilian facilities in the heart of the built-up area. The brigade-level operation began with a rapid opening airstrike, in which air force fighter planes attacked approximately 50 terror targets in 6 minutes with</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3782",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3782
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3782",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3782"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3782/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3782"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3782"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3782"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}