{
    "id": 3774,
    "date": "2024-03-04T11:44:21",
    "date_gmt": "2024-03-04T09:44:21",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9029/"
    },
    "modified": "2024-09-04T21:51:04",
    "modified_gmt": "2024-09-04T18:51:04",
    "slug": "9029",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9029/",
    "title": {
        "rendered": "&#8220;IDF Operation: Demolition of Terrorist&#8217;s Apartment, Arrests in Nablus, and Seizure of Hamas Materials&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF soldiers, the Shin Bet, and the Border Police demolished last night in the city of Nablus the apartment of one of the terrorists involved in the attack at the Hamra intersection in which members of the Day family were murdered; the forces completed a brigade operation that lasted about six hours in Al-Amari, during which they arrested wanted men and investigated many suspects.</p>\n<p>IDF soldiers, the Shin Bet, and Border Police operated last night in the city of Nablus in the West Bank to demolish the apartment of terrorist Ahed Masri who took part in the shooting attack on April 7, 2023 at the Hamra intersection, where members of the Day family were murdered, may their memory be a blessing.</p>\n<p>During the night across Judea and Samaria, and in the Jordan Valley and the Valleys Brigade, 13 wanted men were arrested.</p>\n<p>In an operation that lasted approximately six hours in Al-Amari, in the Benjamin region, soldiers operated under the direction of the Shin Bet, arresting two wanted men. In addition, the forces investigated many suspects and seized incitement materials of the terror organization, Hamas. During the operation, a violent disturbance of the peace erupted during which suspects threw stones and firebombs at the soldiers who responded by firing back, and one injury was noted. As part of the exchanges of fire in the area, a female Border Police officer was injured in her leg and was lightly evacuated for medical treatment in a hospital, her family was updated.</p>\n<p>In engineering activity near Nuran Maas in the Menashe sector, the forces uncovered explosives buried under axles aimed to harm our forces.</p>\n<p>In Hebron, in Judea, two wanted men were arrested and many suspects were investigated. In the Dir A-Mar in Ephraim, four wanted men were arrested, and in Tubas in the Jordan Valley and the Valleys Brigade, two more wanted men were arrested.</p>\n<p>The arrested suspects and the seized incitement materials were transferred for further investigation by the security forces.</p>\n<p>So far, since the beginning of the war, approximately 3,400 wanted men have been arrested across the Judea and Samaria Division and the Jordan Valley and the Valleys Brigade, about 1,500 of them are affiliated with the <a href=\"https://iron-swords.co.il/hamas/\"  data-wpil-monitor-id=\"48\">Hamas</a> terror organization.</p>\n<p>Attached is documentation of the forces&#8217; activity: https://bit.ly/3wLL1CJ</p>\n<p>Attached are photos from the forces&#8217; activity tonight: https://IDFANC.activetrail.biz/ANC040320246422659767</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF soldiers, the Shin Bet, and the Border Police demolished last night in the city of Nablus the apartment of one of the terrorists involved in the attack at the Hamra intersection in which members of the Day family were murdered; the forces completed a brigade operation that lasted about six hours in Al-Amari, during which they arrested wanted men and investigated many suspects. IDF soldiers, the Shin Bet, and Border Police operated last night in the city of Nablus in the West Bank to demolish the apartment of terrorist Ahed Masri who took part in the shooting</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3774",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3774
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3774",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3774"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3774/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17470,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3774/revisions/17470"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3774"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3774"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3774"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}