{
    "id": 3752,
    "date": "2024-03-06T09:12:16",
    "date_gmt": "2024-03-06T07:12:16",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9051/"
    },
    "modified": "2024-03-06T09:12:16",
    "modified_gmt": "2024-03-06T07:12:16",
    "slug": "9051",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9051/",
    "title": {
        "rendered": "&#8220;IDF Forces: Neutralizing Terrorists and Uncovering Weaponry in Central Gaza &#8211; A Comprehensive Update&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF forces continue to neutralize terrorists and locate weaponry in Khan Yunis and central Gaza Strip; in Beit Hanoun, a fighter jet neutralized terrorists who fled into a military building in a swift blockade situation.</p>\n<p>Guided by the Northern Brigade&#8217;s fire complex of the Gaza Division, a fighter jet attacked and neutralized two terrorists in the territory of Beit Hanoun who fled into a military building.</p>\n<p>Fighter jets attacked two terrorists who took part in the massacre at Nir Yitzhak on October 7 and were in a military compound. Additionally, two division commanders and a squad commander of Hamas&#8217;s Nachba forces who were in a military compound were neutralized.</p>\n<p>The combat team of the Nachal Brigade continues to operate in the center of the Strip and neutralized about twenty terrorists during the last day through sniper fire, the direction of remotely piloted aerial vehicles, and a fighter jet.<br />\nIn one of the strikes, as part of a sniper ambush initiated by the forces, the fighters neutralized 15 terrorists.<br />\nIn another strike, the brigade&#8217;s fire complex, together with the Air Force and Intelligence, quickly closed the circle and a fighter jet attacked a terror infrastructure from where terrorists fired mortars towards the forces. After the attack, many explosion echoes were seen, which indicated a lot of weaponry in the location.</p>\n<p>The combat team soldiers of the Givati Brigade operating in the &#8216;Ahmed&#8217; neighborhood in Khan Yunis spotted several terrorists, a combat helicopter attacked and neutralized them. Subsequently, they spotted an armed terrorist moving towards them and neutralized him.</p>\n<p>Commando Brigade soldiers continue to sweep through buildings in the &#8216;Ahmed&#8217; neighborhood and neutralize terrorists. During the sweeps, they discovered combat tools of the Kalashnikov type and warehouses.<br />\nIn sweeps around the neighborhood, the combat team soldiers of the 7th Brigade discovered warfare materials and military equipment. The brigade&#8217;s fire complex directed a vehicle that neutralized two spotted terrorists in the area.</p>\n<p>During an ambush, the combat team soldiers of the 828th Artillery Brigade detected five armed terrorists and neutralized them with close-range gunfire.</p>\n<p>Attached is documentation of the neutralization of terrorists who fled into a military building: https://bit.ly/3T1UXQd</p>\n<p>Attached is documentation from IDF strikes in the Strip: https://bit.ly/4c01F1R</p>\n<p>Attached are photos of the forces&#8217; activities in the Strip: https://IDFANC.activetrail.biz/ANC06032024.1561618</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF forces continue to neutralize terrorists and locate weaponry in Khan Yunis and central <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip; in Beit Hanoun, a fighter jet neutralized terrorists who fled into a military building in a swift blockade situation. Guided by the Northern Brigade&#8217;s fire complex of the <a  href=\"https://iron-swords.co.il/t/gaza-division/\">Gaza Division</a>, a fighter jet attacked and neutralized two terrorists in the territory of Beit Hanoun who fled into a military building. Fighter jets attacked two terrorists who took part in the massacre at <a  href=\"https://iron-swords.co.il/t/nir-yitzhak/\">Nir Yitzhak</a> on October 7 and were in a military compound. Additionally, two division commanders and a squad commander of</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3752",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3752
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3752",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3752"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3752/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3752"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3752"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3752"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}