{
    "id": 3742,
    "date": "2024-03-07T09:04:57",
    "date_gmt": "2024-03-07T07:04:57",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9064/"
    },
    "modified": "2024-03-07T09:04:57",
    "modified_gmt": "2024-03-07T07:04:57",
    "slug": "9064",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9064/",
    "title": {
        "rendered": "&#8220;Inside IDF&#8217;s Intensive Anti-Terror Operations in the Gaza Strip: An In-Depth Report on Recent Activities and Achievements&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF forces continue operations in the Hamad neighborhood in Khan Yunis: Last day, our fighters identified numerous weapons and destroyed terrorist command centers throughout the neighborhood; In the center of the Strip, a terrorist squad was targeted, which had entered a building containing a launch stand.</p>\n<p>Forces from Brigade 7 battle team continued in the last day with raids on several terrorist infrastructures in the Hamad neighborhood in Khan Yunis and located a warehouse used for producing weaponry, charges, and military equipment. Furthermore, the forces located pits throughout the area and demolished command centers belonging to the terrorist organizations in the Gaza Strip.</p>\n<p>Commando Brigade fighters continued with operations and searches on buildings in the neighborhood, finding weaponry and eliminating several terrorists.</p>\n<p>During an attack in the Al-Qarara area, the brigade battle team Beis Lechem (828) identified six armed terrorists entering a military building with a launcher stand in it. A combat aircraft attacked and took down the terrorists. </p>\n<p>In an additional activity of our fighters in the west of Khan Yunis, an RPG-armed terrorist was located, who had entered a building containing a subterranean infrastructure. A combat aircraft eliminated the terrorist.</p>\n<p>In the center of the Strip, the Nachal Brigade combat team eliminated about ten terrorists in the last day. In one of the attacks, a terrorist squad was identified loading military equipment onto a vehicle near our forces, an aircraft attacked the vehicle, destroyed the equipment, and eliminated several terrorists. After the attack, secondary explosions were observed, indicating the presence of a large quantity of explosives in the vehicle.</p>\n<p>In another attack, our ground forces identified a mobile terrorist squad in their sector. The forces directed a remotely piloted aircraft to the spot, which attacked and took down the terrorists.</p>\n<p>Attached is footage of the elimination of the mobile terrorist squad that operated in the Nachal&#8217;s sector, and another strike of a Hamas terrorist organization infrastructure: https://bit.ly/3V0Oc3M</p>\n<p>Attached are pictures from the activities of the forces: https://IDFANC.activetrail.biz/ANC070320240210514</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF forces continue operations in the Hamad neighborhood in Khan Yunis: Last day, our fighters identified numerous weapons and destroyed terrorist command centers throughout the neighborhood; In the center of the Strip, a terrorist squad was targeted, which had entered a building containing a launch stand. Forces from Brigade 7 battle team continued in the last day with raids on several terrorist infrastructures in the Hamad neighborhood in Khan Yunis and located a warehouse used for producing weaponry, charges, and military equipment. Furthermore, the forces located pits throughout the area and demolished command centers belonging to the terrorist</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3742",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3742
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3742",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3742"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3742/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3742"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3742"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3742"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}