{
    "id": 3723,
    "date": "2024-03-10T09:10:42",
    "date_gmt": "2024-03-10T07:10:42",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9083/"
    },
    "modified": "2024-03-10T09:10:42",
    "modified_gmt": "2024-03-10T07:10:42",
    "slug": "9083",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9083/",
    "title": {
        "rendered": "&#8220;IDF&#8217;s Intense Anti-Terror Operations: Aerial and Ground Elimination of Threats in Gaza Strip&#8221;"
    },
    "content": {
        "rendered": "<p>IDF spokesperson:</p>\n<p>Closing circles and eliminating terrorists; in a joint operation from the air and from the ground, soldiers from the Aghoz unit eliminated the terrorist who killed Sergeant (ret.) Amishar Ben David of blessed memory; simultaneously, Brigade 162 continues its operations in the center of the strip</p>\n<p>In a joint operation from the air and from the ground, soldiers from the Aghoz unit targeted an aircraft that eliminated the terrorist who killed Sergeant (ret.) Amishar Ben David of blessed memory in a battle in the south of the Gaza Strip last Friday.</p>\n<p>The Nahal Brigade&#8217;s combat team continues to fight in the center of the Gaza Strip and in the last day eliminated 13 terrorists using sniper fire, directing fighter planes, aircraft, and tank fire.</p>\n<p>In one of the attacks, a remotely manned aircraft identified a group of terrorists inside a building that had a subterranean tunnel below it near the troops. In no time, the aircraft attacked them and a number of terrorists were killed.</p>\n<p>In another attack, the fighters identified five terrorists carrying out suspicious activity close to the troops&#8217; sector, the troops fired on the terrorists and killed them.</p>\n<p>Last night (Saturday), a launch was carried out from the Gaza Strip towards an area where our forces are fighting, shortly after, airstrikes were carried out on the sources of fire directed by the Southern Command&#8217;s Fire Center and with the aid of artillery fire from the 215th Fire Brigade in Brigade 162 towards the launch sector.</p>\n<p>The fighters of the commando brigade continue their intense fight in the &#8216;Hammad&#8217; district, conducting face-to-face battles with terrorists, and constantly supported by the Israel Air Force.</p>\n<p>In the last day, the soldiers of the Maglan unit raided operational apartments and found weapons in them including AK-47s, grenades, and ammunition. During one of the raids, two terrorists from the Hamas terrorist organization&#8217;s military wing trapped themselves next to the forces.</p>\n<p>The fighters of the combat team of the NBC Defense Brigade (828) killed 17 terrorists in a series of attacks in Khan Yunis in the last day. During the operation, the fighters directed an aircraft to attack a building in which three terrorists were seen placing charges.</p>\n<p>The 7th Brigade&#8217;s combat team directed an aircraft to attack in which two armed terrorists were killed. The fighters of the Givati Brigade&#8217;s combat team killed a terrorist who emerged from a military building using tank fire.</p>\n<p>Fighter planes, directed by the Gaza Division&#8217;s Fire Complex, attacked terror infrastructures in the Jebalia and Beit Hanoun sectors during the night.</p>\n<p>Attached is footage of the elimination of the terrorist who killed Sergeant (ret.) Amishar Ben David of blessed memory: https://bit.ly/43eAblc</p>\n<p>Attached are pictures from the IDF&#8217;s operations in the Gaza Strip: https://IDFANC.activetrail.biz/ANC10032024.156198156</p>\n<p>Here is footage from the IDF attacks in the Strip: https://bit.ly/3IPSBPT</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a>: Closing circles and eliminating terrorists; in a joint operation from the air and from the ground, soldiers from the Aghoz unit eliminated the terrorist who killed <a  href=\"https://iron-swords.co.il/t/sergeant/\">Sergeant</a> (ret.) Amishar Ben David of blessed memory; simultaneously, Brigade 162 continues its operations in the center of the strip In a joint operation from the air and from the ground, soldiers from the Aghoz unit targeted an aircraft that eliminated the terrorist who killed Sergeant (ret.) Amishar Ben David of blessed memory in a battle in the south of the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip last Friday. The <a  href=\"https://iron-swords.co.il/t/nahal-brigade/\">Nahal Brigade</a>&#8217;s combat team continues to</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3723",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3723
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3723",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3723"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3723/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3723"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3723"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3723"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}