{
    "id": 3710,
    "date": "2024-03-11T11:36:31",
    "date_gmt": "2024-03-11T09:36:31",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9096/"
    },
    "modified": "2024-03-11T11:36:31",
    "modified_gmt": "2024-03-11T09:36:31",
    "slug": "9096",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9096/",
    "title": {
        "rendered": "&#8220;IDF and Shin Bet&#8217;s Massive Counter-Terrorism Operation: 20 Arrests, Explosives Neutralized, and Terror Funds Seized&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF soldiers, Shin Bet and Border Police arrested 20 wanted individuals across Judea and Samaria last night; explosives were destroyed in a counter-terrorism operation in the area of ​​Nablus and Tulkarm in the Menashe area. In Qalqilya in the Ephraim area, many terror funds were confiscated.</p>\n<p>During the night, IDF soldiers, Shin Bet and Border Police arrested 20 wanted individuals across Judea and Samaria.</p>\n<p>The forces completed a counter-terrorism operation last night in Nablus and Tulkarm in the Menashe Brigade area. As part of the operation, engineering forces exposed explosives that were hidden under the roads to harm our forces. An additional counter-terrorism operation took place two days ago in the same area, where more explosives were destroyed.</p>\n<p>In Qalqilya in the Ephraim area, the soldiers arrested a wanted individual, confiscated weapons, and seven pipe charges that were in the car of a terrorist who shot at the forces during the operation. In addition, approximately NIS 150,000 of terror funds were confiscated. In the brigade area, nine more wanted individuals were arrested.</p>\n<p>In the village of Wadi Salman in the Judea Brigade area, the soldiers arrested three wanted individuals and found several Molotov cocktails.<br />\nIn Mizra Anavim in the Benjamin Brigade area, the forces arrested five more wanted individuals.</p>\n<p>The arrested suspects and the confiscated weapons were handed over for further treatment by the security forces, our forces were not injured.</p>\n<p>So far, since the start of the war, about 3,500 wanted individuals have been arrested across the Judea and Samaria Division and the Jordan Valley and the Valleys Brigade, over 1,500 of them are affiliated with the Hamas terrorist organization.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF soldiers, Shin Bet and Border Police arrested 20 wanted individuals across Judea and Samaria last night; explosives were destroyed in a counter-terrorism operation in the area of ​​Nablus and Tulkarm in the Menashe area. In Qalqilya in the Ephraim area, many terror funds were confiscated. During the night, IDF soldiers, Shin Bet and Border Police arrested 20 wanted individuals across Judea and Samaria. The forces completed a counter-terrorism operation last night in Nablus and Tulkarm in the Menashe Brigade area. As part of the operation, engineering forces exposed explosives that were hidden under the roads to harm</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3710",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3710
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3710",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3710"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3710/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3710"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3710"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3710"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}