{
    "id": 3562,
    "date": "2024-03-26T08:51:22",
    "date_gmt": "2024-03-26T06:51:22",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9250/"
    },
    "modified": "2024-03-26T08:51:22",
    "modified_gmt": "2024-03-26T06:51:22",
    "slug": "9250",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9250/",
    "title": {
        "rendered": "&#8220;IDF Forces Triumph in Intense Combat: Uncovering Terror Networks and Neutralizing Threats in Khan Yunis&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF forces are battling in the Al Amal neighborhood in Khan Yunis, in parallel to the focused activity of the IDF and Shabak in Shifa hospital.</p>\n<p>The Air Force fighter planes attacked over 60 Tamron targets in the Strip during the last day, including offensive tunnels and military buildings where armed terrorists were staying. In a quick wrap-up, targets were attacked from the air in an area from which rockets were launched towards Sderot during the night.</p>\n<p>IDF and Shabak forces continue their concentrated fighting in the area of Shifa hospital. The combat teams of Brigade 401, the Paratroopers Brigade and the 13th Flotilla under Brigade 162 are fighting in the area, avoiding causing harm to civilians, patients, medical teams and medical equipment. During the last day, the soldiers encountered several terrorists in the hospital&#8217;s area, neutralized them, and found combat means.</p>\n<p>The IDF and Shabak forces, led by Brigade 98, continue fighting in the Al Amal and Al Qurarah areas, during which they vanquished many terrorists and raided terror infrastructures. The combat team of the Commando Brigade and Paratroopers found explosives, grenades, weapons, vests, and plenty of ammunition.</p>\n<p>The combat team of Brigade 7 raided buildings used by the Hamas terror organization. The forces found Kalashnikov weapons, military uniforms, warehouses, and military documents, destroyed terror infrastructures and neutralized terrorists. As part of the brigade&#8217;s activity, in cooperation with the Air Force, terror infrastructures were attacked and terrorists were killed.</p>\n<p>The combat team of the Paratroopers Brigade continues to operate in the center of the Strip, through which several terrorists were killed throughout the last day. Two terrorist cells were identified near the forces and eliminated with airstrikes. In another strike, a terrorist cell was spotted by a drone near the forces and was likewise eliminated.</p>\n<p>Attached are photos of the combat means discovered by the soldiers of Brigade 98: https://IDFANC.activetrail.biz/ANC26032024.156189189</p>\n<p>Attached are photos from the forces&#8217; operation: https://IDFANC.activetrail.biz/ANC26032024.1518918</p>\n<p>Attached is footage from IDF strikes in the Strip: https://bit.ly/43AA8QF</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF forces are battling in the Al Amal neighborhood in Khan Yunis, in parallel to the focused activity of the IDF and Shabak in Shifa hospital. The Air Force fighter planes attacked over 60 Tamron targets in the Strip during the last day, including offensive tunnels and military buildings where armed terrorists were staying. In a quick wrap-up, targets were attacked from the air in an area from which rockets were launched towards <a  href=\"https://iron-swords.co.il/t/sderot/\">Sderot</a> during the night. IDF and Shabak forces continue their concentrated fighting in the area of Shifa hospital. The combat teams of Brigade 401, the</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3562",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3562
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3562",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3562"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3562/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3562"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3562"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3562"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}