{
    "id": 3554,
    "date": "2024-03-27T09:01:53",
    "date_gmt": "2024-03-27T07:01:53",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9258/"
    },
    "modified": "2024-03-27T09:01:53",
    "modified_gmt": "2024-03-27T07:01:53",
    "slug": "9258",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9258/",
    "title": {
        "rendered": "&#8220;IDF and Shin Bet Forces Combat Terrorism: Operations Ongoing in Shifa Hospital, Al Amal, and Al Qurarah Regions&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF forces and the Shin Bet continue to fight in the area of Shifa Hospital while also operating in Al Amal and Al Qurarah region. Terrorists were killed and warfare means located in the last day.</p>\n<p>IDF forces and the Shin Bet continue their focused combat in the area of Shifa Hospital. The combat teams of the 401 Brigade, Nahal Brigade, and Shayetet 13 of the 162nd Division fight in the area, striving to avoid harming civilians, patients, medical teams, and medical equipment.<br />\nIn the last day, the fighters killed many terrorists, found terror infrastructure, and discovered weapons in the hospital&#8217;s area. So far, hundreds of terrorists affiliated with the terrorist organizations operating in the region were arrested at the hospital area, and many were killed.</p>\n<p>The IDF and Shin Bet forces, led by the 98th Division, continue to fight in the Al Amal and Al Qurarah region. In the last day, these forces killed terrorists and found means for combat in the area. </p>\n<p>The combat team soldiers of Brigade 7 killed three terrorists in the last day. An aircraft attacked and killed two additional terrorists who approached the forces armed with RPG missiles.</p>\n<p>The combat teams of the Commando Brigade and Givati Brigade continue to operate in Al Amal region in Khan Yunis. The fighters killed several terrorists in collaboration with the Air Force. During a raid on terror infrastructure in the area, the fighters found means of combat, including warehouses, launchers, Kalashnikov-type weapons, and grenades.</p>\n<p>In the last day, aircraft of the Air Force attacked dozens of targets in support of the encircled forces, including tunnels, military buildings, armed terrorists, and other terror infrastructures.</p>\n<p>In the central Strip, the combat team of Nahal Brigade killed several terrorists in the last day. In one of the attacks, a terrorist was identified near the forces, and an aircraft quickly closed the loop, attacked the terrorist, and killed him.</p>\n<p>Attached are pictures from the forces&#8217; activity: https://IDFANC.activetrail.biz/ANC27032024293463</p>\n<p>Included is documentation of IDF attacks in the Strip: https://bit.ly/3ITTeHX</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF forces and the Shin Bet continue to fight in the area of Shifa Hospital while also operating in Al Amal and Al Qurarah region. Terrorists were killed and warfare means located in the last day. IDF forces and the Shin Bet continue their focused combat in the area of Shifa Hospital. The combat teams of the 401 Brigade, <a  href=\"https://iron-swords.co.il/t/nahal-brigade/\">Nahal Brigade</a>, and Shayetet 13 of the 162nd Division fight in the area, striving to avoid harming civilians, patients, medical teams, and medical equipment. In the last day, the fighters killed many terrorists, found terror infrastructure, and discovered weapons</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3554",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3554
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3554",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3554"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3554/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3554"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3554"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3554"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}