{
    "id": 3541,
    "date": "2024-03-28T09:46:14",
    "date_gmt": "2024-03-28T07:46:14",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9271/"
    },
    "modified": "2024-03-28T09:46:14",
    "modified_gmt": "2024-03-28T07:46:14",
    "slug": "9271",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9271/",
    "title": {
        "rendered": "&#8220;Intense Combat Operations in Shifa Hospital: IDF and ISA Forces Eliminate 200 Terrorists, Discover Weapons Cache&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The IDF and the ISA continue to operate in the Al-Emal area, and in the last day eliminated terrorists and found many weapons, concurrently; IDF and ISA forces continue to fight in Shifa Hospital.</p>\n<p>IDF and ISA forces continue to conduct a concentrated fight in the vicinity of Shifa Hospital. Combat teams of the 401 Brigade, the Paratroopers Brigade, and the 13th Flotilla in the command of the 162 Brigade are fighting in the area while avoiding harm to civilians, patients, medical teams, and medical equipment.<br />\nSince the start of the operation in the Shifa area, about 200 terrorists have been killed in the hospital vicinity.</p>\n<p>In the past day, terrorists emerged from the triage area at Shifa Hospital and opened fire on the forces operating in the hospital zone, in addition to shooting at IDF forces from the triage compound in recent days.<br />\nDuring the operation, the forces evacuated hostages, patients, and medical teams to alternate medical complexes that the IDF equipped and set up to allow proper medical treatment to continue.</p>\n<p>The 98 Brigade forces continue to operate in Khan Yunis, in the Al-Amal district and Al-Qarara, so far, the forces in the operation in the Al-Amal area have killed dozens of terrorists.<br />\nThe combat team fighters of the Commando Brigade destroyed a terror infrastructure where combat means were found. The divisional 7th Brigade Combat Team forces found explosives and mortar bombs.</p>\n<p>The combat team of the Givati Brigade identified two terrorists near the forces, the terrorists were killed by aircraft and shellfire. In addition, during sweeps in the area, the fighters found many explosives.</p>\n<p>The Air Force&#8217;s fighter jets continue to operate in the Gaza Strip skies and attacked dozens of targets in the past day as part of it, the forces performed a concentrated bombing raid, in which they destroyed tunnel exits and subterranean rocket launch sites.</p>\n<p>The combat team of the Paratrooper Brigade continues to operate in the center of the Gaza Strip and killed several terrorists over the past day.<br />\nIn one of the attacks, a cell of terrorists was identified near the forces, in quickly closing the circle an aircraft struck and killed several terrorists.</p>\n<p>Attached are images from the forces&#8217; operation: https://IDFANC.activetrail.biz/ANC280320248765450</p>\n<p>Attached is documentation of IDF attacks in the Strip: https://bit.ly/4abBmEC</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The IDF and the ISA continue to operate in the Al-Emal area, and in the last day eliminated terrorists and found many weapons, concurrently; IDF and ISA forces continue to fight in Shifa Hospital. IDF and ISA forces continue to conduct a concentrated fight in the vicinity of Shifa Hospital. Combat teams of the 401 Brigade, the <a  href=\"https://iron-swords.co.il/t/paratroopers-brigade/\">Paratroopers Brigade</a>, and the 13th Flotilla in the command of the 162 Brigade are fighting in the area while avoiding harm to civilians, patients, medical teams, and medical equipment. Since the start of the operation in the Shifa area, about 200</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3541",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3541
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3541",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3541"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3541/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3541"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3541"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3541"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}