{
    "id": 3527,
    "date": "2024-03-30T09:02:51",
    "date_gmt": "2024-03-30T06:02:51",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9285/"
    },
    "modified": "2024-03-30T09:02:51",
    "modified_gmt": "2024-03-30T06:02:51",
    "slug": "9285",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9285/",
    "title": {
        "rendered": "&#8220;IDF and Shin Bet Forces Combat Terrorism in Gaza Strip: Continuous Operations to Neutralize Threats and Protect Civilians&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>A group of terrorists identified moving warfare means outside a military building in the center of the Strip were attacked and killed. Secondary blasts were identified after the attack, and an Air Force fighter plane attacked the military building from which the group emerged; IDF and Shin Bet forces continue to fight in the area of Shifa Hospital. </p>\n<p>IDF and Shin Bet forces continue to fight in the area of Shifa Hospital. The combat team of the 401st Brigade, Nachal reconnaissance unit and forces from Shayetet 13, under 162nd Division command, are fighting in the area, while avoiding injury to civilians, patients, and medical staff. The soldiers continued to eliminate terrorists, locate warfare means, and terror infrastructure in the area during the last day.</p>\n<p>The Givati Brigade&#8217;s combat team continues to operate in the El-Amal area. The soldiers killed several terrorists in the last day who tried to harm the forces using an explosive device.</p>\n<p>Yesterday (Friday), following a launch from the Gaza Strip to the designated bombing area that landed in an open area, an Air Force aircraft attacked the area from where the shooting took place and destroyed three operational &#8220;pirs&#8221; (launchers).</p>\n<p>The combat team of the Nachal Brigade continues to operate in the center of the Strip and killed several terrorists in the last day. In one of the attacks, the forces identified a group of terrorists in a military building, which seemed to be moving a rocket launcher, an aircraft attacked and killed the terrorists. Following the attack, secondary explosions indicating the presence of large amounts of war material in place were seen. A few minutes later, a combat helicopter attacked and destroyed the military building from which the group emerged.</p>\n<p>The 215 Fire Brigade identified several Hamas terrorists who left a military building of the organization in the north of the Strip, an Air Force aircraft attacked and killed them. In addition, the brigade identified a vehicle with two other terrorists who arrived at the building to transfer military equipment, an aircraft attacked and killed the operatives. After the two attacks, a fighter plane attacked the building.</p>\n<p>The Air Force carried out dozens of attacks in the Gaza Strip during the last day, among other things in cooperation with forces from the 98th Division, who continue to operate in Khan Younis in the areas of Al-Amal and Al-Qarara. The soldiers killed terrorists and raided terror infrastructures.</p>\n<p>Attached are pictures from the IDF&#8217;s activities in the strip: https://IDFANC.activetrail.biz/ANC300320248327645</p>\n<p>Attached is footage from IDF attacks in the Strip: https://bit.ly/3VE5XGb</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: A group of terrorists identified moving warfare means outside a military building in the center of the Strip were attacked and killed. Secondary blasts were identified after the attack, and an Air Force fighter plane attacked the military building from which the group emerged; IDF and Shin Bet forces continue to fight in the area of Shifa Hospital. IDF and Shin Bet forces continue to fight in the area of Shifa Hospital. The combat team of the <a  href=\"https://iron-swords.co.il/t/401st-brigade/\">401st Brigade</a>, Nachal reconnaissance unit and forces from Shayetet 13, under 162nd Division command, are fighting in the area, while avoiding</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3527",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3527
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3527",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3527"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3527/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3527"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3527"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3527"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}