{
    "id": 3522,
    "date": "2024-03-30T19:43:24",
    "date_gmt": "2024-03-30T16:43:24",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9290/"
    },
    "modified": "2024-03-30T19:43:24",
    "modified_gmt": "2024-03-30T16:43:24",
    "slug": "9290",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9290/",
    "title": {
        "rendered": "&#8220;Successful IDF Operation in Shifa Hospital: High-Level Terrorists Captured and Eliminated, Claims Chief of Staff&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson: </p>\n<p>Chief of Staff in Shifa Hospital: This operation has achieved its goal &#8211; a large number of captured terrorists and senior operatives killed.</p>\n<p>The Chief of Staff arrived yesterday (Wednesday) at the Shifa Hospital in the Gaza Strip, where IDF forces are still operating to arrest terrorists. The Chief of Staff conducted a review with the commander of the Southern Command, Major General Yaron Finkelmann, the commander of Brigade 162, Brigadier General Itzik Cohen, the commander of the 13 squadron, Colonel A&#8217;, and additional commanders.</p>\n<p>From the words of the Chief of Staff, Lieutenant General Hertzi Halevy: &#8220;Almost two weeks, very, very successful, and this is an operation that I tell you, to plan it during a war, to execute it within a war, to carry it out properly within a war, is very, very complex. The achievements are very high, there is the execution of a tactical concept that is very impressive, there is a very, very important message, a hospital is not a safe place. We do everything not to harm the patients, not to harm the medical teams, by the way, the fact that this operation, didn&#8217;t hurt a single medical staff member, didn&#8217;t hurt any patients and a lot of very many terrorists were killed, a lot of terrorists were arrested, this is a level of warfare very, very high, very high. So far, the achievements are very high and I&#8217;m telling you, no one can roll back such a large amount of captured terrorists, such a large amount of killed terrorists, so many senior operatives, and a shaking of the notion that we can be in a place and they can&#8217;t touch us. This operation is not over yet, this operation has achieved its goal to a very high level and this operation continues to be carried out thoroughly until we announce that we have finished.&#8221;</p>\n<p>A video clip with the remarks of the Chief of Staff is attached: https://bit.ly/4cO8CUa</p>\n<p>An attached video on the topic: https://bit.ly/4cGxQUr</p>\n<p>Photos on the topic included: https://IDFANC.activetrail.biz/ANC300324001285</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Chief of Staff in Shifa Hospital: This operation has achieved its goal &#8211; a large number of captured terrorists and senior operatives killed. The Chief of Staff arrived yesterday (Wednesday) at the Shifa Hospital in the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip, where IDF forces are still operating to arrest terrorists. The Chief of Staff conducted a review with the commander of the Southern Command, Major General Yaron Finkelmann, the commander of Brigade 162, Brigadier General Itzik Cohen, the commander of the 13 squadron, Colonel A&#8217;, and additional commanders. From the words of the Chief of Staff, Lieutenant General Hertzi Halevy: &#8220;Almost</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3522",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3522
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3522",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3522"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3522/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3522"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3522"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3522"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}