{
    "id": 18900,
    "date": "2024-11-23T19:35:29",
    "date_gmt": "2024-11-23T17:35:29",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18900"
    },
    "modified": "2024-11-23T19:35:36",
    "modified_gmt": "2024-11-23T17:35:36",
    "slug": "bds-movement",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/terrorist-sympathizer/bds-movement/",
    "title": {
        "rendered": "BDS movement"
    },
    "content": {
        "rendered": "\n<p>The Boycott, Divestment, and Sanctions (BDS) movement is nothing more than a thinly veiled campaign to destroy Israel and erase it from the map. While it masquerades as a movement for “human rights,” its true agenda is rooted in antisemitism and the complete delegitimization of the world’s only Jewish state. BDS doesn’t seek peace or coexistence; it seeks the dismantling of Israel through economic warfare, cultural isolation, and outright lies designed to turn the world against it.</p>\n\n\n\n<p>Led by the Palestinian BDS National Committee (BNC), BDS uses propaganda to push for boycotts of Israeli goods, sanctions on its government, and divestment from any company that does business with Israel. The goal? To choke Israel economically, ostracize it diplomatically, and isolate it culturally until it can no longer defend itself. This isn’t about a two-state solution—it’s about obliterating the Jewish state entirely. BDS leaders have made this clear time and again, with statements rejecting Israel’s right to exist and demanding the so-called “right of return,” which would turn Israel into yet another Arab-majority state.</p>\n\n\n\n<p>BDS doesn’t just harm Israel—it spreads hate and division globally. It singles out Israel for supposed “human rights abuses” while ignoring the atrocities committed by countries like Iran, Syria, and China. It’s no coincidence that BDS rhetoric mirrors the language of terrorist organizations like Hamas, which openly call for the destruction of Israel. By targeting Israeli businesses, academic institutions, and even individual artists, BDS works hand-in-hand with extremists who seek to demonize and dismantle Israel. Worse, its campaigns have fueled antisemitic attacks worldwide, creating a hostile environment for Jews everywhere.</p>\n\n\n\n<p>Make no mistake: the BDS movement is not a movement for justice. It is a movement for hate, destruction, and the eradication of Israel. Its real aim is to delegitimize the Jewish people’s right to self-determination and support the very forces that promote violence and terror against innocent Israelis. By backing BDS, its supporters align themselves with a cause that seeks not peace, but the annihilation of a nation and its people.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The Boycott, Divestment, and <a  href=\"https://iron-swords.co.il/t/sanctions/\">Sanctions</a> (BDS) movement is nothing more than a thinly veiled campaign to destroy <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and erase it from the map. While it masquerades as a movement for “<a  href=\"https://iron-swords.co.il/t/human-rights/\">human rights</a>,” its true agenda is rooted in antisemitism and the complete delegitimization of the world’s only Jewish state. BDS doesn’t seek peace or coexistence; it seeks the dismantling of Israel through economic warfare, cultural isolation, and outright lies designed to turn the world against it. Led by the Palestinian BDS National Committee (BNC), BDS uses propaganda to push for boycotts of Israeli goods, sanctions on its government, and</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18901,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-useful-idiots",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1578,
        "footnotes": ""
    },
    "categories": [
        1578
    ],
    "tags": [
        1716
    ],
    "class_list": [
        "post-18900",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-terrorist-sympathizer",
        "tag-bds-movement"
    ],
    "lang": "en",
    "translations": {
        "en": 18900
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18900",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18900"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18900/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18902,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18900/revisions/18902"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18901"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18900"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18900"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18900"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}