{
    "id": 18946,
    "date": "2024-11-11T15:00:00",
    "date_gmt": "2024-11-11T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18946"
    },
    "modified": "2024-11-29T22:59:10",
    "modified_gmt": "2024-11-29T20:59:10",
    "slug": "biden-administration-blames-hamas-for-refusal-to-end-war-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/biden-administration-blames-hamas-for-refusal-to-end-war-daniel-rubenstein/",
    "title": {
        "rendered": "Biden Administration Blames Hamas for Refusal to End War | Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Biden Administration Blames Hamas for Refusal to End War | Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/sMF42T4j4Wc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>In Israel, we like to play a game. It&#8217;s to guess which of the seven fronts will attack us today. Will it be the Hamas rapist regime in Gaza? Will it be Palestinian terrorists in the West Bank? Will it be the terrorist Army Hezbollah in Lebanon? Maybe it will be the Houthi pirates in Yemen, Iranians in Syria, Iranian proxy militias in Iraq, or it will be the Iranian regime that attacks us directly.</p>\n\n\n\n<p>Here’s the answer from the past 24 hours: four drones from Iraq, a missile from Yemen that set off sirens near Jerusalem, which means that’s where it was heading before it was intercepted by Israel’s Arrow missile defense system. A drone from Lebanon crashed in Israel, sparking a fire. There have been around 50 rockets from Lebanon as of right now today, which wounded three people. And in Gaza, Hamas terrorists continue to fight. It’s a seven-front war—eight fronts if you count the attacks on Jews like we saw in Amsterdam.</p>\n\n\n\n<p>This is not a war that we can afford to lose. We will keep fighting until the people of Israel are safe in their own country.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hamas’s Brutality: Evidence from the IDF</strong></h3>\n\n\n\n<p>We have just seen more evidence of the kind of barbaric way in which Hamas governed the Gaza Strip. The IDF just published 46 minutes of video taken from CCTV cameras inside a Hamas base known as Outpost 17 in Jabalia in northern Gaza. The Israel Defense Forces raided the base in March.</p>\n\n\n\n<p>The 46-minute video that the IDF published shows Hamas terrorists interrogating and torturing Palestinians in Gaza. It’s difficult to watch. The footage is dated from 2018 to 2020. It shows Palestinian detainees in very distressing conditions. They are in unbearable pain. They are chained to floors and ceilings. Bags are over their heads.</p>\n\n\n\n<p>You can see a Hamas terrorist sitting comfortably in his chair as a prisoner is handcuffed and hanging from the ceiling beside him. It’s horrific.</p>\n\n\n\n<p>This is Hamas. Hamas was the government of Gaza. Hamas brutally crushed any dissent. Hamas tortured anyone it wanted to. The Hamas regime that tortured its own people and filmed it is the same Hamas regime that invaded Israel on October 7th, carried out barbaric atrocities, and filmed it.</p>\n\n\n\n<p>Hamas is a death cult. The Hamas that exists in Gaza is not the same Hamas that existed a year ago. On October 7th, Hamas’s military capabilities and its ability to govern the Gaza Strip have been mostly destroyed by the Israel Defense Forces. What remains of Hamas are armed gangs, looters, guerrilla fighters, and those who hold 101 Israeli hostages in underground terror dungeons.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>When Will the War in Gaza End?</strong></h3>\n\n\n\n<p>When will the war in Gaza end? When will there be a ceasefire?</p>\n\n\n\n<p>For my answer, I turn to U.S. National Security Adviser Jake Sullivan. Here’s what he said on &#8220;Face the Nation&#8221; on CBS News on Sunday:</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;It really today is not Israel that is standing in the way of a ceasefire and hostage deal. It is Hamas. Israel has said it is prepared to do a temporary ceasefire for a number of hostages and then try to build, try to build on that to get all of the hostages home. Hamas said no.&#8221;</p>\n</blockquote>\n\n\n\n<p>Sullivan continued:</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;What they are communicating to the mediators—that’s Hamas—what they are communicating to the mediators is no, no, no. We will not do a ceasefire and hostage deal at this time. So what we need to do is get the rest of the world to continue to increase pressure on Hamas to come to the table to do a deal in Gaza because the Israeli government has said it’s prepared to take a temporary step in that direction.&#8221;</p>\n</blockquote>\n\n\n\n<p>That’s exactly the point. We need to increase the pressure on Hamas and increase the pressure on Hamas’s patrons—Qatar, Turkey, and Iran—so that Hamas ends the war that it started, releases the hostages, and allows the people of Gaza to build a future of peace and not a future of war.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Israel’s Humanitarian Efforts in Gaza</strong></h3>\n\n\n\n<p>As Hamas continues to fight, Israel has expanded the humanitarian zone inside Gaza. Anyone who wants to send humanitarian aid into Gaza—food, water, medicine, medical equipment, and shelter equipment—can send it into Gaza. There are no restrictions on the amount of humanitarian aid that can enter Gaza.</p>\n\n\n\n<p>As of this morning, I just looked it up. As of this morning, approximately 684 trucks’ worth of aid are waiting for collection inside Gaza. The aid has cleared Israeli security checks, and it is waiting for collection inside of Gaza.</p>\n\n\n\n<p>Yesterday, only 25 trucks were collected from Gaza inside of the Kerem Shalom Crossing. Twenty-five trucks’ worth of aid were collected. Six hundred eighty-four trucks’ worth of aid are sitting in the sun, waiting to be collected and distributed.</p>\n\n\n\n<p>The IDF is currently preparing to open another crossing for aid going into Gaza. This crossing will be at a place called Kisim, a short distance from Kibbutz Kisim, which Hamas invaded on October 7th. Inspection facilities have been built at the new crossing, and roads have been paved.</p>\n\n\n\n<p>Israel wants humanitarian aid to go into Gaza. Israel also wants the major global humanitarian aid agencies to scale up their operations and deliver the aid.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Q&amp;A</strong></h3>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Audience Question 1: Humanitarian Situation in Northern Gaza</strong></h4>\n\n\n\n<p>Our first question today is being asked by a number of our viewers and asks: What can you say about the humanitarian situation in the far northern part of Gaza?</p>\n\n\n\n<p>Yes, let me explain the geography first. I know that everyone is focusing on the situation in northern Gaza, so a bit about the geography. There’s southern Gaza, which includes the city of Rafah and Khan Younis. Northern Gaza begins at the city of Gaza, and north of the city of Gaza—north of Gaza City—there are a number of villages, towns, cities like Jabalia, like Beit Hanoun, like Beit Lahia.</p>\n\n\n\n<p>So, this is the area that we’re talking about when we say northern Gaza. You can take a look at a map. So, that is where Hamas continues to fight the hardest.</p>\n\n\n\n<p>The distribution of humanitarian aid in a war zone is difficult. We’re talking about urban warfare, where Hamas fighters can fire an RPG from a narrow alley or where snipers can hide in windows and shoot at Israeli soldiers.</p>\n\n\n\n<p>Despite all this, humanitarian aid—food, water, and medical equipment—was brought to distribution centers for the population that remains in these areas in northern Gaza: Jabalia, Beit Hanoun. The IDF also worked with international aid organizations to make this happen. The IDF has also worked with the World Health Organization to help get over 200 patients in hospitals in northern Gaza out of harm’s way.</p>\n\n\n\n<p>As long as Hamas continues to wage war, the situation in northern Gaza is going to be difficult. It will be less difficult once Hamas is no longer a threat there and humanitarian aid can easily enter without Hamas threatening the people who are delivering that aid.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Audience Question 2: Expulsion of Hamas from Qatar</strong></h4>\n\n\n\n<p>Our next question comes from Apo GG Health on Instagram, who asks: How will the expulsion of Hamas from Qatar affect hostage negotiations, and indeed, is it even true?</p>\n\n\n\n<p>Well, Qatar denies it. I don’t know what’s true. This is the one thing that I want you to know about Qatar:</p>\n\n\n\n<p>On October 7th, 2023, at 3:15 PM Israel time—long after it was clear that Hamas was carrying out barbaric atrocities in Israel and taking hostages—the Qatari Ministry of Foreign Affairs published a statement that said Israel was solely responsible for the ongoing escalation. Qatar condemned Israel on October 7th.</p>\n\n\n\n<p>That’s Qatar. It’s not a mediator. It’s Hamas’s agent. Hamas is a Qatari asset. Qatar wants the war in Gaza to end with Hamas still in power.</p>\n\n\n\n<p>What this means in plain English is that Qatar told Hamas to keep the hostages.</p>\n\n\n\n<p>The Hamas leaders who are still alive and living in Doha, the capital of Qatar, they should be extradited so they can face justice for their crimes against humanity. That’s my view about Qatar.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Audience Question 3: Expectations from the Trump Administration</strong></h4>\n\n\n\n<p>Our next question comes from BDA BeachShell on Instagram, who asks: Now that the Trump Administration is back, what are your expectations, and is the Iran nuclear plant on the table for destruction?</p>\n\n\n\n<p>So, a few things. First of all, President Biden is still the president of the United States, and he will be the president until January 20th at noon East Coast time. He is still the president.</p>\n\n\n\n<p>And what Jake Sullivan, his National Security Adviser, just said, as I mentioned earlier—that Hamas is rejecting all attempts at a ceasefire, all attempts at a deal—is very important. And the United States and Israel are working together on this issue.</p>\n\n\n\n<p>Now, what we expect from the incoming Trump Administration, once it takes office, would be the same thing that we hope to have from any U.S. president, which is sympathy, first of all, and understanding that Israel is in the middle of a seven-front war.</p>\n\n\n\n<p>And the leader—the chief sponsor—of this seven-front war is the regime in Iran. So, we need much more pressure on the Iranian regime so that it will not have the means and the ability to sponsor all of these groups that have built a war machine around our borders—this ring of fire.</p>\n\n\n\n<p>Now, you asked about the nuclear program. This is, of course, the chief concern—that Iran, which is threatening to destroy Israel, is also developing the capability that will enable it to do so. So, Israel’s policy is very clear, which is that Iran can never be allowed to develop a nuclear weapons capability.</p>\n\n\n\n<p>And, of course, Israel hopes and expects that the entire world, not just the United States, will understand that Iran cannot be allowed to develop a nuclear weapons capability. We need to increase the pressure on Iran.</p>\n\n\n\n<p>I think much is possible, and I also hope that when this war ends—with Hamas laying down its arms and releasing the hostages—once this war ends, we will need to rebuild what was lost and give a boost to the Abraham Accords, which was where we were before the war started.</p>\n\n\n\n<p>There are a number of countries in the region—chiefly the United Arab Emirates, Bahrain, with the quiet support of Saudi Arabia—that was building better ties with Israel. I believe this will be possible, and I hope and expect that the incoming Trump Administration will push this just as hard.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Audience Question 4: Lebanon and the Abraham Accords</strong></h4>\n\n\n\n<p>Our last question today comes from Mira Dom G on Instagram, who asks a related question: If the Abraham Accords are revived, will they be expanded to include Lebanon? Should they, sans Hezbollah?</p>\n\n\n\n<p>It would be amazing if the country of Lebanon would join the Abraham Accords and reach a peace agreement with Israel. I do not see the government of Lebanon even pursuing this option, but it is the obvious option that is in their best interests. And that interest is simply called peace with Israel.</p>\n\n\n\n<p>Right now, Lebanon has been effectively taken over by a militia. It’s Lebanese people, but they answer to Iran. I’m talking about Hezbollah. This is a terrorist army within Lebanon that does not answer to the government of Lebanon, and it, in effect, has enough power in the government of Lebanon to prevent anything being done about the fact that there is a separate militia inside Lebanon.</p>\n\n\n\n<p>So, there’s a lot of talk now about ceasefire agreements or UN resolutions. I would hope that the entire international community—the United Nations, the U.S., the U.K., France, anyone who cares about the situation in Lebanon—needs to say clearly that the future between Israel and Lebanon needs to be a future of peace. Not ceasefires. Not UN resolutions. Real peace.</p>\n\n\n\n<p>And if that happens, if Lebanon gets the message, if Hezbollah is pushed out of the picture, then it would be possible for Lebanon to join something like the Abraham Accords. And I think we should aim high, and this, yes, it should be our goal.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Closing Remarks</strong></h4>\n\n\n\n<p>Thank you so much for all of the questions. If you have any others that I didn’t get to, you can message me on my personal social media. I’ll try to look at them.</p>\n\n\n\n<p>We are here live every day, Sunday to Thursday, Israel time, 3 PM—that’s 8 AM on the East Coast.</p>\n\n\n\n<p>Thank you so much for watching. I’m Daniel Rubenstein. I wish you a lovely day.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>US National Security Advisor Jake Sullivan blamed <a  href=\"/hamas\">Hamas</a> for refusing to accept a ceasefire and said there must be more pressure on <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> until it agrees to a deal. In this Daily Briefing, Citizen Spokesman <a  href=\"https://iron-swords.co.il/t/daniel-rubenstein/\">Daniel Rubenstein</a> provides <a  href=\"https://iron-swords.co.il/c/updates/\">updates</a> on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>’s seven-front war.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18067,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312
    ],
    "class_list": [
        "post-18946",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "en",
    "translations": {
        "en": 18946
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18946",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18946"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18946/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18947,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18946/revisions/18947"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18067"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18946"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18946"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18946"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}