{
    "id": 18835,
    "date": "2024-11-22T16:48:07",
    "date_gmt": "2024-11-22T14:48:07",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18835"
    },
    "modified": "2024-11-22T16:48:13",
    "modified_gmt": "2024-11-22T14:48:13",
    "slug": "dear-icc-palestine-does-not-exist-and-never-existed",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/un/icc/dear-icc-palestine-does-not-exist-and-never-existed/",
    "title": {
        "rendered": "Dear ICC: Palestine Does Not Exist and Never Existed"
    },
    "content": {
        "rendered": "\n<p>The International Criminal Court (ICC) has disgraced itself by issuing arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant, accusing them of “war crimes” and “crimes against humanity” in Gaza. Let’s cut through the façade: these charges are nothing more than a political attack on Israel’s sovereignty and its right to defend its people. And the ICC’s implicit endorsement of “Palestine” as a legitimate state is not just historically and legally false—it is a dangerous fiction that empowers terrorism and fuels antisemitic narratives.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Palestine is a Myth</h3>\n\n\n\n<p>TThe ICC’s actions hinge on the false premise that “Palestine” is a state with valid territorial claims. But let’s set the record straight: <strong>there has never been a sovereign state called Palestine.</strong> Ever. This myth is a political fabrication, weaponized to delegitimize Israel and rewrite history. The historical and legal facts are clear, and they unequivocally demonstrate that “Palestine” has never existed as an independent nation-state.</p>\n\n\n\n<p>Before 1948, the term “Palestine” referred only to a geographical region, not to a political entity. For centuries, this land was ruled by a succession of empires, including the Roman, Byzantine, Islamic Caliphates, Crusaders, and Ottoman Empire. Following World War I, the British Mandate for Palestine was established, not to create an independent Palestinian state, but to prepare the region for a Jewish national homeland under the terms of the Balfour Declaration and subsequent international agreements. At no point during this period did an independent Palestinian government, nation, or state exist.</p>\n\n\n\n<p>Even during the Ottoman Empire, the land was administratively divided, with no recognition of a distinct “Palestinian” people or national identity. The Arab population living in the region was largely indistinguishable from populations in surrounding areas such as Jordan, Syria, and Egypt. These Arabs did not identify as “Palestinians” until after the creation of the State of Israel in 1948, when the concept of a Palestinian identity was invented as a tool to oppose Israel’s existence.</p>\n\n\n\n<p>Moreover, the claim that Palestinians have historic ties to the land is undermined by the absence of distinct Palestinian institutions, culture, or symbols of statehood. There was no unique Palestinian currency, government, or borders. The Arabs of the region were either part of broader Arab communities or subjects of ruling empires, with no differentiation between them and their neighbors. In fact, the Arab world itself rejected the idea of Palestinian statehood when it actively opposed the 1947 United Nations Partition Plan, which would have established both a Jewish and an Arab state.</p>\n\n\n\n<p>The myth of “Palestine” as a historical state also crumbles under scrutiny of modern geopolitics. In 1948, when Israel declared independence, the surrounding Arab nations—Egypt, Jordan, Syria, Iraq, and Lebanon—invaded the new Jewish state. During this war, Jordan seized the West Bank, and Egypt took control of Gaza. Yet, during the 19 years that followed (1948–1967), when these areas were under Arab rule, no effort was made to establish an independent Palestinian state. Instead, the Arab states sought to annex the land for themselves, revealing that the Palestinian cause was—and remains—a pretext for opposing Israel’s existence.</p>\n\n\n\n<p>Even today, the notion of “Palestine” as a sovereign state is a political tool, not a historical reality. The Palestinian leadership’s primary goal is not to establish a peaceful state alongside Israel but to undermine and destroy the Jewish state altogether. This is evidenced by the Palestinian Authority’s glorification of terrorism, its refusal to accept numerous offers of statehood, and its ongoing incitement to violence against Jews.</p>\n\n\n\n<p>By embracing the fiction of a Palestinian state, the ICC not only ignores historical truths but also rewards terrorism and delegitimizes Israel’s undeniable historical, legal, and moral rights to the land. The court’s actions perpetuate a dangerous myth, erasing centuries of history in favor of a narrative crafted to dismantle the Jewish homeland. This is not justice; it is a betrayal of truth and international law.</p>\n\n\n\n<h5 class=\"wp-block-heading\">The ICC’s Hypocrisy: Recognizing a Non-State</h5>\n\n\n\n<p>The ICC’s jurisdiction depends on state membership in the Rome Statute. Yet, Palestine’s supposed “statehood” is recognized only by countries that seek to undermine Israel. The ICC’s acceptance of Palestine as a state is not based on law or fact but on political expediency and the court’s own anti-Israel agenda.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The ICC claims jurisdiction over Gaza and the West Bank, ignoring that these territories were never part of any Palestinian state but were under Jordanian and Egyptian control until Israel liberated them in 1967.</li>\n\n\n\n<li>By treating “Palestine” as a legitimate state, the ICC undermines its own credibility and violates the principle of legal neutrality.</li>\n</ul>\n\n\n\n<h5 class=\"wp-block-heading\">Criminalizing Israel, Empowering Terror</h5>\n\n\n\n<p>The ICC’s decision to criminalize Israel’s leaders for defending their citizens against Hamas—a genocidal terrorist organization—reveals the court’s true bias. While it pretends to uphold international law, the ICC has:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Ignored Hamas’s atrocities, including the October 7 massacre, where over 1,400 Israelis were murdered in cold blood.</li>\n\n\n\n<li>Turned a blind eye to Hamas’s war crimes, including its use of human shields, hostage-taking, and deliberate targeting of Israeli civilians.</li>\n\n\n\n<li>Punished Israel for its efforts to protect its people and ensure that Hamas cannot continue its campaign of terror.</li>\n</ol>\n\n\n\n<p>Instead of standing against terrorism, the ICC has chosen to bolster Hamas by treating Israel as an aggressor and “Palestine” as a victim. This is not justice—it is complicity in terror.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Truth: Israel’s Sovereignty is Unquestionable</h3>\n\n\n\n<p>Israel is the only legitimate state between the Jordan River and the Mediterranean Sea. Its sovereignty is not merely a product of modern politics but is rooted in thousands of years of unbroken historical, cultural, and religious ties to the land. The Jewish people have called this land their homeland for over 3,000 years, long before the rise and fall of empires that claimed temporary dominion over the region. Jerusalem was the capital of the ancient Kingdom of Israel, and it remains the heart of Jewish identity, culture, and faith to this day. Archaeological evidence, biblical records, and historical accounts affirm the continuous presence of Jews in the land, even through periods of exile and foreign rule.</p>\n\n\n\n<p>The re-establishment of the State of Israel in 1948 was not an act of colonialism, as detractors falsely claim, but the legal and moral restoration of a nation that had been unjustly displaced. The modern Zionist movement emerged in response to centuries of persecution and antisemitism, culminating in the Holocaust, which underscored the urgent need for a secure Jewish homeland. This aspiration was recognized and supported by the international community, culminating in the United Nations’ 1947 Partition Plan, which called for the creation of both a Jewish and an Arab state. While the Jews accepted this compromise, the Arab leadership rejected it outright, choosing war over peaceful coexistence.</p>\n\n\n\n<p>The rejection of Israel&#8217;s legitimacy is not new. It has been the cornerstone of Arab and Palestinian policy since before Israel’s independence. During the 1948 War of Independence, the surrounding Arab nations launched an invasion aimed at annihilating the nascent Jewish state. Their goal was not to create a Palestinian state but to destroy Israel and divide its land among themselves. Jordan annexed the West Bank, and Egypt occupied Gaza. For nearly two decades, these areas were under Arab control, yet no effort was made to establish a Palestinian state. This fact alone demonstrates that the Palestinian cause is less about self-determination and more about opposition to Israel’s existence.</p>\n\n\n\n<p>Israel’s sovereignty is not only rooted in history but also enshrined in international law. The 1917 Balfour Declaration expressed British support for the establishment of a Jewish homeland in Palestine, a commitment later formalized by the League of Nations’ Mandate for Palestine in 1922. The Mandate explicitly recognized the historical connection of the Jewish people to the land and called for the establishment of a national home for them. This legal framework laid the groundwork for Israel’s declaration of independence in 1948. The United Nations General Assembly endorsed this vision with Resolution 181, legitimizing the creation of Israel as a sovereign state.</p>\n\n\n\n<p>Since its establishment, Israel has demonstrated its commitment to peace and coexistence, even as its neighbors sought its destruction. Israel has extended numerous offers of statehood to the Palestinians, starting with the 1947 Partition Plan, and later through the Camp David Summit in 2000 and the Annapolis Conference in 2007. Each time, these offers were met with rejection, not because they failed to meet Palestinian demands but because they required recognition of Israel as a Jewish state. The Palestinian leadership, whether under the Palestinian Authority or Hamas, has consistently chosen violence and terrorism over negotiation and compromise.</p>\n\n\n\n<p>Israel’s sovereignty is further validated by its unparalleled contributions to the region and the world. Despite being surrounded by hostile neighbors, Israel has built a thriving democracy, the only one in the Middle East, where citizens of all faiths and backgrounds enjoy rights and freedoms unheard of in neighboring nations. Israel is a global leader in technology, medicine, and humanitarian aid, reflecting the resilience and ingenuity of its people. It has turned a barren land into a flourishing nation while safeguarding holy sites for Jews, Christians, and Muslims alike.</p>\n\n\n\n<p>In stark contrast, the Palestinian leadership has perpetuated a culture of violence and rejectionism. Hamas, which rules Gaza, openly calls for Israel’s destruction and has turned the territory into a launchpad for terror. The Palestinian Authority, while less overtly militant, continues to incite violence against Jews, glorify terrorists, and reject every opportunity for peace. Their refusal to recognize Israel’s right to exist is the true obstacle to peace, not Israel’s actions or policies.</p>\n\n\n\n<p>The undeniable truth is this: Israel’s existence is non-negotiable. It is the ancestral homeland of the Jewish people, re-established through legal and moral means, and sustained by its commitment to democracy, innovation, and peace. Any attempt to question Israel’s sovereignty is not just an attack on the Jewish state but an assault on truth and justice itself.</p>\n\n\n\n<h5 class=\"wp-block-heading\">A Dangerous Precedent</h5>\n\n\n\n<p>The ICC’s actions set a dangerous precedent. By legitimizing the Palestinian claim to statehood, the court:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Undermines the sovereignty of legitimate nations, opening the door for any separatist or terror group to demand recognition as a state.</li>\n\n\n\n<li>Encourages terrorism by punishing democracies that defend themselves against violent threats.</li>\n\n\n\n<li>Weakens international law by transforming it into a political tool wielded against Israel.</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">Dear ICC: Stop Rewriting History</h3>\n\n\n\n<p>The ICC has abandoned its mission to deliver impartial justice. By recognizing a state that has never existed and targeting Israel for defending its citizens, the court has revealed its true intentions: to delegitimize Israel and enable its enemies.</p>\n\n\n\n<p>Israel’s right to exist is non-negotiable, and its defense against terror is a moral obligation. The ICC’s attempts to rewrite history, erase Israel’s legitimacy, and elevate a fabricated Palestinian state will fail. History is not on your side. Justice is not on your side. And the world is waking up to your hypocrisy.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The <a  href=\"https://iron-swords.co.il/c/un/icc/\">ICC</a>’s unjust actions undermine <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>’s sovereignty, falsely recognizing &#8220;Palestine,&#8221; a state that has never existed historically or legally. Their bias empowers terrorism, erases history, and delegitimizes Israel&#8217;s right to self-defense</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18836,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1702,
        "footnotes": ""
    },
    "categories": [
        1702
    ],
    "tags": [],
    "class_list": [
        "post-18835",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-icc"
    ],
    "lang": "en",
    "translations": {
        "en": 18835
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18835",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18835"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18835/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18837,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18835/revisions/18837"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18836"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18835"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18835"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18835"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}