{
    "id": 18948,
    "date": "2024-11-12T15:00:00",
    "date_gmt": "2024-11-12T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18948"
    },
    "modified": "2024-11-29T23:04:07",
    "modified_gmt": "2024-11-29T21:04:07",
    "slug": "hamas-tortures-anyone-who-speaks-against-hamas-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-tortures-anyone-who-speaks-against-hamas-doron-spielman/",
    "title": {
        "rendered": "Hamas Tortures Anyone Who Speaks Against Hamas | Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas Tortures Anyone Who Speaks Against Hamas | Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/m9GPVAI6b2Y?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>This morning, Hezbollah, Iran&#8217;s terrorist army in Lebanon, launched an Iranian drone full of explosives at Israel&#8217;s people. Where did they aim? Hezbollah aimed the drone into a preschool for children aged two and three years old, where it exploded.</p>\n\n\n\n<p>There was no warning siren. Everything happened so quickly. However, the teachers received an emergency alert on their phones that sirens had gone off in nearby areas. While they weren’t sure where that killer drone was headed, the teachers decided not to wait until the danger was closer. They took initiative, grabbed the children, and rushed them into bomb shelters. Their decision saved countless lives.</p>\n\n\n\n<p>According to Israel&#8217;s Air Force, 1,300 suicide drones like this one have been launched at Israel since the start of the October 7th war.</p>\n\n\n\n<p>If anyone wants to understand why Israel is in Lebanon, it is because every one of those rockets, drones, and missile attacks is aimed at a family, a preschool, and innocent Israeli people.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Ongoing Threat from Hezbollah</strong></h3>\n\n\n\n<p>The rocket fire from Hezbollah continues. Yesterday, there were over 165 rockets fired by Hezbollah from Lebanon. Hezbollah is down; there’s no question. I’ve seen it with my own eyes. Their soldiers, their terrorists, have run for cover, leaving all their ammunition in place. However, it is not yet out of commission.</p>\n\n\n\n<p>Hezbollah’s senior ranks have been eliminated. Its leader is hiding in Iran, afraid for his own life, and its ability to carry out an October 7th-style massacre has been destroyed.</p>\n\n\n\n<p>But, as we saw with that rocket that exploded this morning next to a preschool, Hezbollah remains a threat. Hezbollah continues to fire Iranian rockets at Israeli cities and towns. Since Hezbollah refuses to back off, the Israel Defense Force will continue to operate in Lebanon to push Hezbollah away so that close to 100,000 Israelis can return to the homes they haven’t seen in over a year.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hamas Torture Evidence Released</strong></h3>\n\n\n\n<p>Recently, the IDF published some CCTV video that it found on Hamas computers in Gaza. The video is shocking. It shows hundreds of hours of Hamas interrogators torturing Gazan people.</p>\n\n\n\n<p>Men and women are hung upside down, their feet poke out from bags, and they struggle to breathe. Hamas militants sit back laughing and whipping their bare feet with such cruelty.</p>\n\n\n\n<p>Their crime? Criticizing Hamas—the same Hamas that has made their lives a living hell.</p>\n\n\n\n<p>Make no mistake: Hamas is a death cult. It does not allow dissent.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Gazan Voices Against Hamas</strong></h3>\n\n\n\n<p>A news crew from Israel&#8217;s Channel 12 was just inside Gaza, speaking to local Gazans on the street. This is an example of what they had to say:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>&#8220;May God take revenge on Hamas,&#8221; one family says.</li>\n\n\n\n<li>&#8220;Hamas took our son.&#8221;</li>\n\n\n\n<li>&#8220;Hamas ruined our lives.&#8221;</li>\n\n\n\n<li>&#8220;Hamas took away our aid.&#8221;</li>\n\n\n\n<li>&#8220;Hamas shot at us.&#8221;</li>\n</ul>\n\n\n\n<p>One courageous woman speaking to the news crew stood out. She said:</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;Hamas will shoot me for speaking to you. I’m a martyr because I talk to you.&#8221;</p>\n</blockquote>\n\n\n\n<p>But that woman felt the message was important to reach us and to reach you, the world.</p>\n\n\n\n<p>Are we going to listen to the people of Gaza, who explain and describe that Hamas is not only a terrorist regime for Israel? They don’t only burn American flags. They are terrorists for any innocent people, even the people in Gaza.</p>\n\n\n\n<p>Anyone who speaks out against Hamas risks being executed—or worse.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Future Without Hamas</strong></h3>\n\n\n\n<p>Israel is under enormous international pressure to leave Hamas in power in Gaza. Make no mistake: if Hamas remains in power, those same Gazans—those who criticize the regime—they will be the first to suffer.</p>\n\n\n\n<p>They will be pounding at the gates of Israel or at your country’s border, begging to be let in.</p>\n\n\n\n<p>If you support Hamas, you are supporting a regime that tortures innocent Gazans as well as innocent Israelis. Hamas can never be allowed, in any way, shape, or form, to govern any territory ever again.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>A Lesson for the World</strong></h3>\n\n\n\n<p>Over the past two decades, Israel was pressured not to topple Hamas. Leaving Hamas on its feet doesn’t only condemn Israel’s people to Hamas murder—it abandons Gazans to suffer under Hamas cruelty.</p>\n\n\n\n<p>Let’s not forget this message:</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>“If you are kind to the cruel, you will be cruel to the kind.”</p>\n</blockquote>\n\n\n\n<p>There’s no two ways about it. If a person supports Hamas and they’re kind to the cruel, they’re going to be cruel to Israelis, to the innocent people of Gaza, and to other innocent people around the world that Hamas is just waiting to attack—whether it’s in the streets of Amsterdam, the streets of the United States, London, Spain, or France.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Israel’s Humanitarian Aid to Gaza</strong></h3>\n\n\n\n<p>Today, Israel opened yet another new aid crossing into Gaza. Israel is flooding Gaza with aid. The new crossing is called Kisim and began passing through aid today.</p>\n\n\n\n<p>Gaza’s other border crossings with Israel remain open: Kerem Shalom in the south, Gate 96 in the north, and also Erez West and Erez East Crossings in the north.</p>\n\n\n\n<p>There continues to be a focus on aid to northern Gaza, where Israel’s forces have been engaged in heavy combat to stop Hamas from rebuilding there. Hundreds of food packages and thousands of liters of water were delivered to civilians in northern Gaza who haven’t left to humanitarian zones.</p>\n\n\n\n<p>Since October, 741 aid trucks entered northern Gaza. Together with the World Health Organization, Israel helped 244 Gazan patients and companions evacuate from hospitals in northern Gaza.</p>\n\n\n\n<p>In the past month alone, 50,000 liters of fuel, 180 blood units, and hundreds of boxes of medical supplies and food were delivered to northern Gaza hospitals.</p>\n\n\n\n<p>Approximately 900 trucks&#8217; worth of aid are waiting inside Gaza, waiting to be picked up by aid organizations. Some of the aid has been sitting there for months.</p>\n\n\n\n<p>Israel is flooding Gaza with so much aid that the United Nations is drowning under it.</p>\n\n\n\n<p>Instead of pretending there’s not enough aid being sent to Gaza—which is not true—the United Nations needs to do its job, collect the overflowing aid, and give it to the Gazan people—not to Hamas’s terrorists, but to the people of Gaza who need it the most.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Qatar and Hostage Negotiations</strong></h3>\n\n\n\n<p>Our next question comes from our audience watching live on social media:</p>\n\n\n\n<p><strong>Q:</strong> &#8220;What do you think of the reports of Qatar backing out of its mediation role, and when do you think we’ll hear good news about the fate of the hostages in Gaza?&#8221;</p>\n\n\n\n<p><strong>A:</strong> First of all, regarding Qatar, what we can see is that Qatar issued an order for the Hamas leadership who’ve been sheltering there for dozens of years. They have a clock ticking, and they have to leave their country, which is a very important positive step.</p>\n\n\n\n<p>The Hamas leadership—three people worth $12 billion—meanwhile, the Gazan people are poor. Qatar issuing an order for them to leave their country is a step in the right direction.</p>\n\n\n\n<p>We hope Qatar is going to pressure Hamas to release our hostages—101 of whom are sitting deep underground in terror dungeons. It’s about time they get their act together.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Closing Thoughts</strong></h3>\n\n\n\n<p>This is a sad reality, but the truth is clear. We need the world to wake up, protect the Jewish people, and provide safety and security for all innocent people.</p>\n\n\n\n<p>Thank you for tuning in today. We are live every day at 3 PM Israel time, 8 AM Eastern Standard Time. Think of your questions for tomorrow—we’ll see you then. Thank you.</p>\n\n\n\n<p>This is the <strong>complete transcription</strong> with structured headings for improved readability. Let me know if further refinements are needed.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"/hamas\">Hamas</a> tortured Palestinians in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> – and filmed it. In this Daily Briefing, Citizen Spokesman <a  href=\"https://iron-swords.co.il/he/t/doron-spielman/\">Doron Spielman</a> says that if <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> remains in power in Gaza, it will continue to threaten the people of <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and will continue to torture the people of Gaza.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18065,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1304
    ],
    "class_list": [
        "post-18948",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-doron-spielman"
    ],
    "lang": "en",
    "translations": {
        "en": 18948
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18948",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18948"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18948/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18949,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18948/revisions/18949"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18065"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18948"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18948"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18948"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}