{
    "id": 9401,
    "date": "2024-11-16T16:17:11",
    "date_gmt": "2024-11-16T14:17:11",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=9401"
    },
    "modified": "2024-11-16T16:17:18",
    "modified_gmt": "2024-11-16T14:17:18",
    "slug": "how-iran-and-qatar-fund-pro-palestinian-activism-in-america",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/how-iran-and-qatar-fund-pro-palestinian-activism-in-america/",
    "title": {
        "rendered": "How Iran and Qatar Fund Pro-Palestinian Activism in America"
    },
    "content": {
        "rendered": "\n<p>Recent revelations have exposed a chilling reality: several prominent U.S.-based organizations, including Students for Justice in Palestine (SJP), National Students for Justice in Palestine (NSJP), American Muslims for Palestine (AMP), Americans for Justice in Palestine (AJP), and Jewish Voice for Peace (JVP), are deeply entangled in a web of financial and ideological support linked to Hamas, Iran, and Qatar. These groups, which operate openly on American campuses, claim to advocate for human rights and the so-called &#8220;liberation of Palestine.&#8221; Yet, behind their banners and chants lies a dangerous truth—they are enablers of terrorism, spreading propaganda, glorifying violence, and fostering division.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Iran and Qatar: The Financiers of Division</strong></h3>\n\n\n\n<p>Iran, the world’s leading state sponsor of terrorism, and Qatar, a notorious safe haven for Hamas leaders, have funneled millions of dollars into organizations that promote anti-Israel sentiment in the U.S. This funding supports protests, training, and recruitment efforts disguised as activism. These efforts are not aimed at promoting peace but at legitimizing Hamas, a designated terrorist organization responsible for the brutal massacre of over 1,400 Israelis on October 7, 2023. The involvement of these regimes in American campus activism reveals a coordinated effort to destabilize public discourse and spread extremist ideologies under the guise of supporting a &#8220;free Palestine.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Students for Justice in Palestine (SJP): A Campus Arm of Hate</strong></h3>\n\n\n\n<p>Students for Justice in Palestine (SJP) operates on hundreds of American campuses, presenting itself as a grassroots student movement. However, SJP has been exposed as a key player in the Hamas-backed propaganda network. Supported financially and ideologically by Iran and Qatar, SJP organizes protests that glorify terrorist acts, spread anti-Semitic rhetoric, and call for the destruction of Israel. Their daily activities revolve around delegitimizing Israel’s right to exist while portraying Hamas’s violent tactics as &#8220;resistance.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>National Students for Justice in Palestine (NSJP): Coordinating Campus Chaos</strong></h3>\n\n\n\n<p>National Students for Justice in Palestine (NSJP) serves as the central hub for SJP chapters nationwide. It receives millions annually from entities with ties to Iran and Qatar, funding protests, training programs, and propaganda campaigns. NSJP’s events, such as their notorious &#8220;Day of Resistance,&#8221; openly celebrate Hamas and incite violence against Jews and Israel. This organization is not an advocate for peace but a well-oiled propaganda machine designed to spread hatred and division.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>American Muslims for Palestine (AMP): The Financial Conduit</strong></h3>\n\n\n\n<p>American Muslims for Palestine (AMP) is at the heart of this network, serving as a primary financier and organizer of anti-Israel activism in the U.S. AMP has been directly linked to Hamas-affiliated entities and is believed to be a major recipient of Iranian and Qatari funding. AMP provides resources, training, and logistical support to NSJP and SJP, ensuring that their messaging aligns with the broader goals of Iran and Hamas. AMP masquerades as an educational group, but its actions reveal its true purpose: to undermine Israel and promote terrorism.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Americans for Justice in Palestine (AJP): Lobbying for Extremism</strong></h3>\n\n\n\n<p>Americans for Justice in Palestine (AJP) focuses on lobbying efforts that align with Hamas’s agenda, amplifying propaganda that erases Israel’s legitimacy while glorifying &#8220;martyrdom&#8221; and violence. AJP serves as a bridge between campus activists and policy influencers, ensuring that extremist narratives seep into public discourse. Like its counterparts, AJP relies on funding from Iran and Qatar to sustain its operations and advance its anti-Israel agenda.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Jewish Voice for Peace (JVP): A Shield for Extremism</strong></h3>\n\n\n\n<p>Jewish Voice for Peace (JVP) operates as a deceptive ally to these organizations, leveraging its Jewish identity to shield anti-Israel rhetoric from scrutiny. JVP collaborates with AMP and other groups linked to Hamas, providing a façade of legitimacy to efforts that ultimately serve Iran’s and Hamas’s goals. By promoting the false narrative of Israeli &#8220;apartheid,&#8221; JVP enables the spread of extremism and lends credibility to movements that seek Israel’s destruction.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Daily Agenda: Masking Terror as Activism</strong></h3>\n\n\n\n<p>These organizations, while claiming to advocate for human rights, are part of a calculated effort to undermine Israel and promote the agenda of Iran and Qatar. Their daily activities—whether organizing protests, spreading propaganda, or lobbying policymakers—serve as cover for their true mission: enabling terrorism. By glorifying violence, demonizing Israel, and perpetuating the myth of a &#8220;Palestinian state&#8221; that has no historical basis, they work tirelessly to destabilize public discourse and fuel hatred.</p>\n\n\n\n<p>The ties between SJP, NSJP, AMP, AJP, JVP, and the regimes of Iran and Qatar represent a direct threat to American values and the safety of Jewish communities. These organizations are not champions of justice—they are accomplices to terror. Their funding networks and propaganda must be dismantled, and their activities brought under legal scrutiny. It is time for universities, lawmakers, and law enforcement to take a stand against the spread of extremism masquerading as activism.</p>\n\n\n\n<p>The truth is clear: these groups are not advocates for peace but enablers of violence. Their allegiance to foreign regimes and terrorist organizations exposes their true intent—to destroy Israel, glorify terrorism, and sow division in the name of a fabricated cause. America must respond decisively to this threat, ensuring that those who stand with terror face the full weight of justice.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Discover how U.S.-based groups like SJP, NSJP, AMP, AJP, and JVP, funded by <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> and Qatar, amplify <a  href=\"/hamas\">Hamas</a> propaganda. </p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18817,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        399
    ],
    "class_list": [
        "post-9401",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-stupid-palestine-supporters-6"
    ],
    "lang": "en",
    "translations": {
        "en": 9401
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9401",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=9401"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9401/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18816,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9401/revisions/18816"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18817"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=9401"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=9401"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=9401"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}