{
    "id": 18848,
    "date": "2024-11-22T18:46:06",
    "date_gmt": "2024-11-22T16:46:06",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18848"
    },
    "modified": "2024-11-22T18:46:12",
    "modified_gmt": "2024-11-22T16:46:12",
    "slug": "icc-prosecutor-karim-khan-the-face-of-legal-hypocrisy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/un/icc/icc-prosecutor-karim-khan-the-face-of-legal-hypocrisy/",
    "title": {
        "rendered": "ICC Prosecutor Karim Khan &#8211; The Face of Legal Hypocrisy"
    },
    "content": {
        "rendered": "\n<p>On November 21, 2024, ICC Prosecutor Karim A.A. Khan delivered a statement regarding the arrest warrants issued for Israeli Prime Minister Benjamin Netanyahu, former Defense Minister Yoav Gallant, and Hamas Commander-in-Chief Mohammed Deif. While cloaked in the language of impartiality and justice, Khan’s remarks are anything but. His statement reflects a deep moral failure of the ICC, equating the actions of Israel—a sovereign state defending its people—with the atrocities of Hamas, a terrorist organization responsible for one of the darkest days in modern history.</p>\n\n\n\n<p>The ICC’s decision stems from events surrounding the Hamas-led massacre on October 7, 2023. On that day, <strong>6,000 Palestinians infiltrated Israel</strong>, including <strong>3,800 operatives from Hamas and affiliated terrorist groups</strong> such as those operating within UNRWA. Additionally, <strong>2,200 Gazan civilians participated</strong> in the slaughter. The outcome was devastating:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>1,163 people were murdered,</strong> the majority being Israeli civilians and foreign nationals, including babies, children, women, and the elderly.</li>\n\n\n\n<li>Among the victims were <strong>301 IDF soldiers, 55 police officers, and 10 Shin Bet personnel</strong> who gave their lives defending their country.</li>\n</ul>\n\n\n\n<p>Hamas terrorists conducted unspeakable atrocities—rape, beheadings, burning entire families alive, and slaughtering innocent civilians in their homes. These were deliberate acts of genocide and terror, not military operations. Yet, rather than focusing its attention on these war crimes, the ICC chose to vilify Israel’s leaders for defending their people.</p>\n\n\n\n<p>Khan’s statement highlights the ICC’s indictment of both Mohammed Deif, Hamas’s top commander, and Israeli leaders Netanyahu and Gallant. While Deif faces charges for crimes against humanity, including murder, torture, and sexual violence, the inclusion of Netanyahu and Gallant undermines the very notion of justice.</p>\n\n\n\n<p>The charges against Israel’s leaders—“starvation as a method of warfare” and “attacks on civilians”—are baseless and morally indefensible. The Gaza blockade, which Israel implements to limit Hamas’s access to weapons and resources, is a legal and necessary measure under international law. The ICC’s narrative ignores Hamas’s use of civilians as human shields and its exploitation of humanitarian aid for terror purposes.</p>\n\n\n\n<p>Khan claims to focus on victims “in Israel and Palestine” equally. However, his words ring hollow in light of the ICC’s selective targeting of Israeli leaders while downplaying Hamas’s atrocities. The ICC’s investigation conveniently omits Hamas’s use of human shields, its diversion of humanitarian aid into terror tunnels, and its ongoing campaign to annihilate the Jewish state.</p>\n\n\n\n<p>While Khan feigns impartiality, his priorities betray an inherent bias. The decision to withdraw arrest warrants for Hamas leaders Yahya Sinwar and Ismail Haniyeh—citing their deaths—raises serious questions about the ICC’s commitment to accountability. Why did the ICC fail to issue these warrants earlier when these individuals were actively orchestrating Hamas’s terror operations?</p>\n\n\n\n<p>By equating Israel’s defensive actions with Hamas’s barbarity, the ICC sets a dangerous precedent. This false equivalence rewards terrorism while punishing those who fight to protect civilians. It erases the moral and legal distinction between aggressors and defenders, emboldening groups like Hamas to continue their genocidal campaigns.</p>\n\n\n\n<p>Khan’s statement also reflects the ICC’s disregard for international law’s most basic principles. Israel is a sovereign state with the right—indeed, the obligation—to defend its citizens. By criminalizing these efforts, the ICC effectively endorses Hamas’s strategy of targeting civilians, using hostages, and weaponizing human suffering.</p>\n\n\n\n<p>The ICC’s decision is an affront to justice, truth, and the victims of Hamas’s terror. Democracies worldwide must reject this sham process and stand firmly with Israel. Prosecutor Khan’s statement reveals a court that has abandoned its mandate, weaponizing international law to attack the very nations working to uphold it.</p>\n\n\n\n<h5 class=\"wp-block-heading\">History will remember October 7 as a day of unspeakable horror—and the ICC’s response as a day of unforgivable betrayal.</h5>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The <a  href=\"https://iron-swords.co.il/c/un/icc/\">ICC</a> disgracefully equates <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>’s defense with <a  href=\"/hamas\">Hamas</a>’s atrocities, legitimizing terror while ignoring October 7’s massacre of 1,163 civilians. Prosecutor Karim Khan&#8217;s hypocrisy undermines justice, emboldens terrorists, and distorts international law</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18849,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1702,
        "footnotes": ""
    },
    "categories": [
        1702
    ],
    "tags": [],
    "class_list": [
        "post-18848",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-icc"
    ],
    "lang": "en",
    "translations": {
        "en": 18848
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18848",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18848"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18848/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18850,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18848/revisions/18850"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18849"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18848"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18848"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18848"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}