{
    "id": 18859,
    "date": "2024-11-22T19:51:55",
    "date_gmt": "2024-11-22T17:51:55",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18859"
    },
    "modified": "2024-11-22T19:52:02",
    "modified_gmt": "2024-11-22T17:52:02",
    "slug": "icc-a-political-witch-hunt",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/un/icc/icc-a-political-witch-hunt/",
    "title": {
        "rendered": "ICC A Political Witch Hunt"
    },
    "content": {
        "rendered": "\n<p>The ICC’s focus on Israel is nothing short of a political witch hunt, orchestrated by its prosecutor, <strong>Karim Ahmad Khan</strong>, and driven by a blatant double standard. Rather than pursuing the world’s most egregious perpetrators of genocide and crimes against humanity, the ICC has turned its attention to a democracy fighting for its survival. Khan has turned a blind eye to true atrocities across the globe and instead decided to criminalize Israel for defending its citizens against a genocidal terrorist organization, Hamas.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Weaponizing International Law Against Israel</strong></h4>\n\n\n\n<p>The ICC has accused Israel of committing “starvation as a method of warfare.” This accusation is as absurd as it is dangerous. It completely ignores the reality on the ground:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Hamas’s exploitation of Gaza’s resources:</strong> Hamas, a recognized terrorist organization, diverts humanitarian aid meant for Gaza’s population to fund its terror infrastructure. Concrete intended for building schools and homes is instead used to construct <strong>terror tunnels</strong> to infiltrate Israel. Millions of dollars in international aid are siphoned off to manufacture <strong>rockets and explosives</strong>, while the people of Gaza are left to suffer.</li>\n\n\n\n<li><strong>The reality of blockade measures:</strong> Israel’s blockade of Gaza is not designed to “starve” the population—it is a defensive measure aimed at preventing weapons and materials from falling into the hands of a terrorist group intent on destroying Israel. The ICC ignores this context, portraying Israel’s actions as criminal while completely disregarding Hamas’s culpability for Gaza’s humanitarian crisis.</li>\n</ul>\n\n\n\n<p>The ICC also accuses Israel of “attacks on civilians,” conveniently ignoring the fact that <strong>Hamas’s thousands of rockets deliberately target civilian areas in Israel.</strong> Every rocket fired from Gaza into Israel is a war crime under international law, yet the ICC remains silent.</p>\n\n\n\n<p>The ICC’s vilification of Israel’s leaders for protecting their citizens flies in the face of international norms and basic morality. <strong>What would any other democracy do in Israel’s place?</strong> When Hamas terrorists infiltrate Israeli communities to murder civilians, when rockets rain down on Israeli cities, and when entire families are held hostage, Israel has no choice but to defend itself.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>October 7 Massacre:</strong> On October 7, 2023, Hamas carried out one of the most brutal terrorist attacks in modern history, killing over <strong>1,100 Israeli civilians</strong>, including women, children, and the elderly. Families were executed in their homes. Babies were murdered. Civilians were burned alive. And yet, the ICC’s response has not been to hold Hamas accountable but to turn Israel’s defensive measures into crimes.</li>\n\n\n\n<li><strong>Human Shields and Civilian Casualties:</strong> Hamas uses <strong>human shields</strong>—deliberately embedding its weapons, command centers, and fighters in civilian areas. Schools, hospitals, and mosques become military targets because Hamas turns them into bases of operations. When Israel strikes these targets, it is Hamas, not Israel, that bears the blame for civilian casualties. Yet the ICC’s narrative treats Hamas’s deliberate war crimes as an afterthought, focusing instead on demonizing Israel.</li>\n</ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong><strong>Why Israel?</strong></strong></h4>\n\n\n\n<p>The ICC’s double standards are glaring. While it fixates on Israel, the court remains silent on far greater atrocities around the world.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>In Congo, 5.5 million have died in brutal conflicts, and the ICC does nothing.</strong></li>\n\n\n\n<li><strong>In Syria, half a million people have been killed in a civil war involving chemical weapons, and the ICC does nothing.</strong></li>\n\n\n\n<li><strong>In Yemen, 400,000 have died amid war and famine, and the ICC does nothing.</strong></li>\n</ul>\n\n\n\n<p>In these cases, the perpetrators are either too powerful to prosecute or ignored altogether. But when it comes to Israel—a small democracy surrounded by hostile forces—the ICC jumps into action, accusing its leaders of war crimes based on propaganda from the <strong>Hamas-run Gaza Ministry of Health.</strong></p>\n\n\n\n<p>The ICC’s relentless targeting of Israel is not about justice—it’s about politics. Israel is held to an impossible standard, expected to wage war against a terrorist organization without any collateral damage, while Hamas operates with impunity. The ICC’s obsession with Israel aligns with broader anti-Israel bias in international institutions, where the Jewish state is routinely singled out for condemnation while the true aggressors escape scrutiny.</p>\n\n\n\n<p>This witch hunt is more than just a travesty of justice—it’s a dangerous precedent. By criminalizing Israel’s right to self-defense, the ICC emboldens terrorists like Hamas. It sends a message to the world that democracies will be punished for protecting their citizens, while terrorist groups can exploit civilian casualties for propaganda and evade accountability.</p>\n\n\n\n<p>By focusing its attention on Israel, the ICC is not just failing to uphold justice—it is actively enabling terrorism. Hamas and other terrorist organizations rely on international bodies like the ICC to shield them from accountability. They know that every civilian casualty in Gaza will be blamed on Israel, no matter the circumstances.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Hamas doesn’t build bomb shelters for its civilians—it builds bunkers for its fighters.</strong> While Israeli civilians run for cover during rocket attacks, Gazans are left exposed because Hamas views them as tools in its propaganda war.</li>\n\n\n\n<li><strong>Hamas doesn’t prioritize its people—it sacrifices them.</strong> Every casualty in Gaza is a win for Hamas’s narrative, and the ICC plays right into their hands.</li>\n</ul>\n\n\n\n<p>The ICC’s actions under Karim Ahmad Khan are not about justice or accountability. They are about using international law as a weapon against Israel, a nation fighting for its survival against genocidal terrorism. By ignoring the context of Israel’s defensive measures and relying on propaganda from Hamas, the ICC has turned itself into a tool for legitimizing terror.</p>\n\n\n\n<p>This is not justice. This is a political witch hunt. And it is a betrayal of the millions of victims around the world who truly deserve the ICC’s attention. Instead of targeting Israel, the ICC should focus on the real perpetrators of genocide and crimes against humanity—starting with the terrorists who massacre civilians and use their own people as human shields. Until then, the ICC’s credibility will remain in shambles, and its name will be synonymous with hypocrisy and injustice.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The <a  href=\"https://iron-swords.co.il/c/un/icc/\">ICC</a>’s focus on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> is a biased political witch hunt, ignoring <a  href=\"/hamas\">Hamas</a>&#8216;s crimes, punishing self-defense, and emboldening terrorists. It neglects global atrocities while undermining justice and enabling propaganda.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18831,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1702,
        "footnotes": ""
    },
    "categories": [
        1702
    ],
    "tags": [],
    "class_list": [
        "post-18859",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-icc"
    ],
    "lang": "en",
    "translations": {
        "en": 18859
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18859",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18859"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18859/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18860,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18859/revisions/18860"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18831"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18859"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18859"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18859"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}