{
    "id": 18845,
    "date": "2024-11-22T18:32:47",
    "date_gmt": "2024-11-22T16:32:47",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18845"
    },
    "modified": "2024-11-22T18:32:53",
    "modified_gmt": "2024-11-22T16:32:53",
    "slug": "icc-endorses-october-7-as-acceptable",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/un/icc/icc-endorses-october-7-as-acceptable/",
    "title": {
        "rendered": "ICC Endorses October 7 as “Acceptable”"
    },
    "content": {
        "rendered": "\n<p>The International Criminal Court (ICC), entrusted with upholding justice, has chosen instead to undermine it. By issuing arrest warrants against Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant, the ICC has delivered a dangerous and immoral verdict: the October 7 massacre, orchestrated by Hamas, is acceptable under international law.</p>\n\n\n\n<p>This disgraceful action by the ICC, which equates Israel’s defensive measures with Hamas’s unprovoked barbarity, sends a clear message. Defending innocent lives is a punishable offense, while committing atrocities earns a slap on the wrist—or worse, tacit validation.</p>\n\n\n\n<p>On October 7, approximately 6,000 Hamas operatives launched an unprovoked, coordinated attack on Israel, crossing into its territory to commit unimaginable acts of violence. This included approximately 3,800 Palestinian terrorists and 2,200 Gazan collaborators, including those disguised as civilians, who played logistical and support roles.</p>\n\n\n\n<p>The results were horrific: <strong>1,163 people were murdered</strong>, the overwhelming majority of them Israeli citizens and foreign nationals, including babies, children, women, and the elderly. Among the victims were <strong>301 Israeli soldiers, 55 police officers, and 10 Shin Bet personnel</strong> who died defending their country. Thousands more were injured, and over 200 individuals—including women, children, and the elderly—were taken hostage.</p>\n\n\n\n<p>Hamas’s atrocities included mass shootings, beheadings, rape, and the burning alive of entire families. The group’s intention was not merely to instill fear but to enact genocide—a deliberate campaign to kill Jews and eradicate the State of Israel.</p>\n\n\n\n<p>Instead of condemning Hamas’s actions unequivocally, the ICC chose to target Israel’s leaders for defending their citizens. Netanyahu and Gallant stand accused of “war crimes” for enforcing a blockade on Gaza, a security measure aimed at neutralizing Hamas’s terror capabilities.</p>\n\n\n\n<p>This accusation disregards the role of Hamas in creating and perpetuating Gaza’s humanitarian crisis. Hamas has consistently diverted resources meant for civilian use to build rockets, tunnels, and weapons, while embedding its operations in hospitals, schools, and residential areas. The ICC’s narrative blames Israel for the suffering in Gaza while excusing Hamas’s deliberate use of its population as human shields.</p>\n\n\n\n<p>While the ICC included Hamas military chief Mohammed Deif in its warrants, this is nothing more than window dressing. Deif, the architect of the October 7 massacre, is responsible for the murders of over 1,100 people and countless acts of terror. Yet the ICC’s focus remains disproportionately on Israel, the only democracy in the region, which is acting to protect its citizens from an existential threat.</p>\n\n\n\n<p>This moral equivalence between a democratic nation defending itself and a terrorist organization committing genocide is an outrageous betrayal of international law and justice.</p>\n\n\n\n<p>By targeting Israel while offering only token accountability for Hamas, the ICC has set a horrifying precedent. It has erased the distinction between aggressors and defenders, between terrorists and those protecting their people. The court’s actions send a message to the world:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>If you massacre civilians, you’ll face symbolic scrutiny.</li>\n\n\n\n<li>If you defend civilians, you’ll face prosecution.</li>\n</ul>\n\n\n\n<p>This inversion of justice doesn’t just endanger Israel; it emboldens terrorists worldwide. It rewards the use of human shields, hostage-taking, and mass murder, signaling that the international community will hold defenders more accountable than perpetrators.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The ICC’s True Agenda</h4>\n\n\n\n<p>The ICC’s actions are not about justice; they are about politics. By treating “Palestine” as a legitimate state and prosecuting Israeli leaders, the ICC is advancing an agenda to delegitimize Israel’s existence. This move aligns with the narratives of those who seek to dismantle Israel as a sovereign state.</p>\n\n\n\n<p>The court’s selective outrage is glaring. Where are the arrest warrants for the leaders of Iran, the primary backers of Hamas’s terror infrastructure? Where is the accountability for Syria’s use of chemical weapons or China’s genocide of Uyghurs? The ICC has chosen to single out Israel while ignoring far more egregious crimes.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The <a  href=\"https://iron-swords.co.il/c/un/icc/\">ICC</a>’s actions disgracefully equate <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>’s self-defense with <a  href=\"/hamas\">Hamas</a>’s atrocities, endorsing October 7’s massacre while undermining justice and truth</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18836,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1702,
        "footnotes": ""
    },
    "categories": [
        1702
    ],
    "tags": [],
    "class_list": [
        "post-18845",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-icc"
    ],
    "lang": "en",
    "translations": {
        "en": 18845
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18845",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18845"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18845/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18846,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18845/revisions/18846"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18836"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18845"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18845"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18845"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}