{
    "id": 18830,
    "date": "2024-11-21T15:31:44",
    "date_gmt": "2024-11-21T13:31:44",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18830"
    },
    "modified": "2024-11-21T15:32:36",
    "modified_gmt": "2024-11-21T13:32:36",
    "slug": "icc-stands-with-hamas",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/un/icc/icc-stands-with-hamas/",
    "title": {
        "rendered": "ICC Stands With Hamas"
    },
    "content": {
        "rendered": "\n<p>The International Criminal Court (ICC) has reached a shocking new low, issuing arrest warrants for Israeli Prime Minister Benjamin Netanyahu, former Defense Minister Yoav Gallant, and Hamas military chief Mohammed Deif. On the surface, the warrants claim to address “war crimes” and “crimes against humanity” related to the Gaza conflict, but beneath this façade lies an undeniable truth: the ICC is legitimizing terrorism and endorsing Hamas&#8217;s barbaric massacre of October 7, 2023. This is not justice—this is a direct attack on Israel’s right to exist and defend its people.</p>\n\n\n\n<p>The charges against Netanyahu and Gallant accuse them of depriving Gaza’s civilian population of basic necessities. What these accusations ignore is that the so-called &#8220;deprivation&#8221; resulted from Israel&#8217;s lawful efforts to combat a genocidal terrorist organization, Hamas, which rules Gaza with an iron fist. Meanwhile, the ICC’s inclusion of Mohammed Deif—Hamas’s architect of the October 7 massacre—is little more than window dressing, an attempt to feign impartiality. The fact remains that the ICC’s decision inherently validates Hamas&#8217;s war crimes while condemning Israel for defending itself against annihilation.</p>\n\n\n\n<h4 class=\"wp-block-heading\">ICC Endorses October 7 as &#8220;Acceptable&#8221;</h4>\n\n\n\n<p>The ICC&#8217;s actions have sent an unmistakable message: the massacre of over 1,400 Israelis on October 7, including babies, families, and civilians slaughtered in their homes, is acceptable under international law. By placing Israel’s leaders on the same moral footing as a terrorist mastermind like Deif, the ICC erases any distinction between a democratic nation defending itself and a terrorist organization committing genocidal atrocities. Worse, it implicitly justifies Hamas&#8217;s actions by punishing Israel for its response.</p>\n\n\n\n<p>This case is not about justice—it is about rewriting the rules of war to favor those who commit mass murder and punish those who fight to protect their people. The October 7 massacre was a modern-day pogrom, designed to terrorize, humiliate, and eradicate the Jewish people. Yet, according to the ICC, the real crime was Israel cutting off resources to a territory governed by terrorists intent on its destruction.</p>\n\n\n\n<p>How can any rational observer interpret this as anything other than a green light for future atrocities? The ICC’s message is clear: if you massacre Jews, you will face some token accountability. But if you defend Jews, you will be dragged into court and branded a criminal.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The ICC’s Goal: The Death of Israel</h4>\n\n\n\n<p>Make no mistake—the ICC’s campaign is not about justice for Palestinians or upholding international law. It is about dismantling Israel as a sovereign state and endorsing its enemies’ goal of its complete destruction. The ICC’s claims of jurisdiction over Israeli territory, despite Israel not being a party to the Rome Statute, is an alarming overreach designed to delegitimize Israel’s right to defend its people.</p>\n\n\n\n<p>This move plays directly into the hands of Hamas, a terror organization openly committed to Israel’s annihilation. The ICC’s actions align with the terrorist narrative that Israel’s very existence is illegitimate and that any act of resistance—including mass murder—is justified. By targeting Netanyahu and Gallant, the ICC is not just punishing Israel’s leaders; it is punishing the Jewish people for daring to survive.</p>\n\n\n\n<p>Meanwhile, the international community’s defense of the ICC as an &#8220;impartial&#8221; institution is laughable. Where are the arrest warrants for the leaders of Iran, who bankroll Hamas&#8217;s terror campaigns? Where is the accountability for the nations that harbor and fund terrorism? The ICC has chosen to single out the only democracy in the Middle East while turning a blind eye to the very forces driving this conflict.</p>\n\n\n\n<p>The ICC’s disgraceful actions cannot go unanswered. This is not merely a legal battle—it is a fight for Israel’s survival and the safety of the Jewish people worldwide. By issuing these warrants, the ICC has abandoned its mandate to pursue justice and has instead become a tool of antisemitism and terrorism.</p>\n\n\n\n<p>The world must wake up to this dangerous reality. If the ICC can target Israel for defending itself against genocidal terror, no nation is safe. Today, they come for Israel. Tomorrow, they will come for anyone who dares to stand against tyranny and violence. It is time to call out the ICC for what it has become: an enabler of terror, an enemy of justice, and a direct threat to the values of freedom and humanity.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The <a  href=\"https://iron-swords.co.il/c/un/icc/\">ICC</a> targets <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s leaders while legitimizing <a  href=\"/hamas\">Hamas</a> terror, endorsing the October 7 massacre, and advancing Israel&#8217;s destruction agenda.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18831,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1702,
        "footnotes": ""
    },
    "categories": [
        1702
    ],
    "tags": [],
    "class_list": [
        "post-18830",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-icc"
    ],
    "lang": "en",
    "translations": {
        "en": 18830
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18830",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18830"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18830/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18833,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18830/revisions/18833"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18831"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18830"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18830"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18830"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}