{
    "id": 18965,
    "date": "2024-11-24T15:00:00",
    "date_gmt": "2024-11-24T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18965"
    },
    "modified": "2024-11-29T23:34:34",
    "modified_gmt": "2024-11-29T21:34:34",
    "slug": "iran-targets-jews-everywhere-in-the-world-ashley-waxman-bakshi",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/iran-targets-jews-everywhere-in-the-world-ashley-waxman-bakshi/",
    "title": {
        "rendered": "Iran Targets Jews Everywhere in the World | Ashley Waxman Bakshi"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Iran Targets Jews Everywhere in the World | Ashley Waxman Bakshi\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/eoj1eRuoPrM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Breaking news right now: so far today, Hezbollah in Lebanon has fired 150 rockets into Israel. Rocket sirens continue to sound throughout Israel as Hezbollah continues to fire rockets at Israeli cities and towns. Several people were hurt in the attacks on Hia and the greater Tel Aviv area.</p>\n\n\n\n<p>This morning, my family and I were woken up with a run to the bomb shelter. As I was getting ready to come to the studio, I had another run to the shelter. While driving to the studio, I was nervous about being on the open highway with nowhere to hide if the siren went off.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Ceasefire? Israel Under Attack</h4>\n\n\n\n<p>I’ve been reading reports about a possible ceasefire between Israel and Hezbollah, and I have to ask—what ceasefire? The State of Israel is under attack on seven different fronts. We have no choice but to keep fighting until we are safe in our homes.</p>\n\n\n\n<p>We say seven fronts around Israel, but really, there are eight fronts if you count attacks on the Jewish people around the world. I’m sure you’ve seen the news about how true this really is.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Iranian Regime Targets Jews Worldwide</h4>\n\n\n\n<p>The whole world needs to wake up. The Iranian regime is targeting Jews wherever they live.</p>\n\n\n\n<p>Rabbi Kogan of blessed memory was a Chabad emissary in Abu Dhabi in the United Arab Emirates. He went missing last Thursday. His body was found around 150 kilometers away in the city of Al near the border with Oman.</p>\n\n\n\n<p>According to reports, the Iranian regime recruited citizens of Uzbekistan to murder the rabbi. The assailant fled to Turkey.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Iran’s Broader War</h4>\n\n\n\n<p>The Iranian regime is the greatest threat to peace and security in the world. Iran murdered a rabbi in the United Arab Emirates because Iran’s war isn’t confined to any specific borders. Iran’s war isn’t about policy disagreements.</p>\n\n\n\n<p>The Iranian regime wants to break apart the Abraham Accords peace agreement between Israel and the UAE. It wants to destroy Israel, and it wants to attack Jewish people wherever they live.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Call for International Pressure</h4>\n\n\n\n<p>We need massive international pressure on the Iranian regime so that it cannot continue to terrorize the whole world.</p>\n\n\n\n<p>The Iranian regime backed the October 7th massacre—the deadliest attack on Jews since the Holocaust. For more than a year now, Iran has been leading a multi-front war against the Jewish state:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Hamas in Gaza</strong></li>\n\n\n\n<li><strong>Terrorists in Judea and Samaria</strong></li>\n\n\n\n<li><strong>Hezbollah in Lebanon</strong></li>\n\n\n\n<li><strong>Houthi pirates in Yemen</strong></li>\n\n\n\n<li><strong>Iranians in Syria</strong></li>\n\n\n\n<li><strong>Iranian militias in Iraq</strong></li>\n\n\n\n<li><strong>The Iranian regime itself</strong></li>\n</ul>\n\n\n\n<h4 class=\"wp-block-heading\">Global Targets of Iranian Aggression</h4>\n\n\n\n<p>It’s not just Jews that Iran is targeting. Iran and its proxy armies murder many others in the Middle East, namely Sunni Muslims, as part of its global religious war.</p>\n\n\n\n<p>Iran is behind the deaths of thousands of U.S. and Western troops, whether in Lebanon in the 1980s or more recently in Iraq and Afghanistan.</p>\n\n\n\n<p>Jewish communities have long been Iranian targets. Iran is behind the deadliest terror attacks on Jews around the world.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Historical and Recent Attacks</h4>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Iran was behind the 1994 bombing of a Jewish community center in Argentina, which killed 85 people.</li>\n\n\n\n<li>A week after that attack, Iran detonated car bombs across London.</li>\n\n\n\n<li>This week, British bomb squads detonated suspected explosive devices in a London airport, a train station, and outside the U.S. Embassy.</li>\n</ul>\n\n\n\n<p>Yesterday, British security forces revealed <strong>15 Iranian plots</strong> to either kidnap or kill British or UK-based individuals whom it considers enemies of the regime.</p>\n\n\n\n<p>The threat from Iran is real.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Escalating Threats in the UK</h4>\n\n\n\n<p>The threat is so high that the British government told an Iranian dissident news organization that its safety couldn’t be guaranteed in the UK. Earlier this year, American officials announced Iranian plots to assassinate political leaders and manipulate elections.</p>\n\n\n\n<p>Just last week, Canada announced an Iranian assassination attempt on former Justice Minister Irwin Cotler. He is a prominent member of Canada’s Jewish community.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The “Little Satan” and the “Great Satan”</h4>\n\n\n\n<p>Remember: Iran calls the Jewish state “the Little Satan,” but Iran calls America “the Great Satan.” What starts with the Jewish people and the Jewish state doesn’t end with them.</p>\n\n\n\n<p>Iran’s plans to acquire nuclear weapons are an existential threat to the Jewish people, but they are a threat to everyone else, too.</p>\n\n\n\n<h4 class=\"wp-block-heading\">A Closer Look at Turkey’s Role</h4>\n\n\n\n<p>Do you know who else is harboring a threat? We need to talk about Turkey.</p>\n\n\n\n<p>Turkey is supposedly a Western ally. It is a member of the NATO alliance. There are reports that the murderers of Rabbi Kogan in the UAE fled to Turkey.</p>\n\n\n\n<p>It’s not surprising. The president of Turkey has long supported Hamas.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Turkey and Hamas</h4>\n\n\n\n<p>After the October 7th massacre, President Erdoğan praised Hamas. After allegedly being kicked out of Qatar, Hamas’s leaders are now reportedly in Turkey.</p>\n\n\n\n<p>This is absurd. As a NATO member state, Turkey is entitled to the protection of the U.S., the UK, and Germany if it is ever attacked. Turkey is pledged to protect them as well.</p>\n\n\n\n<p>A country that harbors terrorists is not an ally. Hamas leaders should not be safe anywhere.</p>\n\n\n\n<p>We need more pressure on Turkey so that Hamas leaders will be extradited to face justice for their crimes against humanity.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Q&amp;A with the Audience</h4>\n\n\n\n<p><strong>Q1 (Instagram):</strong> How does Hezbollah still have so many rockets, and what is their current strength in Lebanon?</p>\n\n\n\n<p><strong>Answer:</strong> Hezbollah has been building its military capabilities for many years, especially since the Second Lebanon War. Although a resolution called for Hezbollah to disarm, it was never enforced.</p>\n\n\n\n<p>Hezbollah continues to amass weapons and rockets. Despite Israel’s success in targeting their leaders and facilities, their arsenal still allows them to terrorize Israel daily.</p>\n\n\n\n<p><strong>Q2 (YouTube):</strong> What will it take to stop Iran?</p>\n\n\n\n<p><strong>Answer:</strong> Many believe the Iranian regime must go. This sentiment is shared not only by Israelis but also by many Iranians who desire freedom.</p>\n\n\n\n<p>Iran’s nuclear ambitions pose a threat to global security. Regime change is widely seen as the solution.</p>\n\n\n\n<p><strong>Q3 (Instagram):</strong> What is the fate of the hostages?</p>\n\n\n\n<p><strong>Answer:</strong> It’s crucial to avoid spreading unverified rumors, as they cause anguish for the families involved. The cold weather adds to the hostages’ peril, emphasizing the urgency of their release.</p>\n\n\n\n<p><strong>Q4 (YouTube):</strong> What’s happening in Canada with protests against Jews and Israel?</p>\n\n\n\n<p><strong>Answer:</strong> Anti-Semitism has been building in Canada for years. The lack of a firm stance against such sentiments has allowed protests to escalate, as seen in Montreal.</p>\n\n\n\n<h4 class=\"wp-block-heading\">A Message to Global Jewry</h4>\n\n\n\n<p>Jews worldwide should never hide their identity, yet personal safety must be a priority. Call out anti-Semitism and demand action from governments.</p>\n\n\n\n<p>Engage the silent majority who support Israel and Western values, as this fight is not just for Jews—it’s for the preservation of Western civilization.</p>\n\n\n\n<p><strong>Closing Remarks:</strong><br>Thank you for watching. Follow our new Spanish-language channels (links in the description). Join us for Giving Tuesday in two weeks to support our campaign.</p>\n\n\n\n<p>We’ll see you tomorrow at 3:00 PM Israel time. Have a good day!</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> sent a death squad to murder a rabbi in the UAE. Citizen Spokeswoman <a  href=\"https://iron-swords.co.il/t/ashley-waxman-bakshi/\">Ashley Waxman Bakshi</a> explains Iran&#8217;s eighth front against Jewish people around the world.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18010,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        490
    ],
    "class_list": [
        "post-18965",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ashley-waxman-bakshi"
    ],
    "lang": "en",
    "translations": {
        "en": 18965
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18965",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18965"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18965/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18966,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18965/revisions/18966"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18010"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18965"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18965"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18965"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}