{
    "id": 18952,
    "date": "2024-11-14T15:00:00",
    "date_gmt": "2024-11-14T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18952"
    },
    "modified": "2024-11-29T23:16:45",
    "modified_gmt": "2024-11-29T21:16:45",
    "slug": "israel-must-maintain-freedom-of-action-in-lebanon-jonathan-elkhoury",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/israel-must-maintain-freedom-of-action-in-lebanon-jonathan-elkhoury/",
    "title": {
        "rendered": "Israel Must Maintain Freedom of Action in Lebanon | Jonathan Elkhoury"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Israel Must Maintain Freedom of Action in Lebanon | Jonathan Elkhoury\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/aoVWLq6OO9E?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>There are intense diplomatic negotiations taking place right now about Lebanon. Israel has a clear demand: if Israel leaves Lebanon and Hezbollah reestablishes itself on Israel&#8217;s border, Israel must have a guaranteed freedom of action in Lebanon in order to remove the threat.</p>\n\n\n\n<p>If the Hezbollah threat returns, then Israel needs to return. That&#8217;s what Israel&#8217;s Defense Minister said Israel needs for any future agreement on Lebanon. He said Israel demands the right to independently enforce and act against any terrorist activity and organization.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Lebanon&#8217;s Weakness and Hezbollah&#8217;s Control</strong></h3>\n\n\n\n<p>France’s foreign minister rejected Israel’s demand. He said if Israel returns to Lebanon, it means Lebanon isn’t a strong country.</p>\n\n\n\n<p>Well, that’s the point—Lebanon isn’t a strong country. Lebanon is a country occupied by Iran via its terror army, Hezbollah. Hezbollah’s army is more powerful than Lebanon’s army.</p>\n\n\n\n<p>Hezbollah uses Lebanon as a base for murdering people in Israel and in Lebanon. Hezbollah murders anyone in Lebanon who they see as a threat to their control.</p>\n\n\n\n<p>In 2005, Hezbollah assassinated Lebanon&#8217;s former Prime Minister Rafik Hariri.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Reality of October 8, 2023</strong></h3>\n\n\n\n<p>Israel cannot return to the reality that existed on October 8, 2023. That’s when Hezbollah joined Hamas’s attack.</p>\n\n\n\n<p>Israel wasn’t in Lebanon then. That’s why Hezbollah was able to fire over 15,000 Iranian rockets, missiles, and drones. That’s why 60,000 people in Israel had to flee their homes. That’s why Hezbollah has been able to aim guided missiles at houses.</p>\n\n\n\n<p>France didn’t protect Hariri or the people in Lebanon from Hezbollah. No one did. France did nothing to protect the people of Israel from Hezbollah. No one pushed Hezbollah away from Israel’s border.</p>\n\n\n\n<p>That’s why Israel is doing it now.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The People of Lebanon and a Future Without War</strong></h3>\n\n\n\n<p>The people of Lebanon dream of a future without war. They know that Hezbollah must disarm. But Israel can’t leave Lebanon unless it knows that Hezbollah won’t be back.</p>\n\n\n\n<p>Israel&#8217;s people are under attack from Iran&#8217;s Hezbollah terror. So are the people of Lebanon. Tomorrow needs to be one without Iranian control of Lebanon, for the sake of both countries.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>UNIFIL and Its Failures</strong></h3>\n\n\n\n<p>I just saw an incredible video. Israel’s troops were about to engage Hezbollah terrorists. Then, UN forces in Lebanon approached in trucks.</p>\n\n\n\n<p>The Israeli soldiers were shocked to see them. They asked the UN soldiers: &#8220;Who sent you here? Who sent you here?&#8221;</p>\n\n\n\n<p>An Israeli news crew embedded within the Israeli soldiers caught that bizarre encounter on camera. The Israeli soldiers warned the UN forces that the area was dangerous and there was shooting, so the UN forces left.</p>\n\n\n\n<p>One of the Israeli soldiers shared that when he was younger, he remembered that UN forces in Lebanon were doing the same thing. When Israel&#8217;s troops would be closing in on Hezbollah, the UN troops would suddenly appear.</p>\n\n\n\n<p>That’s no coincidence. UN forces in Lebanon are part of the problem, not part of the solution.</p>\n\n\n\n<p>The UN forces are known as UNIFIL, the United Nations Interim Forces in Lebanon.</p>\n\n\n\n<p>UNIFIL is another UN agency that hasn’t done its job—quite the opposite. UNIFIL was supposed to prevent Hezbollah from being armed, from being near Israel&#8217;s border, and certainly from firing at people in Israel.</p>\n\n\n\n<p>Instead, UNIFIL looked on as Hezbollah became stronger in Lebanon, right next to UNIFIL bases. UNIFIL did nothing to stop Hezbollah&#8217;s over 15,000 Iranian rockets, missiles, and drones.</p>\n\n\n\n<p>That’s why Hezbollah has been able to wage war for so long. The UN has always done nothing.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Audience Questions</strong></h3>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question 1: Air Strike Near Beirut International Airport</strong></h4>\n\n\n\n<p><strong>Q:</strong> There’s a video circulating online showing an Israeli air strike near the international airport in Beirut, Lebanon. How do you justify this with the claim that Israel is doing everything in its power to avoid civilian casualties?</p>\n\n\n\n<p><strong>A:</strong> This video basically proves that Israel is doing everything in its power to prevent civilian casualties in Lebanon. Israel sends warnings through its Arabic spokesman to tell people in specific areas to evacuate in order not to be harmed.</p>\n\n\n\n<p>When Israel is striking a building that belongs to Hezbollah or is being operated by Hezbollah terrorists, it ensures civilians are not harmed. That video just proves that life continues in Lebanon, and civilians that aren’t part of Hezbollah will not be harmed.</p>\n\n\n\n<p>Israel has been doing this since it began its operation in Lebanon, making sure that none of the Lebanese civilians that aren’t part of any terrorist group would be harmed. Numerous videos show people just watching Israeli strikes on Hezbollah buildings. This proves that Israel is doing everything in its power to prevent Lebanese casualties.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question 2: Connection Between Lebanon and Syria</strong></h4>\n\n\n\n<p><strong>Q:</strong> A few minutes ago, Israeli air strikes were reported in Damascus. What are your thoughts on this report? Is there a connection between what’s happening in Lebanon and what’s happening in Syria?</p>\n\n\n\n<p><strong>A:</strong> Thank you for this amazing question. Syria has been part of the problem. Syria is a base, a hub, for Hezbollah to transfer weapons from the Islamic Republic of Iran to Hezbollah in Lebanon through Syria.</p>\n\n\n\n<p>We’ve seen numerous times where Syria just let it happen and allowed it to go over to Lebanon. Israel is doing everything in its power to prevent Hezbollah from regaining its power—regaining missiles that are being sent from Iran, or drones sent by the Islamic Republic of Iran.</p>\n\n\n\n<p>Israel has every right to protect its citizens. That’s its only job right now—to protect Israeli civilians. Syria is definitely part of the problem. That’s why Israel has to make sure that Syria stops giving weapons to Hezbollah.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question 3: UAE Aid to Northern Gaza</strong></h4>\n\n\n\n<p><strong>Q:</strong> The IDF said this morning that 15 trucks of aid from the UAE entered northern Gaza. Is Israel cooperating with the UAE? What’s the relationship like between Israel and the UAE today?</p>\n\n\n\n<p><strong>A:</strong> That’s a great question. It shows that Israel is continuing to support and want peace in the region.</p>\n\n\n\n<p>When Israel signed the Abraham Accords, it did so in good faith, wanting quiet and prosperity in the region. The UAE continues to honor that peace agreement, even though Israel is under attack and responding to terrorists.</p>\n\n\n\n<p>The UAE has proved itself as an important ally. It can help out in the day after, when the war ends, but also right now. Israel is allowing the UAE to bring support and supplies to Gaza through air and via the border with Israel.</p>\n\n\n\n<p>Israel looks to expand the Abraham Accords. After the UAE announced its normalization with Israel, Bahrain, Morocco, and Sudan followed.</p>\n\n\n\n<p>As a former Lebanese citizen, I hope Lebanon will join the Abraham Accords 2.0. This region needs peace.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Final Question: What’s Next for Jonathan Elkhoury?</strong></h3>\n\n\n\n<p><strong>Q:</strong> Now that you’ve joined the Israeli Citizen Spokesperson’s Office, what’s next for you?</p>\n\n\n\n<p><strong>A:</strong> That’s a great question. I see myself as a bridge between communities. I’m Lebanese, Israeli, Christian, and part of the LGBTQ+ community. I’ve dedicated my life to being a voice for people who are afraid to speak out, both in Israel and abroad—especially in Lebanon.</p>\n\n\n\n<p>I hope to expand collaborations between Lebanese people, Israelis, and people from around the world, to share thoughts and promote peace.</p>\n\n\n\n<p>I’m honored to be part of Israel’s Spokesperson’s Office, and I look forward to expanding these efforts in the future.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Closing Remarks</strong></h3>\n\n\n\n<p>Thank you for watching. Don’t forget to check out our new Spanish-language channel. We’ll be back tomorrow at 3 PM Israel time and 8 AM Eastern time. Have a good day!</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> says that in the future, if <a  href=\"/hezbollah\">Hezbollah</a> is again a threat from Lebanon, then Israel will have to again deal with the threat in Lebanon. In this Daily Briefing, Citizen Spokesman <a  href=\"https://iron-swords.co.il/t/jonathan-elkhoury/\">Jonathan Elkhoury</a> explains the <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a> threat and why it cannot be allowed to return to Israel’s border.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18953,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1630
    ],
    "class_list": [
        "post-18952",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-jonathan-elkhoury"
    ],
    "lang": "en",
    "translations": {
        "en": 18952
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18952",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18952"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18952/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18954,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18952/revisions/18954"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18953"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18952"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18952"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18952"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}