{
    "id": 18683,
    "date": "2024-11-08T12:42:38",
    "date_gmt": "2024-11-08T10:42:38",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18683"
    },
    "modified": "2024-11-08T12:42:45",
    "modified_gmt": "2024-11-08T10:42:45",
    "slug": "israeli-football-hooligans-tear-down-palestine-flags-in-amsterdam-as-taxi-drivers-fight-back",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/fixed/israeli-football-hooligans-tear-down-palestine-flags-in-amsterdam-as-taxi-drivers-fight-back/",
    "title": {
        "rendered": "Israeli football hooligans tear down Palestine flags in Amsterdam as taxi drivers &#8216;fight back&#8217;"
    },
    "content": {
        "rendered": "\n<p>As Jewish fans from Maccabi Tel Aviv gathered in Amsterdam ahead of their team&#8217;s match against Ajax, they were met not with welcome, but with violence from Palestinian extremists and their supporters. This wasn’t just a spontaneous outburst; it was a premeditated, hate-fueled campaign aimed at terrorizing Jewish visitors and spreading fear.</p>\n\n\n\n<p>Reports indicate that Palestinian attackers chased Jews through the streets, ambushed them, and attacked them with knives and baseball bats. Videos circulating on social media show scenes of utter chaos, with Jews forced to flee for their lives. Some were even thrown into rivers, assaulted in broad daylight, while others faced harassment and brutality simply for being Jewish.</p>\n\n\n\n<p>Meanwhile, these attackers proudly flaunted their actions online, posting videos of Jews cowering in fear, while taunting them with chants of “Free Palestine.” These posts weren’t just celebrations; they were a disturbing display of hatred, targeting Jewish people based on the twisted narrative that has been spread to justify such violent actions. Passports of Israeli victims were stolen and displayed publicly as trophies, a chilling reminder of the sheer cruelty at play.</p>\n\n\n\n<p>Local authorities, overwhelmed by the scale of violence, struggled to control the situation. Reports even suggest that attackers broke into hotels, set off incendiary devices, and desecrated Israeli flags, while Jewish families with children sought refuge and safety. Despite the mayhem, there has been minimal condemnation from those pushing the pro-Palestinian narrative, a silence that speaks volumes.</p>\n\n\n\n<p>As Western societies continue to flirt with supporting the so-called &#8220;Palestinian cause,&#8221; it’s critical to understand the implications. This isn’t about peaceful protest; it’s about turning cities like Amsterdam into battlegrounds where Jewish people are hunted and brutalized. The narrative that frames “Palestine” as a victim is being weaponized to incite and justify this violence. This wave of indoctrination and hatred, if not confronted, will endanger not only Jews but anyone who stands in the way of such extremist ideologies.</p>\n\n\n\n<p>Amsterdam&#8217;s night of chaos is a wake-up call. The world must see this for what it truly is: not a political dispute, but a hate-driven assault against Jewish people, designed to terrorize and intimidate. Authorities and citizens alike must recognize the danger and take a stand before this violent ideology spirals further out of control.</p>\n\n\n\n<p>The Daily Mail’s coverage of the recent violence against Jews in Amsterdam is not only misleading but deeply irresponsible. By focusing on so-called “Israeli hooligans” tearing down Palestinian flags, they’ve completely ignored the vicious, hate-fueled attacks initiated by Palestinian extremists against Jewish fans. Instead of condemning the brutal assaults, attempted killings, and intimidation tactics, The Daily Mail chose to paint the Jewish victims as instigators, a shameful distortion that feeds into dangerous antisemitic narratives. This kind of biased reporting not only distorts the truth but emboldens those who commit acts of violence, knowing they won’t be held accountable in the court of public opinion. The Daily Mail’s failure to stand against hate and protect innocent victims shows a shocking disregard for journalistic integrity and a willingness to sacrifice truth for a sensational, one-sided narrative.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Palestinian extremists violently ambushed Jewish fans in Amsterdam, attacking with knives, cars, and incendiary devices, spreading fear and hatred openly.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18660,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 343,
        "footnotes": ""
    },
    "categories": [
        343
    ],
    "tags": [
        1673
    ],
    "class_list": [
        "post-18683",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-fixed",
        "tag-amsterdam-pogrom"
    ],
    "lang": "en",
    "translations": {
        "en": 18683
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18683",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18683"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18683/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18684,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18683/revisions/18684"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18660"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18683"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18683"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18683"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}