{
    "id": 18702,
    "date": "2024-11-08T14:07:20",
    "date_gmt": "2024-11-08T12:07:20",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18702"
    },
    "modified": "2024-11-16T00:50:51",
    "modified_gmt": "2024-11-15T22:50:51",
    "slug": "sjp-amsterdam-orchestrating-violent-terror-attacks-against-jews",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/sjp-amsterdam-orchestrating-violent-terror-attacks-against-jews/",
    "title": {
        "rendered": "SJP Amsterdam: Violent Terror Attacks Against Jews"
    },
    "content": {
        "rendered": "\n<p>Reports indicate that <strong>SJP Amsterdam</strong> has taken its dangerous, antisemitic agenda to new levels, endorsing and reportedly organizing coordinated terror attacks against Jewish civilians in Amsterdam. This series of brutal assaults shows a shocking escalation in the group’s violent ideology, with SJP Amsterdam allegedly leading efforts to incite attacks against Jews and instigating violence across the city.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Details of the Attacks</strong></h3>\n\n\n\n<p>In recent days, Jewish residents and visitors in Amsterdam have been subjected to horrifying acts of violence:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Jewish individuals have been ambushed, some thrown into rivers, and others run over by cars</strong> in a wave of terror targeting civilians simply for their identity.</li>\n\n\n\n<li><strong>Palestinian attackers, reportedly armed with knives and baseball bats, have attacked Jewish families</strong>, stolen passports, and created an environment of fear and chaos.</li>\n\n\n\n<li><strong>Muslim migrants allegedly broke into hotels, threw incendiary devices, and burned Israeli flags</strong> in displays of hatred that mirror terrorist tactics used by Hamas.</li>\n</ul>\n\n\n\n<p>These violent acts are not random incidents—they reflect a coordinated effort, allegedly led or encouraged by SJP Amsterdam, to terrorize the Jewish community.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>SJP Amsterdam’s Role in Fomenting Terror</strong></h3>\n\n\n\n<p>SJP Amsterdam, an extension of the radical <strong>Students for Justice in Palestine (SJP)</strong> network, has allegedly endorsed and supported these actions. By calling for “resistance” and using language that glorifies violence, SJP Amsterdam has played a role in inciting its followers to take violent actions. Rather than standing for legitimate protest, SJP Amsterdam has revealed its true agenda: promoting antisemitic violence and targeting Jewish civilians under the guise of activism.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Endorsing and Glorifying Terrorism</strong></h3>\n\n\n\n<p>As seen in their response to the October 7 Hamas terror attacks, <strong>SJP chapters worldwide, including SJP Amsterdam, have shown support for acts of terror against Jews and Israelis</strong>. Their rhetoric celebrates and justifies violence, contributing to a climate where antisemitic hate crimes become “acceptable” or even encouraged. The recent attacks on Jewish civilians in Amsterdam are a direct consequence of SJP’s toxic influence, which has spread from campuses to communities across the globe.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Conclusion: SJP Amsterdam Is a Threat to Public Safety</strong></h3>\n\n\n\n<p><strong>Supporting SJP Amsterdam is supporting a group that endorses terror.</strong> Their role in recent antisemitic attacks in Amsterdam highlights the real-world impact of their extremist ideology. SJP Amsterdam is not a group interested in peace or justice—they are enablers of hate, violence, and terrorism. By standing with SJP Amsterdam, individuals and organizations are aligning themselves with an agenda that poses a direct threat to Jewish safety and societal peace.</p>\n\n\n\n<p><strong>Let it be clear: SJP Amsterdam is an enabler of terror, and anyone supporting them is complicit in their antisemitic agenda.</strong> The international community must recognize the true nature of SJP Amsterdam and condemn their dangerous actions, which endanger Jewish lives and destabilize communities.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>SJP Amsterdam has escalated its antisemitic agenda, allegedly organizing coordinated attacks on Jews, spreading fear and inciting violence citywide.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18778,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        1673
    ],
    "class_list": [
        "post-18702",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-amsterdam-pogrom"
    ],
    "lang": "en",
    "translations": {
        "en": 18702
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18702",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18702"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18702/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18779,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18702/revisions/18779"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18778"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18702"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18702"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18702"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}