{
    "id": 18950,
    "date": "2024-11-13T15:00:00",
    "date_gmt": "2024-11-13T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18950"
    },
    "modified": "2024-11-29T23:10:21",
    "modified_gmt": "2024-11-29T21:10:21",
    "slug": "state-department-praises-israels-aid-efforts-in-gaza-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/state-department-praises-israels-aid-efforts-in-gaza-ruth-wasserman-lande/",
    "title": {
        "rendered": "State Department Praises Israel’s Aid Efforts in Gaza | Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"State Department Praises Israel’s Aid Efforts in Gaza | Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/SbVjmXwVBxQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>The US agrees Israel has done a lot to help Gazans. One month ago, the US secretaries of state and defense, Antony Blinken and Lloyd Austin, asked Israel to increase the amount of humanitarian aid that reached Gaza. Yesterday, the US Department spokesperson listed many of the steps that Israel actually took.</p>\n\n\n\n<p>He said that Israel responded, reopened actually, the Erez Crossing, opened a new crossing at Kisim, waived customs on Jordanian aid at delivery routes at Banis Suela Road, the Fence Road, and the Coastal Road, expanded the Masasi humanitarian zone, and added operational pauses to allow civilians to move safely.</p>\n\n\n\n<p>Israel is doing its best to help the Gazans while fighting in a war with Hamas murderers who fight from among the civilian population.</p>\n\n\n\n<p>All of Gaza was actually receiving 60 to 70 truckloads of food a day before Hamas’s attack in September. 3,457 truckloads of food entered Gaza—that&#8217;s two to three times as much food as before. From January to April, Gazans received over 3,000 calories per person, more than actually in Norway or in the UK.</p>\n\n\n\n<p>And today, nearly 900 truckloads of aid are still waiting for collection by the UN on the Gazan side of the border. That aid has been uncollected for weeks, some of it actually even over a month.</p>\n\n\n\n<p>There’s been an aid backlog for most of the war. While the UN and others keep complaining about a supposed aid shortage, Israel is flooding Gaza with so much aid the UN is actually drowning under it. The UN needs to scale up its deliveries and stop pointing a finger at Israel.</p>\n\n\n\n<p>It looks like Hamas may be blocking some aid in order to create a shortage in Gaza and thereby raise the demand of certain goods and raise the prices for the goods that they sell on the black market.</p>\n\n\n\n<p>Instead of pretending that there’s not enough aid being sent to Gaza, the UN and other humanitarian aid organizations need to do their job, collect the overflowing aid, and just deliver it.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Prime Minister Netanyahu’s Message to Iran</strong></h3>\n\n\n\n<p>The Prime Minister of Israel published an important video yesterday. Prime Minister Netanyahu told the Iranian people:</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;There is one thing that the regime fears more than Israel, and that is you, the people of Iran. Don’t lose hope.&#8221;</p>\n</blockquote>\n\n\n\n<p>In a direct address to the Iranian people, Israel&#8217;s leader made it absolutely clear: Israel is not at war with the people of Iran.</p>\n\n\n\n<p>Iran&#8217;s leaders are trying to murder people in Israel, and they&#8217;re doing it at the expense of the welfare of the citizens of Iran.</p>\n\n\n\n<p>Iran&#8217;s latest ballistic missile attack cost $2.3 billion—with a capital B. That’s money that could have helped Iranians have clean water or new schools.</p>\n\n\n\n<p>Israel is under attack by Iran&#8217;s regime—the same regime that oppresses its own people.</p>\n\n\n\n<p>You see, in the Middle East, we say, “The enemy of my enemy is my friend.” In this case, the people of Israel and the people of Iran are friends, and they have the same enemy.</p>\n\n\n\n<p>Before the mullah regime took over Iran in 1979, the people of Israel and Iran worked together to make better lives for both our nations. And yes, we can actually do it again.</p>\n\n\n\n<p>Israel winning this war isn’t just about keeping our people safe. It’s about trying to build a better tomorrow for all of us.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Audience Question 1: Why Send Aid to Gaza If Hamas Steals It?</strong></h3>\n\n\n\n<p>Our first question today is: Why is Israel continuing to send humanitarian aid to Gaza when it’s being stolen by Hamas?</p>\n\n\n\n<p>Brilliant question. Why is Israel continuing to be humane?</p>\n\n\n\n<p>Why is Israel continuing to care for the Gazan civilians, which many people in the world are actually complaining about—the fact that Israel is not caring about the Gazan civilians and hurting them?</p>\n\n\n\n<p>Israel cares about the people of Gaza. And yes, the nation is a humanitarian nation, and the purpose is not to hurt the civilians.</p>\n\n\n\n<p>Plus, there’s a lot of pressure from the international arena, particularly the United States of America.</p>\n\n\n\n<p>But there’s a complexity here that we cannot ignore, and that is that it is indeed being stolen by Hamas. And whichever civilian dares to raise his hand and take food for his own children, that hand gets cut off.</p>\n\n\n\n<p>And this is the tragedy. The tragedy is the leadership of the Gazans themselves.</p>\n\n\n\n<p>What should be done? There should be some kind of a mechanism—a strong, responsible mechanism—that actually distributes the food and the aid to the people, and not allowing Hamas to steal it.</p>\n\n\n\n<p>This is not the role of an army, of the IDF. And yet that mechanism is not yet in place. And this is what we all hope to find and put into practice.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Audience Question 2: Should Israel Prioritize Iran or Its Proxies?</strong></h3>\n\n\n\n<p>Our next question is from Talia RAB: Should Israel continue to focus on the war with Hezbollah and Hamas, Iran&#8217;s proxy armies, or should Israel prioritize taking out Iran’s Islamic Revolutionary Guard Corps?</p>\n\n\n\n<p>Thank you for the question of priorities.</p>\n\n\n\n<p>So unfortunately, Israel doesn’t have the privilege of not continuing to fight with Hamas and Hezbollah, and the Shiite militias from Syria and Iraq, and the Houthis in Yemen, and the terrorists—some of them in Gaza, different groups than Hamas, and some of them in the West Bank, some Hamas, some Islamic Jihad, and other groups.</p>\n\n\n\n<p>We simply do not have the privilege. That was the point of the Islamic Republic of Iran—having all of them fight with us to fatigue the IDF and tire the IDF all at once.</p>\n\n\n\n<p>And yet it is very important—in fact vastly important, in my humble opinion—to have a go at the Islamic Republic of Iran, because it is the overarching enemy and the one that operates all of those proxies.</p>\n\n\n\n<p>By the way, not only against Israel, but in Europe, in Canada, in the United States of America, in Australia—worldwide. And that’s not only the Islamic Republic of Iran, but also Qatar funding a lot of those groups.</p>\n\n\n\n<p>So yes, all of those bodies, countries, terrorist organizations need to be dealt with, unfortunately, simultaneously.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Audience Question 3: Hostages in Gaz</strong>A</h3>\n\n\n\n<p>This is our last question today. A short while before you began your briefing, the Palestinian Islamic Jihad terror group released a third video of Israeli hostage Sasha Trufanov.</p>\n\n\n\n<p>What do we know about who exactly is holding the hostages, where they might be, and how we can bring them home?</p>\n\n\n\n<p>Thank you for that very important question, because the most important thing—and actually the first and foremost objective of our war—is to bring our hostages, our people, our dear ones back home.</p>\n\n\n\n<p>What we know is that they’re held against any kind of humanity in horrid conditions. That we learned from those hostages who had returned.</p>\n\n\n\n<p>They are being held by different groups—some so-called civilians, some Islamic Jihad, some Hamas, and some other groups that we don’t even know the names of.</p>\n\n\n\n<p>These people are watching, in a manner of speaking, those hostages, either out of ideology, zealousness for radical religion, or out of pure hatred because of indoctrination against Israel and the Jewish people.</p>\n\n\n\n<p>Or they are hoping to get something in return—ransom, free passage, and so on—that they had been offered.</p>\n\n\n\n<p>This is the time to have a country like Egypt do the intelligence work to make sure they know not only where all the hostages are being kept, but how to make sure they come out.</p>\n\n\n\n<p>And no one—no one—will be able to convince me that the Republic of Egypt, which has expertise in gaining that kind of intelligence for decades against the Muslim Brotherhood in and within Egypt itself, cannot get that intelligence with our hostages as well.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Closing Remarks</strong></h3>\n\n\n\n<p>Thank you so much for being with us today. And yes, we’ll be here tomorrow as well, and we will listen to what interests you. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The State Department praised <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> for taking steps to improve the humanitarian situation in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>. In this Daily Briefing, Citizen Spokeswoman <a  href=\"https://iron-swords.co.il/t/ruth-wasserman-lande/\">Ruth Wasserman Lande</a> explains how Israel is doing everything it can to facilitate the delivery of humanitarian aid to Gaza.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17996,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-18950",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 18950
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18950",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18950"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18950/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18951,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18950/revisions/18951"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17996"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18950"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18950"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18950"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}