{
    "id": 18819,
    "date": "2024-11-16T17:02:44",
    "date_gmt": "2024-11-16T15:02:44",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18819"
    },
    "modified": "2024-11-16T17:08:09",
    "modified_gmt": "2024-11-16T15:08:09",
    "slug": "the-un-resolution-on-palestinian-self-determination",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/the-un-resolution-on-palestinian-self-determination/",
    "title": {
        "rendered": "The UN Resolution on Palestinian Self-Determination"
    },
    "content": {
        "rendered": "\n<p>The recent UN General Assembly resolution affirming the Palestinian right to self-determination and statehood represents a colossal failure to confront the truth. This resolution, along with the accompanying document supporting its claims, is riddled with historical inaccuracies, legal distortions, and a blatant disregard for the consequences of empowering terrorist organizations. This move by the international body not only perpetuates the myth of &#8220;Palestine&#8221; as a sovereign entity but also legitimizes the heinous acts of October 7, 2023, where Hamas terrorists carried out a massacre of innocent Israelis. By voting in favor of this resolution, the international community endorses violence and undermines the foundational principles of peace and justice.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Fiction of Palestinian Statehood</strong></h3>\n\n\n\n<p>Contrary to the claims made in the resolution and its supporting documents, Palestine has never existed as a sovereign state. The term &#8220;Palestine&#8221; was originally used by the Roman Empire to erase Jewish ties to their historic homeland of Judea. This designation has persisted as a geographical reference but was never tied to a distinct Arab nation. The region, under successive empires—including Byzantine, Islamic Caliphates, and Ottoman—did not host an independent Arab state. Its inhabitants identified with their religious or tribal affiliations, not as Palestinians.</p>\n\n\n\n<p>The UN&#8217;s invocation of the principle of self-determination in this context is misleading and inconsistent with the historical record. After World War I, the League of Nations Mandate for Palestine explicitly recognized the Jewish people&#8217;s historical connection to the land and endorsed their right to reestablish their homeland. This mandate laid the legal groundwork for the establishment of Israel in 1948. At no point did it envision the creation of an Arab Palestinian state because no such national identity or political claim existed at the time.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Inventing &#8220;Palestinians&#8221; for Political Convenience</strong></h3>\n\n\n\n<p>The narrative of a Palestinian national identity is one of the most egregious examples of historical revisionism, crafted to serve as a political weapon against Israel. This narrative falsely portrays the Palestinians as an ancient, unified people who have been unjustly displaced from their homeland. In reality, the concept of a distinct Palestinian national identity did not exist until the mid-20th century. Before 1948, Arab inhabitants of the region referred to themselves as Arabs, identifying more with their tribal, religious, or broader pan-Arab identity rather than as Palestinians.</p>\n\n\n\n<p>The deliberate creation of a Palestinian identity emerged in direct response to the establishment of Israel and the international recognition of Jewish sovereignty in the historic land of Judea. Arab leaders and their allies weaponized this fabricated identity to delegitimize the Jewish state, portraying Israel as a colonial imposition on an indigenous population. This manipulation served a dual purpose: to galvanize anti-Israel sentiment on the global stage and to unify Arab populations against Israel under the guise of a common cause. The invention of a &#8220;Palestinian people&#8221; was a political strategy, not a reflection of historical reality.</p>\n\n\n\n<p>The resolution under discussion conveniently ignores this fabrication, treating the Palestinian people as though they have existed as a coherent national group for centuries. This falsehood is perpetuated despite overwhelming evidence to the contrary. The historical record shows that the Arab population of the region made no claims to statehood during the Ottoman Empire’s centuries-long control of the territory, nor during the British Mandate for Palestine. These claims only surfaced when the idea of a Jewish state began to gain international traction. The notion of a Palestinian national identity is, therefore, a retroactive construct, designed to counteract the legitimate and historically rooted claims of the Jewish people.</p>\n\n\n\n<p>By advancing this narrative, the resolution erases key historical moments when the Arab population was offered opportunities for self-determination but chose violence and rejectionism instead. The 1947 UN Partition Plan, for instance, proposed the creation of two states: one Jewish and one Arab. Jewish leaders, despite the limitations and compromises involved, accepted this plan as a pathway to peace and sovereignty. Arab leaders, however, categorically rejected it, opting instead to launch a war aimed at annihilating the nascent Jewish state. This pattern of rejection has persisted for decades, with Arab leaders consistently prioritizing Israel’s destruction over building a peaceful future for their own people.</p>\n\n\n\n<p>Furthermore, the resolution disregards the fact that Arab leaders themselves recognized the absence of a distinct Palestinian identity for much of the 20th century. Notable Arab figures, such as the late PLO leader Zuheir Mohsen, admitted that the Palestinian identity was constructed as a political instrument to undermine Israel’s legitimacy. In a 1977 interview, Mohsen explicitly stated: “The Palestinian people do not exist. The creation of a Palestinian state is only a means for continuing our struggle against the state of Israel.” Such statements highlight the cynical nature of this identity&#8217;s invention, underscoring its roots in anti-Zionism rather than any authentic national aspiration.</p>\n\n\n\n<p>The UN resolution not only perpetuates this fraudulent narrative but also erases the countless acts of terror committed in the name of this fabricated identity. The world is being asked to accept the Palestinian cause as one of justice and liberation while ignoring the atrocities committed under its banner. This is a dangerous precedent, as it legitimizes the use of propaganda and revisionist history to justify violence. It is essential to confront this falsehood head-on, as failure to do so emboldens those who seek to rewrite history for political gain and undermines the pursuit of genuine peace.</p>\n\n\n\n<p>The Palestinian narrative is not merely an abstract historical inaccuracy—it has real and devastating consequences. It fuels hatred, incites violence, and has become the ideological foundation for terrorist organizations like Hamas and Hezbollah. These groups manipulate this invented identity to recruit followers, justify attacks on civilians, and wage a relentless war against Israel. The October 7, 2023, massacre, where Hamas terrorists slaughtered over 1,400 Israelis, is a horrifying example of how the Palestinian cause has been weaponized to serve an agenda of destruction and genocide.</p>\n\n\n\n<p>By ignoring these realities, the UN resolution not only perpetuates a historical lie but also undermines the legitimacy of the Jewish state. It rewards decades of violence, rejectionism, and terror while punishing Israel for defending its existence. This is not just a failure of historical integrity; it is a moral failure of the international community. Recognizing and addressing this fabrication is essential to dismantling the narrative that fuels the conflict and to paving the way for an honest and lasting resolution</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Palestinian Agenda: Annihilation, Not Coexistence</strong></h3>\n\n\n\n<p>At the heart of the Palestinian agenda, as championed by organizations like Hamas, is not the pursuit of self-determination but the total eradication of Israel. The Palestinian leadership has repeatedly demonstrated that their primary goal is not peaceful coexistence or statehood alongside Israel but the elimination of the Jewish state and its people. This is not a baseless claim but a documented fact rooted in their charters, public statements, and actions. Their rhetoric and policies leave no room for doubt: they do not seek liberation but domination, and their ultimate aim is the destruction of Israel.</p>\n\n\n\n<p>The October 7, 2023, massacre is a glaring and horrifying example of this agenda in action. On that day, Hamas operatives infiltrated Israeli territory and carried out a bloodbath of unprecedented brutality. Over 1,400 Israelis, including children, women, and the elderly, were systematically murdered. Women were raped, babies were burned alive, and entire families were executed in their homes. This was not an act of resistance or a response to &#8220;occupation&#8221; as apologists might claim—it was a calculated act of genocidal hatred. Hamas’s own leadership celebrated the massacre, declaring it a victory and promising more to come.</p>\n\n\n\n<p>These atrocities are not anomalies but the logical culmination of a long-standing ideology. Hamas’s founding charter explicitly calls for the destruction of Israel and the murder of Jews. Article 7 of their charter invokes a hadith that states, “The Day of Judgment will not come until Muslims fight the Jews (killing the Jews), when the Jew will hide behind stones and trees. The stones and trees will say, ‘O Muslims, O Abdullah, there is a Jew behind me, come and kill him.’” This is not a fringe perspective within Palestinian society but a core principle of Hamas’s governance in Gaza.</p>\n\n\n\n<p>Despite this clear and present danger, the UN resolution paints Palestinians as victims of oppression, seeking nothing more than freedom and self-determination. It deliberately omits the fact that Palestinian leadership has rejected every peace proposal that includes the continued existence of Israel. From the 1947 UN Partition Plan to the Oslo Accords and subsequent negotiations, every opportunity for a two-state solution has been met with intransigence, violence, and renewed calls for Israel’s destruction. This is not a people striving for peaceful liberation; it is a leadership dedicated to perpetual war.</p>\n\n\n\n<p>Palestinian leaders have consistently indoctrinated their population with a hatred for Jews and Israel. From school curricula to media broadcasts, Palestinian children are taught that Jews are subhuman and that martyrdom in the fight against Israel is the highest aspiration. Textbooks refer to Israel as a &#8220;colonial cancer&#8221; and omit its existence from maps, while state-sponsored media glorifies terrorists as heroes and role models. This systemic indoctrination ensures that each generation is primed not for peace but for conflict, viewing the annihilation of Israel as a sacred duty.</p>\n\n\n\n<p>The use of violence as a means to achieve this end is not limited to Hamas. The Palestinian Authority, often portrayed as a more moderate body, engages in its own incitement and supports terrorism through its “pay-for-slay” program, which rewards families of terrorists with financial stipends. This institutionalized support for terror is a cornerstone of Palestinian governance and has led to countless attacks on Israeli civilians. The message is clear: terror is not only tolerated but incentivized and celebrated within Palestinian society.</p>\n\n\n\n<p>The resolution’s failure to acknowledge these realities makes it complicit in enabling terrorism. By framing Palestinians solely as victims and ignoring their leadership’s genocidal agenda, the UN provides cover for groups like Hamas to continue their campaign of violence. This resolution sends a dangerous message to the world: that the international community will tolerate, and even reward, terror if it is masked as a struggle for self-determination.</p>\n\n\n\n<p>The international support for this resolution ignores the broader implications of the Palestinian agenda. The goal is not just the destruction of Israel but the eradication of Jews globally, as articulated in countless speeches and propaganda pieces circulated by Hamas and other Palestinian factions. The chants of “From the river to the sea, Palestine will be free” are not expressions of peaceful aspirations—they are calls for the complete obliteration of Israel and its replacement with an Arab state. This vision is inherently incompatible with coexistence and peace.</p>\n\n\n\n<p>The October 7 massacre should serve as a wake-up call to the world. It is a stark reminder of the consequences of ignoring or downplaying the true nature of the Palestinian agenda. This is not a movement seeking justice but one rooted in hatred and committed to genocide. Every nation that supports resolutions like the one under discussion must understand that they are endorsing this agenda. They are lending legitimacy to a cause that celebrates the murder of civilians and glorifies acts of terror.</p>\n\n\n\n<p>To support the Palestinian leadership’s demands without addressing their ultimate goals is to condone the very violence and hatred they propagate. It is to align with those who celebrated the slaughter of innocent people on October 7 and who promise more bloodshed in the future. This is not a path to peace; it is a path to destruction, and it must be unequivocally rejected by any nation that values justice and humanity.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Supporting This Resolution Is Supporting Terrorism</strong></h3>\n\n\n\n<p>The United Nations’ resolution affirming the Palestinian right to self-determination is not merely misguided—it is a direct endorsement of terrorism. Every single country that voted in favor of this resolution has, knowingly or unknowingly, approved the October 7 massacre and sent a clear signal to the world: violence against Jews is not only acceptable but politically effective. This vote rewards barbarity, legitimizes the mass murder of innocent people, and reinforces the idea that the killing of Jews carries no consequences. The fact that 101 hostages, including the 10-month-old baby Kfir Bibas, remain in Gaza under torture and inhumane conditions only highlights the moral failure of these nations.</p>\n\n\n\n<p>On October 7, 2023, the world bore witness to atrocities that defy comprehension. Hamas operatives crossed into Israeli territory and unleashed a campaign of terror that left over 1,400 Israelis dead. The victims were not soldiers on a battlefield but civilians—men, women, children, and the elderly. Infants were murdered in their cribs, mothers were executed alongside their children, and concertgoers were hunted down like animals. These were deliberate, calculated acts of genocide, yet the UN resolution does not condemn them.</p>\n\n\n\n<p>By voting in favor of this resolution, countries have sent an unmistakable message: the October 7 massacre is permissible. These votes are a stamp of approval on the actions of Hamas and a nod of encouragement to other terrorist organizations worldwide. The resolution reframes the Palestinian cause as a struggle for liberation while ignoring that its methods include the slaughter of innocents. This grotesque whitewashing of terror not only dishonors the memory of those who were brutally murdered but also incentivizes further violence.</p>\n\n\n\n<p>This resolution has normalized violence against Jews on a global scale. It tells the world that Jewish lives are expendable, that their suffering can be ignored, and that their murderers can be excused. This is not a hypothetical scenario—it is already playing out. Protests in major cities around the world feature chants of “From the river to the sea,” a call for the eradication of Israel, while the October 7 massacre is celebrated openly by Hamas and its supporters.</p>\n\n\n\n<p>The international community’s silence on these atrocities emboldens the perpetrators. The resolution legitimizes the narrative that Jews are fair game, that their lives and safety are secondary to the political demands of their enemies. It reinforces the vile notion that Jews can be murdered with impunity, their deaths excused as part of a broader struggle. This is not just a failure of justice—it is a moral collapse that threatens to erode the very foundations of human rights and dignity.</p>\n\n\n\n<p>As the resolution was passed, 101 hostages remained in Gaza, held captive by Hamas. Among them is baby Kfir Bibas, 2 Years Old, torn from his family and subjected to unthinkable conditions. His parents are also hostages, enduring unimaginable torment alongside him. These innocent people are pawns in Hamas’s grotesque game, used as leverage to extort political and financial gains.</p>\n\n\n\n<p>Yet the resolution fails to even acknowledge their suffering. It does not call for their immediate release or condemn their captors. By ignoring these hostages, the international community has abandoned them, implicitly accepting their captivity and the abuse they endure. This silence is deafening and damning. It sends a message to Hamas that their strategy of kidnapping and torturing civilians is not only effective but acceptable.</p>\n\n\n\n<p>Every country that voted for this resolution bears responsibility for the message it sends to the world. These votes have made it clear that the international community is willing to look the other way when Jews are targeted. They have emboldened terrorist organizations, showing them that their actions will not lead to condemnation but to political gains. The cost of this complicity is measured not only in the lives already lost but in the lives that will be lost in the future.</p>\n\n\n\n<p>By supporting this resolution, these nations have effectively told Hamas and other terrorist groups that violence works. They have shown that massacres, kidnappings, and acts of unspeakable cruelty can be reframed as legitimate acts of resistance. This resolution is not a pathway to peace; it is a roadmap for further atrocities.</p>\n\n\n\n<figure class=\"wp-block-image aligncenter size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"514\" src=\"https://iron-swords.co.il/wp-content/uploads/2024/11/170-the-un-resolution-on-palestinian-self-determination-1024x514.jpeg\" alt=\"\" class=\"wp-image-18824\" srcset=\"https://iron-swords.co.il/wp-content/uploads/2024/11/170-the-un-resolution-on-palestinian-self-determination-1024x514.jpeg 1024w, https://iron-swords.co.il/wp-content/uploads/2024/11/170-the-un-resolution-on-palestinian-self-determination-300x151.jpeg 300w, https://iron-swords.co.il/wp-content/uploads/2024/11/170-the-un-resolution-on-palestinian-self-determination-768x386.jpeg 768w, https://iron-swords.co.il/wp-content/uploads/2024/11/170-the-un-resolution-on-palestinian-self-determination.jpeg 1199w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></figure>\n\n\n\n<p>The UN resolution is a direct reward for Hamas’s actions. It gives the organization exactly what it seeks: international recognition and validation of their cause. This is not just a failure of diplomacy—it is an active betrayal of justice. By framing the resolution as a support for Palestinian self-determination, the UN has whitewashed the realities of Palestinian terrorism.</p>\n\n\n\n<p>Hamas and other terrorist groups do not seek peace or coexistence. Their goal is the destruction of Israel and the extermination of Jews. The resolution ignores this fundamental truth, instead portraying Palestinians as victims of oppression fighting for liberation. This narrative is not only false but dangerous, as it obscures the genocidal intent that drives Hamas and its allies.</p>\n\n\n\n<p>The resolution’s silence on the hostages, its failure to condemn the October 7 massacre, and its one-sided narrative have turned it into a symbol of the international community’s indifference to Jewish suffering. It is a stark reminder that the world has not learned from history. The message of this vote is clear: the lives of Jews are expendable, their killers are justified, and their pain can be ignored.</p>\n\n\n\n<p>This cannot be allowed to stand. Every nation that values human rights and justice must reject this resolution and the message it sends. The international community must demand the immediate release of the hostages, condemn Hamas for its atrocities, and stand unequivocally with Israel in its fight against terrorism. Anything less is a betrayal of the principles that the UN claims to uphold.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The UN’s Role in Promoting Terrorism</strong></h3>\n\n\n\n<p>The adoption of the United Nations resolution supporting Palestinian self-determination is not just a failure of diplomacy—it is an explicit endorsement of terrorism. The UN, under the leadership of António Guterres, has shown a glaring bias against Israel, legitimizing the Palestinian narrative while erasing the atrocities committed against Jews. This resolution marks a historic low point for an institution supposedly committed to peace and human rights, as it turns a blind eye to the suffering inflicted by Palestinian terrorism and implicitly rewards groups like Hamas for their barbaric actions.</p>\n\n\n\n<p>Under António Guterres’s leadership, the UN has consistently displayed a one-sided stance in the Israeli-Palestinian conflict, often echoing anti-Israel rhetoric and failing to condemn terrorism against Jews. His recent statements following the October 7 massacre were emblematic of this bias. Instead of unequivocally condemning Hamas for its heinous crimes—slaughtering over 1,400 Israelis, including women, children, and elderly civilians—Guterres suggested that the attack did not occur in a vacuum, implying that Israel was partly to blame. This victim-blaming narrative is not only abhorrent but also deeply dangerous, as it shifts accountability away from the perpetrators and onto the victims.</p>\n\n\n\n<p>By framing the October 7 massacre as a response to &#8220;occupation&#8221; and &#8220;grievances,&#8221; Guterres downplayed the sheer brutality of the attack and the genocidal ideology driving Hamas. This rhetoric emboldens terrorists, sending a message that their actions will not only be excused but potentially justified on the world stage. For a Secretary-General who should represent impartiality and justice, such words are a betrayal of the UN’s foundational principles and a clear demonstration of his disregard for Jewish lives.</p>\n\n\n\n<p>The UN resolution, passed under Guterres’s watch, makes no mention of the thousands of rockets that have rained down on Israeli towns, the infiltration and massacre of civilians on October 7, or the ongoing glorification of violence in Palestinian schools and media. Instead, it focuses solely on affirming the “right” of Palestinians to self-determination, completely ignoring the terrorism that underpins their leadership.</p>\n\n\n\n<p>The billions of dollars in international aid funneled to Palestinian territories, much of it overseen by UN agencies, have been used not for humanitarian purposes but to construct tunnels, buy weapons, and fund terror infrastructure. Guterres and his administration have failed to hold Palestinian leaders accountable for this misuse of funds, effectively enabling the violence to continue. This complicity has emboldened Hamas and other terrorist groups, reinforcing their belief that their actions will not lead to condemnation or consequences.</p>\n\n\n\n<p>As the UN passed its resolution, 101 innocent civilians remain hostages in Gaza, held by Hamas under horrific conditions. These hostages include children, elderly Holocaust survivors, and entire families who were ripped from their homes during the October 7 attack. Among them is baby Kfir Bibas, just 10 months old, whose plight symbolizes the inhumanity of Hamas and the world’s failure to act.</p>\n\n\n\n<p>Yet Guterres and the UN have remained shamefully silent about these hostages. No urgent resolution has been introduced demanding their immediate release. No global outcry has been led by the Secretary-General to rally nations in their defense. This silence is deafening and speaks volumes about the UN’s priorities. It sends a chilling message that Jewish lives are secondary, that their suffering can be ignored, and that their captors will face no accountability.</p>\n\n\n\n<p>By supporting this resolution, the UN has effectively legitimized terrorism as a tool for political gain. The language of self-determination, as invoked in this resolution, deliberately ignores the fact that Palestinian leadership has rejected every peace proposal that includes coexistence with Israel. Groups like Hamas and the Palestinian Authority have consistently chosen violence, indoctrinating their population with hatred and inciting attacks against Jews.</p>\n\n\n\n<p>The resolution fails to acknowledge that Palestinian self-determination, as it is currently framed, is incompatible with peace. It is rooted in the goal of destroying Israel, not building a peaceful state. Guterres’s refusal to confront this reality—and his continued support for one-sided resolutions—has emboldened those who seek Israel’s destruction.</p>\n\n\n\n<p>António Guterres’s leadership has highlighted a troubling double standard within the UN when it comes to Israel. Time and again, the UN has passed resolutions condemning Israel for defending itself while ignoring the actions of its aggressors. This latest resolution is part of a broader pattern that treats Jewish lives as expendable and Israeli security measures as aggression.</p>\n\n\n\n<p>The hypocrisy is glaring. When other nations defend themselves against terrorism, the international community rallies in support. Yet when Israel does the same, it is vilified and accused of oppression. Guterres has perpetuated this bias, allowing the UN to become a platform for anti-Israel propaganda rather than a forum for genuine dialogue and reconciliation.</p>\n\n\n\n<p>The consequences of this resolution extend far beyond October 7. By failing to condemn Hamas’s actions and by rewarding their narrative with international validation, the UN has set a dangerous precedent. It has shown terrorist organizations that their methods work—that mass murder, kidnappings, and barbarity can be reframed as resistance and gain international support.</p>\n\n\n\n<p>This is not just a failure of the United Nations; it is a betrayal of its very purpose. The UN was founded in the aftermath of World War II, with a commitment to preventing atrocities and protecting human rights. Under António Guterres, it has strayed far from these principles, becoming a platform for legitimizing violence and enabling those who seek to destroy Israel and the Jewish people.</p>\n\n\n\n<p>The UN’s resolution supporting Palestinian self-determination, championed under António Guterres’s leadership, is a stain on the institution’s legacy. It has legitimized the October 7 massacre, ignored the plight of hostages, and sent a message to the world that Jewish lives are expendable. By turning a blind eye to Palestinian terrorism and glorifying their cause, the UN has abandoned its commitment to justice and human rights.</p>\n\n\n\n<p>Guterres’s leadership has highlighted a deep-seated bias within the UN, one that prioritizes political narratives over the truth and the lives of innocent victims. The international community must hold the UN accountable for its complicity in promoting terrorism and demand a return to its founding principles. Until then, the institution remains a symbol of moral failure, unfit to lead the world in the pursuit of peace and justice.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/the-un/\">The UN</a> resolution legitimizing Palestinian self-determination is a catastrophic failure, endorsing the October 7 massacre and terrorism, while ignoring the suffering of 101 <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>, including 10-month-old Kfir Bibas. <a  href=\"https://iron-swords.co.il/t/antonio-guterres/\">António Guterres</a>’s leadership embodies deep-seated anti-<a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> bias, excusing atrocities and emboldening violence.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18822,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        1340
    ],
    "class_list": [
        "post-18819",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-the-un"
    ],
    "lang": "en",
    "translations": {
        "en": 18819
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18819",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18819"
            }
        ],
        "version-history": [
            {
                "count": 4,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18819/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18825,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18819/revisions/18825"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18822"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18819"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18819"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18819"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}