{
    "id": 18955,
    "date": "2024-11-17T15:00:00",
    "date_gmt": "2024-11-17T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18955"
    },
    "modified": "2024-11-29T23:19:52",
    "modified_gmt": "2024-11-29T21:19:52",
    "slug": "unrwa-guys-and-hamas-guys-are-the-same-guys-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/unrwa-guys-and-hamas-guys-are-the-same-guys-daniel-rubenstein/",
    "title": {
        "rendered": "UNRWA Guys and Hamas Guys Are the Same Guys | Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"UNRWA Guys and Hamas Guys Are the Same Guys | Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/lgOqzPPJ2RU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>We need to talk about the head of UNRWA. This guy is hiding the truth, and we can&#8217;t let him get away with it.</p>\n\n\n\n<p>This is Philippe Lazzarini, the head of UNRWA. He said at least 243 UNRWA personnel have been killed in the war. That’s a specific number—it sounds like he has a list of their names.</p>\n\n\n\n<p>I have a simple question: <strong>What are their names? Who are the 243?</strong></p>\n\n\n\n<p>UNRWA refuses to let the public know. Is Muhammad Abu Iwi on the list? He was an UNRWA employee. He was also a commander in Hamas Special Forces. On October 7th, he threw grenades into the shelter where people who fled the Nova Music Festival were hiding.</p>\n\n\n\n<p>In many cases, UNRWA guys and Hamas guys are the same guys.</p>\n\n\n\n<p>UNRWA teachers were among the Hamas terrorists who invaded Israel on October 7th. The head of the UNRWA Teachers Union in Lebanon, Fathi Sharif, was also a senior Hamas commander in Lebanon.</p>\n\n\n\n<p>Is Sharif on Lazzarini&#8217;s list of dead UNRWA employees? Why doesn’t UNRWA publish the list of names?</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Why UNRWA Won’t Publish Names</strong></h3>\n\n\n\n<p>Here’s why: Israel will cross-check the names against a list of known Hamas terrorists. The whole world will see how deeply Hamas has infiltrated UNRWA.</p>\n\n\n\n<p>Let me know in the comments if you think I’m on to something.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Iranian Regime and Its Proxy Armies</strong></h3>\n\n\n\n<p>Good news—the maximum pressure campaign against the Iranian regime is making a comeback.</p>\n\n\n\n<p>The Biden administration was not strict with its Iran sanctions implementation. According to the <em>Financial Times</em>, Iran&#8217;s crude oil exports have more than tripled in the past four years—from a low of 400,000 barrels a day in 2020 to more than 1.5 million barrels a day in 2024.</p>\n\n\n\n<p>Where do you think that money went?</p>\n\n\n\n<p>It didn’t go to the Iranian people. It went to:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The Hamas regime in Gaza,</li>\n\n\n\n<li>The Hezbollah terrorist army in Lebanon, and</li>\n\n\n\n<li>The Houthi pirates in Yemen.</li>\n</ul>\n\n\n\n<p>The Iranian regime used its billions of dollars to build a &#8220;ring of fire&#8221; around Israel. Israel is now defending itself on <strong>seven fronts</strong>.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Returning to Maximum Pressure on Iran</strong></h3>\n\n\n\n<p>President Trump&#8217;s transition team is reportedly drawing up executive orders that he could issue on his first day in office to increase the pressure on Iran.</p>\n\n\n\n<p>This is the right move. We must increase the pressure on the Iranian regime so that it can’t fund its forever war against Israel. The Iranian regime is the problem. Maximum pressure on the Iranian regime is the solution.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>IDF Uncovers Hezbollah&#8217;s Plans</strong></h3>\n\n\n\n<p>Every day, the IDF is uncovering more of the Iranian regime&#8217;s investments in Lebanon. This includes the massive military infrastructure that Hezbollah built very close to Israel&#8217;s border.</p>\n\n\n\n<p>What the IDF is revealing is incredible. Hezbollah was prepared to invade Israel and carry out a massacre, just like what Hamas did on October 7th—but potentially worse.</p>\n\n\n\n<p>Here’s what was ready:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>A huge tunnel network near Israel’s border,</li>\n\n\n\n<li>Weapons and ammunition, and</li>\n\n\n\n<li>Motorcycles for rapid mobilization.</li>\n</ul>\n\n\n\n<p>Hezbollah fighters could have burst into Israel at multiple points along the border, conquered villages, and taken hostages.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Israel’s Commitment to Security</strong></h3>\n\n\n\n<p>Israel will never again allow a terrorist army on its border to have the capability to launch such an invasion.</p>\n\n\n\n<p>We are not going back to an October 6th reality. Israel has said for the past year that Hezbollah must back off, or it will be pushed away. Hezbollah hasn’t backed off—and it’s being pushed away.</p>\n\n\n\n<p>The Iranian regime has invested huge sums of money in its proxy armies and in a <strong>military nuclear program.</strong></p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Iran&#8217;s Military Nuclear Program</strong></h3>\n\n\n\n<p>If you thought Iran froze its military nuclear program decades ago, you’re wrong. When Israel struck targets in Iran at the end of October, one of the sites hit was a nuclear weapons research facility in an Iranian military complex called <strong>Parchin.</strong></p>\n\n\n\n<p>The sophisticated equipment destroyed in the attack was essential for:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Shaping and testing plastic explosives encasing uranium in a nuclear device, and</li>\n\n\n\n<li>Initiating a nuclear chain reaction.</li>\n</ul>\n\n\n\n<p>Iran claims its nuclear program is entirely peaceful. It’s not.</p>\n\n\n\n<p>Iran wants to wipe Israel off the map, and it continues to explore ways to do just that.</p>\n\n\n\n<p>Israel will never allow Iran to develop a nuclear weapons capability.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Q&amp;A Session</strong></h3>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question 1: What About Hamas in Judea and Samaria?</strong></h4>\n\n\n\n<p><strong>Q:</strong> If Hamas must be destroyed, demilitarized, and deradicalized, then what about in Judea and Samaria?</p>\n\n\n\n<p><strong>A:</strong> In Gaza, Hamas had an organized military with brigades, battalions, and a command structure. It was this military that carried out the invasion of Israel on October 7th.</p>\n\n\n\n<p>In the West Bank, Israel never withdrew completely like it did in Gaza. In the West Bank, Hamas has cells, as do other groups like Islamic Jihad. Israel is constantly working to uproot these cells.</p>\n\n\n\n<p>Even if the war in Gaza ends, operations in the West Bank will likely continue.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question 2: Will Philippe Lazzarini Face Charges?</strong></h4>\n\n\n\n<p><strong>Q:</strong> Will Lazzarini get charged with martyrdom?</p>\n\n\n\n<p><strong>A:</strong> I hope Lazzarini gets charged with something. He is the head of UNRWA, an organization deeply infiltrated by Hamas.</p>\n\n\n\n<p>UNRWA teachers have been identified as Hamas terrorists. Many Hamas terrorists on October 7th were graduates of UNRWA schools. Hamas even built a communications network under the UNRWA headquarters in Gaza.</p>\n\n\n\n<p>At a minimum, Lazzarini is negligent. The Israeli Knesset passed legislation prohibiting cooperation with UNRWA because of its infiltration by Hamas.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question 3: Fighting in Northern Gaza</strong></h4>\n\n\n\n<p><strong>Q:</strong> What’s going on in Northern Gaza?</p>\n\n\n\n<p><strong>A:</strong> Northern Gaza is currently the site of intense urban warfare. Hamas fighters are refusing to surrender, fighting from densely populated areas, apartment buildings, and tunnels.</p>\n\n\n\n<p>Israeli soldiers are engaged in intense combat, and there have been many casualties. At the same time, Israel is doing everything possible to ensure civilians are out of harm’s way and that aid reaches them.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Final Question: Iranian Drones</strong></h4>\n\n\n\n<p><strong>Q:</strong> Can you tell us more about the drone that came into Israel from the east today?</p>\n\n\n\n<p><strong>A:</strong> Earlier today, a drone infiltration triggered sirens in Rishon Lezion, south of Tel Aviv. The drone may have originated in Iran, Iraq, Syria, Lebanon, or Yemen.</p>\n\n\n\n<p>It’s an Iranian drone—slow-moving but deadly. Israel is facing a seven-front war and will continue fighting until its people are safe in their homes.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Closing Remarks</strong></h3>\n\n\n\n<p>Thank you for watching the live daily briefing. Follow me, Daniel Rubenstein, on Instagram and Twitter. We’re live every day, Sunday to Thursday, at 3 PM Israel time, 8 AM Eastern time.</p>\n\n\n\n<p>Check out our new Spanish-language channel for more content. Have a lovely day!</p>\n\n\n\n<p></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a> head <a  href=\"https://iron-swords.co.il/t/philippe-lazzarini/\">Philippe Lazzarini</a> refuses to publish the list of names of UNRWA personnel who were killed in the war. In this Daily Briefing, Citizen Spokesman <a  href=\"https://iron-swords.co.il/t/daniel-rubenstein/\">Daniel Rubenstein</a> says that the reason UNRWA won&#8217;t publish the list is because there are many <a  href=\"/hamas\">Hamas</a> members on it.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18067,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312
    ],
    "class_list": [
        "post-18955",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "en",
    "translations": {
        "en": 18955
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18955",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18955"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18955/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18956,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18955/revisions/18956"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18067"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18955"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18955"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18955"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}