{
    "id": 18493,
    "date": "2024-11-04T22:21:39",
    "date_gmt": "2024-11-04T20:21:39",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18493"
    },
    "modified": "2024-11-05T09:16:10",
    "modified_gmt": "2024-11-05T07:16:10",
    "slug": "unrwa-complicity-with-terrorism-confirmed",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/know-your-enemies/unrwa/unrwa-complicity-with-terrorism-confirmed/",
    "title": {
        "rendered": "UNRWA Complicity with Terrorism Confirmed"
    },
    "content": {
        "rendered": "\n<p>The world must stop deluding itself—UNRWA, under the leadership of Commissioner-General Philippe Lazzarini, has shown its true colors. The latest report from the United Nations Office of Internal Oversight Services (OIOS) confirms what Israel and its allies have long argued: UNRWA, the so-called humanitarian agency, is infested with personnel who are not just sympathizers but active participants in terrorism. The OIOS findings uncover the involvement of UNRWA staff in the October 7 massacre that saw the blood of innocent Israelis spilled by Hamas and Palestinian Islamic Jihad (PIJ) militants. This is not a misstep; it is a betrayal of humanity itself.</p>\n\n\n\n<h3 class=\"wp-block-heading\">A Gruesome Reality Confirmed</h3>\n\n\n\n<p>The UN probe concluded that nine UNRWA employees were implicated in the heinous events of October 7, with undeniable ties to Hamas and PIJ. What’s more appalling is that beyond these nine, there are others suspected of collusion for whom evidence was deemed &#8220;insufficient&#8221;—an unacceptable bureaucratic euphemism for allowing terrorists to remain on payroll. This proves that the problem runs deeper than a few rogue individuals. The very structure of UNRWA harbors a dangerous loyalty to terrorist agendas, systematically putting Israeli lives at risk.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The UN’s Failure to Act</h3>\n\n\n\n<p>Despite clear evidence, the UN Secretary-General and UNRWA’s Commissioner-General refuse to take the necessary action. Their response is a disgraceful inaction that legitimizes terrorism. By failing to fire these employees, they demonstrate an unforgivable determination to employ operatives of Hamas and PIJ under the guise of humanitarian work. This is no accident. It is an organized effort to shield operatives while funneling millions in international aid that props up terror under a humanitarian facade.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Taxpayer Money Funding Terror</h3>\n\n\n\n<p>How long will the world’s democratic nations allow their hard-earned tax dollars to finance an organization that educates children in hate and violence? How much longer will donor countries tolerate their money being used to reinforce terror against Israeli civilians? UNRWA’s educational material has long been notorious for inciting violence, glorifying martyrdom, and preparing young minds to pursue the same bloody path as Hamas. This latest evidence only solidifies what Israel and those vigilant to its plight have known for years: UNRWA operates as an ideological and operational partner of terrorist factions in Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Enough Is Enough</h3>\n\n\n\n<p>It is time for an unequivocal global response. Donor countries must cut off funding to UNRWA immediately until every staff member tied to Hamas and PIJ is removed and robust, independent oversight mechanisms are put in place. Israel’s right to defend itself against this multi-pronged, existential threat must be recognized and supported unconditionally. The evidence is irrefutable—this is not an organization striving for peace and stability but one entrenched in perpetuating the cycle of violence against Israelis.</p>\n\n\n\n<p>UNRWA’s claim of neutrality is shattered. The agency, directed by Philippe Lazzarini, operates with a singular purpose: to perpetuate the refugee status of Palestinians while embedding hatred and violence into future generations. It stands as a de facto wing of Hamas, coordinating seamlessly within Gaza. If donor nations and the international community continue to support this malignant arm of terror, they are complicit in the slaughter of innocents and the systematic indoctrination of young minds.</p>\n\n\n\n<p><strong>The truth is out. The stakes are clear. The question is: Will the world act or stand by, once again blinded by the pretense of humanitarian aid?</strong></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a>’s involvement in terrorism is confirmed, with employees tied to <a  href=\"/hamas\">Hamas</a> and PIJ. Urgent global action against this complicity needed.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18494,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-unrwa",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1342,
        "footnotes": ""
    },
    "categories": [
        1342
    ],
    "tags": [
        1663,
        1340
    ],
    "class_list": [
        "post-18493",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-unrwa",
        "tag-philippe-lazzarini",
        "tag-the-un"
    ],
    "lang": "en",
    "translations": {
        "en": 18493
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18493",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18493"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18493/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18495,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18493/revisions/18495"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18494"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18493"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18493"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18493"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}