{
    "id": 18936,
    "date": "2024-11-03T15:00:00",
    "date_gmt": "2024-11-03T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18936"
    },
    "modified": "2024-11-29T22:02:10",
    "modified_gmt": "2024-11-29T20:02:10",
    "slug": "when-will-iran-try-to-murder-me-again-ashley-waxman-bakshi",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/when-will-iran-try-to-murder-me-again-ashley-waxman-bakshi/",
    "title": {
        "rendered": "When will Iran try to murder me again? | Ashley Waxman Bakshi"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"When will Iran try to murder me again? | Ashley Waxman Bakshi\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/zDfaXbrFv-E?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>When will Iran again try to murder me? That’s what parents and children across Israel have been asking for days. Iran has showered Israel’s people with ballistic missiles twice—back in April and on October 1st. Last week, an Iraq-based Shia group told a Hezbollah-linked newspaper that its organization was coordinating with Iran to attack Israel. Yesterday, Iran’s supreme leader, Ayatollah Khamenei, said Iran’s enemies, including Israel and the US, will “definitely receive a teeth-breaking response.” Today, Arab media are reporting that Iranian forces are positioned to strike Israel.</p>\n\n\n\n<p>Can you imagine? How many ballistic missile attacks have you survived? Those of you who haven’t faced them may not realize why ballistic missiles are such a big deal. Israel has, after all, already been under rocket attack for 20 years, right? But ballistic missiles are a whole other story. They not only have massive explosive warheads, unleashing immense destruction, but they also fly into space before crashing down onto homes. All this happens in around eight minutes, making it extremely difficult to intercept them—especially when hundreds are fired at once.</p>\n\n\n\n<p>Israel is currently in a grim competition with Ukraine over which country has been attacked by more ballistic missiles. At this rate, Israel is probably “winning,” in addition to facing over 20,000 Iranian rockets, missiles, and drones fired by:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Hezbollah from Lebanon.</li>\n\n\n\n<li>Iran’s terror proxies, the Houthis in Yemen.</li>\n\n\n\n<li>Shia groups in Syria and Iraq.</li>\n\n\n\n<li>Hamas during the October 7th massacre from Gaza.</li>\n</ul>\n\n\n\n<p>Israel’s people are fighting for survival on seven fronts. The US has moved bombers, fighter jets, and ships into the region, preparing for Iran’s potential attack on either its troops or Israel. The US has also warned Iran not to attack American forces.</p>\n\n\n\n<h3 class=\"wp-block-heading has-text-align-center has-zeever-secondary-color has-text-color has-link-color wp-elements-aa5efa89f5321530111cbf91dd1de04b\">If missiles were aimed at your home, what would you expect your country to do to protect you?</h3>\n\n\n\n<h4 class=\"wp-block-heading\">The Geopolitical Picture</h4>\n\n\n\n<p>You have to understand the geopolitics of the region. Russia and Iran are working together to target Ukraine, Israel, and America. This cooperation forms part of the bigger picture of what is happening in the region and how it could affect everyone globally if the region is not stabilized.</p>\n\n\n\n<p>Israel has taken significant action:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Targeting Hezbollah commanders.</li>\n\n\n\n<li>Demolishing terror tunnels.</li>\n\n\n\n<li>Destroying tons of weapons aimed at Israel.</li>\n</ul>\n\n\n\n<p>Last week, Israel’s jets bombed Hezbollah’s Radwan death squads and weapons warehouses in Syria. This is significant because many Hezbollah terrorists who fled southern Lebanon have relocated to Syria. While Hezbollah’s retreat is positive, Israel wants to ensure that the group does not recover, rearm, and attack again in the near future. For decades, Hezbollah’s weapons pipeline has run through Syria, facilitated by the Assad dictatorship, and is only hours away from southern Lebanon.</p>\n\n\n\n<p>Even UN Security Council Resolution 1701 called for Lebanon to secure its borders and prevent arms smuggling, with UNIFIL assistance. However, UNIFIL failed to stop Hezbollah from:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Bringing weapons to Israel’s border.</li>\n\n\n\n<li>Importing Iranian arms from Syria into Lebanon.</li>\n</ol>\n\n\n\n<p>Former UN Secretary-General Kofi Annan even stated at the time that UNIFIL didn’t have to act because Lebanon hadn’t asked them to. Whatever happens next, it’s not enough for Hezbollah to leave Israel’s border today if they can return tomorrow. It’s not enough for them to disarm today if they can rearm tomorrow. A sustainable peace must ensure the safety of 60,000 Israelis returning to northern homes without facing Hezbollah’s Iranian fire again.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Audience Q&amp;A</h4>\n\n\n\n<p><strong>Question:</strong> Thank you, Ashley. I just read that Russian planes landed in Iran. Why do you think this is happening?<br><strong>Answer:</strong> Russia supplies Iran with advanced arms, including S-300 air defense systems, which Israel recently took out in an attack. Iran, in turn, supplies Russia with drones used against Ukraine. This highlights the broader geopolitical picture, involving not just Israel but also Russia, the US, and the Gulf States. Stability in the region is crucial for global peace.</p>\n\n\n\n<p><strong>Question:</strong> I saw that Israel’s naval commandos took a Lebanese ship’s captain from his home. Was he a civilian?<br><strong>Answer:</strong> Certainly not. Arabic media reported that the officer, Imad Fadel Amas, is a senior Hezbollah member. According to reports, he is considered a significant source of intelligence for Hezbollah’s naval force. Surveillance footage shows that he was taken into custody unharmed. He is a terrorist, not a civilian.</p>\n\n\n\n<p><strong>Question:</strong> A lot of people are asking about Israel’s security situation. Just yesterday, there were 130 rockets and 10 drones fired at Israel. What is your assessment?<br><strong>Answer:</strong> Life is unbearable. Some areas feel almost normal, but many parts of the country are far from it. Schools remain closed, people are evacuated, and the trauma of October 7th persists. Every day, we face additional trauma, including casualties among soldiers and civilians. While the situation hurts our economy, it does not hurt our morale. We are proud, strong, and ready to defend our country against any attack. We hope for an end to this conflict because Israel did not start this war. Hezbollah initiated it on October 8th, one day after the October 7th massacre.</p>\n\n\n\n<p><strong>Question:</strong> Is the recent threat from Iran serious or a bluff?<br><strong>Answer:</strong> Time will tell, but we cannot underestimate the motivation of our enemies. Iran has proven its seriousness, not just through proxy wars but by attacking Israel directly from its own soil. They’ve made their intentions clear, including countdown clocks in Tehran symbolizing Israel’s destruction. These threats must be taken seriously.</p>\n\n\n\n<p><strong>Question:</strong> You’ve been traveling recently. Where did you go, and who did you meet?<br><strong>Answer:</strong> I was in the United States, taking much-needed time away from social media and the war. I visited Florida, Texas, and Oklahoma. The overwhelming support and prayers from everyday Americans were heartwarming. While online platforms often show protests and anti-Israel sentiments, my travels revealed that most Americans stand with Israel and hope for the hostages’ safe return. This gave me hope and reminded me of the deep bond between our nations.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> says it will ‘break teeth’ of <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s people and US troops. In this Daily Briefing, Citizen Spokeswoman <a  href=\"https://iron-swords.co.il/t/ashley-waxman-bakshi/\">Ashley Waxman Bakshi</a> discusses Iran’s latest threats to murder people in Israel.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18010,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        490
    ],
    "class_list": [
        "post-18936",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ashley-waxman-bakshi"
    ],
    "lang": "en",
    "translations": {
        "en": 18936
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18936",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18936"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18936/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18937,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18936/revisions/18937"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18010"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18936"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18936"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18936"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}