{
    "id": 18852,
    "date": "2024-11-22T19:05:25",
    "date_gmt": "2024-11-22T17:05:25",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18852"
    },
    "modified": "2024-11-22T19:05:31",
    "modified_gmt": "2024-11-22T17:05:31",
    "slug": "why-is-the-icc-targeting-israel",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/un/icc/why-is-the-icc-targeting-israel/",
    "title": {
        "rendered": "Why IS THE ICC Targeting Israel?"
    },
    "content": {
        "rendered": "\n<p>The International Criminal Court (ICC), established to prosecute the world’s gravest crimes, appears to have a very selective sense of outrage. While millions have been killed in conflicts worldwide, the ICC has remained conspicuously silent. But when it comes to Israel, defending itself against a terrorist organization like Hamas, the ICC suddenly springs into action, screaming “genocide” and demanding the arrest of Israeli leaders.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Global Atrocities the ICC Ignores</h3>\n\n\n\n<p>The ICC claims to focus on the gravest crimes of concern to the international community. However, its track record tells a different story. In the face of some of the most devastating conflicts and humanitarian crises of the modern era, the ICC has remained conspicuously inactive. Let’s examine these atrocities in more detail:</p>\n\n\n\n<p><strong>5.5 Million Killed in Congo</strong> <br>The Democratic Republic of Congo (DRC) has endured decades of conflict, fueled by ethnic violence, armed militias, and competition for natural resources. The Second Congo War (1998–2003), often called “Africa’s World War,” claimed millions of lives due to direct violence, starvation, and disease. Despite its scale, the ICC has done little to bring justice to the victims or hold perpetrators accountable. Key figures behind mass killings, forced displacement, and systematic sexual violence still walk free.</p>\n\n\n\n<p><strong>500,000 Killed in Syria</strong> <br>Since 2011, the Syrian Civil War has resulted in one of the worst humanitarian crises of our time. Syrian President Bashar al-Assad has used chemical weapons against civilians, bombed hospitals, and laid siege to entire cities. ISIS, meanwhile, committed genocide against Yazidis, enslaving thousands. Half a million people have been killed, with millions more displaced. Yet the ICC has largely avoided taking meaningful action, despite the overwhelming evidence of war crimes and crimes against humanity.</p>\n\n\n\n<p><strong>500,000 Killed in Sudan</strong><br>Sudan has been the epicenter of numerous atrocities, including the Darfur genocide, where the Janjaweed militia killed, raped, and displaced hundreds of thousands of civilians under the directive of former Sudanese President Omar al-Bashir. The ICC indicted Bashir in 2009, but he has yet to stand trial. Meanwhile, ongoing violence in Sudan continues to claim lives, including the recent conflict between the Sudanese Armed Forces and the Rapid Support Forces (RSF). Despite this, the ICC’s attention has waned, and no new investigations have been launched.</p>\n\n\n\n<p><strong>400,000 Killed in Yemen</strong><br>The war in Yemen, fueled by the Saudi-led coalition and Houthi rebels, has resulted in one of the worst humanitarian crises of the modern era. Bombing campaigns have indiscriminately targeted civilian areas, hospitals, and schools, while blockades have created widespread famine. Children make up a disproportionate share of the victims, with thousands dying from malnutrition and preventable diseases. Yet the ICC remains silent, choosing not to investigate either side for potential war crimes.</p>\n\n\n\n<p><strong>300,000 Killed in Iraq</strong><br>Iraq has faced decades of conflict, from Saddam Hussein’s brutal regime to the U.S.-led invasion, followed by the rise of ISIS. Over 300,000 people have died due to sectarian violence, insurgency, and genocide. ISIS’s actions against Yazidis, Kurds, and other minorities have been classified as genocide, yet key perpetrators remain unpunished. The ICC has not pursued investigations into crimes committed during Iraq’s many conflicts, allowing accountability to remain elusive.</p>\n\n\n\n<p><strong>250,000 Killed in Afghanistan</strong><br>Afghanistan’s decades-long war has killed over 250,000 people, many of them civilians. The Taliban, ISIS, and other groups have committed atrocities, including mass killings, sexual violence, and the use of child soldiers. Despite these ongoing crimes, the ICC’s investigation in Afghanistan has stalled, largely due to political pressures and a lack of will to confront major powers like the United States or its allies involved in the conflict.</p>\n\n\n\n<h3 class=\"wp-block-heading\">ICC’s Disproportionate Focus on Israel</h3>\n\n\n\n<p>While these massive death tolls and heinous crimes go unaddressed, the ICC has turned its attention to Israel, accusing its leaders of “genocide” and “crimes against humanity” in Gaza. The contrast is striking.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>In Congo, entire villages were massacred, yet no major ICC action.</li>\n\n\n\n<li>In Syria, chemical weapons turned neighborhoods into graveyards, and the ICC stood by.</li>\n\n\n\n<li>In Yemen, children starve under blockades, but the ICC says nothing.</li>\n</ul>\n\n\n\n<p>When it comes to Gaza, the ICC bases its claims on casualty figures provided by the <strong>Gaza Ministry of Health, controlled by Hamas.</strong> Hamas openly admits that half of the 40,000 reported deaths in Gaza are its own fighters—yet the ICC treats them all as civilians. Israel, defending itself against a terrorist organization that slaughtered over 1,100 civilians on October 7, faces the ICC’s wrath, while the world’s deadliest conflicts are ignored.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why the Double Standard?</h3>\n\n\n\n<p>Why does the ICC ignore millions of deaths in places like Congo, Syria, and Yemen, while rushing to criminalize Israel? The answer lies in politics, not justice. Israel is held to a standard no other nation faces, not because its actions are uniquely egregious, but because the court is influenced by anti-Israel agendas.</p>\n\n\n\n<p>This double standard is a betrayal of the ICC’s mandate. Its role is to uphold international law impartially, not to target specific nations while ignoring others. The ICC’s disproportionate focus on Israel undermines its credibility and emboldens terrorist organizations like Hamas, who exploit international institutions to further their propaganda</p>\n\n\n\n<p>If the ICC truly cares about justice, it must address the world’s worst atrocities without bias. Millions of victims in Congo, Syria, Yemen, and beyond deserve the court’s attention far more than Hamas’s baseless claims against Israel.</p>\n\n\n\n<p>The ICC’s obsession with Israel reveals its failure to uphold its mission. Justice requires integrity, impartiality, and the courage to confront real crimes—not to pander to political narratives..</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The <a  href=\"https://iron-swords.co.il/c/un/icc/\">ICC</a> ignores millions killed in conflicts like Congo, Syria, and Yemen while disproportionately targeting <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>, basing claims on <a  href=\"/hamas\">Hamas</a>-controlled data. This bias undermines justice and emboldens global perpetrators of atrocities.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18853,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1702,
        "footnotes": ""
    },
    "categories": [
        1702
    ],
    "tags": [],
    "class_list": [
        "post-18852",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-icc"
    ],
    "lang": "en",
    "translations": {
        "en": 18852
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18852",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18852"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18852/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18854,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18852/revisions/18854"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18853"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18852"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18852"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18852"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}