{
    "id": 18726,
    "date": "2024-11-08T17:45:04",
    "date_gmt": "2024-11-08T15:45:04",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18726"
    },
    "modified": "2024-11-08T17:45:12",
    "modified_gmt": "2024-11-08T15:45:12",
    "slug": "youness-ouaali",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/terrorist-sympathizer/youness-ouaali/",
    "title": {
        "rendered": "Youness Ouaali"
    },
    "content": {
        "rendered": "\n<p>Youness Ouaali has demonstrated himself to be an active supporter of terror and a vocal instigator of antisemitic violence. Through his social media platforms, which include Instagram, Twitter, Snapchat, and YouTube, he has openly celebrated and encouraged attacks against Jewish people. His posts reveal a pattern of dangerous rhetoric and a willingness to fan the flames of hatred, showing an alarming disregard for human life and a commitment to antisemitic violence.</p>\n\n\n\n<p>Ouaali’s recent posts show a direct endorsement of the violence against Jewish visitors in Amsterdam, including those there to support Maccabi Tel Aviv. He has proudly tracked flights from Israel, clearly keeping an eye on potential targets and sharing this information publicly. This action alone indicates premeditation and a disturbing desire to identify Jewish targets for harassment or worse. Ouaali’s messages also include menacing language, as he describes these Jewish visitors as “genocide perpetrators,” thus justifying violence against them in his warped narrative.</p>\n\n\n\n<p>In another post, he claimed that hundreds of Arabs were in the streets of Amsterdam, allegedly waiting with knives and fireworks, while local police were slow to respond. He even celebrated the possibility of escalating violence, declaring that if they had been armed, “there would already have been deaths.” This callous admission underlines the seriousness of his intentions — he is not only celebrating violence but pushing for escalation.</p>\n\n\n\n<p>Ouaali has also dehumanized Jewish people, referring to them as “rats” in multiple posts, and calling the attacks a “rat hunt.” This language echoes some of the darkest periods of history, when propaganda was used to dehumanize groups as a precursor to violence. His repeated references to “hunting” Jews and cheering on acts of violence showcase an alarming fixation on harming this community.</p>\n\n\n\n<p>Moreover, Ouaali’s posts provide a play-by-play of his movements and plans, suggesting that he was coordinating with others to instigate this mob violence. He used phrases like “we are on the way, whole group” and shared locations in real-time as he seemingly prepared to converge with others in areas where Jewish people were gathered. This level of organization speaks to his role not only as a participant but as an orchestrator of these events, seeking to inspire others to join him in acts of hate-fueled violence.</p>\n\n\n\n<p>Ouaali’s presence on various social media platforms, where he has thousands of followers, amplifies his toxic message to a wide audience. By openly celebrating violence and encouraging others to join, he is using his platform as a tool to radicalize others and normalize hate. His followers witness and, potentially, join in his antisemitic crusade, making him a highly dangerous figure. In the digital age, this type of extremism can rapidly spread, leading to real-world consequences — as seen in the recent coordinated attacks in Amsterdam.</p>\n\n\n\n<p>The Dutch authorities and social media companies must act swiftly to prevent Ouaali from continuing to use his platform for these extremist purposes. Failing to act on individuals like Youness Ouaali, who incite and celebrate antisemitic violence, sends a dangerous message that these actions are tolerated. It is crucial to take his threats and his active promotion of terrorism seriously to protect innocent people and to uphold the values of a free and safe society.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Youness Ouaali has demonstrated himself to be an active supporter of terror and a vocal instigator of antisemitic violence. Through his social media platforms, which include Instagram, Twitter, Snapchat, and YouTube, he has openly celebrated and encouraged attacks against Jewish people. His posts reveal a pattern of dangerous rhetoric and a willingness to fan the flames of hatred, showing an alarming disregard for human life and a commitment to antisemitic violence. Ouaali’s recent posts show a direct endorsement of the violence against Jewish visitors in Amsterdam, including those there to support Maccabi <a  href=\"https://iron-swords.co.il/t/tel-aviv/\">Tel Aviv</a>. He has proudly tracked flights from</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18727,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-useful-idiots",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1578,
        "footnotes": ""
    },
    "categories": [
        1578
    ],
    "tags": [
        1673
    ],
    "class_list": [
        "post-18726",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-terrorist-sympathizer",
        "tag-amsterdam-pogrom"
    ],
    "lang": "en",
    "translations": {
        "en": 18726
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18726",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18726"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18726/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18728,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18726/revisions/18728"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18727"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18726"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18726"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18726"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}