{
    "id": 17762,
    "date": "2024-09-22T15:00:00",
    "date_gmt": "2024-09-22T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17762"
    },
    "modified": "2024-09-24T09:09:05",
    "modified_gmt": "2024-09-24T06:09:05",
    "slug": "100ks-of-jews-arabs-targeted-by-hezbollah-daily-briefing-with-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/100ks-of-jews-arabs-targeted-by-hezbollah-daily-briefing-with-doron-spielman/",
    "title": {
        "rendered": "100Ks of Jews &#038; Arabs Targeted by Hezbollah | Daily Briefing with Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"100Ks of Jews &amp; Arabs Targeted by Hezbollah | Daily Briefing with Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/GR1b2kMSZpc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a>Today marks day 352 of the October 7th War. Hundreds of thousands of people in Israel endured a sleepless night as families across the North and South hid in bomb shelters. This was due to the relentless attacks from Iran’s terror proxies in Lebanon, Iraq, and other locations. Rockets, missiles, and drones were launched in an attempt to harm and murder innocent civilians.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Impact on Children and Schools</h3>\n\n\n\n<p>Thousands of children were forced to remain in bomb shelters, unable to attend school, as their lives were at risk. Hezbollah, Iran&#8217;s terror army in Lebanon, and Iranian-backed Shia militias in Iraq fired over 150 rockets, drones, and cruise missiles at Israel. Israel&#8217;s air defense intercepted the majority of them, but no defense system is 100% foolproof. Some rockets landed in cities like Haifa and Nazareth, where both Jewish and Arab families live side by side.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah and Iran’s Indifference to Life</h3>\n\n\n\n<p>Iran and Hezbollah show no concern for human life, whether Jewish or Arab. Both have a history of killing Arabs in previous attacks on Israel and have caused the deaths of tens of thousands in wars across Syria and Iraq. Israel, on the other hand, invests in protecting all of its citizens, regardless of ethnicity or religion. This is evident in Israel’s efforts not only to intercept Hezbollah’s rockets but to also destroy their rocket launchers.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel’s Retaliation and Strategic Strikes</h3>\n\n\n\n<p>Israeli jets have struck hundreds of Hezbollah targets in Lebanon, destroying thousands of rockets on the ground before they could be launched. Notably, Israel targeted a meeting of Hezbollah’s Redwan Commando Force, the same terrorists who had planned to invade Israel on October 8th. Their plan involved taking over Israeli villages, murdering families, and abducting hostages. The brutal tactics of Hezbollah mirror those of Hamas, as both are directed by Iran.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran’s Global Ambitions</h3>\n\n\n\n<p>Iran’s vision is clear: it seeks to dominate the Middle East and extend its influence globally. The barbaric tactics employed by Hezbollah and Hamas are part of Iran&#8217;s larger strategy to achieve this goal. Israel&#8217;s success in weakening Hezbollah’s capabilities, especially by degrading their command and control systems, has prevented future massacres akin to the one on October 7th.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah’s Daily Assault on Israel</h3>\n\n\n\n<p>Since October 8th, Hezbollah has declared war on the Israeli people, launching over 8,000 rockets, missiles, and drones. Iran is waging this war on seven different fronts. Hezbollah is currently aiming 200,000 rockets and precision-guided missiles at Israel, explicitly targeting civilians. Despite Hezbollah’s relentless rocket attacks, Israel continues to thwart their attempts at mass murder.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel’s Commitment to Defend Its Citizens</h3>\n\n\n\n<p>Israel remains committed to defending its citizens. Hezbollah’s actions have displaced nearly 100,000 Israelis from their homes in the north, and Israel is determined to ensure that these families can return home safely. The Israeli Defense Forces (IDF) have carried out critical aerial strikes against Hezbollah, eliminating key leaders and destroying infrastructure.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Question: Why are rockets being shot from Iraq towards Israel? What does Iraq have to do with the conflict?</strong></h3>\n\n\n\n<p>As part of Iran&#8217;s strategy to take over the entire Middle East and turn it into one single Iranian caliphate, they have proxies operating in numerous places throughout the Middle East. With the United States&#8217; withdrawal from Iraq, Iran immediately saw an opportunity and sent in proxy forces. These forces pose a major threat not only to Iraq itself but also to the region. These armed militias have already fired precision-guided missiles and cruise missiles not only at Israel but at dozens of U.S. military bases throughout the Middle East. Iran has one goal: to spread their version of Islam, take over the Middle East, and extend that influence globally. If they are not stopped, they will continue to grow and pose an even larger threat.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Question: Can you comment on the reports of celebrations in Syria and Lebanon about the attacks on Hezbollah?</strong></h3>\n\n\n\n<p>From what we saw in various places, especially with the Kurds, when there were attacks on certain Hezbollah commanders, we saw celebrations. People were offering cakes and pastries—this is a sign of celebration in the Muslim world and the Middle East. We need to understand why. Hezbollah is a terror army. Like the mob, Hezbollah isn&#8217;t just a threat to certain people; it&#8217;s a threat to everyone. Hezbollah is a terror regime that has essentially taken the people of Lebanon hostage. They’ve carried out wars on Syrian and Lebanese soil, making them a threat to the entire Middle East. When Israel targeted Hezbollah leadership, people who oppose Hezbollah celebrated. If those people received the resources and support they needed, they would break free from Iran’s control in a minute.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Question: When will IDF forces cross into Lebanon to push Hezbollah back?</strong></h3>\n\n\n\n<p>First of all, the IDF has carried out some of the most important aerial strikes in the history of modern warfare, targeting Hezbollah&#8217;s top command structures. Israel has managed to eliminate many of Hezbollah&#8217;s leaders. If you look at Nasrallah, who stands at the top of Hezbollah&#8217;s terror structure, many of the people underneath him have been eliminated through targeted strikes that relied not only on intelligence but also on incredible planning.</p>\n\n\n\n<p>When the story is told in future generations, it will show how Israel strove to avoid civilian casualties. This will go down in modern warfare as one of the most significant efforts to pinpoint terrorists while protecting civilians around them. As for an Israeli ground operation, Israel is leaving all options on the table. If those displaced from their homes in the north can&#8217;t return safely, Israel will do what it needs to ensure its citizens can sleep soundly.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Question: What is the present condition of the ceasefire in Gaza?</strong></h3>\n\n\n\n<p>Wall Street Journal is reporting that a ceasefire is unlikely this year. Is that true?</p>\n\n\n\n<p>Israel has said from the start that the war in Gaza could end immediately if Hamas surrenders, returns all Israeli hostages, and agrees to no longer rule the Gaza Strip or pose a threat to Israel. Hamas, however, has responded by saying they will rebuild and carry out another October 7th attack. Hamas diverts resources like food and money to its terror infrastructure, leaving the people of Gaza with nothing. Israel wants a ceasefire, but it has conditions: control over the Philadelphia Corridor between Gaza and Egypt to prevent Hamas from rebuilding its weapons supplies. Hamas has refused all these deals, showing that they are committed to destruction.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Question: What was the impact of the last UN vote on IDF strategy?</strong></h3>\n\n\n\n<p>The IDF&#8217;s primary strategy is to protect the people of Israel. The right to defend our citizens is a basic human right that every nation has. The United Nations took almost 10 months to acknowledge the atrocities of October 7th, including the rape of Israeli women. This has caused the Israeli people to lose confidence in international institutions. Certain UN members have called for the arrest of Israelis while ignoring Hamas’s terrorism. Alongside our allies in the U.S. and elsewhere, Israel remains steadfast in its right to defend itself from attacks.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Question: How can we stand up to lies like how Alon Levy stood up to Medhi Hasan in their debate?</strong></h3>\n\n\n\n<p>Alon Levy gave one of the most impressive debate performances against Mehdi Hasan, who seems to act as a mouthpiece for Hamas. Alon presented compelling facts, while Mehdi relied on anecdotes and dodged questions. In the coming days, short excerpts of the debate with analysis will be released, showcasing how Alon stayed rooted in facts and exposed Mehdi’s evasions. This is an example of how standing up to misinformation with facts can effectively counter false narratives.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion of the Live Broadcast</h3>\n\n\n\n<p>This is the live broadcast of the Israeli Citizens Office. We are here every day, Sunday through Friday, from 8:00 AM Eastern Standard Time, 3:00 PM Israel time. We will continue to take your questions and provide the latest news, so you can know and speak the truth. Thank you for joining.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> continues to defend its citizens on multiple fronts in the ongoing October 7th War. With relentless rocket and missile attacks from <a  href=\"/hezbollah\">Hezbollah</a> and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>-backed militias, Israel strikes strategic terror targets while intercepting thousands of rockets. Despite global challenges, Israel remains committed to safeguarding its people and countering terrorism.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1304,
        1586
    ],
    "class_list": [
        "post-17762",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-doron-spielman",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 17762
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17762",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17762"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17762/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17767,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17762/revisions/17767"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17762"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17762"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17762"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}