{
    "id": 17591,
    "date": "2024-09-11T15:00:00",
    "date_gmt": "2024-09-11T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17591"
    },
    "modified": "2024-09-17T00:42:41",
    "modified_gmt": "2024-09-16T21:42:41",
    "slug": "9-11-and-10-7-jihadist-attacks-on-innocents-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/he/israeli-citizen-spokesperson/9-11-and-10-7-jihadist-attacks-on-innocents-doron-spielman/",
    "title": {
        "rendered": "9/11 and 10/7: Jihadist attacks on innocents | Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"9/11 and 10/7: Jihadist attacks on innocents | Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/o3MAba51wUw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a>Today is day 341 of the October 7th War. Today is also September 11th—23 years ago as Al-Qaeda terrorists hijacked four airplanes and flew them into the Twin Towers, the Pentagon, and a field in Pennsylvania. 2,977 Americans were murdered on that day. 9/11 was the worst terror attack in American history. We all remember where we were on that day; we remember who mourned, and we remember who celebrated.</p>\n\n\n\n<p>The October 7th Massacre was Israel&#8217;s 9/11. It was the worst terror attack in Israel&#8217;s history—over 1,200 people were murdered. Both 9/11 and 10/7 were acts of mass murder carried out by jihadist groups. The US and Israel share the exact same enemies. They marched and handed out sweets in Gaza on 9/11; they marched and burned US and Israeli flags in New York on 10/7. If we want to defeat them, we must stand together.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Impact on a Small Nation</h2>\n\n\n\n<p>Most people have no idea how small, in fact, Israel is. Israel&#8217;s population is 3% of the United States. On October 7th, over 1,200 people in Israel were murdered—that&#8217;s equivalent to 13 9/11s. There&#8217;s probably no one in Israel that does not know someone personally or know a close relative or family member of someone who was killed or taken hostage.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Similarities Between Al-Qaeda and Hamas</h2>\n\n\n\n<p>Just after the Hamas massacre in October, Al-Qaeda and Islamic State called on their followers to strike not only Israel but Israeli, US, and Jewish targets. Al-Qaeda terror affiliates congratulated Hamas on its invasion of Israel.</p>\n\n\n\n<p>There are many similarities between Al-Qaeda and Hamas. According to the FBI, Osama bin Laden founded Al-Qaeda in order to continue the cause of jihad (holy war) through violence and aggression. Hamas similarly says jihad is its path and death for the sake of Allah is the least of wishes. On 9/11, Al-Qaeda attacked defenseless men, women, and children. On October 7th, Hamas attacked defenseless men, women, and children.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Defending Freedom and Democracy</h2>\n\n\n\n<p>9/11 and October 7th have some differences, but both are examples of jihadist terrorists slaughtering the defenseless. The US and Israel both stand for freedom. The US and Israel both elect their leaders democratically. The US and Israel both champion freedom of speech and freedom of religion. Those are the values that Al-Qaeda and Hamas and its Iranian overlords seek to destroy. We are fighting for our way of life, and we have no choice but to win this war.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Violations of the Laws of War</h2>\n\n\n\n<p>The laws of war aim to keep the fighting away from civilians—away from schools, hospitals, and humanitarian zones, which are supposed to be protected places. If terrorists cynically fight from protected zones, they don&#8217;t get immunity; rather, it removes the protection from the protected zones and endangers civilians directly.</p>\n\n\n\n<p>Israel identified yesterday and took out three of the most senior Hamas commanders. The commanders were operating from outside of the humanitarian zone. Did the international leaders condemn Hamas for violating the laws of war, for putting Gazan civilians at risk by operating out of a protected facility? Well, let&#8217;s check.</p>\n\n\n\n<h2 class=\"wp-block-heading\">International Leaders&#8217; Responses</h2>\n\n\n\n<p>UN Secretary-General Antonio Guterres condemned Israel, but guess what? He didn&#8217;t mention Hamas. EU Foreign Minister Josep Borrell condemned Israel but didn&#8217;t mention Hamas. Ironically, most of them called to uphold the laws of war—the very laws that Hamas broke and Israel upholds. But Hamas knows those leaders will always ignore their violations, their war crimes, and instead always accuse Israel.</p>\n\n\n\n<p>Those leaders encourage Hamas&#8217;s strategy to hide behind human civilian shields. Those leaders are saying to Hamas: keep trying to murder Israel&#8217;s children from behind Gaza&#8217;s children—it works. Hamas is achieving world sympathy with the lies of these international agencies simply by using civilians to cover their terrorist way. If a Gazan child dies, Hamas says violations; if an Israeli child dies, Hamas says that we&#8217;re starving in Gaza.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Addressing the Humanitarian Crisis</h2>\n\n\n\n<p>Hamas is the culprit—the address for every single thing that has gone wrong since October 7th is Hamas and its Iranian overlord. The UN is once again repeating the starving Gazans lie. The UN Special Rapporteur on the Right to Food issued another dishonest report. Incredibly, the UN report does not mention that 50,000 aid trucks entered Gaza from Israel. Thousands of trucks were not collected by the UN from inside of Gaza.</p>\n\n\n\n<p>Gazans today get more food now than before Hamas&#8217;s October 7th massacre. In fact, Gazans actually receive more calories per capita—over 3,000 per day—than Norway, Switzerland, or the United Kingdom. The UN lied again and made claims that Gazans, of which there are 2 million, were 80% of the people in the world experiencing famine or catastrophic hunger.</p>\n\n\n\n<p>But the UN report contradicts the UN itself, where three paragraphs down it admits that there are 25 million people being starved from the conflict in Sudan alone, while 282 million suffer from food insecurity globally. Israel is flooding Gaza with food while fighting the war Hamas declared on it. The UN is promoting Hamas propaganda.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Necessity of Defeating Hamas</h2>\n\n\n\n<p>Israel is breaking Hamas on the battlefield, so Hamas wants the world, including the UN, to press Israel to let it survive. And we all know what that means. Hamas has stated again and again and again its goal is to carry out another October 7th attack. And make no mistake: letting Hamas survive in Gaza is condemning the next group of innocent men, women, and children to the next October 7th attack—God forbid.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Audience Questions</h2>\n\n\n\n<p>We are now ready to take questions from our audience who&#8217;s watching live on social media.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on the Helicopter Crash</h3>\n\n\n\n<p><strong>Question:</strong> This is a question from our Instagram Live. Someone is asking about the news of the helicopter crash this morning in Gaza, which killed two Israeli soldiers. Do you have any information on this incident itself and the kinds of missions that the Israeli soldiers are currently involved in inside Gaza as we speak?</p>\n\n\n\n<p><strong>Answer:</strong> The helicopter accident that happened this morning left apparently two soldiers killed as a tragic result of that crash. It was an evac attempt to try to evacuate certain injured troops from inside of Gaza. There was apparently a technical failure that happened, and that is what caused the helicopter to crash. It&#8217;s being investigated, and I imagine that we will have more information in the coming hours.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Details on the Tunnel Where Hostages Were Murdered</h3>\n\n\n\n<p><strong>Question:</strong> This is a question from Ed Bar on our YouTube Live. The IDF spokesperson Daniel Hagari exposed the tunnel in which six hostages were murdered two weeks ago. Can you please give more details about this in the context in which this was found and what this tunnel shows the people of Israel and the whole world?</p>\n\n\n\n<p><strong>Answer:</strong> The most barbaric, cruel conditions imaginable is what one sees inside that tunnel. Can you imagine hunching over for weeks at a time in a tunnel that is no more than three feet high, on ground surrounded by cement and steel, with Hamas attackers standing over you? We found their bottles with a little bit of juice in them, their clothes that were torn, full of blood. We found the spots on the ground where you can see the outline of their bodies because of the blood that came out of them when they were executed by Hamas.</p>\n\n\n\n<p>They were underfed, undernourished, and there&#8217;s almost no air inside these tunnels. If there was ever a human rights violation, if there was ever a time for the Red Cross, for the United Nations, for the EU, for anyone who cares about humanity to stand up and yell—all you have to do is look at the video that was released of the place these six hostages were held. This is inhumane, and this gives us an insight—as if we need any—onto Hamas. They have not changed; their ideology is to destroy Israel and kill innocent civilians.</p>\n\n\n\n<p>We&#8217;ve seen it with the more than 1,000 civilians who were killed between 2000 and 2003. We&#8217;ve seen it in the tens of thousands of rockets that Hamas shot at Israel over the last 20 years, even after Israel pulled out of Gaza. We saw it on October 7th when 1,000 people were massacred, and we saw it last week where these six innocent, beautiful human beings were killed and executed, and the lives of their families were shattered. That is what we see when we look at this tunnel in Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Global Attention and Sudan</h3>\n\n\n\n<p><strong>Question:</strong> This is a question from our Instagram. Why do you think there are many people who are vocal about the Israel-Hamas war while in Sudan the situation is catastrophic and people are silent?</p>\n\n\n\n<p><strong>Answer:</strong> I think it&#8217;s an excellent, excellent point. In Sudan, there are estimates that over half a million, maybe even a million people have died in that conflict, and the world is not crying out and calling out the terrorist regimes and the Sudanese regimes that are carrying out that attack. It&#8217;s simply pathetic.</p>\n\n\n\n<p>The obsessive focus on Israel and on the war with Hamas in Gaza is because Hamas has been so effective by understanding how they would survive. Hamas wrote a script before this entire war began. They knew before they came into Israel to slaughter civilians that Israel would respond—any nation of the world would respond. And so they asked themselves, what is the only lifeline that they could have? It is if world opinion turns amazingly against Israel and puts so much pressure on Israel to let Hamas survive.</p>\n\n\n\n<p>And that is how Hamas has been manipulating the world from day one. They are the greatest scammers and deceivers possibly in the history of the world—it is on the level of the Nazi regime. And that is why they have drawn world attention to Gaza. They are so willing to sacrifice their own civilians so that a camera will roll. Just when we took out the three Hamas militant commanders yesterday, Hamas immediately released accounts that dozens and dozens—40, 50, 60, 100 people—were killed. Only a few hours later did they lower those numbers to 20 when they felt that people were actually going to start checking.</p>\n\n\n\n<p>Hamas is manipulating the world, drawing attention to them, and using world opinion to try to stop Israel from defeating them. And this is the mask that we need to pull off of them. And we need to focus on real humanitarian crises like what is happening in Sudan. I&#8217;m glad that you brought up that question. Thank you.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Egypt&#8217;s Position on the Conflict</h3>\n\n\n\n<p><strong>Question:</strong> There&#8217;s a report in The Times of Israel from about 20 minutes ago quoting the president of Egypt, Sisi, who said that hunger is being used as a weapon against Palestinians. What do you make of this comment and Egypt&#8217;s position in Israel&#8217;s war against Hamas in general?</p>\n\n\n\n<p><strong>Answer:</strong> Egypt is correct about the facts but blaming the wrong person—the wrong country. Hunger is being used as a weapon against civilians in Gaza by Hamas. Let&#8217;s not forget that Hamas have had ample amounts of food and supplies from before October 7th. All those supply trucks—your international aid money, your taxes that pay to send international aid into Gaza—it didn&#8217;t go to the Gazan civilians, a mere few percent. The masses of it went not only for weapons and cement and for guns; it went towards the food that Hamas was storing inside its tunnels, waiting for there to be a hunger crisis amongst the civilians of Gaza so that, again, the world would put pressure on Israel.</p>\n\n\n\n<p>This is all part of the Hamas scam. We have to see through it—not only so that we understand that Israel is correct in defending itself and trying to destroy Hamas, but for those innocent Gazan people whose lives have been controlled and manipulated over the last 17 years by Hamas.</p>\n\n\n\n<p>Egypt, by the way, is not really a country I think that we can look at as having an objective role in what is happening in Gaza. Egypt was profiting tens of millions of dollars by smuggling food and weapons, trucks and cars into Gaza, and by extorting Gazan people—$5,000, $10,000, $15,000 per person—just to leave Gaza to go into Egypt in order to be able to leave. 250,000 Gazan people left to Egypt. The reports are that at least one quarter of the Gazan people would like to leave, but Egypt is closing that door—not only because they don&#8217;t want Gazans in Sinai, but because right now their smuggling routes have been detected and destroyed by Israel.</p>\n\n\n\n<p>They&#8217;re only going to allow people out if they&#8217;re going to get rich, and this goes all the way to the top of the Egyptian regime. Egypt is the last one that should be weighing in and making any moral comments on Israel; they should look at themselves in the mirror first.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s 9/11 Memorial and Shared Remembrance</h3>\n\n\n\n<p><strong>Question:</strong> Our last question today is from Instagram Stories. Someone is noting that Israel is the only country in the world that has a 9/11 memorial with all the names of the victims. Can you say a few more words about how Israelis remember the 9/11 attacks, how they relate to it, and how they were affected by it?</p>\n\n\n\n<p><strong>Answer:</strong> Israel looks at the United States as a fellow brother, a fellow sister. When 9/11 happened, Israelis&#8217; hearts broke. We understand that the United States is a beacon of freedom and justice in the world and has a very important role. Also, Israel sees itself as having a very important role as the only democracy and beacon of freedom in the Middle East.</p>\n\n\n\n<p>The relationship between Israel and the United States is so close that Israelis felt it was critical to memorialize the innocent Americans that were killed as a result of that terror. Unfortunately, over the last 340-plus days, we have experienced our own attack, and we understand and look at the United States, which is the one country in the world—or maybe a few others—but the main country in the world that has consistently stood by Israel&#8217;s side. We share values; we share an alliance together, and we all value life as opposed to our enemies who value death.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Closing Remarks</h2>\n\n\n\n<p>Thank you for tuning in today to the Israel Spokesperson Citizens Office. We look forward to you joining us again tomorrow. We are on every day at 3 p.m. Israel time, 8:00 a.m. Eastern Standard Time. Send in your questions, tune in, and be sure to like and follow us so that more people can see the important content that we are putting out. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Parallels between 9/11 and <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s <a  href=\"https://iron-swords.co.il/c/october-7th/\">October 7th massacre</a> highlight shared jihadist threats from <a  href=\"/hamas\">Hamas</a> and Al-Qaeda. Critiques international leaders for not condemning <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>&#8216;s violations, underscores Hamas&#8217;s manipulation of global opinion, and emphasizes the imperative of defeating Hamas to prevent future attacks and protect freedom and democracy.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        367
    ],
    "tags": [
        1576
    ],
    "class_list": [
        "post-17591",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-doron-spielman"
    ],
    "lang": "he",
    "translations": {
        "he": 17591
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17591",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17591"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17591/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17592,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17591/revisions/17592"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17591"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17591"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17591"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}