{
    "id": 16538,
    "date": "2024-09-02T15:00:00",
    "date_gmt": "2024-09-02T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=16538"
    },
    "modified": "2024-09-03T00:51:02",
    "modified_gmt": "2024-09-02T21:51:02",
    "slug": "calls-for-hamas-to-free-hostages-need-an-or-else-with-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/calls-for-hamas-to-free-hostages-need-an-or-else-with-daniel-rubenstein/",
    "title": {
        "rendered": "Calls For Hamas to Free Hostages Need An “Or Else” | with Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Calls For Hamas to Free Hostages Need An “Or Else” | with Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/iMTWeEl76B4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is day 332 of the October 7th War. The people of Israel continue to mourn the six hostages that Hamas executed a few days ago. The six murdered hostages were shot multiple times from close range, execution-style. This tragic event serves as another reminder that Hamas is an enemy of humanity—a barbaric terrorist organization with no regard for human life.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Diplomatic Activity and World Leaders&#8217; Responses</h3>\n\n\n\n<p>We are now in a period of intense diplomatic activity that could determine the course of the October 7th War. Many world leaders issued statements after news broke that Hamas executed six hostages. Here are three examples:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>U.S. Secretary of Defense Lloyd Austin</strong>: &#8220;Hamas will be held accountable, and we must swiftly conclude a deal to secure the release of the remaining hostages.&#8221;</li>\n\n\n\n<li><strong>Canadian Prime Minister Justin Trudeau</strong>: &#8220;Hamas must release all hostages, lay down its arms, and have no future in the governance of Gaza. Leaders must reach a deal to bring the rest of the hostages home and end the violence.&#8221;</li>\n\n\n\n<li><strong>U.K. Foreign Minister David Lamy</strong>: &#8220;Hamas must release all the hostages immediately, and all sides must accept the deal on the table to end this war.&#8221;</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">The Contradiction in Global Responses</h3>\n\n\n\n<p>There is a common theme in these statements: the demand for Hamas to release the hostages, the assertion that Hamas must be held accountable, and the call to reach a deal. However, there is a contradiction. If Hamas is to be held accountable, how can a deal be reached that allows Hamas to avoid accountability? This contradiction is why the war that Hamas started on October 7th continues.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Need for Consequences</h3>\n\n\n\n<p>World leaders are saying that Hamas must release the hostages, but none are stating what the consequences will be if Hamas does not. The word &#8220;must&#8221; needs to be followed by an &#8220;or else,&#8221; or it is meaningless. The U.S. and its allies should apply maximum pressure to Hamas&#8217; supporters—Qatar, Turkey, Iran, and others—so that they, in turn, pressure Hamas to release the hostages. Right now, Hamas is not afraid of its global standing. Hamas leaders are living comfortably in luxury villas in Qatar, down the street from a major U.S. Airbase. Hamas is welcome in Turkey, a NATO member, where Hamas leader Khaled Meshaal recently called for more suicide bombings. Hamas has an interesting relationship with Egypt, a major recipient of U.S. military aid, and a huge supporter of Hamas is Iran. Iran has enjoyed massive U.S. sanctions relief while backing Hamas and other groups threatening Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Pressure Hamas&#8217; Supporters</h3>\n\n\n\n<p>Tell your leaders to pressure Hamas&#8217; partners to pressure Hamas. It should not be possible for a country to be a NATO ally and also support Hamas. World leaders must be clear: Hamas must release the hostages now and must not be allowed to rearm and take more hostages in the future.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section</h3>\n\n\n\n<p><strong>Question:</strong> <em>Are we still going to negotiate with Hamas knowing full well that it will never work?</em></p>\n\n\n\n<p><strong>Answer:</strong> Israel remains open to finding ways to achieve the aims of the October 7th War that Hamas started. The objectives are clear: destroying Hamas&#8217; military and government capabilities in Gaza, safely returning all hostages, and ensuring that Hamas can never carry out another massacre like October 7th. Israel is pursuing both military and diplomatic tracks to achieve these goals. Negotiations are ongoing, with Israel sending negotiators to Cairo, Doha, and Qatar. However, Israel does not trust Hamas, and there has been little progress. Ultimately, more pressure is needed on Hamas&#8217; backers to achieve these objectives.</p>\n\n\n\n<p><strong>Question:</strong> <em>Why do you and other pro-Israel channels use the term &#8220;executed&#8221;? It lends Hamas&#8217; actions legitimacy. Why don&#8217;t you call it murder?</em></p>\n\n\n\n<p><strong>Answer:</strong> Hamas certainly murdered the hostages, just as it murdered 1,200 people on October 7th. The word &#8220;execute&#8221; is used because of the manner in which the murders took place—close-range, execution-style shootings. This term highlights the barbaric nature of Hamas&#8217; actions, which go beyond everyday murder to something even more heinous.</p>\n\n\n\n<p><strong>Question:</strong> <em>Are hostage body recovery operations rescue operations or recovery? What should we call them?</em></p>\n\n\n\n<p><strong>Answer:</strong> The term &#8220;rescue&#8221; typically implies saving someone who is still alive. Unfortunately, for many hostages, it is too late to save them. The operations to retrieve the bodies are more accurately described as &#8220;recovery&#8221; or &#8220;retrieval&#8221; operations. However, the important thing is that we are bringing them home, whether dead or alive.</p>\n\n\n\n<p><strong>Question:</strong> <em>Why hasn&#8217;t Israel finished all operations in Gaza until now and freed all the hostages?</em></p>\n\n\n\n<p><strong>Answer:</strong> Israel is facing an enemy that prepared for this war for years. Hamas has built an extensive underground tunnel network in Gaza, allowing its fighters to move undetected and store weapons. The urban warfare against Hamas is slow and methodical but ongoing. Israel adheres to the Geneva Conventions, distinguishing between combatants and non-combatants, which slows the progress of the war. Additionally, Israel is working to avoid endangering the hostages. The complexity of this war means it will take time to achieve all of Israel&#8217;s objectives.</p>\n\n\n\n<p><strong>Question:</strong> <em>Should we submit and leave the Philadelphia Corridor?</em></p>\n\n\n\n<p><strong>Answer:</strong> This is a hotly debated issue within Israel. On the one hand, maintaining control of the Philadelphia Corridor is essential to prevent Hamas from rearming. On the other hand, some voices suggest that leaving the corridor might facilitate a hostage release agreement. The decision is complex and involves considering multiple factors, including military and diplomatic strategies.</p>\n\n\n\n<p><strong>Question:</strong> <em>How could Israel allow this complex underground terror network to be built?</em></p>\n\n\n\n<p><strong>Answer:</strong> This is a question many Israelis are asking, and it will eventually be answered through an official Commission of Inquiry, much like the 9/11 Commission in the United States. For now, the focus must remain on the ongoing war and the future, as Hamas continues to pose a significant threat.</p>\n\n\n\n<p>Thank you all for watching. We are live every day, Sunday to Thursday, at 3 PM Israel time (8 AM Eastern). Please follow my personal accounts on Twitter (@PaulRubns) and Instagram (@RubyGuidesIsrael) for more updates. Stay safe, and have a wonderful day.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On day 332 of the October 7th War, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> mourns six <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a> executed by <a  href=\"/hamas\">Hamas</a>. Diplomatic efforts face challenges as world leaders demand both accountability and negotiations. Israel remains committed to destroying <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>, ensuring the safety of its citizens, and navigating complex military and diplomatic strategies to end the conflict.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312
    ],
    "class_list": [
        "post-16538",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "en",
    "translations": {
        "en": 16538
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16538",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=16538"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16538/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16539,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16538/revisions/16539"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=16538"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=16538"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=16538"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}