{
    "id": 17589,
    "date": "2024-09-05T15:00:00",
    "date_gmt": "2024-09-05T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17589"
    },
    "modified": "2024-09-16T22:28:48",
    "modified_gmt": "2024-09-16T19:28:48",
    "slug": "hamas-plan-to-make-israelis-lose-hope-with-doron-spielman-2",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-plan-to-make-israelis-lose-hope-with-doron-spielman-2/",
    "title": {
        "rendered": "Hamas’ Plan to Make Israelis Lose Hope | with Doron Spielman"
    },
    "content": {
        "rendered": "\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a>Today is day 334 of the October 7th war. In recent days, Hamas has intensified its efforts to terrorize the people of Israel psychologically. This is something that Hamas has been doing throughout the war, but its efforts have reached new heights in recent days with the execution of six Israeli hostages.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hamas Intensifies Psychological Warfare</h2>\n\n\n\n<p>Hamas is losing on the battlefield. We have to understand this: they are losing on the battlefield. Israeli forces are breaking Hamas. We have nearly dismantled every Hamas terror battalion. Hamas cannot fight as an organized army like it did on October 7th when it invaded Israel and massacred 1,200 people. Hamas knows that its only chance at achieving tactical victories is by winning not in the physical war but on the psychological front.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Execution of Hostages and Psychological Tactics</h3>\n\n\n\n<p>That&#8217;s why, after executing in cold blood six hostages, Hamas released videos of the hostages&#8217; final messages. The editing, the graphics, and the Hebrew language text are aimed at us, the people of Israel. Hamas is trying to cause psychological pain to the people of Israel. The Hamas video ends with the words &#8220;Time is running out.&#8221; Hamas has again and again published the most twisted and evil videos: hostages pleading for their lives, hostages looking abused, hostages after being executed in cold blood. It is psychological warfare, and in psychological warfare, the attacker tries to get the victim to lose his or her will to fight. That is what Hamas is doing against the people of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF Uncovers Hamas Psychological Warfare Guide</h3>\n\n\n\n<p>We know that this is what Hamas is doing because our military, the IDF, recently uncovered a Hamas psychological warfare guide inside a tunnel in Gaza. It was written by a senior leader of Hamas, quite likely Sinwar himself. In the guide, Hamas says it should increase distribution of hostage photos and videos to increase psychological pressure, target specific Israeli leaders for pressure, and damage the narrative that says Israel&#8217;s ground operations will help free the hostages.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Pressure on Hamas and Its Enablers</h3>\n\n\n\n<p>Hamas knows it is losing the war on the ground, but Hamas is trying to get people to believe that Israel cannot win the war. Hamas wants to end this war on its feet, still holding Israeli hostages in its terror dungeons. Hamas must be pressured to release the hostages immediately. We have to pressure Hamas and their enablers; this includes Qatar, Turkey, and Iran, so that they will pressure Hamas to release the hostages.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israel&#8217;s Humanitarian Efforts in Gaza Recognized by WHO</h2>\n\n\n\n<p>On a different note, here&#8217;s something you don&#8217;t see every day. Finally, the World Health Organization acknowledges that the campaign to vaccinate 600,000 children in Gaza against polio was a success. The WHO said it exceeded its vaccination goal. &#8220;It&#8217;s going well,&#8221; they said. &#8220;The atmosphere is almost festive.&#8221; They almost never admit it, but that is the closest we will get to hearing the World Health Organization thank Israel for doing everything possible to save Gazan children while the Hamas rapist regime—which the World Health Organization is totally quiet about—continues to wage war against Israel and hold Israeli hostages in underground terror dungeons.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Polio Vaccination Campaign Success</h3>\n\n\n\n<p>Israel facilitated the entry of 1.3 million doses of polio vaccine to Gaza together with the World Health Organization and UNICEF. Gaza is already 90% vaccinated. This new effort was a preventative measure because of an Egyptian strain of polio that was detected in Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Contrasting Hamas and Israel&#8217;s Priorities</h3>\n\n\n\n<p>Just think about it for one second. Hamas is dedicated to murdering Israel&#8217;s children. Israel is dedicated to saving the children of Gaza. Hamas is not afraid of this; they&#8217;re not embarrassed by this. They loudly proclaim—just look it up—they say, &#8220;The Jews love life; we Hamas love death.&#8221; I have a word for you, Hamas: you&#8217;re correct, the people of Israel do love life. That&#8217;s why we are fighting our war, to ensure that Hamas can never carry out another massacre and that all children—Israeli children and children living in Gaza—can know a better future.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Escalation in Northern Israel</h2>\n\n\n\n<p>&#8220;Uh, Derone, one more thing that&#8217;s not in your daily briefing. The IDF just sent out a press release about the situation in the north. If you take a look at your phone, you can see that press release and add that to your briefing.&#8221;</p>\n\n\n\n<p>&#8220;Sure, okay. Unfortunately, the IDF just announced that sirens are sounding all throughout northern Israel and that 65 projectiles—rockets and killer drones—were fired from Lebanese territory and identified crossing into northern Israel. The IDF aerial defense, often known by other acronyms—that is what Israel has invested its money in, such as Iron Dome and an array of defensive technologies—according to this, intercepted those 65 attack drones and rockets fired on Israel.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Aggression and Israel&#8217;s Defense</h3>\n\n\n\n<p>Let&#8217;s just take a step back. Could you imagine, wherever any of you are living, if one rocket, one attack drone was fired by an enemy country over your home? If your children, your brothers and sisters, your grandchildren heard loud explosions in the sky just over your home when either one of those rockets was intercepted or, God forbid, one of them landed? This is the terror that Hezbollah has been forcing on the people of Israel. This was totally unprovoked. Israel did not attack Lebanon, did not attack Hezbollah. On October 8th, following the October 7th massacre, Hezbollah was hungry to join in. In fact, we know from intelligence they were incredibly disappointed that Hamas did not reveal to them they were attacking on October 7th. The reason is, Hezbollah would have attacked on October 7th as well. Just like Hamas captured and brutally murdered and took hostages in the south, Hezbollah feels left out that they did not do that in the north. And if there&#8217;s any question about that, here we have more than 60 rockets and killer drones that have been launched while I&#8217;m speaking to you from Hezbollah into Israeli territory. Why? For one reason: they&#8217;re hoping that just one of those gets through our defensive barrier and kills innocent Israelis. That is evil. What we are doing is trying to protect the people of Israel while minimizing casualties on the other side. That is good. This is a typical war of good against evil.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Audience Q&amp;A Session</h2>\n\n\n\n<p>&#8220;Now I&#8217;d like to take some questions from our audience that&#8217;s watching us live on social media. Please, if you haven&#8217;t yet, submit some questions, and I&#8217;m here to answer whatever questions you may have.&#8221;</p>\n\n\n\n<p>&#8220;Thank you, Donon. These two questions I&#8217;m going to combine are from our Instagram stories on our account on the Israeli Citizen Spokesperson&#8217;s Office. A person writes, &#8216;Please make people aware of the set of impossible choices that Israel faces with a deal, and also what should the international media know about the demonstrations in Israel?'&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Difficult Choices and International Media</h3>\n\n\n\n<p>This is a deal that I would not wish on anyone. This is a deal that essentially says if we want to release the remaining 100-plus hostages that are in the terror dungeons inside of the Gaza Strip, the terms of the deal dictate that for every one of those hostages, we have to release 30 killers—Hamas killers—from Israeli prisons back onto the streets in Gaza, where we know what they&#8217;re going to do because we have already recaught Hamas terrorists that were already released from Israeli prisons in the Gilad Shalit deal. Those same prisoners go back into Gaza, and they carried out the October 7th attack. Therefore, while we are so desperate to have our hostages home, we know that the cost means releasing, for every hostage, 30 killers back into Gaza that have one goal: to carry out the October 7th attack again. Could you imagine, God forbid, having to make this choice? Hamas will only agree to a deal that gives them one thing: the power to survive. Hamas does not want the power to survive to come up with technological innovations and win Nobel prizes. No, Hamas&#8217;s charter—and you&#8217;re free to learn it online—calls for one thing: it is the destruction of the State of Israel. And therefore, we care so much about our own civilians, so much about these sons and daughters which we feel are our own family, we&#8217;re willing to do almost anything to bring them home. However, we have to be very careful that what we do doesn&#8217;t cause the next wave of hostages to be taken back into Gaza. We don&#8217;t want to have to look in those parents&#8217; eyes either. And this is the question, this is the deal; it&#8217;s not much of a deal that&#8217;s being put in front of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Protests and Emotional Turmoil in Israel</h3>\n\n\n\n<p>The protests in the streets of Israel are incredibly difficult for Israel as a country. Everyone is drawn into this; everyone has either families or relatives that are on one side or another, and it is for one simple reason: we are a small family. Everyone in Israel knows these hostages, and we are torn apart that these boys and girls, sons and daughters, grandparents, even little babies—four-year-old babies, less than a one-year-old baby—are inside Gaza. And therefore, the emotion and the need to bring these people home is very great, and that&#8217;s why many people are protesting. And who can blame them? God forbid if it was anyone&#8217;s children, they would do the same thing. And at the same time, they are protesting against what could be called logic to a large degree, or a feeling that we cannot do something that&#8217;s going to enable the Hamas terror regime to take the next wave of hostages. And these competing scenarios, both of which make sense and both of which are so painful, are what are filling the streets of Israel. It is because people do care, and at the same time, the leadership and the military know that we have Hamas cornered in Gaza. These are the decisions that Israel has to make, and we have responsible leadership. We are a democracy; we voted for our leadership, and the IDF is doing a supreme job in order to carry out these goals. And our hope has been from the very beginning that we will bring all of our hostages home. And if Hamas would send home every Israeli hostage and lay down their arms, the second that they do this, this war ends. It is in their hands; they criminally and brutally murdered our people and took our hostages, and they cruelly and brutally threaten the State of Israel. The onus is completely on them.</p>\n\n\n\n<h3 class=\"wp-block-heading\">US Charges Against Hamas Leaders: A Positive Step</h3>\n\n\n\n<p>&#8220;Uh, yesterday the Department of Justice in the United States published its charges against senior Hamas terrorists. What is your reaction to the United States doing this?&#8221;</p>\n\n\n\n<p>It&#8217;s obviously a positive thing; it sounds like it&#8217;s better late than never. I think anyone—even the average viewer at home—can understand that the people that lead the Hamas terror organization are like the leaders of the Nazi movement. Sinwar is like Hitler, and his minions are like the Nazis. I mean, anyone who watched the videos that Hamas so proudly videoed of themselves raping and killing Israeli hostages should know that charges should be pressed against them. Even though it&#8217;s late, it&#8217;s a very positive thing. The U.S. has been an incredible partner with Israel in this war to defend ourselves, and we call on every international organization to do the obvious thing that the U.S. Justice Department just did. That is, the United Nations, the World Health Organization, every large international body—if you have a shred of dignity, a shred of dignity—stop pestering and chasing Israel and accusing Israel of war crimes, which is ludicrous, and look at the true enemy, which is Hamas, and bring them to justice. Do not let them find safe havens in your country. Cut off all of Hamas&#8217;s funding and call evil what evil is: Hamas is evil. And follow the United States&#8217; example and declare them outlawed so that they are alone in solitude with their own evil and gods and cannot look for hope to any of the other countries in the world.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Strategic Importance of the Philadelphia Corridor</h3>\n\n\n\n<p>&#8220;There are many headlines also about the Philadelphia Corridor. What is your interpretation of the latest developments of Israel&#8217;s position and what Israel&#8217;s position is?&#8221;</p>\n\n\n\n<p>Israel understands that—how did Hamas in Gaza get all of the arms and the weapons, the bombs and the explosives, the blast doors and the trucks that fill their terror dungeons and that are being used to kill Israelis? They got them from one area, from through the Philadelphia Corridor. The Philadelphia Corridor is the corridor that&#8217;s the width of a football field and the length of around 10 miles that separates Egypt from Gaza. It is a site of the most rampant corruption—corruption that goes all the way up to the highest levels of the Egyptian government—and it was there that Hamas used their aid money—that&#8217;s your tax dollars, wherever you are in the world, that was sent to the United Nations for your taxes to aid Hamas to build a better life for the people of Gaza. They used that money not on food and not on polio vaccines; they used it to pay off Egypt and to bring in weapons and explosives through the Philadelphia Corridor. To leave that corridor unguarded is like giving a terrorist bullets while he&#8217;s pointing a gun at you. It is giving Hamas back their umbilical cord and their oxygen while they are on their last legs. And therefore, the leadership of the State of Israel, the Prime Minister, has made it very, very clear, and many people in Israel agree with this, that it is inconceivable that Israel has spent 11 months fighting Hamas to defeat them, and we are going to enable them to keep their supply route to bring in more weapons to fight us. Could you imagine doing that anywhere else in the world? That is Israel&#8217;s position on the Philadelphia Corridor. The most recent agreement, which came out today—the details have not yet been released—but anything that does not allow Israel to be vigilant and have a permanent force in the Philadelphia Corridor is simply handing Hamas not only a victory but it is determining the fate of the next war and assault they declare on the State of Israel. The Philadelphia Corridor must not be given up by Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Message to College Students Facing Anti-Israel Protests</h3>\n\n\n\n<p>&#8220;Uh, Donon, this is our final question. We have many viewers who are college students in the United States and elsewhere who are returning to campuses this fall. What is your message to these students who are dealing with anti-Israel protests across college campuses?&#8221;</p>\n\n\n\n<p>Well, first of all, we have to understand why these protests are taking place. The protests that are taking place are built to scare the Jews on campus. They&#8217;re putting them in the same pot as Israel, and it is simply anti-Semitism. If you watch it, what&#8217;s being said—the words &#8220;Kill Israel&#8221; are in the same mouthful as the words &#8220;Dirty Jew.&#8221; We hear it all the time. This is typical anti-Semitism. What does it mean to terrorize? It means to cause a person to feel threat to the point at which they lose all hope; they carry their head down, and they&#8217;re meek. The answer needs to be the exact opposite: hold your head high, show your belief in the State of Israel, your belief in democracy, stand for what is right at this time, and do not allow people who are evil to scare you. That only causes evil to grow larger and larger. If you need to, turn to your school administrations and turn to the police. But if there is a protest, an anti-Israel protest, it needs to be met on the other side by people that proudly stand with Israel. Just like we cannot give Hamas a psychological victory, you cannot allow those anti-Semite, anti-Israel, and anti-American protesters on your campus a victory by enabling them to scare you into silence. This is your chance to be courageous. It always takes courage to stand on the side of good against the side of evil. I think that all of us, both in Israel where we&#8217;re fighting our enemies and in the United States and other places around the world, have to show courage and faith in what is good, and hopefully good will get a boost and will win sooner rather than later.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>Thank you for all of your questions. I appreciate you joining us on the Citizen Spokesperson&#8217;s Unit Office. We are live every day at 3 a.m. Israeli time, 8 a.m. EST, Eastern Standard Time. We look forward to your joining us. Send us in your questions in the future. We&#8217;ll see you back here again tomorrow. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Israeli spokesperson Donon reports that <a  href=\"/hamas\">Hamas</a>, losing militarily, is intensifying psychological warfare by executing <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>. He notes <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s humanitarian efforts in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> acknowledged by WHO, addresses <a  href=\"/hezbollah\">Hezbollah</a> attacks from Lebanon, and discusses Israel&#8217;s tough choices, public protests, U.S. charges against <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> leaders, and advises students facing anti-Israel campus protests.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1304
    ],
    "class_list": [
        "post-17589",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-doron-spielman"
    ],
    "lang": "en",
    "translations": {
        "en": 17589
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17589",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17589"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17589/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17590,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17589/revisions/17590"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17589"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17589"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17589"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}