{
    "id": 18489,
    "date": "2024-09-30T22:03:00",
    "date_gmt": "2024-09-30T19:03:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18489"
    },
    "modified": "2024-11-05T09:16:16",
    "modified_gmt": "2024-11-05T07:16:16",
    "slug": "hamas-commander-in-lebanon-also-served-as-unrwa-school-principal",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/know-your-enemies/unrwa/hamas-commander-in-lebanon-also-served-as-unrwa-school-principal/",
    "title": {
        "rendered": "Hamas Commander in Lebanon Also Served as UNRWA School Principal"
    },
    "content": {
        "rendered": "\n<p>The world must wake up to the unmasking of UNRWA’s treacherous operations. The confirmation that Fatah Sharif, a senior Hamas commander killed in an Israeli airstrike, doubled as an UNRWA school principal and led the UNRWA Teachers&#8217; Association in Lebanon is another chilling proof of how deep the ties between UNRWA and terrorist organizations run. This is not an isolated incident or a simple oversight; it is part of an alarming pattern that places innocent lives at risk and uses humanitarian aid as a cover for militant agendas.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Lazzarini’s Continual Denials Ring Hollow</h3>\n\n\n\n<p>UNRWA’s Commissioner-General, Philippe Lazzarini, has once again shown that he is either willfully ignorant or, worse, complicit. Just as he feigned surprise when Israel revealed a Hamas server farm hidden beneath UNRWA’s Gaza headquarters, Lazzarini now claims he had no knowledge of Sharif&#8217;s double life as a terrorist. This habitual dismissal of Israel’s well-founded accusations as &#8220;disinformation&#8221; is a transparent attempt to deflect accountability. The truth is out: UNRWA has become a de facto partner in facilitating terror in the region.</p>\n\n\n\n<h3 class=\"wp-block-heading\">UNRWA’s Structure: A Conduit for Terrorism</h3>\n\n\n\n<p>What makes this even more alarming is that UNRWA operates on a scale unlike any other UN body, heavily reliant on local staff who often align with extremist groups. The claim of neutrality crumbles under the weight of evidence, showing that hundreds of active terrorists are employed within its ranks. Lazzarini’s unwillingness to take action—he has not fired a single individual for known terrorist affiliations—underscores an institutionalized tolerance for militant infiltration.</p>\n\n\n\n<p>This is not a rogue phenomenon; it is an inevitable result of UNRWA’s organizational setup. Unlike other UN agencies, its quasi-state scale and dependence on local hires have made it an unsustainable, dangerous anomaly. It acts as an incubator for radicalization, sheltering those who wish to see Israel and its people destroyed. The goal is not humanitarian support but rather the perpetuation of refugee status and the indoctrination of youth to carry forward a cycle of violence. This grotesque perversion of humanitarian aid must stop.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Time for Change: Dissolve and Replace UNRWA</h3>\n\n\n\n<p>Enough is enough. The global community must confront the truth that UNRWA cannot be salvaged in its current form. It is high time to phase out UNRWA operations in Gaza responsibly and reallocate its functions to more accountable, neutral organizations that can truly focus on humanitarian efforts without the taint of terrorism. Humanitarian work must be delinked from any terror affiliations, and Israel’s legitimate security concerns must be front and center.</p>\n\n\n\n<p>The continued existence of an organization that educates children to hate, that serves as a platform for terror operatives like Fatah Sharif, is an affront to the principles of peace and human decency. Philippe Lazzarini, your denials have worn thin. UNRWA’s complicity in terror is proven and indefensible.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a>’s admission confirms it harbors terrorists. <a  href=\"/hamas\">Hamas</a> leader Fatah Sharif as principal proves <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> right: UNRWA fuels terrorism.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18490,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-unrwa",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1342,
        "footnotes": ""
    },
    "categories": [
        1342
    ],
    "tags": [
        1663,
        1340
    ],
    "class_list": [
        "post-18489",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-unrwa",
        "tag-philippe-lazzarini",
        "tag-the-un"
    ],
    "lang": "en",
    "translations": {
        "en": 18489
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18489",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18489"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18489/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18498,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18489/revisions/18498"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18490"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18489"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18489"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18489"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}