{
    "id": 17493,
    "date": "2024-09-04T15:00:00",
    "date_gmt": "2024-09-04T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17493"
    },
    "modified": "2024-09-07T20:01:58",
    "modified_gmt": "2024-09-07T17:01:58",
    "slug": "hamas-plan-to-make-israelis-lose-hope-with-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-plan-to-make-israelis-lose-hope-with-doron-spielman/",
    "title": {
        "rendered": "Hamas’ Plan to Make Israelis Lose Hope | with Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas’ Plan to Make Israelis Lose Hope | with Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/hynO_fCXl3E?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is day 334 of the October 7th War, and in recent days, Hamas has ramped up its psychological warfare against the people of Israel. Though this has been a tactic throughout the war, it has reached new levels in recent days with the execution of six Israeli hostages.</p>\n\n\n\n<p>Hamas is losing on the battlefield. Israeli forces are breaking Hamas, and nearly every Hamas terror battalion has been dismantled. Hamas cannot fight as an organized army, as it did on October 7th when it massacred 1,200 people. Knowing they can&#8217;t win physically, Hamas aims to achieve tactical victories through psychological warfare.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Hamas&#8217; Strategy: Psychological Warfare</strong></h4>\n\n\n\n<p>Hamas is exploiting hostages to cause psychological pain. After executing six hostages in cold blood, Hamas released videos of their final messages. The videos, filled with edited graphics and Hebrew language text, are clearly aimed at the people of Israel. The end of the video reads, &#8220;Time is running out,&#8221; a deliberate attempt to weaken Israel’s resolve.</p>\n\n\n\n<p>Hamas has continuously published twisted and evil videos of hostages pleading for their lives, hostages looking abused, and even videos of hostages after being executed. This is psychological warfare at its worst, designed to strip people of their will to fight.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The IDF Uncovers Hamas&#8217; Psychological Warfare Manual</strong></h4>\n\n\n\n<p>We know this is Hamas’ strategy because the IDF recently uncovered a Hamas psychological warfare guide in a Gaza tunnel. Written by a senior Hamas leader, possibly Sinwar himself, the guide outlines how Hamas should increase the distribution of hostage photos and videos to apply psychological pressure, target Israeli leaders, and challenge the narrative that Israel’s ground operations will free the hostages.</p>\n\n\n\n<p>Hamas knows it’s losing on the ground but wants people to believe Israel cannot win. Its goal is to end the war still holding Israeli hostages in its terror dungeons. Immediate pressure on Hamas and its enablers—Qatar, Turkey, and Iran—is necessary to secure the release of these hostages.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Israel&#8217;s Humanitarian Efforts Amid War</strong></h4>\n\n\n\n<p>In an unusual move, the World Health Organization (WHO) has acknowledged that the campaign to vaccinate 600,000 children in Gaza against polio was a success. The campaign, which exceeded its vaccination goal, was carried out in coordination with Israel, WHO, and UNICEF.</p>\n\n\n\n<p>Israel facilitated the entry of 1.3 million doses of polio vaccine into Gaza, ensuring that 90% of children in Gaza were vaccinated. This campaign was a preventative measure against an Egyptian strain of polio detected in Gaza.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>A Stark Contrast: Israel Saving Lives, Hamas Destroying Them</strong></h4>\n\n\n\n<p>While Israel is working to save the children of Gaza, Hamas remains dedicated to murdering Israel’s children. As Hamas itself proclaims, &#8220;Jews love life, but we love death.&#8221; In contrast, Israel fights to ensure a future where all children—Israeli and Gazan—can live in peace.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Rocket Fire and Hezbollah’s Aggression from the North</strong></h4>\n\n\n\n<p>The IDF just issued a press release stating that sirens are sounding throughout Northern Israel as 65 projectiles, including rockets and killer drones, were fired from Lebanese territory. Israel’s aerial defense systems, including the Iron Dome, intercepted these projectiles.</p>\n\n\n\n<p>Hezbollah, eager to join the fray, has attacked Israel multiple times since October 7th. According to intelligence, Hezbollah was disappointed that Hamas did not inform them of the October 7th attacks, which would have allowed them to strike Israel from the north simultaneously. Their attacks today are a reflection of their desire to be part of the terror campaign, hoping one of their rockets or drones will break through Israel’s defense systems.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Unprovoked Attacks on Israel</strong></h4>\n\n\n\n<p>These attacks are unprovoked. Israel has not attacked Lebanon or Hezbollah since October 8th. Hezbollah’s ongoing rocket fire is an attempt to terrorize Israeli civilians, hoping to cause mass casualties.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Audience Questions and Responses</strong></h2>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>Question from Instagram Stories:</strong></h5>\n\n\n\n<p><em>&#8220;Please make people aware of the impossible choices Israel faces with a deal, and what should the international media know about the demonstrations in Israel?&#8221;</em></p>\n\n\n\n<p>This deal is incredibly difficult. To secure the release of over 100 hostages from Hamas’ terror dungeons in Gaza, Israel must release 30 convicted Hamas terrorists for each hostage. We know that released Hamas prisoners have returned to carry out attacks, as they did in the October 7th massacre.</p>\n\n\n\n<p>Demonstrations in Israel reflect this painful choice. People are protesting because they want their loved ones home, but there is also a recognition that releasing terrorists could lead to further bloodshed. It’s an impossible situation, and the emotions on both sides are deeply understandable.</p>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>Question from the U.S. Department of Justice’s Announcement:</strong></h5>\n\n\n\n<p><em>&#8220;What is your reaction to the U.S. pressing charges against senior Hamas terrorists?&#8221;</em></p>\n\n\n\n<p>The U.S. pressing charges is a positive step, even if it’s late. Hamas leaders are akin to the Nazis, and those who led the October 7th atrocities should be held accountable for their war crimes. The U.S. has been a strong partner, and it’s essential for international bodies like the UN and WHO to follow suit, condemning Hamas and cutting off its funding.</p>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>Question about the Philadelphia Corridor:</strong></h5>\n\n\n\n<p><em>&#8220;What is Israel’s position on the Philadelphia Corridor?&#8221;</em></p>\n\n\n\n<p>The Philadelphia Corridor, a narrow strip between Egypt and Gaza, has been the lifeline for Hamas’ weapons smuggling operations. Leaving it unguarded would be akin to handing Hamas bullets while they point a gun at Israel. The leadership of Israel has made it clear that this route cannot be left unchecked.</p>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>Final Question for College Students Facing Anti-Israel Protests:</strong></h5>\n\n\n\n<p><em>&#8220;What is your message to students returning to campuses with anti-Israel protests?&#8221;</em></p>\n\n\n\n<p>These protests are meant to intimidate and silence Jewish students. It’s crucial to stand up for what’s right. Hold your head high, show your support for Israel, and don’t let fear silence you. This is a time for courage, and standing against evil requires it. Reach out to your school’s administration and take action if necessary.</p>\n\n\n\n<p>Thank you for joining us today. We’ll be live again tomorrow at 3 AM Israeli time (8 AM EST). Continue to send in your questions, and we’ll see you again tomorrow.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On day 334 of the October 7th War, <a  href=\"/hamas\">Hamas</a> escalated psychological warfare by executing six <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a> and releasing disturbing videos. While <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> dismantles <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> battalions, the IDF uncovered Hamas&#8217; strategy to weaken Israel psychologically. Meanwhile, <a  href=\"/hezbollah\">Hezbollah</a> launched unprovoked rocket attacks from Lebanon. Israel continues humanitarian efforts, vaccinating children in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1304
    ],
    "class_list": [
        "post-17493",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-doron-spielman"
    ],
    "lang": "en",
    "translations": {
        "en": 17493
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17493",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17493"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17493/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17496,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17493/revisions/17496"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17493"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17493"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17493"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}