{
    "id": 17593,
    "date": "2024-09-10T15:00:00",
    "date_gmt": "2024-09-10T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17593"
    },
    "modified": "2024-09-16T22:43:41",
    "modified_gmt": "2024-09-16T19:43:41",
    "slug": "hamas-plots-attacks-from-humanitarian-zones-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-plots-attacks-from-humanitarian-zones-ruth-wasserman-lande/",
    "title": {
        "rendered": "Hamas plots attacks from humanitarian zones | Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas plots attacks from humanitarian zones | Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/tFnDrSrOsuA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a>Today is day 340 of the October 7th War. Since the beginning of the war, Israel has designated certain areas of Gaza as humanitarian zones. These zones are areas away from battles waged in urban areas; the population of Gaza can move to these areas in order to be safer.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hamas Endangering Palestinian Civilians</h2>\n\n\n\n<p>Hamas saw that Israel was taking steps to protect Palestinian civilians and responded by taking steps to endanger Palestinian civilians. Hamas terrorists moved into those areas designated by the IDF as humanitarian zones. That brings us to this morning.</p>\n\n\n\n<p>Israel designated an area in Gaza as a humanitarian zone. It was an area where Hamas was not operating. What did Hamas do? It intentionally moved its operations and command center to that very humanitarian zone. So when Israel targeted multiple senior Hamas murderers in that command center, civilians may have been tragically hurt. However, the IDF disputes the numbers published by Hamas-run government information office.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Elimination of Senior Hamas Members</h2>\n\n\n\n<p>Hamas murderers eliminated today include:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The head of Hamas aerial unit, Som is Abaka</li>\n\n\n\n<li>Head of the observation and targets, Osama Tabish</li>\n\n\n\n<li>Another senior Hamas terrorist, Iman M</li>\n</ul>\n\n\n\n<p>Hamas often operates among tens of displaced people. In fact, videos on Arab social media document Hamas forcing Gazans out of their own tents so they can use them, while berating those same Gazans that complain of the danger that Hamas places them in.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hamas Using Civilian Sanctuaries</h2>\n\n\n\n<p>Hamas consistently attacks from places meant to be safe for Gazan civilians: UN facilities, schools, hospitals, and other civilian sanctuaries. Hamas attacks Israel&#8217;s children from behind Gaza&#8217;s children. The Hamas murderers eliminated this morning were directly involved in the October 7th massacre—raping, killing, torturing, kidnapping, and burning Israeli civilians.</p>\n\n\n\n<h2 class=\"wp-block-heading\">IDF&#8217;s Precise Strikes and Hamas Disinformation</h2>\n\n\n\n<p>Before the strike, Israel gathered intelligence and watched the area from the air. It then used precise munitions in the strike. Hamas&#8217;s government information office claimed that there were massive civilian casualties, but their numbers have been proved consistently unreliable and misleading since the beginning of the war.</p>\n\n\n\n<p>Remember that same Hamas numbers counted 500 dead at the Al-Ahli hospital just two minutes after the explosion that they claimed was Israel&#8217;s fault. Well, it was proved by foreign media outlets that 500 people were not killed and that it was a Gazan rocket which was meant to kill Israeli civilians and accidentally hit the Al-Ahli hospital parking lot. Media still using Hamas government information office numbers are irresponsibly platforming terrorist disinformation. Stop encouraging Hamas to use Gazans as human shields—human sacrifices in their war against the people of Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\">UN Convoy Stopped by Israeli Military</h2>\n\n\n\n<p>A UN convoy in Gaza was stopped by the Israeli military because of a suspicion that several wanted men were on one of those vehicles. Apparently, the UN gives rides to wanted men in a war zone. Were the suspects UN staff perhaps?</p>\n\n\n\n<p>UNRWA head Philip Lazarini called Israel&#8217;s action a violation. Yet again, it&#8217;s not a violation. We know that UNRWA always plays dumb when called out for its close ties with Hamas. The convoy was supposed to take UN staff for shift changes; it wasn&#8217;t carrying polio vaccines as Lazarini claimed. But Lazarini too is not exactly the best source of accurate information.</p>\n\n\n\n<p>When a massive Hamas intelligence headquarters was found just underneath an UNRWA headquarters in Gaza City, with electric wires going underground to power Hamas computers, that same Lazarini said UNRWA did not know what is under its headquarters in Gaza. Rather strange. Lazarini covers for Hamas.</p>\n\n\n\n<h2 class=\"wp-block-heading\">UNRWA&#8217;s Alleged Ties with Hamas</h2>\n\n\n\n<p>UNRWA is a Hamas front. In fact, UNRWA has thousands of people affiliated with Hamas on its very payroll, including hundreds of hardened terrorists. UNRWA laundered millions of dollars taxpayer money for Hamas and therefore must be shut down.</p>\n\n\n\n<h2 class=\"wp-block-heading\">UN Calls for Removal of Jewish People from Jerusalem</h2>\n\n\n\n<p>Here&#8217;s another interesting term about the United Nations—in fact, something for all of us to think about. The UN is going to call for the removal of Jewish people from Jerusalem, displacing an entire indigenous population. I don&#8217;t know; that sounds like something that the UN always says is not done.</p>\n\n\n\n<p>Representatives from the Palestine Liberation Organization submitted a General Assembly resolution calling to implement decisions of the UN Court, International Court of Justice (or the ICJ). The ICJ, in fact, called for Israel to leave Jerusalem&#8217;s Old City, including Judaism&#8217;s holiest sites at the Temple Mount and its Western Wall, as well as the West Bank—the Judea and Samaria hills surrounding Jerusalem and overlooking Tel Aviv.</p>\n\n\n\n<p>In recent years, the UN has become a platform for despots and human rights violators like the Islamic Republic of Iran, for example. The UN was established after World War II, especially for safeguarding human rights and Western values, and now it is doing the exact opposite.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Audience Questions</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Hamas&#8217;s Inflated Casualty Numbers</h3>\n\n\n\n<p><strong>Question:</strong> There&#8217;s a report in <em>The Times of Israel</em>. I&#8217;m going to read it to you now. The headline is: &#8220;After IDF disputed claim 40 dead in Gaza strike, Hamas Health Ministry now says toll is 19.&#8221; Is this a pattern that you see again and again, where in the beginning Hamas makes one claim only to revise it later after the false claim is spread?</p>\n\n\n\n<p><strong>Answer:</strong> Thank you for that question. In fact, not only do I see this as a pattern, but very often they don&#8217;t correct. And when they do correct, always the numbers begin very, very high. Something that they do—they lie in order to have that kind of impact on public opinion. And then after it is proved to be absolutely wrong, then they come back and say the numbers were much, much lower, if they come back and correct at all.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Gaza Civilians Keeping Gunmen Out</h3>\n\n\n\n<p><strong>Question:</strong> Yes, right now there&#8217;s a headline in <em>The New York Times</em>: &#8220;Fearing Israeli strikes, Gaza school shelters try to keep gunmen out.&#8221; Do you think many people in Gaza are starting to get the message that Israel does not want to harm civilians and that they are seeing that when Hamas gunmen enter their area, they bring danger to everyone?</p>\n\n\n\n<p><strong>Answer:</strong> I think that, one, the people of Gaza have been held hostage by a very cruel terrorist organization, the Hamas, and they are being used as human shields. That being said, a lot of the people in Gaza have been through tremendous indoctrination for many years and are truly brainwashed to despise Israel, to hate Israel, to hate the West, to hate Europe, and to hate America and everything that the West holds dear. And therefore, I&#8217;m not 100% sure that the entire population is finally seeing that Israel is on the good side, actually not wanting to hurt civilians.</p>\n\n\n\n<p>However, many of them do see that the Hamas does steal food from them, does use civilians as human shields, but they won&#8217;t say it aloud. Only very few brave souls do say it aloud, and we always see that they&#8217;re either killed afterwards or very, very badly hurt, unfortunately.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Disbanding UNRWA</h3>\n\n\n\n<p><strong>Question:</strong> This is a question from our Instagram: Knowing why and how UNRWA was created and all the behind the scenes about UNRWA creation, do you actually believe UNRWA can be dismantled and replaced?</p>\n\n\n\n<p><strong>Answer:</strong> Thank you so much for that question. Must UNRWA be displaced? Yes. Can UNRWA be displaced and replaced or broken down and shut down? Of course it can. It&#8217;s a matter of will. It&#8217;s an organization which is supposed to take care of Palestinian refugees. It does not only not take care of Palestinian refugees; it, in fact, keeps those poor people in a refugee status forever. In other words, there&#8217;s no hope for these poor people to ever have any kind of true hope because this is the exact purpose of this organization.</p>\n\n\n\n<p>Plus, they pay the Hamas operatives, some of them, to work within the organization, giving a sanctuary to Hamas terrorists. This is insane. This has been proven by international media outlets and by international specialists. This is not something that we can deny. But is there a will to break them and stop paying taxpayers&#8217; money from the United States of America and Europe to have that body continue its terrible work? It&#8217;s a matter of will, and you can do a lot by pressing your people, your decision-makers, your influencers to make sure that it&#8217;s done.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Potential War with Hezbollah</h3>\n\n\n\n<p><strong>Question:</strong> A senior administration official, a Biden administration official, at a conference in Washington said that a full-blown war between Israel and Hezbollah could have, quote, &#8220;catastrophic and unforeseen consequences.&#8221; What do you foresee would be the consequences of a wider war in Lebanon, and what do you see are the consequences of inaction?</p>\n\n\n\n<p><strong>Answer:</strong> The consequences of war are terrible. Any war is terrible. If Israel could choose, it would not choose to go to war. In fact, on October 6th, Israel did not want to go to war. It didn&#8217;t prepare to go to war, and it unfortunately didn&#8217;t retaliate in time when the war started by the Hamas terrorists.</p>\n\n\n\n<p>Any kind of war on the outskirts of Israel by Hezbollah will have terrible repercussions; there&#8217;s no question of that. Is this something that Israel cannot go into? Well, you have to ask the Hezbollah, but more so you have to ask Iran. The Islamic Republic of Iran is planning on all fronts to attack Israel, like it was attacked in 1948 by many Arab armies. In the same manner, Iran wants to be the hero of the Islamic world, to take over the West, to take over the region, and it wants to begin with Israel as its first stop.</p>\n\n\n\n<p>And to do that, it&#8217;s very meticulously planning to begin a war by Hezbollah in the north—although they&#8217;ve been at war for a very long time, 11 months, but not a full-blown war—in the south by Hamas, in the West Bank by Hamas and the Islamic Jihad, and via Jordan, in all fronts at the same time. And this is the biggest danger. The biggest danger is the Islamic Republic of Iran, and that&#8217;s where the world&#8217;s eyes should be.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Sanctions Against Hamas Backers</h3>\n\n\n\n<p><strong>Question:</strong> This is a question from our Instagram Live: Why aren&#8217;t there any financial sanctions imposed on the Hamas leaders in Qatar, and why is there not enough pressure yet? And how can there be more pressure on Hamas&#8217;s backers—Qatar, Turkey, and Iran?</p>\n\n\n\n<p><strong>Answer:</strong> Why is the world not understanding that terrorists—which, by the way, the United States, Europe, some European countries, and other Western powers have designated as terrorist organizations—if they do what they do, for example, Hezbollah throwing rockets at civilian populations for 11 months, displacing people, tens of thousands of people, which is completely illegal, how is the world not responding, not attacking Hezbollah, not taking action against it, or the Hamas for the absolutely atrocious things they have done on October 7th, but rather coming to Israel because Israel is a proper state, a proper normal accountable country which takes care of its civilians, which actually is a democracy, and it can be pressed?</p>\n\n\n\n<p>But that doesn&#8217;t mean that it only needs to be pressed and not those terrorists. And what actually happens is that the perpetrators of evil like Qatar funding, like the Islamic Republic of Iran, like Hamas, like Islamic Jihad, like Hezbollah—they are not enough held accountable by the international arena, which will feel the repercussions thereof on their streets. They already do, but they&#8217;ll feel it much more in a very short time, and that&#8217;s a big problem.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Volatility in the West Bank</h3>\n\n\n\n<p><strong>Question:</strong> We have time for one last question. The IDF has just published a statement saying that it is very likely that indirect and unintended fire killed an American woman, a citizen in the West Bank. Can you say a few words about the general situation in the West Bank and why it&#8217;s so volatile?</p>\n\n\n\n<p><strong>Answer:</strong> Again, we are talking about a very densely populated urban area in the West Bank. Now, we need to understand this is not some far away destination. These are villages that are literally a mere hundreds of meters from the Israeli undisputed villages within the northern Sharon area and generally within Israel proper.</p>\n\n\n\n<p>And Israel has shown, and the world has seen but sort of doesn&#8217;t respond to, the fact that there are militants with weapons—very, very many weapons of destruction—that have been smuggled via Jordan by Iran, Hamas terrorist organization, and Islamic Jihad infiltrated amid the civilians inside their homes, inside the villages, and basically throwing rockets, planning explosives, doing things that are absolutely undeniably <em>casus belli</em>, a declaration of war against the people that no other country would remain apathetic to.</p>\n\n\n\n<p>They&#8217;ve been doing this for years, but recently even more so because in the last two years Iran has given them so many weapons via Jordan, smuggled, and this is unbelievable because it is so difficult not to hurt civilians. The fact that Israel has not hurt almost a single civilian in the West Bank is a miracle because Israel and the IDF do so much to avoid hurting unrelated civilians, and this is not a mantra, this is not a point to declare; this is reality, whether it&#8217;s convenient for people to hear or not.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Closing Remarks</h2>\n\n\n\n<p>Thank you so much for being with us today, and we look forward to having you with us tomorrow at the same time, 3 p.m. Israel time, online. Take care.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"/hamas\">Hamas</a> moved its operations into areas designated by <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> as humanitarian zones, endangering Palestinian civilians. Israel targeted senior <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> members in these zones, leading to disputed civilian casualties. Hamas often uses civilian sanctuaries like UN facilities, schools, and hospitals to launch attacks against Israel.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-17593",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 17593
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17593",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17593"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17593/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17594,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17593/revisions/17594"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17593"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17593"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17593"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}