{
    "id": 17719,
    "date": "2024-09-19T15:00:00",
    "date_gmt": "2024-09-19T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17719"
    },
    "modified": "2024-09-22T01:44:19",
    "modified_gmt": "2024-09-21T22:44:19",
    "slug": "hezbollah-is-more-honest-than-its-online-defenders-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-is-more-honest-than-its-online-defenders-daniel-rubenstein/",
    "title": {
        "rendered": "Hezbollah Is More Honest Than Its Online Defenders | Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Is More Honest Than Its Online Defenders | Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/GxzAPbRBvmg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Alon Levy&#8217;s Debate with Al Jazeera&#8217;s Massan</h3>\n\n\n\n<p>This is my last chance to remind you live that this Saturday, September 21st, our very own Alon Levy will be debating Al Jazeera&#8217;s Massan in New York City. If you&#8217;re in New York, you can buy a ticket and attend in person. If you&#8217;re not attending in person, you will be able to watch a live stream. The link is in the bios of our social media platforms.</p>\n\n\n\n<p>Wherever you are in the world, you can host a viewing event. If you want to host a viewing event, please again go to our social media pages, find a link in our bios, and you will find a form to fill out. We will send you materials to help you have a successful viewing event. Again, all of the relevant information on how to attend in person, how to register for the live stream, and how to host a viewing event is on our social media platforms. You&#8217;re not going to want to miss this: Alon Levy versus Massan!</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah Casualties: 10 Killed, 3,000 Injured in Strikes</h3>\n\n\n\n<p>Hezbollah is mourning its dead and injured. Hezbollah announced at least 10 terrorists killed in two waves of strikes—one on Monday targeting pagers, and a second on Tuesday targeting two-way radios. Hezbollah media reported that more than 3,000 were injured from Hezbollah units.</p>\n\n\n\n<p>There’s a lot of nonsense commentary on social media. Some people are so committed to finding Israel guilty of crimes no matter what that they are fabricating claims that not even Hezbollah is making. I&#8217;ve seen claims that Israel tampered with pagers that were sold to the Lebanese public, and that Lebanon at large is under attack. This is false. Listen, Israel could invent a magic spell that just wished all the Hezbollah and Hamas gangsters out of existence, and the same crowd—so many of whom are professors—would whine that it&#8217;s not fair that Israel has better technology.</p>\n\n\n\n<p>Here’s what Hezbollah is saying. Hezbollah said they purchased thousands of special-order encrypted pagers for its commanders. This followed a public Hezbollah campaign to stop using cellular phones, which Hezbollah believed were susceptible to Israel&#8217;s eavesdropping. Hezbollah put out multiple messages acknowledging that its operatives were the targets. Hezbollah did not distribute its special pagers to uninvolved civilians.</p>\n\n\n\n<p>What is true is that Iran&#8217;s terror army, Hezbollah, is so deeply embedded in Lebanon that seemingly civilian locations were explosively exposed as housing Hezbollah equipment and terrorists. As the saying goes: Hezbollah is an army with a state.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Reach Beyond Lebanon: Syria, Iraq, and Yemen Affected</h3>\n\n\n\n<p>Here’s an important part of the story that isn&#8217;t getting enough attention: Hezbollah pagers also detonated in Syria and Iraq. Why is that? There&#8217;s even firsthand video of Houthis, Iran&#8217;s terror pirates in Yemen, saying they were injured and killed. I will be watching that closely.</p>\n\n\n\n<p>The detonations clearly depict Iran&#8217;s &#8220;Ring of Fire&#8221; across the Middle East around Israel and the seven fronts where Iran&#8217;s war against Israel is taking place. Many in the Arab world, long suffering from Iran&#8217;s violence, are celebrating Hezbollah&#8217;s loss—some celebrating quietly, and some more publicly. Arab social media was abuzz with anti-Hezbollah memes and calls to remember Hezbollah&#8217;s role in massacring innocents in Syria and Lebanon. There are Arabic-language music clips mocking Hezbollah, much like last month’s chicken memes.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The UN General Assembly Targets Israel Again</h3>\n\n\n\n<p>One more item today: the UN General Assembly is doing what it does best—ganging up on Israel. The General Assembly passed a resolution that demands that Israel end its &#8220;unlawful presence&#8221; in the &#8220;occupied Palestinian territory&#8221; and evacuate all settlers from the occupied Palestinian territory. The resolution also called for sanctions against Israelis who ignore this unjust demand.</p>\n\n\n\n<p>I have questions. What exactly is Palestinian territory? Since when? And how do you know? The UN says that East Jerusalem is part of occupied Palestinian territory. This means the Western Wall and the Temple Mount are part of occupied Palestinian territory. It means the Jewish quarter of the Old City of Jerusalem is an illegal settlement. It means the UN seeks sanctions against Israel until Israel gives up the entire Old City of Jerusalem and 100% of the West Bank. It gives the Palestinians everything, including the holiest sites of the Jewish people, in exchange for nothing.</p>\n\n\n\n<p>124 countries, including France, voted in favor. 14, including the United States, opposed, and 43 abstained. UN General Assembly resolutions are non-binding, but they are a clear indication that most countries in the world think that bullying Israel is good politics.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Viewer Questions: Lebanon and the IDF</h3>\n\n\n\n<h4 class=\"wp-block-heading\"><em>Question from Jerry Hagen on YouTube:</em></h4>\n\n\n\n<p>&#8220;Why hasn’t the IDF taken advantage of the situation to move into Lebanon?&#8221;</p>\n\n\n\n<p>We’re all watching closely because, ultimately, from Israel’s perspective, it’s the goal that matters, not the tactics. Meaning, what is the goal? The goal, which the Israeli Security Cabinet articulated very clearly earlier this week, is that the 60,000-plus Israelis who were forced to flee their homes in northern Israel because Hezbollah is shooting rockets, anti-tank missiles, and suicide drones at them, will be able to return home safely.</p>\n\n\n\n<p>If we look at the situation in northern Israel today, are those people home safely? No, they are not. And therefore, Israeli military operations will continue. I am not privy to the calculations about specific IDF tactics. We’re all watching closely. Perhaps there is still room for a diplomatic solution. Perhaps Hezbollah received the message very clearly that Israel is serious about ensuring its citizens can return home safely, and Hezbollah will not be in a position to fire on them once they do. We’re just going to have to wait and see.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iranian Agent Arrested</h3>\n\n\n\n<h4 class=\"wp-block-heading\"><em>Question from Sammy Tissa on YouTube:</em></h4>\n\n\n\n<p>&#8220;Can you speak about the arrest of the businessman who was sent by Iran to assassinate various senior Israeli officials?&#8221;</p>\n\n\n\n<p>Yes, I just saw this story before going live. The headline is that an Israeli Jew has been arrested for effectively being an Iranian agent, seeking to assassinate senior Israeli officials. The details are still emerging. It’s good news that this plot was stopped, but the bigger picture is clear: Iran wants to set the whole Middle East on fire. It’s attacking Israel through its proxies and its own military on seven fronts: Gaza, the West Bank, Lebanon, Syria, Yemen, Iraq, the Iranian militias in Iraq, and Iran itself. And you can count a front number eight: Jewish communities and Israelis around the world.</p>\n\n\n\n<p>The attacks on them are being sponsored, trained, and manipulated by Iran. So Iran is trying to attack Israel on all fronts. Why? It&#8217;s simple. Iran’s goal is to destroy Israel. That goal makes Iran popular in many quarters of the world that see the destruction of Israel as a good idea. Iran is trying to recruit agents to carry out this mission, and it’s a very good thing this one was stopped.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing In On Sinwar?</h3>\n\n\n\n<h4 class=\"wp-block-heading\"><em>Question from Rachel on Instagram:</em></h4>\n\n\n\n<p>&#8220;Are we closing in on Sinwar, or is Hezbollah&#8217;s interference affecting our rescue efforts?&#8221;</p>\n\n\n\n<p>That’s the million-dollar question. Are we closing in on Sinwar, and what will be the fate of the Hamas leaders who planned the October 7th massacre? We know the fate of some of them already. There have been targeted strikes on people like Muhammad Daif and other senior Hamas leaders who planned and participated in the October 7th massacre. The remaining question about Sinwar is open. There’s speculation that Sinwar is surrounded by hostages, and therefore a strike on him could also kill hostages.</p>\n\n\n\n<p>There are constant headlines and proposals about a diplomatic solution. Israel is seeking the safe return of all hostages and ensuring Gaza will never again pose a threat. I’m waiting and watching just like you.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Impact of Weapon Sales Restrictions on Israel</h3>\n\n\n\n<h4 class=\"wp-block-heading\"><em>Question from Winno on Instagram:</em></h4>\n\n\n\n<p>&#8220;To what extent are halting weapon sales threatening Israel’s war goals and defense capabilities, and is this more of a medium-term problem?&#8221;</p>\n\n\n\n<p>Yes, I’ve been following this story. There were headlines about Germany quietly participating in an arms embargo against Israel by delaying shipments of parts and supplies. A similar situation happened in the UK. This trend is disturbing, but I cannot say how it affects military operations directly. However, Israel’s defense planners are undoubtedly taking all necessary steps to ensure they have what they need for military operations.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Media Bias Against Israel in the UK</h3>\n\n\n\n<h4 class=\"wp-block-heading\"><em>Question from Katie on Instagram:</em></h4>\n\n\n\n<p>&#8220;In the UK, all broadcasters are twisting this whole story against Israel. How on Earth do we correct this?&#8221;</p>\n\n\n\n<p>The one thing you can do is hold the line yourself. Don’t let yourself be bullied by people who claim that Israel deserves to lose this war or that Hamas has a point. You may not be able to change the political reality or the media in other countries, but you can stand strong in support of Israel. Israel will continue fighting until its citizens are safe, and the rest of the world will have to accept that fact.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Post-Debate Availability</h3>\n\n\n\n<h4 class=\"wp-block-heading\"><em>Question from Alysia:</em></h4>\n\n\n\n<p>&#8220;Will the debate between Alon and Massan be online after it goes live?&#8221;</p>\n\n\n\n<p>Yes, thank you for asking. This debate is a significant event, and we’re calling it the &#8220;Debate of the Century.&#8221; It will take place Saturday night at 8:00 p.m. New York time, which is 3:00 a.m. in Israel. If you&#8217;re in Israel and can’t watch at 3:00 a.m., don’t worry! The entire debate will be published by Open to Debate, the organizers, on their YouTube channel, and we will also be sharing it on our social media platforms. So, if you&#8217;re unable to watch it live at 8:00 p.m. Eastern or 3:00 a.m. Israel time, you will still have the chance to watch the whole debate. You’ll be able to witness Alon Levy debate and defeat Massan, and show that Israel&#8217;s actions in Gaza were justified.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks from Daniel Rubenstein</h3>\n\n\n\n<p>That’s all the time we have for in this live Daily Briefing. If I didn’t get to your question, feel free to message me on my own platforms. I&#8217;m Daniel Rubenstein, and this was the live Daily Briefing from the Israeli Citizen Spokesperson&#8217;s Office. Have a great weekend, and we’ll see you back here for the live session on Sunday.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Alon Levy will debate <a  href=\"https://iron-swords.co.il/t/al-jazeera/\">Al Jazeera</a>&#8216;s Massan in New York on September 21st. Attend live or stream via social media. <a  href=\"/hezbollah\">Hezbollah</a> mourns 10 terrorists, and <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> faces false accusations. <a  href=\"https://iron-swords.co.il/t/the-un/\">The UN</a> targets Israel, demanding settlement evacuations. <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>’s plot to attack Israel was foiled. Israel’s defense efforts continue amidst global pressure.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312
    ],
    "class_list": [
        "post-17719",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "en",
    "translations": {
        "en": 17719
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17719",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17719"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17719/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17721,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17719/revisions/17721"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17719"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17719"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17719"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}