{
    "id": 17859,
    "date": "2024-09-24T15:00:00",
    "date_gmt": "2024-09-24T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17859"
    },
    "modified": "2024-09-28T18:07:30",
    "modified_gmt": "2024-09-28T15:07:30",
    "slug": "hezbollah-puts-lebanese-civilians-in-grave-danger-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-puts-lebanese-civilians-in-grave-danger-daniel-rubenstein/",
    "title": {
        "rendered": "Hezbollah Puts Lebanese Civilians in Grave Danger | Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Puts Lebanese Civilians in Grave Danger | Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/7YpV0XOQbGk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Everyone, the <strong>Eylon Levy vs. Mei Hassan</strong> debate is live. You can find the debate highlights live on our YouTube page as <strong>Ry Citizen Spokesperson&#8217;s Office</strong>, and the full debate is on the <strong>State of a Nation Podcast YouTube page</strong>. You’ve got to watch the whole thing! See how <strong>Eylon dealt with Mei Hassan</strong>—it’s a must-watch TV.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Is Israel Occupying Lebanon?</strong></h3>\n\n\n\n<p>Now on with the daily briefing. I have a question: <strong>Is Israel occupying Lebanon?</strong> If yes, since when? If no, then why did <strong>Hezbollah</strong> start a war in Lebanon?</p>\n\n\n\n<p>I ask because people say that occupation is the core of the problem, but Israel is <strong>not occupying Lebanon</strong>. There’s a border between Israel and Lebanon, a border marked by the United Nations. <strong>Israel would be very happy to never cross it</strong>, but Hezbollah had other ideas.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hezbollah&#8217;s War Against Israel</strong></h3>\n\n\n\n<p><strong>Hezbollah</strong> joined <strong>Hamas’s war</strong> a year ago because <strong>Iran</strong> told Hezbollah to open a second front against Israel. Hezbollah launched <strong>9,000 rockets, anti-tank missiles, and suicide drones</strong>. What did people expect Israel’s response to be? Diplomacy?</p>\n\n\n\n<p>Israeli military action has <strong>failed to persuade Hezbollah to stop attacking Israel</strong> for a year. Israel has warned Hezbollah to back off or be pushed away. <strong>Hezbollah hasn’t backed off</strong>.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Operation Northern Arrows</strong></h3>\n\n\n\n<p>A lot has happened recently. The <strong>Israel Defense Forces (IDF)</strong> declared the start of <strong>Operation Northern Arrows</strong>. The IDF struck <strong>hundreds of Hezbollah targets</strong> in Lebanon, including command posts and missiles aimed at Israelis.</p>\n\n\n\n<p><strong>Israeli leaders</strong>, from the Prime Minister to military officials, have issued multiple warnings to Lebanese civilians to distance themselves from Hezbollah’s military infrastructure and to evacuate areas <strong>around Hezbollah strongholds</strong> in southern Lebanon.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hezbollah&#8217;s Tactics in Civilian Areas</strong></h3>\n\n\n\n<p><strong>Hezbollah uses people’s homes to store and launch rockets and missiles.</strong> Hezbollah pays civilians in southern Lebanon to use rooms in their homes for these purposes. Former Prime Minister <strong>Naftali Bennett</strong> tweeted about this, and you should read it.</p>\n\n\n\n<p>Some people supplement their income by renting out a room on Airbnb, but in Lebanon, people supplement their income by renting out rooms to Hezbollah rockets. If terrorists store missiles in your house and you get paid for it, is your house a <strong>legitimate military target</strong>? It may be.</p>\n\n\n\n<p>That’s why the IDF has issued warnings, giving people time to move away from missiles hidden in residential areas. <strong>Videos on social media</strong> show large explosions in homes that prove <strong>Hezbollah hid powerful weapons</strong> in these places.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hezbollah&#8217;s Dangerous Arsenal</strong></h3>\n\n\n\n<p>One missile, which the military destroyed before it could be fired, was <strong>identical</strong> to the one that killed <strong>12 Druze children</strong> playing soccer in <strong>Majdal Shams</strong> in northern Israel at the end of July.</p>\n\n\n\n<p><strong>Hezbollah and Hamas</strong> have the same strategy: they fight wars from civilian areas, target Israeli civilians, and then hope international pressure will force Israel to surrender when it defends itself.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hezbollah&#8217;s Attacks on Palestinian Towns</strong></h3>\n\n\n\n<p>Here’s an angle you might not have heard about: some of the rockets <strong>Hezbollah fired</strong> actually struck <strong>Palestinian towns</strong> in the West Bank. <strong>Hezbollah is attacking Palestinians.</strong> They also fired rockets at the <strong>Israeli Arab city of Nazareth.</strong></p>\n\n\n\n<p>I think you’ve heard of Majdal Shams, where <strong>Hezbollah killed 12 children</strong>. <strong>Christians, Muslims, Druze, Jews</strong>—Hezbollah has targeted them all. This isn’t new.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hezbollah&#8217;s History of Targeting Arabs</strong></h3>\n\n\n\n<p>In 2006, when <strong>Hezbollah started a war</strong> by ambushing Israeli soldiers, they also <strong>rocketed Arab towns</strong> across northern Israel. <strong>43% of those killed in Israel</strong> during that war were Arabs. Hezbollah’s rockets even hit the <strong>West Bank</strong> back then.</p>\n\n\n\n<p>Hezbollah doesn’t care about <strong>human life</strong>, whether it’s Arab or Jewish. Just like <strong>Hamas</strong>, they fight with no regard for the lives of Arabs or Jews.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hezbollah&#8217;s Role as Iran&#8217;s Proxy</strong></h3>\n\n\n\n<p>Let’s remember the big picture: <strong>Hezbollah</strong> is not an independent actor. <strong>It is trained by Iran, financed by Iran, supplied by Iran, and ordered by Iran.</strong> Hezbollah is <strong>an Iranian proxy army</strong>.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>World Leaders&#8217; Silence on Hezbollah</strong></h3>\n\n\n\n<p>After a year of war with Hezbollah, it’s fair to ask: <strong>Where are world leaders?</strong> Where is the <strong>United Nations, the United States, the UK, France, Germany, the government of Lebanon?</strong></p>\n\n\n\n<p>I’ll tell you—they’re hiding. No one is willing to say what needs to be said clearly: <strong>Hezbollah needs to stop attacking Israel</strong>.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Israeli Civilians Deserve Safety</strong></h3>\n\n\n\n<p>The people of <strong>northern Israel</strong> need to be able to return to their homes safely without <strong>Hezbollah aiming anti-tank missiles at them</strong>. That’s the bottom line, and it’s not too much to ask. But all we get from world leaders are <strong>clichés, non-statements, and calls for de-escalation</strong>. Right now, it feels like Israel is on its own.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Question: Is Hezbollah Popular in Lebanon?</strong></h3>\n\n\n\n<p>We have a number of questions coming in. <strong>Adena on Instagram</strong> asks:</p>\n\n\n\n<p><strong>Is Hezbollah popular among the people of Lebanon?</strong></p>\n\n\n\n<p>In one word, <strong>no</strong>. Hezbollah is <strong>not popular</strong> among the people of Lebanon. However, Hezbollah is the <strong>strongest power</strong> in Lebanon. It’s a divided country—split between <strong>Christians, Sunni Muslims, Shia Muslims, and Druze</strong>.</p>\n\n\n\n<p>Hezbollah has enough power, weapons, and votes to <strong>participate in the Lebanese government</strong>. Although Lebanon is supposed to <strong>disarm Hezbollah</strong>, according to international law, Hezbollah has enough control over the government to block any such decision.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>UN Security Council Resolution 1701 and Hezbollah</strong></h3>\n\n\n\n<p>Many are asking about <strong>UN Security Council Resolution 1701</strong> and its relevance to the current situation.</p>\n\n\n\n<p>This resolution was passed <strong>18 years ago</strong> in the summer of 2006 and ended the previous war between Israel and Lebanon. It called for <strong>Hezbollah to disarm</strong> and for the <strong>Lebanese Army</strong> to take control of southern Lebanon.</p>\n\n\n\n<p>But Hezbollah did not disarm. Instead, <strong>Iran supplied Hezbollah</strong> with billions of dollars in weapons and training. <strong>Resolution 1701</strong> failed to resolve the conflict between Israel and Hezbollah.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Will a Ground Invasion Start a Wider War?</strong></h3>\n\n\n\n<p><strong>Itai Hagag on Instagram</strong> asks:</p>\n\n\n\n<p><strong>Will a ground invasion in Lebanon start a regional wider war as the West fears?</strong></p>\n\n\n\n<p>It’s hard to predict. <strong>War is unpredictable.</strong> The Israeli military has not published its plans, but what we know is that <strong>Hezbollah started this war</strong>. The goal of Israel’s military operations is to enable <strong>the people of Israel to go home</strong> safely.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>IDF Strikes on Hezbollah in Beirut</strong></h3>\n\n\n\n<p>We’re getting reports of another targeted strike in <strong>Beirut</strong> by the IDF. Hezbollah’s presence isn’t just in southern Lebanon—it also has a <strong>base in Beirut</strong>, specifically in a neighborhood called <strong>Dahiya</strong>.</p>\n\n\n\n<p>Recent Israeli strikes have affected <strong>Hezbollah’s communication</strong> capabilities. Stories of <strong>pagers and walkie-talkies blowing up</strong> in Hezbollah operatives’ hands have emerged, indicating the challenges Hezbollah now faces in organizing.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Conclusion: Israelis Want to Return Home Safely</strong></h3>\n\n\n\n<p>At the end of the day, the <strong>effectiveness of these strikes</strong> can only be judged by whether <strong>the people of Israel</strong> can return to their homes safely. That’s the goal.</p>\n\n\n\n<p>That’s all the time we have for today. Thank you for watching this live broadcast from the <strong>Israeli Citizen Spokesperson&#8217;s Office</strong>. We’ll be back tomorrow at 3 p.m. Israel time (8:00 a.m. on the East Coast).</p>\n\n\n\n<p>If I didn’t get to answer your question, feel free to reach out on social media. <strong>I’m Daniel Rubenstein</strong>, and I wish you a lovely day.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The <a  href=\"https://iron-swords.co.il/t/eylon-levy/\">Eylon Levy</a> vs. Mei Hassan debate is live, featuring intense discussions on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>, <a  href=\"/hezbollah\">Hezbollah</a>, and Lebanon. Israel has launched Operation <a  href=\"https://iron-swords.co.il/t/northern-arrows/\">Northern Arrows</a>, striking <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a> targets in response to continued attacks. Despite international silence, Israel aims to ensure the safety of its citizens under Hezbollah&#8217;s growing threat.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312
    ],
    "class_list": [
        "post-17859",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "en",
    "translations": {
        "en": 17859
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17859",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17859"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17859/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17860,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17859/revisions/17860"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17859"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17859"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17859"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}