{
    "id": 17595,
    "date": "2024-09-09T15:00:00",
    "date_gmt": "2024-09-09T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17595"
    },
    "modified": "2024-09-16T22:49:21",
    "modified_gmt": "2024-09-16T19:49:21",
    "slug": "hezbollah-drone-strikes-israeli-apartment-building-ashley-waxman-bakshi",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-drone-strikes-israeli-apartment-building-ashley-waxman-bakshi/",
    "title": {
        "rendered": "Hezbollah Drone Strikes Israeli Apartment Building | Ashley Waxman Bakshi"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Drone Strikes Israeli Apartment Building | Ashley Waxman Bakshi\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/smNqCYMlfaY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today marks day 339 of the October 7th War. <strong>Breaking news</strong> has just come in: 13 Palestinians have crossed into Israel without permits and have been apprehended by Israeli police on Highway number six. This is breaking news, and further details are not yet available.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Illegal Palestinian Crossings into Israel</h3>\n\n\n\n<p>This event raises the question: Why are Palestinians attempting to enter Israel illegally? As tensions in the region continue, families in Israel’s North are once again running to shelters. <strong>Sirens rang out</strong> this morning, indicating potential attacks by the Hezbollah Terror Army from Lebanon.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah Attacks in Northern Israel</h3>\n\n\n\n<p>In <strong>Naharia</strong>, an explosive drone slammed into a residential building, and the people of Israel’s North were awakened at <strong>2:00 a.m.</strong> and again at <strong>5:00 a.m.</strong> as <strong>Hezbollah</strong> fired rockets. For the past 11 months, since Hezbollah joined the war on October 8th, <strong>Iran’s Terror Army</strong> in Lebanon has launched nearly 8,000 rockets, missiles, and suicide drones at Israel, displacing <strong>60,000 people</strong>.</p>\n\n\n\n<p>Hezbollah has explicitly stated its aim to kill Israeli civilians. In <strong>Majal Shams</strong>, a <strong>rocket attack in July</strong> claimed the lives of 12 Arabic-speaking Druze children as they played soccer. Diplomatic efforts to end Hezbollah’s attacks are ongoing, but Israel’s military stands ready to respond within minutes if given the order.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The War Against Israel: Iran’s Influence</h3>\n\n\n\n<p>The <strong>Iranian regime</strong> supports Hezbollah and fuels the conflict. If Hezbollah does not stop, Israel will do what is necessary to restore security to the North and allow displaced citizens to return home.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hostages in Hamas&#8217; Terror Dungeons</h3>\n\n\n\n<p>We are learning more about the horrific conditions endured by Israeli hostages in <strong>Hamas&#8217; terror dungeons</strong> in Gaza. Israeli media reports that six Israeli hostages were executed by Hamas while being held in cramped, airless tunnels with no toilets, showers, or sufficient food. <strong>Edi</strong>, one of the executed hostages, weighed just <strong>36 kilograms (80 pounds)</strong> at the time of her death. The remaining hostages face similarly unbearable conditions.</p>\n\n\n\n<p><strong>Massive pressure</strong> is needed on Hamas and its backers—<strong>Qatar, Turkey, and Iran</strong>—to secure the release of the hostages before it is too late.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Humanitarian Aid in Gaza</h3>\n\n\n\n<p>As for the <strong>humanitarian situation in Gaza</strong>, <strong>208 trucks</strong> carrying aid entered the region from Israel yesterday. Out of these, <strong>175 trucks</strong> entered through the <strong>Kerem Shalom Crossing</strong>. However, <strong>43 trucks</strong> were left uncollected, highlighting failures in coordination, particularly by the <strong>United Nations</strong>. Israel continues to face unjust blame for shortages, while essential infrastructure, such as fuel and cooking gas, is still being delivered.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Polio Vaccination Campaign Amid Conflict</h3>\n\n\n\n<p>In other news, yesterday marked the fourth and final day of the second stage of the <strong>preemptive polio vaccination campaign</strong>, during which <strong>44,454 children</strong> were vaccinated. However, Hamas continues to attack Israel, hold hostages, and threatens further atrocities.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Military Operations in the West Bank: Israel&#8217;s Fight Against Terrorism</h3>\n\n\n\n<p>A question from Instagram asks about the <strong>recent Israeli military operations in Jenin</strong>. While many associate Hamas with Gaza, Hamas and other terrorist organizations like <strong>Islamic Jihad</strong> operate in the West Bank as well. These groups are actively planning and executing attacks against Israel. Israeli soldiers have been killed in these operations, showing the intensity of the battle. Images from Jenin show militants, specifically <strong>Islamic Jihad terrorists</strong>, invoking historical references to the murder of Jews, highlighting the deep-rooted hatred driving these attacks.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israeli Air Strikes in Syria: Iran’s Proxies at Play</h3>\n\n\n\n<p>A headline on CNN reports that <strong>at least 16 people were killed</strong> in Israeli airstrikes in Syria. While no specific information is available, it is clear that <strong>Iran</strong>, which orchestrates much of the war against Israel, is responsible. Iran uses Syria as a base for proxy attacks against Israel, and <strong>Israeli airstrikes</strong> target military sites threatening the country’s security.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Qatar’s Role in Hamas Negotiations</h3>\n\n\n\n<p>A question from Instagram Live asks how <strong>Qatar</strong>, a known backer of Hamas, is involved in negotiations. Despite Qatar’s financial and political support for Hamas, it has emerged as a key mediator due to its influence over the group. Qatar maintains strong business ties with the West and seeks to maintain a balance between appeasing Hamas and preserving its Western alliances.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Recent Terrorist Attack on the Israel-Jordan Border</h3>\n\n\n\n<p>Regarding the <strong>terrorist attack by a Jordanian on the Israel-Jordan border</strong> at the Allenby Bridge, <strong>three Israeli civilians</strong> were murdered in cold blood. Sadly, there has been no condemnation from the <strong>Jordanian monarchy</strong>, and celebrations have been reported in the streets of Jordan.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel’s War Goals: Fighting Amid Western Pressure</h3>\n\n\n\n<p>A question from Instagram Live asks how Israel can achieve its war goals while under pressure from the Western world. Israel must balance diplomatic relations with its need to protect its civilians. <strong>Israel’s government and people</strong> understand the importance of defeating not just Hamas but also sending a message to surrounding enemies that Israel will not back down and will defend itself.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Negotiating the Release of Hostages: Complex Obstacles</h3>\n\n\n\n<p>The situation around the release of hostages held by Hamas is complex, with optimism and pessimism fluctuating daily. It is clear that <strong>Hamas</strong> consistently rejects deals, despite <strong>Israel</strong> making numerous concessions. The <strong>United States</strong> is showing increased urgency in these negotiations, and there is hope that a deal can be brokered without compromising Israel’s security.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Anti-Semitism and Safety Abroad</h3>\n\n\n\n<p>A question from YouTube Live asks about the safety of traveling to countries with rising anti-Semitism, such as <strong>Australia</strong>. While experiences vary, the key takeaway is to be proud of one’s identity. Jews should not hide who they are. The lessons of history remind us that hiding only leads to further persecution.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you for tuning in to today’s live update. We will return tomorrow at <strong>3 p.m. Israel time</strong> (<strong>8 a.m. Eastern time</strong>). Have a safe and quiet day, everyone.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The October 7th War continues with escalating attacks from <a  href=\"/hezbollah\">Hezbollah</a> and <a  href=\"/hamas\">Hamas</a>, leading to civilian casualties and <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a> held in horrific conditions. <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> faces military, diplomatic, and humanitarian challenges, while negotiating for the hostages&#8217; release. Global pressure intensifies, yet Israel remains resolute in defending its people.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        490
    ],
    "class_list": [
        "post-17595",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ashley-waxman-bakshi"
    ],
    "lang": "en",
    "translations": {
        "en": 17595
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17595",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17595"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17595/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17596,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17595/revisions/17596"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17595"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17595"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17595"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}