{
    "id": 17715,
    "date": "2024-09-18T15:00:00",
    "date_gmt": "2024-09-18T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17715"
    },
    "modified": "2024-09-22T22:56:01",
    "modified_gmt": "2024-09-22T19:56:01",
    "slug": "hezbollah-hit-with-most-precise-strike-in-history-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-hit-with-most-precise-strike-in-history-asher-westropp-evans/",
    "title": {
        "rendered": "Hezbollah Hit With Most Precise Strike in History | Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Hit With Most Precise Strike in History | Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/X96FG_E2Ny4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Important Announcement: Debate Event with Elon Levy and Medi Hassan</strong></h2>\n\n\n\n<p>Now I have an important announcement before we start today. This Saturday, September 21st, our very own <strong>Elon Levy</strong> will be debating <strong>Alzer&#8217;s Medi Hassan</strong> in New York City. If you are in New York, you can actually go and buy a ticket yourself and attend in person. If you&#8217;re not attending in person, you&#8217;ll still be able to watch a <strong>live stream</strong> of the event wherever you are in the world. You can also host a <strong>viewing event</strong>, and if you want to host a viewing event, please go to our social media pages and find a link for more info about the debate. It’s in our <strong>Instagram</strong> and <strong>X profiles</strong> right now. If you just click that link, you&#8217;ll find a form to fill out, and we’ll send you all the materials needed to help you have a successful viewing event.</p>\n\n\n\n<p>All the relevant information and links will be on our social media platforms today, so stay tuned for more posts.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Day 348 of the October 7th War</strong></h2>\n\n\n\n<p>Today is <strong>day 348</strong> of the <strong>October 7th War</strong>. Now, you&#8217;ve probably heard by now that <strong>thousands of pages simultaneously exploded in Lebanon</strong> yesterday. No one has taken formal responsibility, but <strong>Hezbollah</strong> is saying that Israel is behind the strike. The detonation of <strong>thousands of Hezbollah-issued pages</strong> at the exact same time is the most precise targeting of combatants in history. Close to <strong>100% of casualties</strong> are Hezbollah, and that is unprecedented in warfare.</p>\n\n\n\n<p>These pinpoint strikes represent a warning to the terror armies of the world: they cannot hide behind any technology to enact their terror agenda. Those, like <strong>Belgium&#8217;s vice prime minister</strong>, who condemn this precise strike as a terror attack, are really telling on themselves. They regularly demand a magic wand war that only injures bad guys, and they actually got it. But it seems <strong>nothing is enough</strong> for them. They’re actually saying no attack on Hezbollah is okay, while any attack on Israel&#8217;s people seems to be okay.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hezbollah&#8217;s Attacks and Casualties</strong></h3>\n\n\n\n<p><strong>Hezbollah</strong>, <strong>Iran’s proxy army in Lebanon</strong>, has launched over <strong>8,000 rockets, missiles, and drones</strong> at Israel since it declared war on <strong>October 8th</strong>, in solidarity with <strong>Hamas&#8217; October 7th massacre</strong>. <strong>60,000 people</strong> have had to flee their homes in <strong>Northern Israel</strong> because Hezbollah is targeting civilians. Hezbollah regularly shoots <strong>guided missiles</strong> at civilian homes in Israel. Hezbollah even fired a <strong>rocket</strong> that murdered a dozen Arabic-speaking children who were playing soccer in a field in Northern Israel.</p>\n\n\n\n<p>Israel already set the gold standard in <strong>combatant to non-combatant casualty ratios</strong> in urban warfare in Gaza, at <strong>1:1 or even better</strong>, meeting and exceeding the ratios of other Western militaries. So let&#8217;s be clear here: it was never about protecting Lebanon&#8217;s civilians; it was always about <strong>Hezbollah&#8217;s continuing assault on Israel’s civilians</strong>.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Hezbollah Beeper Incident</strong></h3>\n\n\n\n<p>Let’s also be clear about something else. What happened wasn’t assorted beepers blowing up around Lebanon; it was <strong>specifically Hezbollah-distributed beepers</strong> that blew up. This means anyone with a beeper must have received them through a Hezbollah distribution network. That’s why <strong>Iran’s ambassador to Lebanon was injured</strong>, and that’s why <strong>dozens of pages exploded in Syria and Iraq</strong>, places where other Iran-backed militias attack Israel from.</p>\n\n\n\n<p>The <strong>UN Special Coordinator for Lebanon</strong> said the detonation of thousands of Hezbollah’s pages marked an extremely concerning escalation. But we must ask the question: <strong>concerning for whom</strong>? Degrading Hezbollah&#8217;s ability to continue murdering people in Israel is not an escalation—it’s an attempt to stop Hezbollah&#8217;s war.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Timeline of Events</strong></h3>\n\n\n\n<p>Hezbollah has been attacking Israel daily since <strong>October 8th</strong>. <strong>Monday evening</strong>, Israel’s cabinet updated its war goals to say that the <strong>60,000 people forced to flee from Israel’s North must be able to return home</strong>. At <strong>2:30 p.m. on Tuesday</strong>, Israel announced it had stopped a Hezbollah plot to <strong>assassinate a senior former security official</strong>. At <strong>3:30 p.m.</strong>, the <strong>beepers blew up</strong> in Beirut.</p>\n\n\n\n<p>Israel has done everything over the last year to avoid escalating the war Hezbollah is fighting, but Hezbollah continues to attack again and again. Israel is saying Hezbollah must back off and <strong>end its war</strong>, or Israel will do what it must to end the war. Hezbollah was warned. The whole world was warned.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Live Questions from the Studio Audience</strong></h2>\n\n\n\n<p>Thank you, Asher. This first question is about an <strong>IDF press release</strong> that went out this morning, which said that overnight, a <strong>drone from Iraq</strong> was on its way to Israel and was intercepted.</p>\n\n\n\n<p>Is Israel in some kind of war with Iraq?</p>\n\n\n\n<p>This is a very pertinent question and relates precisely to the point we keep making here at the <strong>Israeli Citizen Spokesperson&#8217;s Office</strong>. Israel is facing a <strong>war on seven fronts</strong>. Let’s be clear here: we’re talking about <strong>Gaza, the West Bank, Lebanon, Syria, Iraq, Iran</strong>, and <strong>the wider diaspora community</strong>. We need to be absolutely clear: this attack from Iraq is part of the wider network we are used to seeing.</p>\n\n\n\n<p>We are seeing <strong>Iranian-backed militias</strong> spreading their web throughout the entire region in an attempt to surround Israel. That is exactly why we saw a <strong>ballistic missile cross Israel coming from Yemen</strong> and why the <strong>Houthis pirate militias</strong> attacked from the south.</p>\n\n\n\n<p>The <strong>beepers</strong> that blew up were not just from Hezbollah’s network inside Lebanon; they also detonated in <strong>Syria and Iraq</strong>. This shows us that Hezbollah’s network, funded and backed by <strong>Iran</strong>, extends throughout the region, and <strong>Israel must confront it</strong> wherever it exists to maintain peace, stability, and security in the region.</p>\n\n\n\n<p>This is a question from our Instagram. The <strong>Israel Defense Forces</strong> on Wednesday announced the deaths of <strong>four Israeli soldiers</strong> and the injury of several others during fighting in the southern Gaza Strip the day before.</p>\n\n\n\n<p>What is going on in the southern Gaza Strip? Is there still fighting?</p>\n\n\n\n<p>Yes, unfortunately, there is still fighting. As we heard the terrible news, four more soldiers were killed in <strong>southern Gaza</strong> in a <strong>booby-trapped home</strong>, a tactic Hamas has used extensively during this war.</p>\n\n\n\n<p>Hamas has turned <strong>civilian infrastructure</strong> into military strongholds, continuing to endanger civilians on both sides. We are seeing this in urban warfare environments across Gaza. <strong>Hamas continues to regroup</strong> and attack in whatever way they can, even as <strong>Israel successfully removes much of their terror infrastructure</strong>.</p>\n\n\n\n<p>This question came through on our Instagram live. Why isn’t the <strong>IDF</strong> taking responsibility for the precision pager strike?</p>\n\n\n\n<p>At this time, we don’t know for certain who was behind the precision pager strike. There are reports and accusations from Hezbollah and Lebanon, and some <strong>US officials</strong> are weighing in, but Israel is not in the business of revealing every <strong>tactic</strong> it uses.</p>\n\n\n\n<p>What is important is the <strong>success</strong> of the operation, which <strong>wounded thousands of Hezbollah militants</strong> who would otherwise continue their assault on Israel. The operation has prevented further harm to <strong>Israel’s civilians</strong>, including the <strong>12 Druze children</strong> tragically killed by Hezbollah’s rockets. This kind of operation is critical for peace and stability, regardless of who was behind it.</p>\n\n\n\n<p>The current headline in <strong>The Times of Israel</strong> reads: <strong>Ex-Defense Minister Yaalon was target of Hezbollah bomb attack in Tel Aviv last year</strong>. This article mentions a bomb attack in <strong>September 2023</strong> before October 7th, where Hezbollah tried to target the former Israeli defense minister.</p>\n\n\n\n<p>Does it surprise you that Hezbollah intended to attack in Israel a month before October 7th?</p>\n\n\n\n<p>Certainly, it doesn’t surprise me. These are the aims of the <strong>terrorist militias</strong> surrounding Israel. <strong>Israel is surrounded on almost all sides</strong> by Iran-backed proxy militias whose sole purpose is to destabilize Israel. This assassination attempt highlights Israel’s constant fight against <strong>terrorist forces</strong> that seek to harm and destroy it, even during ceasefire periods.</p>\n\n\n\n<p>It’s fortunate that <strong>Israeli intelligence</strong> was able to prevent this attack, showing once again the <strong>commitment and skill</strong> of <strong>Israel’s defense forces</strong>.</p>\n\n\n\n<p>This is a question for the people of <strong>Lebanon</strong>. What is your message to them, especially those who have no connection to Hezbollah and are worried about a wider war?</p>\n\n\n\n<p>I would say this to the people of Lebanon: <strong>Hezbollah</strong> are the oppressors. They are <strong>taking your resources</strong> to build their military infrastructure, while you struggle to power your homes and put food on your tables.</p>\n\n\n\n<p>Hezbollah is aligned with <strong>Iran’s interests</strong>, not yours. Israel has no issue with the Lebanese people. Israel’s issue is with Hezbollah, who have co-opted your country, dragged you into wars, and <strong>taken control</strong> of your political and military forces.</p>\n\n\n\n<p>There is a future for <strong>peace between Israel and Lebanon</strong>, but that future depends on <strong>removing Hezbollah’s influence</strong>. Look at the <strong>Abraham Accords</strong>—peace is possible in the region. It is possible for <strong>Lebanon</strong> too.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Closing Remarks</strong></h2>\n\n\n\n<p>That’s all we have time for today on the <strong>Daily Briefing</strong>. Be sure to check in again tomorrow at <strong>3 p.m. Israel time</strong> (8 a.m. Eastern) for updates on everything happening in the region.</p>\n\n\n\n<p>Also, don’t forget to check the <strong>upcoming debate</strong> between <strong>Elon Levy</strong> and <strong>Medi Hassan</strong> this Saturday. It’s going to be a fascinating discussion, and it’s definitely not one to miss. You can find all the details on our <strong>social media</strong> pages. Make sure you stay informed, and keep an eye on the links we’ve provided to follow the live stream or host your own viewing event.</p>\n\n\n\n<p>I’m <strong>Ash Westrop Evans</strong>, and I want to thank everyone for tuning in today. We’ll continue to bring you the latest updates and information as the situation unfolds. Please stay safe, stay informed, and we’ll see you again soon. Thanks for watching!</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>In today&#8217;s briefing, Elon Levy&#8217;s upcoming debate with Medi Hassan was announced, and key <a  href=\"https://iron-swords.co.il/c/updates/\">updates</a> on the October 7th War were discussed, including <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s precise strikes against <a  href=\"/hezbollah\">Hezbollah</a> in Lebanon. Ongoing fighting in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> continues, and Israeli officials emphasized <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>&#8216;s role in destabilizing Lebanon and the region.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306
    ],
    "class_list": [
        "post-17715",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans"
    ],
    "lang": "en",
    "translations": {
        "en": 17715
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17715",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17715"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17715/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17717,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17715/revisions/17717"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17715"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17715"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17715"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}