{
    "id": 17861,
    "date": "2024-09-25T15:00:00",
    "date_gmt": "2024-09-25T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17861"
    },
    "modified": "2024-09-28T18:29:32",
    "modified_gmt": "2024-09-28T15:29:32",
    "slug": "hezbollah-fires-missile-at-tel-aviv-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-fires-missile-at-tel-aviv-ruth-wasserman-lande/",
    "title": {
        "rendered": "Hezbollah Fires Missile at Tel Aviv | Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Fires Missile at Tel Aviv | Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/GXLnwc3Go7w?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Missile Attack in Central Israel</h3>\n\n\n\n<p>Millions of children, parents, and grandparents in central Israel woke up to air raid sirens at 6:30 a.m. The sirens meant that a missile was on its way, and it was time to run to the shelter. The missile was fired by Hezbollah, the proxy army of the Islamic Republic of Iran in Lebanon. Thankfully, the missile was intercepted before it struck Tel Aviv.</p>\n\n\n\n<p>A few hours earlier, another proxy militia of the Islamic Republic of Iran, this time in Iraq, sent an attack drone into northern Israel. In fact, Israel is fighting on seven fronts. Over the past year, the Islamic Republic of Iran and its proxies have attacked Israelis from Gaza, the West Bank, Lebanon, Syria, Iraq, Yemen, and from Iran itself. The Iranian regime wants to light the Middle East on fire. The pyromaniacs in Iran have ignited a ring of fire around Israel, wanting to engulf Israel in flames and watch the entire region burn.</p>\n\n\n\n<p>Israel, however, can and will extinguish those flames to protect its people.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Strategy and the UN&#8217;s Role</h3>\n\n\n\n<p>Today&#8217;s missile was fired by Hezbollah from a parking lot of a civilian building in a southern Lebanese village. Hezbollah, like Hamas, fully embraces the strategy of embedding itself among civilians and shooting from behind them, endangering civilians while claiming to be the so-called protector of Lebanon. The UN and others play along with this strategy, condemning Israel for defending itself against Hezbollah’s attacks, likely due to a lack of courage to stand up to the Islamic Republic of Iran.</p>\n\n\n\n<p>The United Nations ignores its own Security Council Resolution 1701, which ended Israel’s last war with Hezbollah in 2006. This resolution was supposed to prevent another war, but it has clearly failed. The resolution demanded that UN peacekeeping troops in Lebanon stop Hezbollah from hostile activities near Israel’s border, and also called for Hezbollah to disarm. Yet, none of these things have happened.</p>\n\n\n\n<p>The UN peacekeepers have failed to stop Hezbollah from launching nearly 9,000 rockets, missiles, and drones at Israel over the past year—completely unprovoked by Israel. For 18 years, the UN has watched Hezbollah, a designated terrorist organization, prepare for an attack on Israel without intervening.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel’s Response and the Impact of Restraint</h3>\n\n\n\n<p>Hezbollah needs to stop attacking Israel. Israelis in northern Israel need to return to their homes safely. The Israeli government and military will do everything possible to achieve these objectives with or without global support, despite practicing incredible restraint for the past 11 months while Hezbollah bombarded northern Israel without provocation. Israelis were frustrated with their government for not doing more to allow civilians to return to their homes, children to their schools, and business owners to their businesses.</p>\n\n\n\n<p>No other country would have shown such restraint for 11 months if their citizens were being bombarded. Imagine if your country’s neighbor sent even one rocket into your city. What would you expect your leadership to do?</p>\n\n\n\n<h3 class=\"wp-block-heading\">Audience Questions</h3>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question 1: What Was Hezbollah&#8217;s Plan?</strong></h4>\n\n\n\n<p>Hezbollah, a designated terrorist organization, had long been planning an attack similar to what Hamas did on October 7th. They dug tunnels and trained a commando force, known as Radwan, to carry out the same kind of massacre, rape, and carnage seen in Israel. Hezbollah, like Hamas in the south and in the West Bank, is an arm of the Islamic Republic of Iran. Iran’s goal is to wage war against Israel by surrounding it, and also against the West simultaneously.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question 2: Assessment of Hezbollah’s Strength</strong></h4>\n\n\n\n<p>While I don’t know the exact numbers, Hezbollah’s senior leadership and military command have been decimated. This is significant because it disrupts their terrorist activities. The Baper operation also targeted many senior commandos, not at the very top level, but those involved in daily terrorist activities. It was a very successful and meaningful attack.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question 3: Will the IDF Enter Southern Lebanon?</strong></h4>\n\n\n\n<p>This is a concern for many. Whether the IDF enters Lebanon depends on whether Hezbollah stops its unprovoked missile and rocket attacks on Israel. For the past 11 months, Hezbollah has been bombing Israel without provocation. They must be pushed back from Israel’s border to the Litani River, as stipulated by UN Resolution 1701. However, I do not believe Hezbollah will comply voluntarily; they must be forced to do so.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran’s Influence and Regional Instability</h3>\n\n\n\n<p>The new Iranian president recently spoke at the United Nations, but it is important to distinguish between the people of Iran, many of whom oppose this regime, and the Islamic Republic regime itself. The current leadership terrorizes its own people, particularly women, while hypocritically speaking of human rights and care for Palestinian civilians. Meanwhile, Palestinians in Lebanon live as second-class citizens under Hezbollah’s rule, denied basic rights.</p>\n\n\n\n<p>Iran’s influence extends throughout the region. The country is using Iraq as a base to send missiles and drones against Israel, with Shiite militias from Iraq and Yemen being sent to Syria. Iran’s aim is not just to destroy Israel but to dominate the entire region by destabilizing countries from within. Iraq is just one example.</p>\n\n\n\n<p>Thank you for joining us today. We hope to see you again at 3 p.m. Israel time tomorrow.</p>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> faces ongoing attacks from <a  href=\"/hezbollah\">Hezbollah</a>, the proxy army of <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>, with missile strikes and drone assaults. Despite repeated violations of UN resolutions, the international community fails to act. Israel, showing remarkable restraint, continues to defend its people, determined to ensure the safety of its citizens amidst escalating regional tensions.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1586,
        492
    ],
    "class_list": [
        "post-17861",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-northern-arrows",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 17861
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17861",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17861"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17861/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17862,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17861/revisions/17862"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17861"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17861"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17861"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}