{
    "id": 17604,
    "date": "2024-09-15T15:00:00",
    "date_gmt": "2024-09-15T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17604"
    },
    "modified": "2024-09-17T07:49:09",
    "modified_gmt": "2024-09-17T04:49:09",
    "slug": "houthis-fire-ballistic-missile-at-israel-ashley-waxman-bakshi",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/houthis-fire-ballistic-missile-at-israel-ashley-waxman-bakshi/",
    "title": {
        "rendered": "Houthis fire ballistic missile at Israel | Ashley Waxman Bakshi"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Houthis fire ballistic missile at Israel | Ashley Waxman Bakshi\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/8HUlRzm4gVs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h2 class=\"wp-block-heading\">Debate Announcement</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Eylon Levy vs. Medi Hassan Debate</h3>\n\n\n\n<p>This Saturday, September 21st, our very own Eylon Levy will be debating Al Jazeera&#8217;s Medi Hassan in New York City. We will be sharing all the relevant information on our platforms about how to watch the debate live, how to host a watch party, and how to join a watch party. Make sure you&#8217;re following for updates—more info is coming very soon.</p>\n\n\n\n<div class=\"wp-block-gutenverse-divider guten-element guten-divider guten-XfAkUU\"><div class=\"guten-divider-wrapper\"><div class=\"guten-divider-default guten-divider-line guten-divider-regular\"></div></div></div>\n\n\n\n<p>Today marks day 345 of the October 7th War. This morning, I woke up to sirens at 6:30 a.m., along with millions of Israelis. The Houthis in Yemen, backed by Iran, fired an Iranian ballistic missile at central Israel. Thankfully, it was intercepted by Israel’s air defenses before it could strike the Tel Aviv metropolitan area.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran’s Expanding Influence in the Region</h3>\n\n\n\n<p>Israel has no conflict with Yemen; we should be at peace, not at war. But the Houthi terror army has turned Yemen into one front of Iran&#8217;s seven-front war against the Jewish state. Iran is utilizing militias across Yemen, Iraq, Syria, Lebanon, and terrorist groups like Hamas and the Palestinian Islamic Jihad in Gaza and the West Bank to destroy Israel. Simultaneously, Iran destabilizes Arab societies with chaos and bloodshed.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran&#8217;s Escalation: A Ring of Fire</h3>\n\n\n\n<p>Iran is trying to ignite a ring of fire around Israel, and they are more than willing to burn the Arab world along the way. However, Israel is extinguishing these flames. As we continue to break Hamas in Gaza, we have already struck the Houthis in Yemen. Some reports even suggest Israel eliminated Hamas leader Isma Hanah in Tehran, Iran’s capital.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israel’s Missile Defense and the Threat from Hezbollah</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Challenges with Missile Defense</h3>\n\n\n\n<p>There are reports that the first tier of Israel’s air defense may have missed intercepting today’s ballistic missile, but the second tier was successful. No defense system is 100% effective. This is why Israel&#8217;s right to self-defense is about more than just shooting down missiles. Israel must destroy their launchers as well.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Attacks from Lebanon</h3>\n\n\n\n<p>This morning, residents in Northern Israel had to run to shelters as Hezbollah, Iran’s terror army in Lebanon, launched 40 rockets, missiles, and drones at Israeli homes. Hezbollah has launched over 200 such attacks in just the last week and over 8,000 since October 8th, when they joined Hamas’s brutal massacre of Israeli civilians. Sixty thousand people have already fled their homes in Northern Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel’s Response to the Threat from Hezbollah</h3>\n\n\n\n<p>Israel will not allow Hezbollah to continue its murder campaign. Our military is ready to remove this threat, as it has done with threats from Yemen and Hamas. Those who stand with Israel know that missiles launched by Iran, regardless of the origin, are escalations that require strong defense.</p>\n\n\n\n<h2 class=\"wp-block-heading\">UNRWA&#8217;s Compromise with Hamas</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Philippe Lazzarini’s Admission</h3>\n\n\n\n<p>UNRWA’s commissioner, Philippe Lazzarini, admitted recently that he has no way to know if Hamas infiltrated UNRWA. Just two days ago, during a BBC interview, he struggled to justify his constant accusations against Israel, even as overwhelming evidence shows Hamas’s deep compromise of the organization.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas Profits from UNRWA Aid</h3>\n\n\n\n<p>A recent report recorded Hamas terrorists boasting that their warehouses were overflowing with UNRWA-delivered aid, with so much diesel, trucks, and pallets of food that they couldn’t store it all. Hamas has also made half a billion dollars selling this aid, with UNRWA paying staff in US dollars, enriching Hamas money changers who earned $1 billion in commissions.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Time to Shut Down UNRWA</h3>\n\n\n\n<p>UNRWA is being sued by October 7th victims because of its links to Hamas. Many of its staff members are affiliated with Hamas, some of whom participated in the October 7th massacre. UNRWA is effectively Hamas’s humanitarian front. It’s time to shut down Hamas’s UN front, stop the financing of murder, and fire Lazzarini, as Switzerland has already done by defunding UNRWA.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A Section</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Social Media: What Will Israel Do in Response to a Missile from Yemen?</h3>\n\n\n\n<p><strong>Question</strong>: After a drone from Yemen struck Tel Aviv some time ago and killed an Israeli citizen, Israel struck back in Yemen quite forcefully. What do you expect Israel will do in response to a ballistic missile from Yemen striking Israel?</p>\n\n\n\n<p><strong>Answer</strong>: As I mentioned earlier, Yemen should be at peace with Israel. We don’t want war with Yemen, with the Houthis, or with Iran. But when attacked, Israel does everything in its power to defend its civilians. Whether that means taking out their missile launchers or any other necessary action, Israel will do whatever it can to protect its citizens, no matter where the threat originates. It’s important to note that people around the world may claim Israel is escalating the war, but we’re already in a regional war. When Israel defends itself, it is simply a defensive war. The true escalation comes from Iran, Hezbollah, the Houthis, and Hamas. If no one attacks Israel, we seek peace with everyone in the region.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Instagram Stories: Potential Confrontation with Hezbollah</h3>\n\n\n\n<p><strong>Question</strong>: There’s a headline in <em>The Times of Israel</em> saying the prime minister of Israel warned that Israel faces a &#8220;large-scale confrontation with Hezbollah in the near future.&#8221; What do you think will spark this confrontation, and can anything be done to avoid it?</p>\n\n\n\n<p><strong>Answer</strong>: The prime minister’s visit to the United Nations is important because our global allies need to understand that Israel will do whatever it takes to defend its sovereign borders. Since October 8th, Hezbollah has been attacking civilian populations, which is a clear violation of international law. Northern Israel has been evacuated for 11 months due to these attacks, and Hezbollah’s actions clearly violate UN Resolution 1701, which calls for their disarmament. Our prime minister will need to call out the hypocrisy of the UN, and hopefully, we’ll gain support from global allies to defend our civilians. Israel will no longer tolerate a terror proxy army on its borders, threatening its people.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from the Audience: The UAE’s Role in Gaza’s Future</h3>\n\n\n\n<p><strong>Question</strong>: The United Arab Emirates has reportedly vowed that it will not take part in Gaza&#8217;s &#8220;day after&#8221; without Israel agreeing to a clear pathway to a Palestinian state. How do you assess Israel&#8217;s current relations with the UAE, and how can this relationship be used to improve the situation in Gaza and the wider region?</p>\n\n\n\n<p><strong>Answer</strong>: The Abraham Accords are still strong, and our ties with the UAE remain good. People in the West must understand that sometimes diplomatic statements are necessary, but the real discussions happen behind closed doors. The UAE has been working to reduce violence and extremism within its own borders and remains a key ally of Israel and the West. We encourage their involvement in future rebuilding efforts in Gaza, but it’s important that Gaza transitions away from the indoctrination to hate that has been perpetuated under Hamas and UN mechanisms. The people of Gaza need to embrace peace if we are to live side by side peacefully.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from the Audience: The Situation in Northern Gaza and the War’s Status</h3>\n\n\n\n<p><strong>Question</strong>: The Israeli military has ordered residents in northern Gaza to evacuate once again ahead of IDF operations. What is the current status of the war in Gaza? Are there war goals, and is there an end date for major operations?</p>\n\n\n\n<p><strong>Answer</strong>: The situation in the northern part of Gaza is complex. While Israeli military operations in the area were previously successful, allowing civilians to return to their homes, Hamas has used its stolen aid and resources to rebuild its forces. They continue to infiltrate the region, using civilian populations as human shields. Israel&#8217;s military must act to eliminate these strongholds to protect both Israeli civilians and Gazans. As long as Hamas continues its terror campaign, the Israeli military will need to ensure the safety of the region.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from the Audience: Israel-Jordan Relations Post-Elections</h3>\n\n\n\n<p><strong>Question</strong>: Less than a week after parliamentary elections in Jordan saw some gains for the Islamist opposition, how do you assess the current state of Israel-Jordan relations? Where do you see them going in the future, especially after the recent attack on the Israel-Jordan border?</p>\n\n\n\n<p><strong>Answer</strong>: The Jordanian government understands the threat posed by Islamic radicalism, particularly the influence of Iran. We’ve seen evidence of weapons coming into Jordan from Iran, and Jordan recognizes the danger this poses to its peace and stability. Despite some political statements made for diplomatic purposes, I believe the peace between Israel and Jordan will remain strong. Both nations have a shared interest in countering the threat from Iran, which seeks to destabilize the entire region.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from the Audience: Divisive Politics in Israel</h3>\n\n\n\n<p><strong>Question</strong>: How should friends of Israel and Jews around the world relate to the divisive political atmosphere in Israel, and what’s the big picture they should take away from the situation?</p>\n\n\n\n<p><strong>Answer</strong>: This is a personal opinion, but while I don’t participate in the protests every week, I will always defend every Israeli’s right to demonstrate. That’s the beauty of our democracy—we are the only democracy in the Middle East where people can protest against their government, even during war. The protests don’t undermine Israel’s legitimacy; rather, they are a sign of our vibrant democracy. Whether we are demonstrating or not, every Israeli is proud of our democratic values.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you for joining today’s session. As always, we will be back tomorrow at 3 PM Israel time (8 AM Eastern Standard Time). Have a great day!</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On Saturday, September 21st, <a  href=\"https://iron-swords.co.il/t/eylon-levy/\">Eylon Levy</a> will debate <a  href=\"https://iron-swords.co.il/t/al-jazeera/\">Al Jazeera</a>&#8216;s Medi Hassan in New York City. Stay tuned for <a  href=\"https://iron-swords.co.il/c/updates/\">updates</a> on how to watch live and join or host a watch party. More details are coming soon, so follow our platforms for the latest information!</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        490
    ],
    "class_list": [
        "post-17604",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ashley-waxman-bakshi"
    ],
    "lang": "en",
    "translations": {
        "en": 17604
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17604",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17604"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17604/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17605,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17604/revisions/17605"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17604"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17604"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17604"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}