{
    "id": 17709,
    "date": "2024-09-21T21:00:00",
    "date_gmt": "2024-09-21T18:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17709"
    },
    "modified": "2024-09-24T08:04:59",
    "modified_gmt": "2024-09-24T05:04:59",
    "slug": "idf-spokesman-update-09-21-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-09-21-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 09/21, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 21.09, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/4v7EFd0KvhM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good week. In the last hour, we have been attacking widely in southern Lebanon following the detection of Hezbollah extensions to fire at the territory of the State of Israel. Dozens of Air Force planes are now attacking terrorist targets and launching them to remove a threat to the citizens of the State of Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hezbollah Attack Summary</h2>\n\n\n\n<p>During the day, we attacked a total of about 400 Hezbollah launchers, including thousands of launchers in accordance with the situation and our actions. This means that from Haifa and the north it will be possible to hold educational and work activities in places that can be reached in the time required to protect the standards of gatherings in closed buildings. These gatherings will be limited to up to 300 people indoors, and up to 30 people outdoors. The complete instructions are available on the website of the Home Front Command.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Potential Rocket Threats</h2>\n\n\n\n<p>We will update immediately if necessary. It is possible that in the near future rockets and additional threats will be sent to the territory of the country. We ask you to adhere to the directives of the Home Front Command. We are in combat days and must therefore be vigilant and alert for any changes in the directives.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hezbollah Commanders and Israeli Intelligence Action</h2>\n\n\n\n<p>Hezbollah&#8217;s operations array in Rai Makil, along with 15 commanders from Hezbollah&#8217;s elite Radwan unit, gathered in the heart of the Dehia neighborhood, clearly under the protection of the civilian population. They met to plan attacks and infiltrations into the territory of the State of Israel. However, we were aware of their location, and through precise and powerful action by the Intelligence Division and the Air Force, we eliminated them.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israeli Air Force Readiness</h2>\n\n\n\n<p>We are prepared to continue operations and are maintaining a very high level of readiness in both attack and defense. The Air Force planes are armed and ready to attack anywhere. Our defense systems are deployed and are repelling daily fire from Gaza. We continue to fight to dismantle the military arm of Hamas.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Tribute to the Fallen</h2>\n\n\n\n<p>This evening, we honored the families of Arash Eden, Uri Alex Almog, and Carmel in memory of their elimination of two terrorists who were holding hostages in a tunnel in the Rafah area. This occurred a day after the murder of the abductees. In addition to neutralizing the terrorists, we discovered DNA evidence and equipment that linked them to the cell responsible for the murder of the six abductees. We are investigating their involvement in the act of murder.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Commitment to Justice</h2>\n\n\n\n<p>We are committed to pursuing the families of the victims and ensuring that justice is served. We will not stop until we reach everyone responsible for this heinous murder.</p>\n\n\n\n<h2 class=\"wp-block-heading\">q&amp;a</h2>\n\n\n\n<h5 class=\"wp-block-heading\">News Question 12: Sending Students from Haifa</h5>\n\n\n\n<p>Is it safe to send students from Haifa to the south? As I said, we are continuously assessing the situation. At this stage, the instructions are to follow the policy from Haifa to the north. If there are any changes during the night or morning, we will immediately update the public. I will be available to explain further, and updates will be posted on all platforms of the Home Front Command.</p>\n\n\n\n<h5 class=\"wp-block-heading\">Gali Teshal&#8217;s Question: Hostage Deal Impact</h5>\n\n\n\n<p>What are the consequences of the events in the north on the chances of reaching a hostage deal? Do you agree that the military pressure on Hamas in Gaza is currently minimal? We remain committed to the goals of the war. We are working in Gaza to dismantle Hamas.</p>\n\n\n\n<h5 class=\"wp-block-heading\">Evacuation Estimates for Residents North of Haifa</h5>\n\n\n\n<p>Are there estimates for a large-scale evacuation of residents north of Haifa? As I mentioned earlier, the current instructions are to follow the policy from Haifa to the north. If anything changes, we will inform the public accordingly. We are on high alert and taking precautionary measures to ensure the safety of the public.</p>\n\n\n\n<h5 class=\"wp-block-heading\">Channel 14&#8217;s Question: Attacks from Iran, Yemen, and Syria</h5>\n\n\n\n<p>Is the IDF prepared for the possibility of attacks from Iran, Yemen, and Syria? Throughout the war, we have already experienced attacks from Yemen and Iran, and we have responded accordingly. We are vigilant in our collection of intelligence and strategic planning. Our mission is clear, and we are prepared to respond.</p>\n\n\n\n<h5 class=\"wp-block-heading\">Posh News Question: Ground Entry into Lebanon</h5>\n\n\n\n<p>Is the army prepared for a ground entry into Lebanon while fighting on other fronts? Our primary mission is to ensure the safe return of the residents of the north to their homes. We will do whatever is necessary to achieve this goal.</p>\n\n\n\n<h5 class=\"wp-block-heading\">i24&#8217;s Question: Ground Maneuver Against Lebanon</h5>\n\n\n\n<p>Is it possible to end the campaign against Lebanon without a ground maneuver? I will reiterate, our mission is to return the residents of the north safely to their homes. We are prepared to do whatever is necessary to achieve that.</p>\n\n\n\n<h5 class=\"wp-block-heading\">Network B&#8217;s Question: Hezbollah Ground Invasion or Sea Attack</h5>\n\n\n\n<p>Are there estimates for a possible surprise ground invasion or sea attack by Hezbollah? We are strongly supported in both attack and defense. This has been our approach since the beginning of the war, and we will continue to maintain this support, both today and in the coming days.</p>\n\n\n\n<p>Thank you very much. Have a good week.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The IDF launched widespread airstrikes on <a  href=\"/hezbollah\">Hezbollah</a> targets, eliminated commanders, and remains prepared for further threats from Lebanon.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [
        1586
    ],
    "class_list": [
        "post-17709",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 17709
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17709",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17709"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17709/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17711,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17709/revisions/17711"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17709"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17709"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17709"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}