{
    "id": 17866,
    "date": "2024-09-28T14:00:00",
    "date_gmt": "2024-09-28T11:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17866"
    },
    "modified": "2024-09-28T18:28:32",
    "modified_gmt": "2024-09-28T15:28:32",
    "slug": "idf-spokesman-update-28-09",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-28-09/",
    "title": {
        "rendered": "IDF spokesman update – 28.09"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 28.09\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/9EOzpiK3g9Q?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good afternoon, Shabbat Shalom. This morning, we officially discussed the assassination of Hasan Nasrallah, head of the Hizbullah terrorist organization for the past 30 years. In a targeted attack by the Air Force, the Intelligence Wing, and the Operations Wing yesterday, we successfully eliminated him, along with other commanders and senior officials, including Eli Karki, the commander of the organization&#8217;s southern front.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Planning and Command of Attacks Against Israel</h3>\n\n\n\n<p>These individuals gathered in an underground headquarters beneath residential buildings, where they planned, led, and commanded the fighting against the State of Israel. Nasrallah has been responsible for the murder and kidnapping of Israelis and citizens from around the world for years. He was one of Israel&#8217;s greatest enemies, and his elimination makes the world a safer place. However, the situation is not over yet.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ongoing Operations Against Hizbullah</h3>\n\n\n\n<p>Even at this moment, a pilot is attacking Hizbullah&#8217;s terrorist infrastructures throughout Lebanon in Pekka and Tzur. We are clearly rejecting the strategic capabilities that Hizbullah has built over the years, using funding and construction. We will shoot anyone who attempts to aid Hizbullah&#8217;s terrorist operations in Lebanon.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Situation Assessment and Home Front Command Update</h3>\n\n\n\n<p>In the last few hours, we conducted a situation assessment. Now, we are announcing an update to the directives of the Home Front Command. Any changes will be updated immediately on the official platforms of the Home Front Command, and I will keep you informed here. Challenging days lie ahead of us, with more tasks to complete, including the return of our abductees, who are being brutally held by Hamas in Gaza, and the return of the northern and southern residents to their homes. We are determined to complete this mission.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF Preparedness and Questions from News 13</h3>\n\n\n\n<p><strong>Question from News 13:</strong> <em>Is the IDF prepared for the possibility of direct fire from Iran following the assassination?</em></p>\n\n\n\n<p>Throughout the war, we encountered fire from Iran, Syria, Yemen, and Iraq. We eliminated Hasan Nasrallah, a very centralized figure in the organization, and over the past few weeks, we have continued eliminating Hezbollah&#8217;s command structure. Even now, we are eliminating commanders of the organization and will continue doing so in the days to come.</p>\n\n\n\n<h3 class=\"wp-block-heading\">School Safety and Instructions</h3>\n\n\n\n<p><strong>Question from News 12:</strong> <em>Do they recommend sending children to school tomorrow?</em></p>\n\n\n\n<p>As I mentioned, we had a situational plan, and the Minister of Defense will remain. For the safety of the residents, we are taking necessary precautions. At this stage, beyond the avoidance of large gatherings, there are no changes in instructions—schools will operate tomorrow. We are following a continuous situational plan.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Returning Northern Residents Home</h3>\n\n\n\n<p><strong>Question from i24:</strong> <em>Is it possible to return the residents of the north to their homes now?</em></p>\n\n\n\n<p>We have a mission to return the northern residents safely, and we will do everything necessary to achieve this.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Rosh Hashanah and Potential Continuation of the Conflict</h3>\n\n\n\n<p><strong>Question from Vint:</strong> <em>Can we celebrate Rosh Hashanah quietly across most of the country, or will the shooting continue?</em></p>\n\n\n\n<p>We have several challenges ahead and are determined to complete them. Our role, both during Rosh Hashanah and on other days, is to protect the citizens of Israel. We will do everything we can to fulfill this task.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Northern Shooting and Public Safety</h3>\n\n\n\n<p><strong>Question from Israel Today:</strong> <em>How are we dealing with the frequent shooting that disturbs the northern residents?</em></p>\n\n\n\n<p>It is important to reflect the situation accurately to the public. Returning northern residents safely to their homes requires vigilance, especially adherence to instructions. The leadership and resilience of the northern residents have been exemplary, and I ask that you continue your responsible behavior. It helps us act with determination and avoid casualties. This will take time, and we need this time to complete the work. Your compliance with the instructions is crucial.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Preparedness for Future Attacks</h3>\n\n\n\n<p>We are constantly assessing the situation. Our readiness in both attack and defense remains strong, though no defense is completely airtight. The public&#8217;s role, as seen in recent days, is vital. There was a shooting from Yemen recently, and following instructions is essential. We are determined to continue our efforts, both offensively and defensively, to prevent as much harm as possible.</p>\n\n\n\n<p></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The IDF eliminated Hasan Nasrallah and other Hizbullah leaders, continuing operations to dismantle terrorist infrastructures and protect <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [
        1586
    ],
    "class_list": [
        "post-17866",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 17866
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17866",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17866"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17866/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17869,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17866/revisions/17869"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17866"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17866"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17866"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}