{
    "id": 17764,
    "date": "2024-09-23T15:00:00",
    "date_gmt": "2024-09-23T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17764"
    },
    "modified": "2024-09-24T09:08:23",
    "modified_gmt": "2024-09-24T06:08:23",
    "slug": "idf-warns-lebanese-to-get-away-from-hezbollah-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/idf-warns-lebanese-to-get-away-from-hezbollah-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "IDF Warns Lebanese to Get Away from Hezbollah | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"IDF Warns Lebanese to Get Away from Hezbollah | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/NkIp0hqnjsQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a>Today is day 353 of the October 7th War. There have been near unceasing sirens today across Northern Israel. Hezbollah is attacking the Lower Galilee with a plethora of rockets, and frankly, it&#8217;s a scary time in Northern Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Minister of Defense&#8217;s Statement</h3>\n\n\n\n<p>Israel&#8217;s Minister of Defense, Yoav Galant, declared that &#8220;ahead of us are days when the public will have to show composure, discipline, and full compliance,&#8221; end quote, there referring to safety warnings from the IDF Homefront Command.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF Intensifies Air Strikes Against Hezbollah</h3>\n\n\n\n<p>The IDF has also intensified its air strikes against Hezbollah targets inside Lebanon. Earlier today, the IDF sent warnings to residents of Southern Lebanon that if they are living near Hezbollah targets, they need to leave the area immediately.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Use of Civilian Infrastructure</h3>\n\n\n\n<p>IDF spokesman Daniel Hagari said that Hezbollah has cruise missiles ready to fire from inside houses in Lebanon. And in fact, Hezbollah has already fired missiles from inside homes. For example, just recently the IDF published a video showing one such home in Lebanon. In the video, we see as the cruise missile was about to be launched, an exterior wall fell away from the home, and the missile was ready to fire. This is the precise moment when Israel struck the house.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Militarization of Lebanese Villages</h3>\n\n\n\n<p>Now this isn&#8217;t new. For 20 years, Hezbollah has been militarizing civilian infrastructure in Lebanon. Hezbollah has packed villages across Lebanon with weapons aimed at villages in Israel. And let&#8217;s remember, Hezbollah has seen Hamas&#8217;s strategy of hiding behind civilians and believes, like Hamas does, that they can shoot at Israel&#8217;s people with impunity, and that if Israel shoots back at them, it will be Israel who is condemned for supposedly firing at civilians.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Warnings to Lebanese Civilians</h3>\n\n\n\n<p>Now, in the meantime, Israel has been telling civilians in Lebanon via text messages and even radio broadcasts to stay away from Hezbollah, and we truly hope they can. Israel does not want a war with Lebanon or its people. That&#8217;s why Iran&#8217;s terror army in Lebanon is trying to use Lebanon&#8217;s people as its personal shield. As Israel acts against Hezbollah, we need to hold them to account for endangering innocent people all around them. Like Hamas, Hezbollah wants to murder Israel&#8217;s children from behind Lebanon&#8217;s children.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Media Coverage and Key Points to Know</h3>\n\n\n\n<p>And as the fighting intensifies between Israel and Hezbollah, you can be sure that world leaders and media will start the story at the end, unfortunately, rather than at the beginning. Here are some key points that everyone needs to know:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Hezbollah is a Lebanese militia that takes its orders from Iran&#8217;s Islamic Revolutionary Guard Corps.</strong></li>\n\n\n\n<li><strong>Hezbollah joined Hamas&#8217;s war on October 8th.</strong></li>\n\n\n\n<li><strong>Hezbollah has continued to wage war for the past year.</strong></li>\n\n\n\n<li><strong>Hezbollah wants to destroy Israel.</strong></li>\n\n\n\n<li><strong>Hezbollah has fired rockets, anti-tank missiles, and suicide drones into Israeli towns.</strong></li>\n\n\n\n<li><strong>More than 60,000 Israelis living near the border with Lebanon have fled their homes because they are in imminent and immediate danger.</strong></li>\n\n\n\n<li><strong>Israel has the right to defend itself against the promise of destruction and against consistent acts of war.</strong></li>\n\n\n\n<li><strong>Diplomacy and Israeli military action up to this point have failed to persuade Hezbollah to stop attacking Israel.</strong></li>\n\n\n\n<li><strong>The IDF is intensifying its strikes against Hezbollah in accordance with the principles of international humanitarian law: precaution, distinction, and proportionality.</strong></li>\n\n\n\n<li><strong>The Israeli government&#8217;s goal is to allow residents of Northern Israel to return safely to their homes.</strong></li>\n</ol>\n\n\n\n<h3 class=\"wp-block-heading\">The Seven-Front War</h3>\n\n\n\n<p>Let&#8217;s not forget, the Lebanese front is just one front of the seven-front war that Hamas started on October 7th and Hezbollah joined on October 8th. Those fronts are as follows: Gaza, the West Bank, Lebanon, Syria, Iraq, Yemen, and of course Iran itself. And unfortunately, the bonus 8th front: Jews in the diaspora around the world who are also under attack right.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Audience Questions</h3>\n\n\n\n<p>At this point, I&#8217;d like to invite our audience watching at home to please submit their questions.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Instagram Live</h4>\n\n\n\n<p><strong>Do we know Hezbollah&#8217;s plan in the next few days?</strong></p>\n\n\n\n<p>Unfortunately, we do not know Hezbollah&#8217;s plans over the next few days. We do not know what their responses will be, which is exactly why the IDF and Israel as a whole is prepared for any potential eventuality. We don&#8217;t know what this terrorist army, who acts with impunity in the way that they wish to because they are given the opportunity by their Iranian funders who are funding this proxy all the way from Tehran to others around the world who would justify any of Hezbollah&#8217;s actions—they allow that this sort of impunity and action to occur from Hezbollah no matter what their true interests are. Israel is prepared for any eventuality. They are prepared but also live under the hope, as do all here in Israel, that Hezbollah will be able to see some sort of sense, will be frightened back and pulled back to allow the 60,000 plus Israelis who have been almost a year now unable to return home since October 8th when Hezbollah joined the war to be able to return back to their homes, to achieve a sense of normality and to break through this unbearable status quo that Israel has been living under, as I said since October 8th, very close to a year now since then.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Another Question on Instagram Live</h4>\n\n\n\n<p><strong>Is there any more news on reports that Sinwar was injured or eliminated?</strong></p>\n\n\n\n<p>So far, what we do know about Yahya Sinwar is that there has been a lack of communication from him over the past several weeks. We haven&#8217;t heard of any clear communication from him. That being said, that is not truly indicative of anything, to be clear. Sinwar has proven himself adept at avoiding Israeli tracking and communication monitoring. He has used a series of encrypted networks and skills—skills that he developed over decades as a leader, as a terrorist leader of Hamas, and ones that he is putting to his own security uses now in this ongoing battle against Hamas. Sinwar, it seems, has avoided capture by Israel by burying himself deep underground in the deepest, darkest of tunnels, surrounding himself most likely by Israeli hostages which he keeps as protection shields, and his own people as an additional layer beyond that while he protects himself and his ilk. You know, whether Sinwar has been injured, whether Sinwar has been killed, whether he&#8217;s fled out of the Gaza Strip to try and find safe haven in another area, at the moment we don&#8217;t truly know. But we will not stop; Israel will not stop; the IDF will not stop until we ensure at the end of the day that he is put to bed and Hamas and the rest of his organization are utterly dismantled and destroyed.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Instagram Live from Leel</h4>\n\n\n\n<p><strong>Was Hezbollah&#8217;s plan to invade the Galilee ultimately thwarted?</strong></p>\n\n\n\n<p>Maybe not thwarted entirely. You know, as we&#8217;ve seen the attack on Hezbollah commanders there in Beirut, they managed to kill off a number of senior Hezbollah figures that were reportedly planning this attack into the Galilee. Seems to have been highly effective, seems to have done a great deal of damage to the sort of leadership that would be leading this sort of charge. But we can&#8217;t know for certain that this has dismantled the plans in their entirety. Obviously, as I said earlier, the IDF is ready, Israel is ready. They have evacuated those 60,000 plus Israelis from the northern border to ensure that they are able to build a proper, strong, and secure military border and foundation to prevent anyone from crossing the border there. But Hezbollah continues to act, as I said, with their own impunity, seeking for plans that would try and commit the sort of atrocities that we saw on October 7th again and again if they had the opportunity. So Israel must be ever vigilant, ever ready, and that is not just the IDF I&#8217;m talking about—that is the people of Israel that are having to be ever vigilant and ever ready. It is undoubtedly a scary time. We don&#8217;t truly know what Tehran is planning; we don&#8217;t know the degree to which they will respond. But we do know that Israel stands ready to find diplomatic solutions, to find solutions that allow Israelis to return back to their homes, which is the ultimate goal here after close to a year now in which Israelis have been unable to live in the North for the threat of the literal hundreds of thousands of rockets, missiles, and drones that are pointed at them just across the border in southern Lebanon controlled by Hezbollah. This status quo cannot be returned to, this status quo cannot be maintained, and that is the most important thing that Israel, the IDF, and everyone in the free world should be fighting in order to break down and prevent.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Ian on YouTube</h4>\n\n\n\n<p><strong>Why has the IDF not retrieved more hostages?</strong></p>\n\n\n\n<p>Ian, the IDF is absolutely trying its best to retrieve as many hostages as it can from Hamas and from the Gaza Strip. But as it stands now, and unfortunately as the reality is, Hamas understands the value of these assets that they&#8217;ve taken—these human beings, I should say rather, these human beings that they stole from their homes—but they see as potential assets, as potential fruits of war to be traded in order to gain advantage or continue their ongoing survival in any way that they possibly can. And in understanding that value, they keep these assets, as they see them, close at hand. As I said earlier, Yahya Sinwar is most likely sitting surrounded by hostages under the full knowledge that should any IDF assault attempt to root him out of his rat cellar, he would be able to rely on these hostages around him as a protective shield as he protects himself even with his own people at the same time. You know, the value he would give to an Israeli life would only be so much as the value that we as Israelis put on these lives. You know, this is the terrible reality of the situation on the ground, and this is why it has been so hard in order to enact the remarkable rescue operations that the IDF has put up until now to save a few of the hostages. You know, we&#8217;ve seen deals done in the past; we hope that we can get the remaining hostages out no matter what state they may be, and that is a clear critical goal in order to bring them home now. We must never lose sight of that goal, but as it stands for now, you know, the situation on the ground is clearly incredibly difficult, and everyone in Israel and the IDF and hopefully all our allies around the world are working tirelessly to try and get those hostages back as soon as possible.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Sammy on YouTube</h4>\n\n\n\n<p>Sammy on YouTube writes that the Iranian resistance in Iraq has been firing more drones per day towards Israel. It&#8217;s a big escalation as it has never been as frequent as it is now. <strong>Is this a concern, and will the IDF also strike in Iraq?</strong></p>\n\n\n\n<p>Sammy, that&#8217;s a fantastic question because it certainly is a concern. The entire &#8220;Ring of Fire&#8221; approach that Iran and its militant proxies have put in place around Israel on all fronts, almost entirely surrounding Israel, are indeed indicative of deep concerns. And these militant organizations operating with impunity from Iraq, from Syria, from Lebanon, and from all the other nations around Israel where they do so is a serious and significant problem. You know, as we saw with the pager explosions in the last few weeks, it was remarkable to see that those pages exploded not only within Lebanon but also within Syria, also within Iraq, showing that these linked militant organizations all share singular goals and are using the same networks in which to operate. So it is in fact unsurprising that we&#8217;re seeing these sort of attacks coming from those areas. But Israel will act wherever it needs to in order to defend its sovereignty, in order to defend its people from arbit missile assaults that would come firing at them from any side. It is not an acceptable situation, and I want everyone watching to consider how that situation would be tolerated in their hometowns, counties, cities, wherever. How many rockets would you celebrate—would you accept fired towards you before you felt the need to respond, before you felt the need to take any action to protect yourselves, your children, your families, however, whomever it may be watching, whoever may be there with you? You know, this is an intolerable situation. Israelis certainly should not be expected to live with it despite the fact that it seems to become an acceptable status quo for so many to have militants surrounding you firing upon you. This is not an acceptable status quo, and we here in Israel will not accept it.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Final Question from Instagram Live</h4>\n\n\n\n<p>An account called &#8220;Check Support Israel&#8221; asks: <strong>Can I come to Tel Aviv for tourism now?</strong></p>\n\n\n\n<p>You absolutely can come to Tel Aviv for tourism. You know, this area right now—Tel Aviv—it is a flourishing area in the world. There are people sitting in cafes, there are people enjoying the fine early autumn weather, there are people out enjoying the beach and trying to live their lives as best they can. You know, certainly the situation is difficult, and it may become more difficult over the days, weeks, and months ahead, and we all must be sensible and aware—alert but not alarmed. But that being said, Israel is and continues to be open for business, whether that be tourism, whether it be visiting family, whether that be coming to in fact enact business. We continue to keep on and keep our lives going because we will not let those terrorist armies dictate how we live our lives. We will continue to do so in the face of this sort of barbarity, in the face of this sort of inhumanity that is surrounding us on so many sides, as Israel has done since 1948 and frankly to some degrees even before. Israelis continue to live their lives; we will continue to do so whatever way that we can, and that is really the key message that I think we can take away from this situation at the moment.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>Alright, that is all we have time for on today&#8217;s Daily Briefing. I&#8217;d ask you to please join us again tomorrow at 3 p.m. Israel time, 8:00 a.m. Eastern. There&#8217;s such a fast-moving array of news at the moment; I think it is a critical time for everyone to be making sure that they are keeping on top of things, understanding what&#8217;s truly happening, and helping us to get that message out. So please, as I said earlier, like, subscribe, share anything that you can—clips of ours, we put everything on all our social media—it really truly does make a difference. I&#8217;m Ash Westrop Evans. Thanks for watching.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Day 353 of the October 7th War sees intensified conflict between <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and <a  href=\"/hezbollah\">Hezbollah</a> in Northern Israel. Israel is striking <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a> targets in Lebanon and warning civilians to evacuate. Key points include Hezbollah&#8217;s continued attacks, Israel&#8217;s right to defend itself, and the impact on civilians on both sides.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306,
        1586
    ],
    "class_list": [
        "post-17764",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 17764
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17764",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17764"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17764/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17765,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17764/revisions/17765"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17764"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17764"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17764"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}