{
    "id": 17713,
    "date": "2024-09-17T15:00:00",
    "date_gmt": "2024-09-17T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17713"
    },
    "modified": "2024-09-22T01:26:51",
    "modified_gmt": "2024-09-21T22:26:51",
    "slug": "israels-security-cabinet-sets-a-new-war-goal-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/israels-security-cabinet-sets-a-new-war-goal-daniel-rubenstein/",
    "title": {
        "rendered": "Israel&#8217;s Security Cabinet Sets a New War Goal | Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Israel&#039;s Security Cabinet Sets a New War Goal | Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/uIfAwAJdCMM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading has-text-align-center\"><strong>Debate Announcement: Eylon Levy vs. Al Jazeera’s Massan</strong></h3>\n\n\n\n<p>This Saturday, September 21st, our very own Eylon Levy will be debating Al Jazeera&#8217;s Massan in New York City. If you&#8217;re in New York, you can buy a ticket and attend in person. If you&#8217;re not attending in person, you will be able to watch a live stream wherever you are in the world. You can host a viewing event. If you want to host a viewing event, please go to our social media pages, the Israeli Citizen Spokesperson&#8217;s Office, and find a link there to more information about the debate. It&#8217;s in our Instagram and Twitter profiles now.</p>\n\n\n\n<p>If you click that link, you&#8217;ll find a form to fill out, and we will send you materials to help you have a successful viewing event. Again, all of the relevant information and links will be on our social media platforms today, so stay tuned for more posts.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>October 7th War Update: Day 347</strong></h2>\n\n\n\n<p>Today is day 347 of the October 7th War. The Israeli security cabinet has updated its official goals of the October 7th War. The war already had three official objectives, and these objectives remain:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Destroying Hamas as a military and government entity in Gaza.</li>\n\n\n\n<li>Bringing every Israeli hostage home.</li>\n\n\n\n<li>Ensuring that Gaza no longer poses a threat to Israel.</li>\n</ol>\n\n\n\n<p>There was always a fourth goal, which was obvious but not officially confirmed in this manner by the security cabinet. That fourth goal has just been officially confirmed, and it is this: allowing residents of Northern Israel to safely return to their homes.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hezbollah’s Involvement: Israel’s Seven-Front War</strong></h3>\n\n\n\n<p>Let me remind you of the situation. The October 7th War isn&#8217;t just about Gaza. Israel is fighting a seven-front war against Iran and its proxies in the region. On October 8th, Hezbollah joined Hamas&#8217;s war. For the past 11 months, Hezbollah has been firing rockets, anti-tank missiles, and suicide drones into Israel.</p>\n\n\n\n<p>Think about that. Hezbollah saw what Hamas did on October 7th and said to itself, &#8220;We want to be part of that. We stand with Hamas.&#8221; Hezbollah fired accurate anti-tank missiles into Israeli houses near the border with Lebanon. More than 60,000 Israelis have fled their homes in Northern Israel because they are in immediate danger of being on the receiving end of an anti-tank missile, rocket, or explosive drone. Remember, Hezbollah fired a rocket at a soccer field in Northern Israel and massacred kids.</p>\n\n\n\n<p>It&#8217;s not safe when Hezbollah is our neighbor. It&#8217;s an unbearable and unacceptable reality. The government of Israel has been saying for 11 months: Hezbollah must back off, or Israel will be forced to push it away. Israel has been, and continues to be, open to a diplomatic solution, but it must be a solution that allows the residents of Northern Israel to return to their homes without fear of Hezbollah shooting their homes with anti-tank missiles. I don&#8217;t think that&#8217;s too much to ask.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Diplomatic Silence on Hezbollah</strong></h3>\n\n\n\n<p>While there is intensive diplomacy underway, including with the Americans, I&#8217;ve noticed something. Here&#8217;s a challenge for my viewers: I&#8217;m collecting statements from world leaders who have said clearly and publicly that Hezbollah, Iran&#8217;s Army of Terror in Lebanon, must stop attacking Israel or else it will face severe consequences. I have zero names so far. Zero names of world leaders who have demanded that Hezbollah back away from the border with Israel. Zero names of secretaries of state or foreign ministers who have demanded that Hezbollah cease fire immediately. Zero names of ambassadors who have demanded that Hezbollah comply with international law and disarm.</p>\n\n\n\n<p>I see what&#8217;s happening. World leaders don&#8217;t want to prepare their own publics for the righteousness of Israeli military action in Lebanon, so they make weak public statements and call it diplomacy or de-escalation. Let&#8217;s call it what it is: appeasement.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>UN Special Rapporteur Francesca Albanese’s Latest Claims</strong></h3>\n\n\n\n<p>Please share this video to help me find someone who tells Hezbollah to cease fire, withdraw, disarm, and live in peace. Something else I saw today: UN Special Rapporteur Francesca Albanese, the UN&#8217;s chief Hamas apologist, has taken her hatred of Israel to new levels. She knows that she needs to say crazier and crazier things to get attention, and I must give her credit, it&#8217;s working.</p>\n\n\n\n<p>In her latest presentation, Albanese provided a new list of crimes for which she has found Israel guilty. These crimes are: domicide, herbicide, scholasticide, medicide, cultural genocide, and ecocide. She&#8217;s making up words at this point.</p>\n\n\n\n<p>This is the same Albanese who told the president of France that he was wrong to call Hamas&#8217;s October 7th Massacre the greatest anti-Semitic massacre of our time. Instead, she justified Hamas&#8217;s October 7th Massacre as a response to Israel&#8217;s oppression. The French government called Albanese&#8217;s remarks scandalous and a disgrace. The German government called her comments appalling.</p>\n\n\n\n<p>This is the same Albanese who is under investigation for accepting funds from pro-Hamas groups as she travels the world to tell horrific lies about Israel while she has a UN title attached to her name. Her extracurricular activities might be too much even for the UN. Albanese is the face of a broken UN system that coddles Hamas, a terrorist army, and tries to stop Israel, a UN member state, from defending itself against the terrorist army.</p>\n\n\n\n<p>Albanese wants to expel Israel from the UN and welcome Hamas to the UN. She should have to choose between having a UN title in front of her name and continuing to spread horrific lies about Israel. Given the UN&#8217;s track record, I&#8217;m not optimistic that she will be forced to change. Are you?</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Ken Roth’s Contradictions in the Gaza Debate</strong></h3>\n\n\n\n<p>Finally, today I just watched a debate on YouTube between Ken Roth, former head of the rabidly anti-Israel Human Rights Watch, international law expert Eugene Korovich, and urban warfare expert John Spencer. Roth said some interesting things. Roth, as you may know, made a career out of wild and disproportionate criticism of Israel. Even the founder of Human Rights Watch has said that his organization lost its way.</p>\n\n\n\n<p>In this debate, Roth conceded that Israel is not starving Gazans. He said, &#8220;People are not dying of hunger in Gaza.&#8221; This is the same Roth who accuses Israel of putting a siege on Gaza. When asked about the contradiction between an alleged 11-month siege and people not dying of starvation after 11 months of siege, he said, &#8220;Israel is smart enough to not do an actual full siege, and it lets in drips and drops of aid.&#8221; He said, &#8220;People are dying, but they&#8217;re not starving.&#8221;</p>\n\n\n\n<p>What? These are the facts: Gazans now receive over 3,000 calories per person—more than Norway or the UK. Hundreds of trucks of aid enter Gaza. This is the information I have from Sunday. I just looked it up; it&#8217;s from two days ago from the IDF about what&#8217;s going through the Gaza border crossings. 132 trucks were collected from the Gazan side of Kerem Shalom, the southern border crossing, and 124 of those trucks were collected by the private sector. Only eight were collected by UN agencies.</p>\n\n\n\n<p>By the way, that&#8217;s why they underreport the number of trucks entering Gaza, because very often they&#8217;re only counting the ones they&#8217;re dealing with. Another 45 trucks were collected on the Gazan side of the Erez crossing, which is in the northern part of Gaza. Approximately 460 trucks worth of aid right now are waiting for collection inside Gaza. Roth’s claim that Israel is starving Gazans, despite no known deaths from starvation and the fact that more food is going into Gaza than before the war, is ridiculous.</p>\n\n\n\n<p>Roth is not alone in making outrageous claims. It&#8217;s up to us to point out that these are lies, no matter how often they are repeated. Watch the full debate on YouTube and let me know what you think.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Audience Questions</strong></h3>\n\n\n\n<p><strong>Will the debate live stream be available after for those who can&#8217;t watch live?</strong></p>\n\n\n\n<p>Yes, the debate live stream will be available afterward. It will be posted to YouTube by the organizers, and you can also keep an eye on our platforms—Israeli Citizen Spokesperson&#8217;s Office. You will find the debate after it&#8217;s over. I understand that not everyone will be able to watch live, certainly at 3:00 am Israel time when the debate takes place. I will be staying awake and watching, but if you can&#8217;t stay awake and watch at 3:00 am Israel time (and it will end much later or early in the morning), you will be able to watch it after. Don&#8217;t worry!</p>\n\n\n\n<p><strong>What&#8217;s Eylon doing to prepare for the debate?</strong></p>\n\n\n\n<p>Well, that&#8217;s classified information! Maybe Massan is watching this live stream right now to try to gather intelligence, so I will not be revealing anything about how Eylon is preparing for the debate, only to say that I am confident that he will be prepared to win this debate Saturday night in New York, 8:00 pm Eastern Time.</p>\n\n\n\n<p><strong>What will happen if there is a full-scale war with Hezbollah in Lebanon?</strong></p>\n\n\n\n<p>Yes, this is a huge concern, and it&#8217;s a question everyone is asking: What will happen if there is a wider war with Hezbollah in Lebanon? I think the most honest answer anyone can give is, &#8220;I don&#8217;t know.&#8221; We don&#8217;t know what the war will look like. We don&#8217;t know what will spark a wider war with Lebanon. We don&#8217;t know where exactly it would take place, when, or how—all of these are open questions. The future is one of those things that&#8217;s hard to predict.</p>\n\n\n\n<p>However, I can tell you what we&#8217;re worried about. First of all, we&#8217;re worried about the status quo, which is that 60,000 Israelis in Northern Israel have been forced to leave their homes because Hezbollah is shooting anti-tank missiles at their homes, firing rockets, and sending suicide drones. It’s simply not safe to live in Northern Israel near the border with Lebanon, so this is already a war situation.</p>\n\n\n\n<p>If the war expands, of course, Hezbollah is threatening to escalate it further. We understand that Hezbollah has a massive rocket and missile arsenal, with missiles that can reach everywhere in Israel and even parts of Europe. If Hezbollah decides to escalate, we can expect to see a very difficult situation both in Israel and, as a result, also in Lebanon. We want to do everything possible to avoid a wider war, and we want to give diplomacy a chance to resolve this situation. But it has been 11 months of Hezbollah firing, and diplomacy has not resolved the situation. If this continues, Israel will have no choice but to push Hezbollah away from the border.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Updates on Israeli Politics: Will There Be a New Defense Minister?</strong></h3>\n\n\n\n<p>Israeli politics is never dull. Just before this daily briefing started, I was skimming the news on my phone to see if there were any developments before I went live on air. Maybe since I&#8217;ve been on air, there have been developments, and I just don’t know about them because I’m here talking with you.</p>\n\n\n\n<p>I don’t know what&#8217;s going to happen, and I&#8217;m following the news just like you are. But here&#8217;s what&#8217;s important to keep in mind: no matter what happens in the Israeli domestic political scene, the goals of the war set by the Security Cabinet will remain the goals of the war until the Security Cabinet meets again and adds or subtracts from these war goals. And that&#8217;s what&#8217;s important to remember: focus on the war goals, focus on the policy, which is:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The dismantlement of Hamas&#8217;s military and government capabilities.</li>\n\n\n\n<li>The safe return of every hostage that is alive or dead in Hamas&#8217;s terror dungeons right now.</li>\n\n\n\n<li>Ensuring that Gaza will never again pose a threat to Israel.</li>\n</ul>\n\n\n\n<p>Hamas has been holding hostages since October 7th. We need more pressure on Hamas and Hamas’s backers—Turkey, Qatar, and Iran—to pressure Hamas to release the hostages. The third goal is to ensure that Gaza will never again pose a threat to Israel. Those are the three goals, and we have added an official fourth goal: the residents of Northern Israel must be able to return to their homes safely, which means Hezbollah will not be on the border with anti-tank missiles pointed at those homes.</p>\n\n\n\n<p>Those are the four war goals, and that’s what we need to keep in mind. Israeli politics is something the Israeli people will have to sort out on their own.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>South African Muslim Leader Declares &#8220;I Am Hamas&#8221;</strong></h3>\n\n\n\n<p>A South African Muslim leader recently declared, “I am Hamas.” My first reaction is to want to teach people something about Hamas&#8217;s place in the world, and it’s this: Hamas is popular. Hamas has vast popularity in many places around the world. People see Hamas as a legitimate resistance group. They see Hamas’s goals as justified, and they see Israel as entirely to blame.</p>\n\n\n\n<p>You can go back and look at the statements that countries issued on October 7th. Qatar, for example, said that Israel was solely responsible for Hamas’s attack on Israel. You can also look back at South Africa&#8217;s statement: South Africa condemned Israel on the afternoon of October 7th. The government of South Africa condemned Israel.</p>\n\n\n\n<p>What does that tell you? It tells you that there is some domestic popularity in South Africa for Hamas, and it tells you that being anti-Israel in South Africa is good politics for the current government, for the current ruling party in South Africa. So, while it&#8217;s disappointing, of course, to hear anyone say, &#8220;I am Hamas, we support Hamas,&#8221; ultimately, the domestic political situation in South Africa is something that I hope the people of South Africa will resolve among themselves.</p>\n\n\n\n<p>I think we have great potential for better relations between Israel and South Africa, but the current ruling party of South Africa has been very hostile to Israel for many, many years, and it’s become only more hostile after October 7th. South Africa is leading the charge in international institutions to condemn Israel for defending itself against the October 7th massacre.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Final Reminder: Debate Information</strong></h3>\n\n\n\n<p>That’s all we have for today. I want to remind you again: if you want more information about the debate between Eylon Levy and Massan that’s taking place Saturday night in New York, you can find it on our social media platforms—the Israeli Citizen Spokesperson&#8217;s Office. You can also find it on my social media platforms. We will be posting all kinds of updates throughout the week about how you can host an event, a viewing party, and bring people together to watch this important debate.</p>\n\n\n\n<p>Thank you so much for watching, and thank you even more so for the questions. We’ll see you next time, which is tomorrow at 3 p.m. Israel time, 8 a.m. on the East Coast. Have a wonderful day!</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/eylon-levy/\">Eylon Levy</a> will debate <a  href=\"https://iron-swords.co.il/t/al-jazeera/\">Al Jazeera</a>&#8216;s Massan on September 21st in New York, addressing the ongoing October 7th War and <a  href=\"/hezbollah\">Hezbollah</a>’s involvement. The Israeli Security Cabinet confirmed its goals, including the destruction of <a  href=\"/hamas\">Hamas</a> and ensuring Northern <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s safety. Global leaders remain silent on <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>’s aggression, while UN criticism intensifies.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312
    ],
    "class_list": [
        "post-17713",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "en",
    "translations": {
        "en": 17713
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17713",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17713"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17713/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17718,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17713/revisions/17718"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17713"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17713"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17713"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}