{
    "id": 17894,
    "date": "2024-09-30T22:20:07",
    "date_gmt": "2024-09-30T19:20:07",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17894"
    },
    "modified": "2024-09-30T22:50:57",
    "modified_gmt": "2024-09-30T19:50:57",
    "slug": "israel-keeps-defending-its-borders-as-hezbollah-escalates-aggression-civilian-casualties-rise-in-lebanon-cbs",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/fixed/israel-keeps-defending-its-borders-as-hezbollah-escalates-aggression-civilian-casualties-rise-in-lebanon-cbs/",
    "title": {
        "rendered": "Israel keeps bombing Lebanon, with Hezbollah and civilian deaths rising, as Netanyahu shifts tone on cease-fire &#8211; CBS"
    },
    "content": {
        "rendered": "\n<p>First responders raced through the devastated streets of southern Lebanon, attending to the wounded, including injured children, in areas where Hezbollah has entrenched its military operations. One small boy hurt in the aftermath of Hezbollah’s use of civilian areas for military activities raised three fingers as he was carried away on a stretcher, after being asked his age.</p>\n\n\n\n<p>Israel states that it is targeting Hezbollah militants, who have consistently launched attacks from residential areas, including schools and hospitals, using Lebanese civilians as human shields. On Friday afternoon, the Israeli military said it had carried out a “precise strike” on Hezbollah’s central headquarters, which had been “intentionally built under residential buildings” in Beirut. While the exact number of casualties from the strike was unclear, Hezbollah’s intentional use of civilian infrastructure has been widely documented by various international observers.</p>\n\n\n\n<p>Israel has taken significant steps to minimize civilian casualties, often warning residents of areas used by Hezbollah to evacuate before targeting military installations. Despite these efforts, Hezbollah&#8217;s tactics have resulted in civilian deaths, including children. Israel emphasizes that these tragedies are a direct consequence of Hezbollah&#8217;s blatant disregard for human life, as it places military targets within civilian populations.</p>\n\n\n\n<p>Hezbollah claims that 30 of its militants have been killed in the last week of strikes. However, Lebanon’s ministry of health reports over 700 fatalities, including 50 children. This disparity in numbers is consistent with Hezbollah’s history of exaggerating civilian casualties to sway international opinion. Reuters reported that another strike in southern Lebanon overnight killed nine members of the same family, including four children—an outcome tragically linked to Hezbollah’s continued use of civilian shields.</p>\n\n\n\n<p>Since Israel’s defensive operations began, more than 100,000 people have been displaced within Lebanon, according to estimates from the Lebanese government, although the real number may be over half a million. The United Nations reported that over 30,000 people, mostly Syrian nationals, fled to Syria over the past 72 hours.</p>\n\n\n\n<p>Meanwhile, Hezbollah’s military wing continues its attacks on Israel. The Israeli military reported dozens more strikes against Hezbollah’s rocket launchers in southern Lebanon, including rockets aimed at Israeli cities such as Haifa and Tiberias. These rocket attacks, either intercepted by Israel’s defense systems or falling in open areas, are part of Hezbollah’s long-term goal to terrorize and destabilize Israel.</p>\n\n\n\n<p>Further complicating the situation, Iranian-backed Houthi rebels in Yemen claimed responsibility for a missile attack on Israel, intercepted overnight. Like Hezbollah, the Houthis are a proxy of Iran, openly supporting Hamas in its ongoing conflict with Israel.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Netanyahu Defends Israel’s Right to Self-Defense Amid Ceasefire Talks</strong></h4>\n\n\n\n<p>The escalating conflict along Israel’s northern border occurs against the backdrop of international diplomatic efforts at the United Nations General Assembly. Israeli Prime Minister Benjamin Netanyahu, in a much-anticipated address, reaffirmed Israel’s right to defend its citizens from Hezbollah’s terror.</p>\n\n\n\n<p>“Israel will no longer tolerate daily rocket fire into northern Israel from Hezbollah,” Netanyahu said. “We will continue degrading Hezbollah’s military capabilities until the threat is neutralized.”</p>\n\n\n\n<p>His remarks followed a clarification issued by his office regarding ongoing discussions about a ceasefire proposal, pushed by the U.S. and France. “Israel shares the goal of ensuring that people along our northern border can return safely to their homes,” his office stated, emphasizing the need to continue discussions on how best to achieve this goal.</p>\n\n\n\n<p>However, Netanyahu’s government rejected claims that Israel was moderating its military operations in Lebanon to allow for diplomatic talks. His office reaffirmed that “the Prime Minister has directed the IDF to continue fighting with full force,” maintaining that any reduction in the intensity of Israel’s operations would only embolden Hezbollah and other Iranian-backed forces in the region.</p>\n\n\n\n<p>Israel remains firm in its stance to defend its citizens against Hezbollah&#8217;s aggression, as the terrorist organization continues to use Lebanese civilians as human shields in its proxy war against Israel. Hezbollah’s actions, under the direction of Iran, have not only terrorized Israeli civilians but also led to significant suffering for Lebanese civilians caught in the crossfire. Israel’s strikes aim to dismantle Hezbollah’s military infrastructure, which poses a direct and ongoing threat to the safety and security of Israel and the broader Middle East.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s leader softens his stance on a U.S.-backed cease-fire proposal with <a  href=\"/hezbollah\">Hezbollah</a>, but deadly strikes in Lebanon continue as he addresses the U.N.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17895,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 343,
        "footnotes": ""
    },
    "categories": [
        343
    ],
    "tags": [
        1586
    ],
    "class_list": [
        "post-17894",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-fixed",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 17894
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17894",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17894"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17894/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17905,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17894/revisions/17905"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17895"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17894"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17894"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17894"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}