{
    "id": 17995,
    "date": "2024-09-29T15:00:00",
    "date_gmt": "2024-09-29T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17995"
    },
    "modified": "2024-10-04T11:56:20",
    "modified_gmt": "2024-10-04T08:56:20",
    "slug": "look-who-is-celebrating-hassan-nasrallahs-death",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/look-who-is-celebrating-hassan-nasrallahs-death/",
    "title": {
        "rendered": "Look Who Is Celebrating Hassan Nasrallah&#8217;s Death | Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Look Who Is Celebrating Hassan Nasrallah&#039;s Death | Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/NgErjzRvchg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is <strong>day 359 of the October 7 War</strong>, a war that <strong>Hamas</strong> had started. <strong>Hezbollah</strong> joined the next day, and now it involves the <strong>Islamic Republic of Iran</strong> and its proxies on a total of seven fronts around Israel. The <strong>Islamic Republic of Iran</strong> has established a &#8220;ring of fire&#8221; around Israel.</p>\n\n\n\n<p>You’ve certainly heard the news—<strong>Hezbollah&#8217;s head, Hassan Nasrallah, is dead</strong>. It’s not only the people of Israel who are relieved; in fact, many throughout the Arab world are celebrating. After news of Israel’s Friday strike on Hezbollah’s leader spread, <strong>parties erupted in the streets of cities in Syria</strong>. Music was played, sweets were handed out, and faces were smiling.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Why are Arabs Celebrating?</h4>\n\n\n\n<p>Why are Arabs happy about an Israeli victory? People who don’t know anything about the Middle East assume that Arabs and Israelis are enemies, but that’s not true. <strong>Millions of Sunni Muslims in Syria</strong>, for example, hate Nasrallah, hate Hezbollah, and hate the <strong>Iranian overlords</strong> directing them. Over a million were slaughtered by them in recent years while <strong>Hezbollah helped Syria’s bloody dictator, Assad, massacre his own people</strong>.</p>\n\n\n\n<p>Sunni Muslims remember <strong>Hezbollah’s assassination of Lebanon’s prime minister Rafik Hariri in 2005</strong>. They also remember <strong>Hezbollah’s slaughter of Palestinians in the Yarmouk refugee camp in Syria in 2015</strong>, and <strong>Hezbollah’s starvation of babies in Madaya, Syria, in 2016</strong>.</p>\n\n\n\n<p>Ignore what Western commentators are telling you—listen to what the Arabs themselves have to say. Many in the Arab and Muslim world know that <strong>Hezbollah is a force for destruction</strong>. They know that Hezbollah is an <strong>Iranian boot on their neck</strong>. In fact, they have felt on their own skins the <strong>cruelty of the rapes, the massacres, the beheadings, and the torture in Syria</strong> carried out by Hezbollah.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hezbollah&#8217;s True Nature</h4>\n\n\n\n<p>Hezbollah claims that its reason for existing is to be the <strong>defender of Lebanon</strong>, but many see through that claim. <strong>Israel</strong>, on its part, has no interest in occupying Lebanon at all. In fact, Israel <strong>waited for 11 whole months</strong> before retaliating to massive barrages of rockets into its sovereign territory—something which no other country in the world would ever do.</p>\n\n\n\n<p>Let’s remember: the week before Hamas and Hezbollah launched their wars in Israel on October 7th and 8th, <strong>global headlines were announcing that peace was coming to the Middle East</strong>. There was optimism in the air; there was talk of peace between Israel and the most important Arab state, <strong>the Kingdom of Saudi Arabia</strong>.</p>\n\n\n\n<p>Since then, the <strong>Islamic Republic of Iran</strong> has been trying to destroy Israel from seven fronts using <strong>Arab proxies</strong>, firing from the rubble of <strong>Iranian-dominated Arab states like Lebanon, Syria, Iraq, and Yemen</strong>. In recent weeks, with Hezbollah&#8217;s senior leadership eliminated and <strong>Hamas being broken in Gaza</strong>, there is a chance to <strong>pave the way to peace</strong>, but not before Israel makes absolutely sure that Hezbollah—or what remains of it—is removed from the <strong>Lebanese-Israeli border</strong> and is disarmed. In other words, Israel must make sure that the <strong>two UN resolutions</strong> pertaining to this issue from <strong>18 whole years ago</strong> are actually implemented.</p>\n\n\n\n<h4 class=\"wp-block-heading\">President Biden&#8217;s Statement</h4>\n\n\n\n<p><strong>President Biden</strong> released a statement after Nasrallah’s death, saying that Israel’s strike on Nasrallah was a <strong>measure of justice</strong> for his many victims, including <strong>thousands of Americans, Israelis, and Lebanese civilians</strong>. And he’s absolutely right.</p>\n\n\n\n<p>The war is not yet over. <strong>Hezbollah continues to attack Israelis right now</strong>. <strong>Hamas continues to hold hostages</strong> in its terror dungeons in Gaza. The <strong>Iranian regime</strong> continues to threaten Israelis with yet more attacks. With <strong>Hezbollah’s leadership in disarray</strong>, now is the time to press the advantage. Now is the time to <strong>leverage Israel’s tactical victories over Hezbollah</strong> to roll back the <strong>Islamic Republic of Iran’s regional hegemony</strong>.</p>\n\n\n\n<p>All countries of the world must stand behind Israel and its <strong>Arab partners</strong> in the region as they beat back the <strong>Iranian regime</strong> and forge a new future.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section</h3>\n\n\n\n<h4 class=\"wp-block-heading\">Question 1: Hezbollah Rockets and Israeli Home Front</h4>\n\n\n\n<p><strong>Q</strong>: There have been reports of <strong>Hezbollah rockets</strong> in Tiberias and Nazareth. How far can Hezbollah’s rockets reach into Israel, and how is the Israeli home front preparing for such threats?</p>\n\n\n\n<p><strong>A</strong>: It’s well known that <strong>Hezbollah</strong> had hundreds of thousands of rockets before the IDF attacked its storages, arsenals, and headquarters. Many of these rockets are very specific and long-range. This remains a threat not only to Israel but also to the <strong>Arab towns in Israel</strong> and the <strong>Palestinian Authority in the West Bank</strong>. Though we’ve significantly cut back their supply, there’s still much work to do.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 2: Will Israel Ever Go Directly After Iran?</h4>\n\n\n\n<p><strong>Q</strong>: Will Israel ever go directly after the <strong>Islamic Republic of Iran</strong>?</p>\n\n\n\n<p><strong>A</strong>: That’s a very good question, and I have no intention of answering it directly here. But I’ll put it this way: everything we’ve been speaking about since October 7th—<strong>Gaza Strip, West Bank, Lebanon, Shiite militias in Syria and Iraq</strong>—all of this traces back to one entity: the <strong>Islamic Republic of Iran</strong>. Yes, there are other evils like <strong>Qatar</strong>, which funds the Muslim Brotherhood, and <strong>Erdogan’s Turkey</strong>, but if <strong>Iran’s will to create a global Islamic caliphate</strong> is quelled, many of the region&#8217;s problems will also be quelled.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 3: Can Lebanon Rid Itself of Hezbollah?</h4>\n\n\n\n<p><strong>Q</strong>: Is there really a possibility that <strong>Lebanon</strong> can rid itself of Hezbollah after they’ve been embedded in society and government since the 1970s?</p>\n\n\n\n<p><strong>A</strong>: It’s all a matter of the <strong>will of the Lebanese people</strong>. Lebanon was originally a sanctuary for Christians. Over time, they welcomed Muslims, who grew in number and became more aggressive, and in the 1970s, the Shiites came in, overtaking the country. Can Hezbollah be removed? <strong>Yes, it can</strong>. But it’s not going to be easy. Much work has already been done, and there’s still more to do, but ultimately, the fate of the Lebanese people is in their own hands, and the <strong>Lebanese army</strong> will need to take the reins.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 4: Dahiya Area of Beirut Strike</h4>\n\n\n\n<p><strong>Q</strong>: Can you explain what the <strong>Dahiya area</strong> of Beirut is, following today’s IDF strike?</p>\n\n\n\n<p><strong>A</strong>: <strong>Hezbollah</strong> embeds itself among the civilian population in <strong>Dahiya</strong>, a neighborhood in Beirut that has become their headquarters. <strong>Hezbollah uses homes, schools, hospitals</strong>—embedding their terror cells among civilians. This is similar to <strong>Hamas</strong> in Gaza, using the population as human shields. It’s the standard operating procedure for <strong>radical Islamist terrorist organizations</strong>.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 5: Egypt’s Loss of Revenue</h4>\n\n\n\n<p><strong>Q</strong>: What has caused <strong>Egypt</strong> to lose $6 billion in revenue from the <strong>Suez Canal</strong>, and what can be done about it?</p>\n\n\n\n<p><strong>A</strong>: Instability in the region, along with <strong>Iran-backed Houthi fighters</strong> targeting shipments, has significantly impacted Egypt’s income. <strong>Egypt</strong> is a 100-million-person republic, already facing economic challenges. The war has also harmed <strong>tourism</strong>. Red lines must be drawn to address the <strong>Houthis</strong> and stabilize the region. The root of the issue again leads back to the <strong>Islamic Republic of Iran</strong>.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Final Question: Message to the People of Lebanon</h4>\n\n\n\n<p><strong>Q</strong>: What is your message to the people of <strong>Lebanon</strong>?</p>\n\n\n\n<p><strong>A</strong>: Israel is <strong>not at war with the Lebanese people</strong>. We never were, and we never will be. There’s no ill feeling among Israelis toward civilians in Lebanon. In fact, we <strong>crave and dream of peace</strong> with the Lebanese people. We do not want to see <strong>Radwan forces</strong>, Hezbollah&#8217;s commando force, raping and massacring civilians, as they plan to do with our civilians in the north. We cannot accept unprovoked rocket attacks. Israel acted not only for its own people but for the <strong>region in general</strong>. Hopefully, in the future, we can exchange warm words and look forward to peace.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Today marks day 359 of the October 7 War, which began when <a  href=\"/hamas\">Hamas</a> attacked <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>, followed by <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s involvement. The war has now spread across seven fronts, with Iranian proxies engaging from multiple states. The death of <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>&#8216;s leader Hassan Nasrallah has been met with celebrations throughout the Arab world. Israel aims to counter Hezbollah and ensure regional stability.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17996,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-17995",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 17995
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17995",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17995"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17995/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17997,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17995/revisions/17997"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17996"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17995"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17995"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17995"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}