{
    "id": 17546,
    "date": "2024-09-12T16:42:50",
    "date_gmt": "2024-09-12T13:42:50",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17546"
    },
    "modified": "2024-09-12T16:49:35",
    "modified_gmt": "2024-09-12T13:49:35",
    "slug": "november-2023",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/terror-attacks/november-2023/",
    "title": {
        "rendered": "Palestinian Terrorism | November 2023"
    },
    "content": {
        "rendered": "\n<p><strong>November 2</strong> – Attack on Highway 557: Palestinian terrorists traveling on Highway 557 bypassed a vehicle of an Israeli reserve soldier near Shavei Shomron, fired at the vehicle, causing it to overturn. The driver was critically injured and later died.</p>\n\n\n\n<p><strong>November 2</strong> – Two 14-year-olds from Umm al-Fahm aroused the suspicion of police officers from the Tel Aviv Central Station near Savidor Central Station. During a check, knives were found on both of them, and they were taken for investigation. It is suspected they were planning a stabbing attack against soldiers.</p>\n\n\n\n<p><strong>November 3</strong> – Palestinian terrorists fired at the settlement of Rechelim, causing damage to homes. The Palestinian terrorists fled.</p>\n\n\n\n<p><strong>November 3</strong> – A Palestinian terrorist accelerated towards soldiers operating near the village of Tayasir, exited his car with a knife in his possession, and the soldiers shot him to death. No injuries were reported.</p>\n\n\n\n<p><strong>November 4</strong> – Palestinian terrorists arrived in a car at an IDF position near the village of Nabi Elias and opened fire at the IDF forces stationed there. One soldier was lightly injured.</p>\n\n\n\n<p><strong>November 6</strong> – The stabbing attack at the Flowers Gate in Jerusalem: A 16-year-old Palestinian terrorist from Issawiya attacked two Border Police officers with a knife near the Flowers Gate in the Old City of Jerusalem. One female officer was critically injured (later pronounced dead), and another officer was lightly injured. The Palestinian terrorist was shot and killed.</p>\n\n\n\n<p><strong>November 7</strong> – Attempted attack at the Qalandiya crossing: A Palestinian woman armed with a knife and carrying a Hamas flag approached the Qalandiya crossing and attempted to harm security forces. The Palestinian terrorist was neutralized at the scene after failing to heed the forces&#8217; orders.</p>\n\n\n\n<p><strong>November 7</strong> – A masked Palestinian terrorist armed with a knife arrived at the entrance to the settlement of Ofra. IDF forces opened fire at him. No injuries were reported, and the Palestinian terrorist fled toward the village of Ein Yabrud.</p>\n\n\n\n<p><strong>November 7</strong> – Palestinian minors threw stones at a bus in the city of Lod, causing damage. The Palestinian terrorists were arrested.</p>\n\n\n\n<p><strong>November 8</strong> – During an operation to demolish the home of a Palestinian terrorist who carried out the attack at the Shuafat checkpoint, masked individuals threw stones and blocks at the security forces. As a result, four police officers were lightly injured by the stones and rocks.</p>\n\n\n\n<p><strong>November 8</strong> – Palestinian terrorists fired at a vehicle carrying a couple and their baby between Givat Arnon and Gitit. Both parents were moderately injured.</p>\n\n\n\n<p><strong>November 16</strong> – During anti-terror operations as part of the Iron Swords War in Far&#8217;ah, an IDF soldier was lightly injured after the force was fired upon, and Molotov cocktails and explosives were thrown at them.</p>\n\n\n\n<p><strong>November 16</strong> – The shooting attack at the Tunnel checkpoint: Three Palestinian terrorists from Hebron carried out a shooting attack on the Tunnel Road (Highway 60) between Gush Etzion and Jerusalem, near the Palestinian city of Bethlehem. The attack combined shooting and explosive devices. Seven Israelis were injured in the incident, one of whom later died. The three Palestinian terrorists were killed at the checkpoint.</p>\n\n\n\n<p><strong>November 17</strong> – Two Palestinian terrorists arrived by car at the Zayit Junction in Hebron and opened fire at the forces operating there. Soldiers from Reserve Battalion 8106 shot and killed the two Palestinian terrorists. The forces also seized the Carlo-type weapon used in the shooting.</p>\n\n\n\n<p><strong>November 30</strong> – Shooting attack at the exit from Jerusalem: Two Palestinian terrorists from Sur Baher carried out a shooting attack at the exit junction from Jerusalem on Ben-Gurion Boulevard. Four Israelis were murdered, and 12 others were injured, ranging from mild to severe (including victims of shock). The Palestinian terrorists were shot and killed.</p>\n\n\n\n<p><strong>November 30</strong> – Car-ramming attack near the Bakaot checkpoint in the Jordan Valley: A Palestinian terrorist rammed his car into two soldiers, lightly injuring them. The Palestinian terrorist was neutralized.</p>\n\n\n\n<p><strong>November 30</strong> – Palestinian terrorists opened fire from a vehicle at an IDF patrol near Migdalim in Samaria. No injuries were reported, and the Palestinian terrorists fled.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The Palestinians carried out 292 terrorist attacks, resulting in the deaths of 7 Israelis and injuries to 18 others. Among the victims, 2 of the fatalities and 11 of the injured were members of the security forces.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17542,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1570,
        "footnotes": ""
    },
    "categories": [
        1570
    ],
    "tags": [
        1574
    ],
    "class_list": [
        "post-17546",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-terror-attacks",
        "tag-palestinian-terrorism"
    ],
    "lang": "en",
    "translations": {
        "en": 17546
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17546",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17546"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17546/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17547,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17546/revisions/17547"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17542"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17546"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17546"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17546"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}