{
    "id": 17540,
    "date": "2024-09-12T16:23:24",
    "date_gmt": "2024-09-12T13:23:24",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17540"
    },
    "modified": "2024-09-12T16:49:30",
    "modified_gmt": "2024-09-12T13:49:30",
    "slug": "october-2023",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/terror-attacks/october-2023/",
    "title": {
        "rendered": "Palestinian Terrorism | October 2023"
    },
    "content": {
        "rendered": "\n<p><strong>October 7</strong> – A Palestinian terrorist attempted to stab the security coordinator of Beit Aryeh and was neutralized.</p>\n\n\n\n<p><strong>October 7</strong> – A Palestinian terrorist attempted to run over soldiers near Al-Arub and was neutralized.</p>\n\n\n\n<p><strong>October 7</strong> – Palestinian terrorists threw a Molotov cocktail at the Lebanon border. IDF forces were dispatched to the area.</p>\n\n\n\n<p><strong>October 8</strong> – A stabbing attack was prevented in Jerusalem: Police arrested two Palestinian Arabs disguised as Jews near a synagogue in Givat Ze&#8217;ev, with a knife in their possession.</p>\n\n\n\n<p><strong>October 9</strong> – A Palestinian terrorist threw a Molotov cocktail at Border Police fighters and was neutralized.</p>\n\n\n\n<p><strong>October 10</strong> – Palestinian terrorists launched fireworks and threw stones at Border Police forces in the Silwan neighborhood. Two Palestinian terrorists who launched the fireworks were killed.</p>\n\n\n\n<p><strong>October 11</strong> – A Palestinian terrorist attempted to grab a soldier’s weapon at the Tunnel checkpoint on Highway 60 and was killed. A Border Police fighter was moderately injured by friendly fire during the incident.</p>\n\n\n\n<p><strong>October 12</strong> – Khaled Al-Mukhtasib, a 21-year-old Palestinian terrorist from Beit Hanina affiliated with the Popular Front, shot a Carlo submachine gun at officers at the entrance to the &#8220;Shalem&#8221; police station in Jerusalem, seriously and lightly injuring two officers. The Palestinian terrorist tried to escape but was shot and killed.</p>\n\n\n\n<p><strong>October 12</strong> – A Palestinian terrorist shot at IDF forces in the Talmonim area. One soldier was lightly injured by shrapnel, and the Palestinian terrorist was neutralized.</p>\n\n\n\n<p><strong>October 13</strong> – Riots in Judea and Samaria caused by Palestinians: <br>Four Palestinian terrorists were killed by Yamam forces after threatening lives with stones and Molotov cocktails near Tulkarm. <br>Palestinian terrorists opened fire at the cities of Mevo Dotan, Merav, the Salem checkpoint, and the Gilboa crossing (Jalama checkpoint). Palestinian terrorists attempted to attack Israeli vehicles on Highway 60, and IDF forces prevented their approach. During the activity, a Palestinian terrorist threw stones at the forces and was neutralized. Another Palestinian terrorist attempted to throw a stone at Israelis in the Hebron Hills. Additionally, several Palestinian terrorists left a mosque to try to attack Jews, and one was neutralized by a local civilian. No IDF forces were injured in any of these incidents.</p>\n\n\n\n<p><strong>October 13</strong> – Palestinian terrorists threw stones at a military vehicle near Immatin. IDF forces pursued the Palestinian terrorists, during which additional Palestinian terrorists fired at the vehicle. Another IDF force arrived at the scene. During the operation, a reserve officer was killed by friendly fire, and another soldier was lightly injured.</p>\n\n\n\n<p><strong>October 19</strong> – Clashes in the Nur Shams refugee camp: During anti-terror operations, 13 Palestinian terrorists were killed, along with one Border Police fighter. <br>Nine other fighters were lightly injured.</p>\n\n\n\n<p><strong>October 20</strong> – A Palestinian Hezbollah terrorist infiltrated from Lebanon, fired at IDF forces in Moshav Margaliot, and was shot to death. The attack was part of the Lebanese front in the Iron Swords War.</p>\n\n\n\n<p><strong>October 22</strong> – A Palestinian terrorist attempted to run over several IDF fighters near Al-Arub and was neutralized. Additionally, a knife was found in the Palestinian terrorist’s car during searches.</p>\n\n\n\n<p><strong>October 24</strong> – During anti-terror operations in Burqa, an explosive device was thrown at the forces by Palestinians. One reservist was moderately injured.</p>\n\n\n\n<p><strong>October 24</strong> – Palestinian terrorists opened fire at a minibus near Ras Karkar in Binyamin. During their escape, their vehicle overturned.</p>\n\n\n\n<p><strong>October 26</strong> – During anti-terror operations as part of the Iron Swords War, violent disturbances erupted, caused by Palestinians, as the forces were leaving an arrest in the city of Tubas. The riots included the throwing of explosives and stones at the forces, who responded with gunfire.</p>\n\n\n\n<p><strong>October 26</strong> – Palestinian terrorists attacked two Jewish shepherds with an axe and stones near the Rimonim junction in Binyamin. One was critically injured, and his life is in danger, while the other was lightly injured.</p>\n\n\n\n<p><strong>October 28</strong> – Palestinian terrorists shot at IDF forces in Maale Ephraim.</p>\n\n\n\n<p><strong>October 29</strong> – Palestinian terrorists shot at a passing vehicle near Shavei Shomron.</p>\n\n\n\n<p><strong>October 30</strong> – A Palestinian terrorist stabbed a Border Police fighter near the &#8220;Shivtei Yisrael&#8221; light rail station in Jerusalem on Bar-Lev Boulevard. <br>The forces chased him and shot him to death near the Jerusalem District Court. The stabbed fighter was seriously injured.</p>\n\n\n\n<p></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>In October, the Palestinians carried out 567 terrorist attacks, in which a member of the security forces was killed and 18 Israelis were injured</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17542,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1570,
        "footnotes": ""
    },
    "categories": [
        1570
    ],
    "tags": [
        1574
    ],
    "class_list": [
        "post-17540",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-terror-attacks",
        "tag-palestinian-terrorism"
    ],
    "lang": "en",
    "translations": {
        "en": 17540
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17540",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17540"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17540/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17544,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17540/revisions/17544"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17542"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17540"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17540"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17540"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}