{
    "id": 17902,
    "date": "2024-09-30T22:48:17",
    "date_gmt": "2024-09-30T19:48:17",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17902"
    },
    "modified": "2024-09-30T22:48:22",
    "modified_gmt": "2024-09-30T19:48:22",
    "slug": "omar-baddar",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/terrorist-sympathizer/omar-baddar/",
    "title": {
        "rendered": "Omar Baddar"
    },
    "content": {
        "rendered": "\n<p>Omar Baddar, a prominent Palestinian-American political analyst and digital producer, has carved out a niche in progressive circles as an advocate for Palestinian rights and U.S.-Middle East policy reform. With his polished credentials, including an M.A. in International Relations and key roles at various Arab-American organizations, Baddar presents himself as a well-reasoned commentator on complex geopolitical issues. However, behind the veneer of academic rigor and human rights advocacy lies a more troubling aspect: his defense of groups like Hamas, whose brutal tactics are impossible to ignore.</p>\n\n\n\n<p>Baddar’s activism, while framed as a fight for human rights, often veers into dangerous territory by either downplaying or justifying the actions of terrorist organizations like Hamas. After the horrific Hamas attacks on October 7, 2023, which left more than 1,400 civilians dead, Baddar’s response was notably lacking in direct condemnation. His focus instead shifted to Israel’s policies, as though the mass murder of innocents could be rationalized by grievances. This pattern of sidestepping the horrors inflicted by Hamas in favor of attacking Israel mirrors a broader trend among terror sympathizers who refuse to hold accountable those responsible for acts of barbarism.</p>\n\n\n\n<p>As a digital producer and former communications director for several influential organizations, Baddar holds considerable sway over public opinion. His refusal to unequivocally denounce Hamas and other terrorist organizations fosters a dangerous narrative—that their violent actions are somehow justified in the name of resistance. Such rhetoric not only undermines the legitimate pursuit of Palestinian rights but also emboldens extremists who exploit this ambiguity to carry out acts of terror.</p>\n\n\n\n<p>Baddar’s sympathies extend beyond Hamas, as evidenced by his praise of Hezbollah and its leader, Hassan Nasrallah, whom he has publicly referred to as a &#8220;hero.&#8221; Hezbollah, another Iran-backed terrorist organization, has been responsible for numerous attacks against civilians, including U.S. citizens, and continues to serve as a proxy for Iranian ambitions in the Middle East. By aligning himself with Hezbollah, a group that openly calls for the destruction of Israel and receives financial and military support from Iran, Baddar once again exposes his willingness to support violent extremists under the guise of political resistance. His praise for Nasrallah, a figure known for his violent anti-Israel rhetoric and terrorism, reveals an even deeper connection to organizations that thrive on violence and destabilization.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Omar Baddar, a prominent Palestinian-American political analyst and digital producer, has carved out a niche in progressive circles as an advocate for Palestinian rights and U.S.-Middle East policy reform. With his polished credentials, including an M.A. in International Relations and key roles at various Arab-American organizations, Baddar presents himself as a well-reasoned commentator on complex geopolitical issues. However, behind the veneer of academic rigor and <a  href=\"https://iron-swords.co.il/t/human-rights/\">human rights</a> advocacy lies a more troubling aspect: his defense of groups like <a  href=\"/hamas\">Hamas</a>, whose brutal tactics are impossible to ignore. Baddar’s activism, while framed as a fight for human rights, often veers into dangerous</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17903,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-useful-idiots",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1578,
        "footnotes": ""
    },
    "categories": [
        1578
    ],
    "tags": [],
    "class_list": [
        "post-17902",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-terrorist-sympathizer"
    ],
    "lang": "en",
    "translations": {
        "en": 17902
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17902",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17902"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17902/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17904,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17902/revisions/17904"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17903"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17902"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17902"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17902"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}