{
    "id": 17606,
    "date": "2024-09-16T15:00:00",
    "date_gmt": "2024-09-16T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17606"
    },
    "modified": "2024-09-17T08:04:53",
    "modified_gmt": "2024-09-17T05:04:53",
    "slug": "report-germany-is-holding-up-weapons-sales-to-israel-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/report-germany-is-holding-up-weapons-sales-to-israel-doron-spielman/",
    "title": {
        "rendered": "Report: Germany is Holding Up Weapons Sales to Israel | Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Report: Germany is Holding Up Weapons Sales to Israel | Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/r3IAQpC8cW8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>This <strong>Saturday, September 21st</strong>, our very own <strong>Alon Levy</strong> will be debating <strong>El Jaz&#8217;s Mediasan</strong> in New York City. If you&#8217;re in New York, you can <strong>buy a ticket</strong> and attend in person. If you&#8217;re not attending in person, you will be able to watch a <strong>live stream</strong> wherever you are in the world. You can even <strong>host a watch party</strong>. If you want to host a watch party, you can fill out a form, and we will send you materials. All of the relevant information and links will be available on our social media platforms today.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Germany&#8217;s Position on Weapons Exports to Israel</h3>\n\n\n\n<p>A very disturbing report states that <strong>Germany is holding up weapons exports to Israel</strong>. This situation is perplexing, as Germany claims to have a special relationship with the Jewish State and is committed to Israel&#8217;s defense. Following <strong>Hamas&#8217;s October 7th Massacre</strong>, <strong>German Chancellor Olaf Scholz</strong> pledged unconditional solidarity with Israel.</p>\n\n\n\n<p>However, despite this pledge, Germany is reportedly selling weapons to <strong>Qatar</strong>—a nation that <strong>hosts Hamas leadership</strong> and supports Israel&#8217;s destruction. While Israel is fighting a war on multiple fronts, Germany&#8217;s actions contradict its stated support for Israel&#8217;s right to defend itself.</p>\n\n\n\n<p>Since <strong>March</strong>, Germany has not granted any approval for arms exports to Israel, according to reports in <strong>German media</strong>. This includes allegations from Germany&#8217;s <strong>Economics Ministry</strong> regarding possible violations of international humanitarian law. Yet, Germany continues to sell <strong>100 million euros worth of weapons to Qatar</strong>, a country that supports terrorism and practices <strong>modern slavery</strong>.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Germany&#8217;s Role and Obligations</h3>\n\n\n\n<p>Germany needs to uphold its commitment, as stated by Chancellor Scholz: &#8220;In difficult times, Germany has only one place, and that is by Israel&#8217;s side.&#8221; <strong>Germany must follow through</strong> and support Israel in its time of need, instead of aiding one of the largest supporters of international terrorism.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ongoing Attacks from Hezbollah</h3>\n\n\n\n<p><strong>Rocket fire from Lebanon</strong> continues this week. This morning, sirens sounded in border towns, warning of incoming rockets. <strong>Hezbollah</strong> has been launching attacks almost daily since <strong>October 8th</strong>, just one day after <strong>Hamas</strong> started the war. Hezbollah claims it does not want war, but it continues to attack Israel with <strong>rockets, anti-tank missiles, and suicide drones</strong>. Over <strong>60,000 Israelis</strong> have fled their homes due to the danger.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Deception and Global Impact</h3>\n\n\n\n<p>Hezbollah&#8217;s leaders, like <strong>Naim Kasam</strong>, claim they don&#8217;t want war, but their actions say otherwise. <strong>Secretary of State Blinken</strong> and the international community must recognize that Hezbollah is already waging war, and Israel may be forced to <strong>push Hezbollah back</strong> if it does not stop its attacks.</p>\n\n\n\n<h3 class=\"wp-block-heading\">AP Reporting on the Role of Palestinian Youths in Terrorism</h3>\n\n\n\n<p>This week, the <strong>Associated Press</strong> inadvertently reported the truth about terrorism in <strong>Judea and Samaria</strong>. A headline suggested that <strong>Israel&#8217;s crackdown</strong> is killing Palestinian youths, but the reality is different. The AP photo used in the story featured <strong>teenagers holding weapons</strong>, showing that these individuals are not innocent victims but rather <strong>armed terrorists</strong>.</p>\n\n\n\n<p><strong>Hamas</strong> has tragically brainwashed <strong>minors</strong> in both Gaza and Judea and Samaria, sending <strong>16 and 17-year-olds</strong> to kill Israelis. The media, unfortunately, often overlooks this child abuse, which is enabled by a radicalized society and supported by <strong>Western governments</strong> and the news media.</p>\n\n\n\n<h3 class=\"wp-block-heading\">If Israeli Ground Forces Enter Lebanon</h3>\n\n\n\n<p>If Israeli ground forces enter <strong>Lebanon</strong>, it will not look good for Hezbollah. Israeli forces are <strong>trained to fight Hezbollah</strong>, which has historically been one of the world&#8217;s most dangerous terrorist organizations. Since the <strong>Second Lebanon War</strong> in 2006, Hezbollah has violated international law, consistently targeting <strong>Israeli citizens</strong> with rocket fire.</p>\n\n\n\n<p>Hezbollah, backed by <strong>Iran</strong>, is in violation of <strong>UN Security Council Resolution 1701</strong>, which mandated that Hezbollah withdraw from the <strong>Litani River</strong> and cease firing rockets at Israel. <strong>Israeli National Defense</strong> demands that Hezbollah be pushed back to ensure the safety of Israeli citizens.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ballistic Missile Fired from Yemen</h3>\n\n\n\n<p>Recently, a <strong>ballistic missile</strong> was fired from <strong>Yemen</strong> toward <strong>central Israel</strong>, marking a significant escalation. Ballistic missiles, capable of traveling at speeds up to <strong>20,000 km/h</strong>, pose a massive threat due to their destructive power, which can devastate entire cities.</p>\n\n\n\n<p>The <strong>Houthis</strong> in Yemen are not only targeting Israel but also <strong>Western ships</strong> in international waters, driving up global shipping costs and causing international economic instability. This terror group must be addressed by the global community before its threat expands further.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Reflection on the Abraham Accords</h3>\n\n\n\n<p>Four years after the signing of the <strong>Abraham Accords</strong>, which symbolized peace between Israel and several <strong>Arab nations</strong> like the <strong>Emirates</strong> and <strong>Morocco</strong>, the agreements remain strong. Despite <strong>Iran&#8217;s aggression</strong>, these nations have stood by Israel in the face of terrorism. The <strong>Abraham Accords</strong> demonstrate Israel&#8217;s desire for peace in the region, and it is a model for future cooperation with the Arab world.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Reliance on Global Partners and the Need for Independence</h3>\n\n\n\n<p>As the current war highlights Israel&#8217;s <strong>reliance on foreign weapons</strong>, including from countries like <strong>Germany</strong> and the <strong>United States</strong>, there is a growing movement in Israel to <strong>ramp up domestic weapons production</strong>. A <strong>military committee</strong> has been established to plan for the next decade, aiming to reduce dependence on foreign arms and increase <strong>indigenous military capabilities</strong>.</p>\n\n\n\n<p>Existing <strong>Israeli facilities</strong> have already quadrupled their production, but building an industry capable of sustaining Israel’s defense needs will take time. This shift is one of the war&#8217;s most important lessons.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Closing Remarks</h2>\n\n\n\n<p>Thank you for joining us today. Every day at <strong>3:00 PM Israel time</strong> and <strong>8:00 AM Eastern Standard Time</strong>, we are here to bring you updates and insights on Israel&#8217;s defense efforts. Your support and understanding are essential in allowing <strong>the truth</strong> to break through the <strong>disinformation</strong> spread by terrorists like Hamas and Hezbollah. Stay informed, stay united, and continue to stand with Israel.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On September 21st, Alon Levy will debate in New York, while <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> faces ongoing challenges in the October 7th War. Germany&#8217;s contradictory arms policies, <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s attacks from Lebanon, and missile threats from Yemen escalate tensions. Israel emphasizes increasing domestic weapons production and reflects on the success of the Abraham Accords.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1304
    ],
    "class_list": [
        "post-17606",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-doron-spielman"
    ],
    "lang": "en",
    "translations": {
        "en": 17606
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17606",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17606"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17606/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17607,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17606/revisions/17607"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17606"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17606"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17606"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}