{
    "id": 17751,
    "date": "2024-09-22T18:00:00",
    "date_gmt": "2024-09-22T15:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17751"
    },
    "modified": "2024-09-24T08:04:47",
    "modified_gmt": "2024-09-24T05:04:47",
    "slug": "statement-of-the-chief-of-staff-lt-col-hartzi-halevi-22-09",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/statement-of-the-chief-of-staff-lt-col-hartzi-halevi-22-09/",
    "title": {
        "rendered": "Statement of the Chief of Staff, Lt. Col. Hartzi Halevi &#8211; 22.09"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"הצהרת הרמטכ&quot;ל, רא&quot;ל הרצי הלוי - 22.09\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/xj1fEwsMYsY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hitting Hizbullah&#8217;s Elite Radwan Unit</strong></h3>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Strike on Hizbullah Commanders</strong></h3>\n\n\n\n<p>Last Friday, we hit the chain of command of Hizbullah&#8217;s elite force, the Radwan unit, and their senior commander, Baraiim Mekil, is an exterminator. This is a very important ability in the Hizbullah organization. I know how much it shakes the organization. These commanders have been planning for years plans to conquer the Galilee. Soldiers for years they have been planning how to carry out the next attack.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hizbullah&#8217;s Plan to Infiltrate Israel</strong></h3>\n\n\n\n<p>This may be what they were dealing with in that meeting on Friday afternoon: how to infiltrate the State of Israel to murder civilians and kidnap IDF soldiers. In Hizbullah&#8217;s chain of command, it is a clear message to the Hizbullah organization, it is hurting it badly, and it is also a message to the entire Middle East, and even more so, we will know how to reach anyone who threatens the citizens of the State of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>IDF&#8217;s Efforts Against Hizbullah</strong></h3>\n\n\n\n<p>The capabilities and infrastructure of this force, in various ways and tricks, are being initiated and operated non-stop since the beginning of the war. The Israel Defense Forces have hit sabotage systematically and day after day for months. Those Israeli citizens who live near the border and want to know that he will no longer be found there, we have killed over 600 terrorists, dozens of them from the top military ranks of the Hizbullah organization. The price Hizbullah is paying is increasing.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Threat to Northern Israel</strong></h3>\n\n\n\n<p>The North is shooting at civilians. No sovereign country can allow such a threat to its citizens and its sovereignty. Hizbullah places its launchers near Lebanese citizens, thereby endangering them. We will do everything necessary to remove and thwart threats against the State of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>IDF&#8217;s Continued Operations and Readiness</strong></h3>\n\n\n\n<p>He didn&#8217;t understand it even after the last two weeks. He will receive another blow and another blow until this organization understands. We have to say that we have many more capabilities that we have not yet activated. We are at a very high level of readiness both in attack and in defense. To turn from here tonight to the residents of the north and I remember very well that for almost a year you are not in your homes.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>IDF&#8217;s Commitment to Civilians</strong></h3>\n\n\n\n<p>I want you to know that the IDF is working around the clock with many forces to return you to your homes safely. We will not compromise on the security of you, your families, your children. We do it hand in hand with the heads of the authorities, the heads of the councils. I must say, in these complex days, they are showing exceptional leadership that deserves great appreciation from all of us.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Effective Civilian Response in the North</strong></h3>\n\n\n\n<p>The residents of the home front should continue to behave responsibly, as you did throughout the war, as many did this morning in the north in the tensions that were fired into the north of the country. The behavior that was this morning saved lives. Many rockets were fired, the vulnerabilities are few thanks to proper behavior and very high-quality air defense. These we will keep going forward.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Fighting on Multiple Fronts</strong></h3>\n\n\n\n<p>We are fighting on many fronts. Our enemies will try to challenge us in the future as well. I know it is not easy, but we must remember that proper conduct by all of us will prevent the enemy&#8217;s achievements and is worth a great effort. For over a month, Israel has been fighting with determination both in the south and in the north.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>IDF Operations Beyond the Borders</strong></h3>\n\n\n\n<p>At the same time, we are working in Judea and Samaria and on the front lines in eastern Iraq, Yemen, and of course Iran. We are fighting to achieve all the goals of the war. This is important and urgent, and of course, the safe return of the residents of the north to their homes.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Impact on Hizbullah and the Middle East</strong></h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Price Hizbullah Pays</strong></h3>\n\n\n\n<p>On behalf of the entire IDF, it is important to say we salute those who pay the heavy price of our war: the families of the bereaved and the wounded. We remember how painful this price is. We will continue to follow the path of the fallen, the path of the wounded—both persistently, with determination and strength.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Ongoing Battle Against Hizbullah</strong></h3>\n\n\n\n<p>The commanders of the IDF and its fighters, both on a regular basis and many, many reservists, who are doing great quality work and have been fighting for a long time—even at these moments—are at all the borders fighting in all the arenas. All the soldiers, all the commanders are fighting to protect our security here in the State of Israel. Attacks have become really more significant and are still limited or tense.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Hizbullah&#8217;s Response and Israel&#8217;s Strategy</strong></h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Awaiting Hizbullah&#8217;s Response</strong></h3>\n\n\n\n<p>It seems as if we are still waiting for Hizbullah&#8217;s response in order to understand how we will respond. The question is why exactly are we waiting for and what needs to happen in order for us to reach an all-out campaign.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hizbullah&#8217;s Arsenal and Capabilities</strong></h3>\n\n\n\n<p>And another question for you: according to estimates, Hizbullah has 5,000 missiles and rockets for the June period and another 5,000 for the long term. Spokesman Tzel says that we have heard thousands of launch canes, some of this arsenal. And Hizbullah&#8217;s capabilities are actually mandated until on the eighth of October Hizbullah joined the terrorist organization Hamas in the war against the State of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Israel Takes Initiative Against Hizbullah</strong></h3>\n\n\n\n<p>Starting in October, we take the initiative and work to attack Hizbullah without an attack. We do not wait. Many thousands of rockets, hundreds of operatives, dozens of commanders, and we continue to do this every day. If I look only at the last two weeks, there is not a day that many rockets have not been hit, and no operatives have been killed.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>IDF&#8217;s Preparedness in the Syrian Arena</strong></h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Readiness for Escalation</strong></h3>\n\n\n\n<p>To tell about the preparation of the IDF in front of the Syrian arena. Do you estimate that Hezbollah will try to activate it as well if a wider campaign breaks out? And another question you have regarding the IDF&#8217;s investigations: in recent months, the IDF has narrowed the presentation of the investigations after the storm that broke out over the investigation in the mountains.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Transparency of IDF Investigations</strong></h3>\n\n\n\n<p>Are the delays in presenting the investigations transparently to the public due to that public uproar? When will the other investigations be presented to the public? In the Syrian arena, we maintain a very high level of preparedness. We operate in the Syrian arena, attacking there from time to time. Our readiness to welcome an enemy with great force and to solve challenges both in the Golan Heights and in the Syrian arena.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>IDF&#8217;s Commitment to Ongoing Investigations</strong></h3>\n\n\n\n<p>As for the investigations, the IDF did not stop the investigations. We defined it at the beginning of the war. Barry was introduced earlier for a very specific reason in a sensitive event that was there in September, which had to be released. This is what we did. We reassured many people who were worried and hurt about what happened in Barry. We continue to investigate. We continue to move forward, determined to fight.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Efforts to Rescue Abductees</strong></h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Military Pressure and Risk to Abductees</strong></h3>\n\n\n\n<p>The contacts for the kidnapping deal have not been held for two weeks. Today the Prime Minister said that at least half of the abductees are still alive. What do you reply to the families who claim that the military pressure puts them at risk and they are simply very much on the verge of despair? Every Shabbat we see them.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Support for Abductee Families</strong></h3>\n\n\n\n<p>They feel that the state is beginning to abandon them, and they fear that there will be 101 more abducted. Shabbat is all a war goal, a war goal, and it needs to be done quickly, as the clock of the abducted counts at a faster rate. So, we are working for this purpose both with determination and with great precision so as not to harm the abductees. Even today, with the distribution of attention to the North, we are working towards this.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>IDF&#8217;s Precision in Combat Operations</strong></h3>\n\n\n\n<p>All the abductees who are alive must be brought quickly so that they remain alive. For those who are not alive, the ones who are dead, we also want to bring them. I want you to know that our combat operations are carried out as precisely and professionally as possible to create the military pressure that will lead to an agreement under the right conditions, and on the other hand to prevent unnecessary risk to abductees.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Professionalism and Determination in Rescues</strong></h3>\n\n\n\n<p>We are aware of this. We remember this. This is the most noble mission; they are ready to do anything for her, and they act very professionally.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Israel&#8217;s Continuous Efforts for Abductees</strong></h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Focus on Hostage Recovery</strong></h3>\n\n\n\n<p>Last question, Aden Solomon Haaretz: the Chief of Staff, do you think that even today, when most of the attention is directed to the north, Israel is doing everything it can to help free the abductees?</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>IDF&#8217;s Operational Adaptation</strong></h3>\n\n\n\n<p>The IDF should be a bigger army, but an army at any point in time does the best with what it has at the current point in time. This is what we are doing today. We have been fighting in Gaza for almost a year with great determination. We have returned many hostages alive. Hizbullah is severely damaged in all parts of the Gaza Strip, and we did not stop dismantling and attempting to return the abductees. We are also fighting in other areas and know how to change our modes of operation so that the Hamas operatives from the Hamas terrorists in the Gaza Strip will not feel any relief due to the fact that we are fighting harder and increasing our presence in the northern arena as well.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Determination in the Northern Arena</strong></h3>\n\n\n\n<p>We will continue to work to realize the war&#8217;s goals, including the safe return of the abducted. We will try to do it as soon as possible. The clock is ticking, and this mission remains critical.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Commitment to Victory</strong></h3>\n\n\n\n<p>Friends, thank you very much for your continued support. We must remember that every action taken is aimed at protecting the security of our people and ensuring a future free from threats. The sacrifices made by our forces, the leadership shown by our commanders, and the resilience of our citizens are all a testament to the strength of Israel. Let&#8217;s continue with determination, vigilance, and hope as we face the challenges ahead.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s operations against Hizbullah target leadership, disrupt attacks, rescue abductees, and ensure civilian safety amid ongoing regional conflicts.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17753,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [
        32,
        1586
    ],
    "class_list": [
        "post-17751",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson",
        "tag-idf",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 17751
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17751",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17751"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17751/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17754,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17751/revisions/17754"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17753"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17751"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17751"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17751"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}