{
    "id": 17601,
    "date": "2024-09-12T15:00:00",
    "date_gmt": "2024-09-12T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17601"
    },
    "modified": "2024-09-17T01:06:57",
    "modified_gmt": "2024-09-16T22:06:57",
    "slug": "swiss-parliament-votes-to-defund-unrwa-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/swiss-parliament-votes-to-defund-unrwa-daniel-rubenstein/",
    "title": {
        "rendered": "Swiss parliament votes to defund UNRWA | Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Swiss parliament votes to defund UNRWA | Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/ld9CMd0GTOY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today marks day 342 of the October 7th War, and we begin by discussing the recent comments from UN Secretary-General Antonio Guterres. He stated that Israeli airstrikes targeting Hamas terrorists at a school in Gaza, which was being used as a shelter, resulted in the deaths of six UNRWA staff members. Guterres tweeted, &#8220;What&#8217;s happening in Gaza is totally unacceptable. Six of our UNRWA colleagues are among those killed.&#8221; This was described as the highest death toll among UNRWA staff in a single incident.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF&#8217;s Response to the UN Claims</h3>\n\n\n\n<p>In response to these allegations, Lieutenant Colonel Nadav Shoshani, the international spokesman of the IDF, issued a statement, which I will read in full: &#8220;Yesterday, the Israel Air Force conducted a precise strike on terrorists operating inside a command and control center embedded within a compound that previously served as the Al-Jon School in central Gaza. Upon receiving reports claiming that local Palestinian UNRWA workers were killed as a result of the strike, the IDF requested that the agency provide details and names of the workers in order to thoroughly review the claim. To date, no answers have been provided by UNRWA despite repeated requests.&#8221;</p>\n\n\n\n<p>Furthermore, the IDF suggests that a significant number of the names mentioned in the media and social networks are actually Hamas operatives involved in terrorist activities against Israeli civilians and IDF troops.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questioning UNRWA’s Claims: What Are Their Names?</h3>\n\n\n\n<p>Whenever UNRWA claims that its employees were killed in an Israeli strike and Israel insists that the target was Hamas terrorists, there&#8217;s a simple question that needs to be asked: <strong>What are their names?</strong> It is almost never seen that UNRWA publishes the names of the employees they claim were killed. Why is that? Let me know your thoughts in the comments.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Switzerland Moves to Suspend Contributions to UNRWA</h3>\n\n\n\n<p>In a rare move of European action, the Swiss National Council has called for the immediate suspension of contributions to UNRWA and the replacement of UNRWA by a more competent aid organization. This is significant because the head of UNRWA, Philippe Lazzarini, is Swiss and tried to prevent this motion from passing. Swiss lawmakers saw through the corruption within UNRWA, an organization filled with Hamas sympathizers.</p>\n\n\n\n<h3 class=\"wp-block-heading\">UNRWA Employees and the October 7th Massacre</h3>\n\n\n\n<p>In an intercepted phone call on October 7th, a UNRWA teacher was heard saying, &#8220;We have female hostages; I captured one.&#8221; This is what international donors have been funding. For years, Hamas has relied on UNRWA to handle health and education in Gaza while Hamas invests its resources in weapons and tunnels. The Swiss Parliament is right to address this issue, and the motion will now go to the Upper House. We must maintain pressure to dismantle UNRWA.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas Profiting from Humanitarian Aid</h3>\n\n\n\n<p>In an astonishing report, Israeli media has revealed that Hamas has made half a billion dollars from humanitarian aid deliveries since October 7th. Over 200 aid trucks enter Gaza daily from Israel, but much of this aid is taken by Hamas from UNRWA warehouses and sold to the Gaza population. Hamas uses this revenue to pay its fighters. Could this be why the UN keeps pushing the narrative of starvation, hoping to secure more aid that ultimately benefits Hamas?</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel’s Successes on the Battlefield</h3>\n\n\n\n<p>Israel is successfully weakening Hamas on the battlefield. Israel&#8217;s Defense Minister Yoav Gallant shared a letter from a Hamas Brigade Commander to Hamas leader Yahya Sinwar, revealing that 50% of Hamas’s men have been killed or injured, 90-95% of rockets are gone, and significant portions of personal weapons and anti-tank weapons are lost. Israel has eroded Hamas’s military capabilities, but we must ensure that Hamas is not allowed to recover and continue its terrorist activities.</p>\n\n\n\n<h3 class=\"wp-block-heading\">South Africa’s Genocide Case Falling Apart</h3>\n\n\n\n<p>In a separate development, the South African government’s genocide case at the International Court of Justice (ICJ) appears to be collapsing due to a lack of evidence. South Africa claimed genocide—not by Hamas, but by Israel—and is now seeking more time to find proof. This case was initially seen as an attempt to prevent Israel from entering Hamas’s stronghold in Rafah and was rumored to be funded by Iran.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions from the Audience: Why Israel Cooperates with UNRWA</h3>\n\n\n\n<p>Our first question comes from Shlomo on Instagram, asking why Israel continues to work with UNRWA despite its ties to Hamas. The answer lies in the complexity of the ongoing multi-front war. Humanitarian aid is necessary to avoid a humanitarian catastrophe in Gaza, which would ultimately burden Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ensuring UNRWA’s Replacement Does Not Become Another Terrorism Front</h3>\n\n\n\n<p>Jefferson and Eve from Instagram ask how we can ensure that a replacement for UNRWA does not also become a front for terrorism. While there are no guarantees, removing politics from humanitarian aid is key. UNRWA, which employs a large portion of the Gaza population—many of whom are tied to Hamas—must be replaced by organizations like UNHCR that provide aid based on need.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Reaching Out to UN Organizations</h3>\n\n\n\n<p>Mana Le on Instagram asks about the best way to reach out to UN organizations. The most effective approach is public pressure and engaging with the governments funding these organizations. UNRWA raises funds independently, so it’s crucial to focus on the countries that support it, such as the US, Germany, and Switzerland.</p>\n\n\n\n<h3 class=\"wp-block-heading\">ICC’s Politicization</h3>\n\n\n\n<p>Ramona on YouTube inquires about the ICC’s integrity after its chief prosecutor made false statements about Israeli leaders. The ICC has long been criticized for being politicized and anti-Israel, much like other international organizations that are easily swayed by accusations and lies against Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel’s Operations in Syria</h3>\n\n\n\n<p>Israeli strikes on Iranian entrenchments in Syria are part of a larger effort to prevent Iran from establishing military positions on Israel&#8217;s borders. Israel’s operations in Syria aim to stop Iran’s attempts to extend its influence in the region.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Preparing for the One-Year Anniversary of October 7th</h3>\n\n\n\n<p>Talia on Instagram asks how Jews and Israel supporters can prepare for the one-year anniversary of the October 7th Massacre. This date will serve as a grim reminder that the war is ongoing and that Israeli hostages remain in Hamas’s hands. We must continue pressuring Hamas and its backers to end the war and secure the release of hostages.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>That’s all the time we have for today. As always, follow me on Twitter (X) at @PaulRubin and on Instagram at @RubyguidesIsrael for more updates. Feel free to DM your questions if I didn’t get to them today. Stay safe, and have a quiet weekend.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Today&#8217;s update on the October 7th War discusses UN Secretary-General Guterres&#8217; claims about Israeli airstrikes, the IDF&#8217;s response, Switzerland&#8217;s push to suspend contributions to <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a>, and revelations about <a  href=\"/hamas\">Hamas</a> profiting from humanitarian aid. The article also highlights <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s battlefield successes and the politicization of international organizations.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312
    ],
    "class_list": [
        "post-17601",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "en",
    "translations": {
        "en": 17601
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17601",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17601"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17601/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17603,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17601/revisions/17603"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17601"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17601"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17601"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}