{
    "id": 17599,
    "date": "2024-09-08T15:00:00",
    "date_gmt": "2024-09-08T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17599"
    },
    "modified": "2024-09-17T00:55:18",
    "modified_gmt": "2024-09-16T21:55:18",
    "slug": "terrorist-attack-at-israel-jordan-border-crossing-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/terrorist-attack-at-israel-jordan-border-crossing-ruth-wasserman-lande/",
    "title": {
        "rendered": "Terrorist attack at Israel-Jordan border crossing | Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Terrorist attack at Israel-Jordan border crossing | Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/etpYZpK7IqQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a>Today marks day 338 of the October 7th War, and the conflict continues to escalate. Early this morning, three Israeli men were murdered at the border between Jordan and Israel. A terrorist from Jordan drove a truck to the Allen B Bridge border crossing and opened fire at the men. The tragic incident underscores the ongoing volatility in the region despite decades of peace between Israel and Jordan.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Importance of the Israel-Jordan Peace Agreement</h2>\n\n\n\n<p>Israel and Jordan have maintained peace for over 30 years. Jordan relies on Israel for much of its water supply, and both countries work together to prevent cross-border attacks. Jordan has even aided Israel by intercepting Iranian missiles before they could hit Israeli targets. However, the real problem in the region is the Iranian regime.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Influence in Jordan and the Region</h2>\n\n\n\n<p>The Islamic Republic of Iran seeks to destabilize the Jordanian monarchy by flooding the country with weapons and strengthening Hamas, a terrorist organization operating within Jordan. Iran provides funding, logistics, and training to extremist groups that threaten both Israel and Jordan. While Israel and Jordan have their differences, both nations must collaborate to counter Iran&#8217;s growing influence in the region.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Multi-Front War and Global Impact</h2>\n\n\n\n<p>Iran&#8217;s aggression isn&#8217;t limited to Israel and Jordan. The regime has been sending weapons and support to countries worldwide, including Russia. For instance, Iran supplied over 200 ballistic missiles to Russia, which are being used in Ukraine. A Ukrainian defense source has warned that if civilians die from these missiles, Iran will face severe consequences. The Iranian regime&#8217;s proxy armies have killed hundreds of thousands in Iraq, Syria, Lebanon, and Yemen, and its influence continues to grow.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Iranian Threat to Israel and Europe</h2>\n\n\n\n<p>Iran’s missile attacks on Israel are part of its larger strategy to destabilize the Middle East. In April, Iran launched the second-largest ballistic missile attack in history, targeting Israel. These missiles can reach all of Israel, parts of Europe, and even as far as Ukraine. Iran prefers to operate through proxy forces to avoid direct consequences, letting other countries bear the brunt of the destruction.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israel and NATO: Facing a Common Threat</h2>\n\n\n\n<p>Both Israel and NATO face the same threat from the Iranian regime. Standing with Israel means supporting a secure Middle East, a safe Europe, and a more stable future for humanity. The regime&#8217;s missile and drone attacks on Israel are the same types of weapons Russia uses against Ukraine.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h1 class=\"wp-block-heading\">Jordan’s Dual Policy on Israel: Cooperation and Public Criticism</h1>\n\n\n\n<h2 class=\"wp-block-heading\">Cooperation Between Israel and Jordan</h2>\n\n\n\n<p>Jordan’s monarchy cooperates with Israel on security and economic matters, including receiving water and preventing attacks. This cooperation is crucial for maintaining stability in the region, especially given Jordan&#8217;s location between Israel and Iran-influenced countries like Iraq. The West, particularly the U.S., has a strategic interest in ensuring that Iran does not gain further influence in Jordan.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Public Criticism of Israel by Jordan’s Leaders</h2>\n\n\n\n<p>Despite this cooperation, Jordan’s leadership, including Queen Rania, often publicly criticizes Israel, especially during times of heightened tensions such as Ramadan. The majority of Jordan’s population is Palestinian, and the monarchy uses anti-Israel rhetoric to maintain its legitimacy among its citizens and prevent potential uprisings. Queen Rania’s public berating of Israel is part of this broader strategy to retain internal stability.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h1 class=\"wp-block-heading\">The Situation in Northern Israel: A Year of Rocket Fire</h1>\n\n\n\n<h2 class=\"wp-block-heading\">Rocket Attacks from Lebanon</h2>\n\n\n\n<p>Today marks 11 months since Hezbollah began firing rockets into Israel as part of the October 7th War. Approximately 50 rockets were fired from Lebanon overnight, with 20 aimed at the city of Kiryat Shmona. This ongoing barrage has displaced tens of thousands of Israelis from the northern part of the country.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hezbollah’s Role and International Response</h2>\n\n\n\n<p>Hezbollah, a proxy of Iran, has been using Lebanon as a base to attack Israel. Despite the presence of UN peacekeeping forces (UNIFIL) along the Israel-Lebanon border, Hezbollah continues to fire rockets into Israel, putting civilians at risk. The international community has remained largely silent on these attacks, which further highlights the double standard in how the world responds to violence in the region.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h1 class=\"wp-block-heading\">Humanitarian Aid and Israeli Hostages: Balancing Ethics and Security</h1>\n\n\n\n<h2 class=\"wp-block-heading\">Israel’s Humanitarian Efforts in Gaza</h2>\n\n\n\n<p>Despite the ongoing conflict and the fact that Hamas continues to hold Israeli hostages, Israel recently sent polio vaccines into Gaza. This is not the first time Israel has provided humanitarian aid to Gaza, as the country consistently aims to protect civilian lives on both sides of the conflict. While Hamas hides behind civilian infrastructure, Israel works to minimize casualties and ensure the welfare of Palestinian civilians, especially children.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hamas’ Strategy of Hostage Taking</h2>\n\n\n\n<p>Hamas has continued to hold Israeli hostages, using them as bargaining chips to further their goals. Recently, there have been reports that Yahya Sinwar, a Hamas leader, planned to escape to Iran with Israeli hostages through the Philadelphia Corridor. While unconfirmed, this aligns with Hamas’ history of exploiting human lives for political gain.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h1 class=\"wp-block-heading\">Conclusion: The Importance of Global Awareness and Action</h1>\n\n\n\n<p>The ongoing conflict in Israel and the broader Middle East is not an isolated issue. The actions of the Iranian regime have global consequences, from missile attacks in Israel to the war in Ukraine. It is crucial for the international community to recognize the extent of Iran’s influence and to stand with Israel and other nations in their fight for security and peace.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A: Audience Questions</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Ruth’s Question: Jordan’s Monarchy vs. Its People</h3>\n\n\n\n<p>The Jordanian monarchy is aligned with Israel and the West, but the population is predominantly Palestinian, and there is strong anti-Israel sentiment. Jordan’s leaders, including Queen Rania, often publicly criticize Israel to appease their population, despite ongoing cooperation with Israel on security and economic matters.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Kirat Shmona: Rocket Attacks and Displacement</h3>\n\n\n\n<p>Northern Israel, including Kirat Shmona, has been under constant rocket fire from Hezbollah for the past 11 months. Thousands of Israelis have been displaced, yet the international community remains silent.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Polio Vaccines in Gaza: Humanitarian Aid Amid Hostage Crises</h3>\n\n\n\n<p>Israel has provided polio vaccines to Gaza, despite Hamas holding Israeli hostages. Israel continues to prioritize the well-being of civilians, even as Hamas exploits the situation for political gain.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Yahya Sinwar’s Escape Plans</h3>\n\n\n\n<p>There are unconfirmed reports that Hamas leader Yahya Sinwar planned to escape to Iran with Israeli hostages. This is part of Hamas’ broader strategy to use hostages for political leverage.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h2 class=\"wp-block-heading\">Closing Remarks</h2>\n\n\n\n<p>Thank you for joining us today. We’ll be back tomorrow at 3 P.M. Israel time with more updates and answers to your questions.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The ongoing October 7th War continues with a deadly attack on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>’s border. <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s influence fuels instability across the region, supporting terrorist groups like <a  href=\"/hamas\">Hamas</a>. Israel and Jordan, despite differences, cooperate for security. The global threat extends to Ukraine, with Iran supplying missiles to Russia for attacks.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-17599",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 17599
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17599",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17599"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17599/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17600,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17599/revisions/17600"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17599"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17599"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17599"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}