{
    "id": 17491,
    "date": "2024-09-03T15:00:00",
    "date_gmt": "2024-09-03T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17491"
    },
    "modified": "2024-09-07T22:10:51",
    "modified_gmt": "2024-09-07T19:10:51",
    "slug": "the-uk-targets-israels-ability-to-defend-itself-with-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/the-uk-targets-israels-ability-to-defend-itself-with-ruth-wasserman-lande/",
    "title": {
        "rendered": "The UK Targets Israel’s Ability to Defend Itself | with Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"guten-element guten-video guten-Zu8pmF\"><div class=\"guten-video-wrapper\" data-property=\"{&quot;url&quot;:&quot;https://youtu.be/ViwZ7yWROog&quot;,&quot;class&quot;:&quot;guten-video-background&quot;,&quot;width&quot;:&quot;100%&quot;,&quot;height&quot;:&quot;500px&quot;,&quot;controls&quot;:true,&quot;playsinline&quot;:true,&quot;style&quot;:{},&quot;config&quot;:{&quot;youtube&quot;:{&quot;playerVars&quot;:{}}}}\"></div></figure>\n\n\n\n<p>Today marks day 333 of the October 7th War, and let&#8217;s get right to the point: Israel&#8217;s prime minister said last night that Hamas has rejected every hostage release deal since November 2023. Don&#8217;t take Israel&#8217;s word for it. On April 27th, U.S. Secretary of State Antony Blinken said Israel made an extraordinarily generous offer. On May 31st, Israel agreed to a U.S.-backed proposal, but Hamas refused. Again, on August 16th, Israel agreed to an American final bridging proposal, and once more, Hamas rejected it. Then, on August 19th, Secretary Blinken said Israel accepted the U.S. proposal, but Hamas still refused. On August 21st, the U.S. Deputy CIA Head said Israel has shown seriousness in negotiations and that now Hamas must show the same seriousness.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Does Hamas Want to Release the Hostages?</strong></h4>\n\n\n\n<p>Hamas is executing hostages. What is the proper response to this? Is it to pressure Israel? That just doesn’t make sense. If you pressure Israel, you&#8217;re telling Hamas that its strategy is working. You&#8217;re telling Hamas, &#8220;Don’t concede anything, execute more hostages.&#8221; What we need is massive pressure on the hostage takers—on Hamas—and massive pressure on Hamas&#8217; backers: Qatar, Turkey, and Iran. We need massive pressure now before it&#8217;s too late. It&#8217;s nice that world leaders are saying Hamas must release the hostages, but without action, Hamas has no reason to listen. Tell your leaders to give Hamas, Qatar, Turkey, and Iran a reason to listen. Don’t just say hostages should be released, act to make it happen.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The UK&#8217;s Controversial Decision on Arms Exports</strong></h4>\n\n\n\n<p>I&#8217;m sorry to say, but the United Kingdom made a terrible decision. The UK suspended 30 arms export licenses to Israel. This decision, now, when Hamas is executing hostages, sends a terrible message to Hamas and terrorists in general. It tells Hamas, &#8220;Hey guys, terror works. If you continue holding hostages, if you continue trying to murder Israeli children while hiding behind your own children, the UK will deny Israel’s ability to defend itself.&#8221; It’s obscene. UK Foreign Secretary David Lammy rightly said that Hamas doesn’t care at all about international humanitarian law. You’d think he would take steps to pressure Hamas, right? But instead, he said the UK must assess Israel’s compliance with international law—a decision detached from reality as Israel fights a barbaric enemy in densely populated areas. The UK says Hamas is bad but acts to punish Israel. The UK should stand with Israel, a fellow democracy defending itself against barbarism, in both word and deed.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The Broader Implications of UK Arms Withholding</strong></h4>\n\n\n\n<p>In his address to Parliament, Secretary Lammy spoke several times about Israel’s right to self-defense, but his action is to deny Israel the tools it needs to defend itself. This isn’t just about Hamas in the Gaza Strip. Lammy highlighted threats to Israel from Iran and Hezbollah in Lebanon, noting that UK fighter jets helped blunt Iran’s massive missile attack on Israel in April. Now, he said the UK would deny important components for Israel’s fighter aircraft, helicopters, and roads. Remember, Hamas is still holding over 100 hostages, including five British citizens. The UK withholding arms from Israel emboldens Hamas and the entire Iranian &#8220;ring of fire&#8221; that surrounds Israel. We must all resist Hamas&#8217; psychological warfare. Let’s be clear: Hamas is demanding a ransom. We need the world to pressure them to reduce that ransom. Pressure Hamas, and pressure its backers—Iran, Qatar, and Turkey—to release the hostages now.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Radical Islamist Threats in the West</strong></h4>\n\n\n\n<p>Don’t forget that terrorism knows no borders. It will not stop with Israel. The threat is already more than obvious in London and elsewhere in the West. You see mass prayers on the streets of London, stopping traffic, while there are many mosques available. You see physical fights between radical Islamists, extremists, and simple Brits. It’s got nothing to do with Jews. Many Islamist extremists treat their women in London in ways unacceptable to Western values. They openly declare that their vision is to occupy Europe, to occupy Rome, specifically naming it as part of their end-of-times vision. This threat will come to your doorstep soon.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Audience Questions</strong></h2>\n\n\n\n<p>Now, let’s take some questions from our audience watching live on social media.</p>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>Question from Marjorie on Instagram Live:</strong></h5>\n\n\n\n<p><em>&#8220;Will Israel start to become more self-sufficient with weapon production in light of this news from the UK?&#8221;</em></p>\n\n\n\n<p>Thank you, Marjorie. First of all, Israel should become more self-sufficient. This is absolutely true, regardless of whether the UK enacts an embargo or not. It’s always a preferred path. However, with or without the UK, Israel will, please God, defeat its enemies because it has no other choice. I do want to say that the UK is making a wrong decision, not because I’m on Israel’s side, but because radical Islamist extremism and terrorism do not know borders. You see it happening in Europe, in London, with mass prayers stopping traffic and physical altercations. The UK’s decision emboldens these extremists</p>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>Question from Ed Bar on YouTube:</strong></h5>\n\n\n\n<p><em>&#8220;Can you comment on the documents the IDF uncovered in Gaza that show Hamas manipulated the public opinion polling of Khalil Shikaki, and anything you can add about public opinion among Palestinians in general about Hamas in this war?&#8221;</em></p>\n\n\n\n<p>The words &#8220;Hamas&#8221; and &#8220;manipulation&#8221; are practically synonymous. Manipulation is the art of psychological warfare, and Hamas has perfected it. They learned it from the Soviets and Nazis and mastered it. They edit videos and craft messages to control public opinion, particularly within Gaza. People are indoctrinated in schools, mosques, everywhere, and can’t speak out against Hamas. This poll manipulation was aimed at showing support for Hamas over the Palestinian Authority, their arch-enemy, and that’s the key reason they manipulated it.</p>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>Question from Ab on YouTube Live</strong></h5>\n\n\n\n<p><em>&#8220;People have suggested that Israel should leave the Philadelphia Corridor as part of a hostage deal, saying it can simply go back in afterward. How realistic is it that Israel could reenter?&#8221;</em></p>\n\n\n\n<p>This is a bit complicated, but I see it as black and white. Some people say Israel can just reenter afterward, but Hamas is not idiotic. They would want security guarantees that Israel won’t return to the Philadelphia Corridor. The corridor is Hamas’ lifeline for smuggling weapons. If Israel leaves, and the Egyptians turn a blind eye, in one year, Hamas will be loaded with weapons again. We must prevent them from rearming, or else they will repeat the massacres of October 7th over and over again.</p>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>Question from Instagram Live</strong></h5>\n\n\n\n<p><em>&#8220;Does Israel feel hampered by the upcoming U.S. elections?&#8221;</em></p>\n\n\n\n<p>The U.S. elections are critically important. The U.S.-Israel strategic relationship is essential for security and shared values. There are significant differences between the Republican and Democratic candidates, despite attempts to claim otherwise. This has huge implications for Israel and the Arab countries in the region, including the Abraham Accords nations. They fear a weakened U.S. administration, having seen what happened in Iraq and Afghanistan.</p>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>Final Question from Rachel on Instagram</strong></h5>\n\n\n\n<p><em>&#8220;Hamas supporters in the West have grown louder. How do we as Jews in the West protect ourselves and educate the blind followers?&#8221;</em></p>\n\n\n\n<p>First, I suggest listening to our daily briefings, but also educate yourselves through reliable news sources. Not all media outlets are responsible in how they report on these issues. Be active, write to your Congress representatives, and influence those in the media with the courage to speak the truth. This isn’t a popular opinion, but Pro-Hamas sentiment will eventually crumble under the weight of truth. Be courageous, stand up, and make your voice heard.</p>\n\n\n\n<p>Thank you for sharing this time with us, and we hope to see you again tomorrow, live at 3 AM Israel time.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Today, on day 333 of the October 7th War, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>’s Prime Minister reiterated that <a  href=\"/hamas\">Hamas</a> has rejected every hostage release deal since November 2023. International reactions, including the UK suspending arms exports, have sparked controversy. Israel remains committed to defeating <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>, as pressure mounts on Hamas and its backers. Audience questions addressed Israel&#8217;s self-sufficiency, manipulation by Hamas, and global extremism.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-17491",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 17491
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17491",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17491"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17491/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17504,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17491/revisions/17504"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17491"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17491"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17491"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}