{
    "id": 18009,
    "date": "2024-09-30T15:00:00",
    "date_gmt": "2024-09-30T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18009"
    },
    "modified": "2024-10-04T12:49:49",
    "modified_gmt": "2024-10-04T09:49:49",
    "slug": "this-senior-hamas-terrorist-worked-for-unrwa-ashley-waxman-bakshi",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/this-senior-hamas-terrorist-worked-for-unrwa-ashley-waxman-bakshi/",
    "title": {
        "rendered": "This Senior Hamas Terrorist Worked for UNRWA | Ashley Waxman Bakshi"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"This Senior Hamas Terrorist Worked for UNRWA | Ashley Waxman Bakshi\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/6ppyhsLKbgo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today marks day 360 of the October 7th War. Here’s something that the whole world should be saying loudly and clearly:<br>UNRWA employed the head of Hamas in Lebanon. The head of Hamas in Lebanon worked for UNRWA. His name was Fat Sharif. Sharif was a senior Hamas terrorist and also the head of the UNRWA teachers&#8217; union in Lebanon. Israel just eliminated him in an airstrike.</p>\n\n\n\n<p>His identity was not a secret. He didn’t sneak into UNRWA. His identity was public. UNRWA head Philippe Lazzarini knew that Fat Sharif was a senior Hamas terrorist. He knew because he was told multiple times. In fact, anyone watching this broadcast would have heard our spokespeople talking about Sharif’s position in Hamas. H. Neuer, the head of UN Watch, was a guest on Alon Levy’s <em>State of a Nation</em> podcast, and he talked about it. We reposted a clip of Neuer today on our social media platforms. Check it out after this.</p>\n\n\n\n<p>Lazzarini knew. He knew, but Lazzarini refused to fire Sharif. Instead, UNRWA is trying to get legal immunity for its leadership. It’s obvious that UNRWA and leaders like Lazzarini are complicit with Hamas. In the face of overwhelming evidence, they don’t want to be held accountable. They <strong>should</strong> be held accountable. Lazzarini <strong>should</strong> be held accountable.</p>\n\n\n\n<p>The relationship between Hamas and UNRWA is well-known. Hundreds of hardened Hamas murderers were on the UNRWA payroll. Thousands of Hamas affiliates were on the UNRWA payroll. Billions of dollars were diverted to Hamas money changers or laundered through Hamas via the theft of humanitarian aid. Hamas built a military base with a massive server farm underneath the UN’s headquarters in Gaza City. UNRWA has nothing to say about this. UNRWA is Hamas’s UN front group. UNRWA <strong>is</strong> Hamas.<br>It’s time to defund UNRWA and hold those like Lazzarini, who collaborated with Hamas, accountable.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Israel’s Ground Operation Against Hezbollah</h4>\n\n\n\n<p>There is another big news item today. Israel is preparing for a ground operation against Hezbollah in Lebanon. That’s what the <em>Wall Street Journal</em> reported. In fact, Israeli Special Forces have been operating in Lebanon to gather intelligence for weeks, according to the report. Remember how we got here: Hezbollah waged war against the people of Israel for a year—daily attacks with Iranian rockets, guided anti-tank missiles, and suicide drones. 60,000 Israelis fled their homes a year ago because of Hezbollah’s attacks. These Israelis must be able to return to their homes safely. Israel’s troops are ready on the border. If Israel enters Lebanon in a big way, remember: Israel does not want war with the people of Lebanon. Israel has been telling Hezbollah to back off for a whole year. Hezbollah did not get the message. What do you think it will take? Let me know in the comments.</p>\n\n\n\n<p>Everyone should understand how big the threat of Hezbollah is. Hezbollah had plans to do what Hamas did on October 7th—but worse. Hezbollah commandos were trained to cross the border, conquer villages, and massacre Israelis in their homes. Hezbollah joined Hamas’s war on October 8th, while Hamas terrorists were still inside Israel. Hassan Nasrallah went to war for Yahya Sinwar. Nasrallah went to war for Sinwar, and he died for the regime in Iran.</p>\n\n\n\n<p>Nasrallah claimed that the reason Hezbollah existed was to protect Lebanon. Everyone can see that this was a lie. I have a question for every world leader: What are you going to do to help the people of Lebanon regain their sovereignty, disarm the local terrorist army that takes its orders from Iran’s Islamic Revolutionary Guard Corps, make peace with Israel, and enjoy a better future?<br>Up to this point, it seems that the answer is nothing.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section</h3>\n\n\n\n<h4 class=\"wp-block-heading\">1. Confidence in Lebanese Prime Minister&#8217;s Pledge on UN Resolution 1701</h4>\n\n\n\n<p><strong>Question:</strong> There’s a report in <em>Reuters</em> right now that says the Lebanese prime minister says he’s willing to deploy the Lebanese Army south of the Litani River and fully implement UN Resolution 1701. How confident do you feel about this pledge?</p>\n\n\n\n<p><strong>Answer:</strong> I mean, I think the short answer is: I’d have to see it to believe it. UN Resolution 1701, which was passed in 2006, called for Hezbollah to disarm and to no longer threaten the north of Israel. The Lebanese government has failed to implement it. The UN has failed to implement this resolution. So, as I began this answer with, I’d have to see it to believe it.</p>\n\n\n\n<h4 class=\"wp-block-heading\">2. Future Leadership of Hezbollah</h4>\n\n\n\n<p><strong>Question:</strong> Do you have any idea who will be the next leader of Hezbollah, and if there will be any difference in Hezbollah policy about attacking Israel?</p>\n\n\n\n<p><strong>Answer:</strong> Well, hopefully, the future leaders are kind of fearful to take that position right now, if you know what I mean. I obviously don’t know who will fill that position. I’m hoping no one will fill that position because I am hoping that we won’t see Hezbollah regrouping, rearming, and endangering the north of Israel anymore. And as you asked in the previous question, hopefully, we’ll be able to see some kind of agreement between the Lebanese government and the Israeli government. And, you know, I’m going to be as optimistic to say that, hopefully, we could see Lebanon even join the Abraham Accords.</p>\n\n\n\n<h4 class=\"wp-block-heading\">3. Israeli Air Force Strikes in Yemen</h4>\n\n\n\n<p><strong>Question:</strong> Just recently, the Israeli Air Force struck the Houthis in Yemen for a second time. Do you know what sparked this decision of the Israeli government to strike the Houthis in Yemen, and if there will be any response from the Houthis in Yemen?</p>\n\n\n\n<p><strong>Answer:</strong> The Houthis have been not only blocking the sea and effectively being pirates and harming trade for the entire world, but they’ve also been attacking Israel, sending ballistic missiles and suicide drones. Israel is very clear: you can’t just send ballistic missiles and suicide drones and attack Israeli civilians without expecting Israel to retaliate. So, I’m going to say, on behalf of Israel to the rest of the world, “You’re welcome”—that we are taking care of the job that the whole world really should be taking care of, but Israel is doing it on your behalf, so, “You’re welcome.”</p>\n\n\n\n<h4 class=\"wp-block-heading\">4. Ongoing Hezbollah Rocket Fire</h4>\n\n\n\n<p><strong>Question:</strong> Can you please elaborate on the aggression and ongoing firing of rockets from Hezbollah, even after Nasrallah was eliminated? What is exactly the current threat from Hezbollah?</p>\n\n\n\n<p><strong>Answer:</strong> Hezbollah has what’s estimated to be about 200,000 rockets and ballistic missiles. First of all, I just want to say hi—a shout-out to Toronto, my hometown. And just because the commanders, leaders of the organization, have been eliminated, it doesn’t mean that the organization ceases to exist. They still have tens of thousands of terrorists operating. They have bunkers full of rockets and missiles aimed directly at Israel. They are, of course, still in chaos. They’re still trying to regroup and figure out what’s going to be the new chain of command, but they are still targeting Israeli civilians and Israeli communities every day, just as they have done since October 8th. And, unfortunately, as I predict, we’re going to continue to see this over the coming weeks.</p>\n\n\n\n<h4 class=\"wp-block-heading\">5. Whereabouts of Hamas Leader Yahya Sinwar and Fate of Israeli Hostages</h4>\n\n\n\n<p><strong>Question:</strong> Are there any updates on the whereabouts of Hamas leader Yahya Sinwar, and what is the latest news about the fate of the Israeli hostages who are still in Hamas’s terror dungeons?</p>\n\n\n\n<p><strong>Answer:</strong> As of right now, I don’t believe we know where he is. I believe that if we knew exactly where he was, he would no longer be with us. There are rumors going around that he has lost connection. There have been rumors that possibly he has been eliminated, but that is still yet to be confirmed. Regarding the fate of the Israeli hostages—my cousin Aam Berger being one of them—unfortunately, at this point, we don’t see any negotiation happening, or any public negotiation happening. My hopes are that the Hamas leadership, Sinwar in Gaza, are seeing what is happening around, with all of the rest of Israel’s enemies. We are taking them out and eliminating them one by one. Hopefully, that should pressure them to come to the negotiation table and, finally, strike a deal.</p>\n\n\n\n<p>It’s important to say that we have many demonstrations here in Israel calling for the release of hostages, but I think it’s been about 18 or 19 times now that there has been a ceasefire deal on the table, and it is Hamas that has, time and time again, said no. So, you just have to keep getting the word out around the world, wherever you are, and we need to keep telling our leaders, especially in the Western countries, to pressure Hamas via Qatar and Egypt to get them to come to the negotiation table and to finally broker a deal.</p>\n\n\n\n<h4 class=\"wp-block-heading\">6. Defunding UNRWA</h4>\n\n\n\n<p><strong>Question:</strong> How are we going to influence world leaders to defund UNRWA?</p>\n\n\n\n<p><strong>Answer:</strong> That is a great question. Go to the streets. Tell your leaders that you are no longer willing to see your tax dollars fund terrorism, bring chaos to the Middle East, and endanger the lives of not only Israelis here in Israel, but also of Arabs in all the countries surrounding us. This UNRWA money is continuing to train and indoctrinate terrorists for generations to come. If you don’t want to see escalation, if you don’t want to see this turn into a regional war, or, God forbid, a world war, pressure your leaders to stop wasting your tax dollars to fund terrorism.</p>\n\n\n\n<h4 class=\"wp-block-heading\">7. Message to the People of Lebanon</h4>\n\n\n\n<p><strong>Question:</strong> What is your message right now to the people of Lebanon?</p>\n\n\n\n<p><strong>Answer:</strong> So, my message to the people of Lebanon is: we don’t want war with you. We never wanted war with you. In fact, Lebanon was fairly close to making peace with Israel about 30 years ago. We would like to stretch out our hand for peace. Help us eliminate the radical Islamists that are taking over your country—the Iranian regime hijacking your country and your civilization—in the name of nothing, in the name of just destroying the State of Israel. We stretch out our hand for peace. Help us. Join us. Combat the radicalism, the extremism, and, hopefully, pressure your government. Tell them that you would like to join the Abraham Accords.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a> employed a senior <a  href=\"/hamas\">Hamas</a> terrorist, Fat Sharif, while ignoring warnings. <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> eliminated him in an airstrike. The connection between <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> and UNRWA is undeniable, and global leaders must defund UNRWA. Meanwhile, Israel prepares for possible ground operations in Lebanon, addressing ongoing threats from <a  href=\"/hezbollah\">Hezbollah</a> and the Houthis.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18010,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        490
    ],
    "class_list": [
        "post-18009",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ashley-waxman-bakshi"
    ],
    "lang": "en",
    "translations": {
        "en": 18009
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18009",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18009"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18009/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18011,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18009/revisions/18011"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18010"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18009"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18009"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18009"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}