{
    "id": 17699,
    "date": "2024-09-21T15:30:57",
    "date_gmt": "2024-09-21T12:30:57",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17699"
    },
    "modified": "2024-09-21T15:31:02",
    "modified_gmt": "2024-09-21T12:31:02",
    "slug": "uks-largest-hamas-fan-base-youth-demand",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/uks-largest-hamas-fan-base-youth-demand/",
    "title": {
        "rendered": "Uk&#8217;s largest Hamas fan base Youth Demand"
    },
    "content": {
        "rendered": "\n<p>During the October 7 massacre and throughout the following 11 months of the Iron Swords War, thousands of groups have voiced support for the actions carried out by terrorist organizations like Hamas.</p>\n\n\n\n<p>Many of these groups disguise their agenda under the banner of activism, advocating for causes such as climate change, fighting corruption, and more. However, beneath this facade lies a single, undeniable truth: their hypocrisy and deceit.</p>\n\n\n\n<p>Their real aim is to support Hamas and seek the destruction of the state, along with the death of everyone living within it</p>\n\n\n\n<figure class=\"guten-element guten-video guten-ZaIriX\"><div class=\"guten-video-wrapper\" data-property=\"{&quot;url&quot;:&quot;https://vimeo.com/873780784&quot;,&quot;class&quot;:&quot;guten-video-background&quot;,&quot;width&quot;:&quot;100%&quot;,&quot;height&quot;:&quot;500px&quot;,&quot;playing&quot;:true,&quot;muted&quot;:true,&quot;loop&quot;:true,&quot;controls&quot;:true,&quot;playsinline&quot;:true,&quot;style&quot;:{},&quot;config&quot;:{&quot;youtube&quot;:{&quot;playerVars&quot;:{}}}}\"></div></figure>\n\n\n\n<h2 class=\"wp-block-heading\">Meet Youth Demand</h2>\n\n\n\n<p>Youth Demand is a British activist group that emerged in early 2024, positioning itself as a movement focused on environmental and political causes. The group quickly gained attention for its direct actions, such as protests targeting both the Labour and Conservative parties over fossil fuel licensing and British arms exports to Israel. Represented across 17 British universities, Youth Demand claims a large following of young people advocating for what they describe as social and environmental justice.</p>\n\n\n\n<p>Their activism has included high-profile demonstrations, such as vandalizing political headquarters, organizing protests at politicians’ homes, and blocking major public spaces to draw attention to their causes. They have primarily focused their demands on ending new fossil fuel licenses in the North Sea and pushing for a two-way arms embargo on Israel. </p>\n\n\n\n<h2 class=\"wp-block-heading\">Support for Hamas</h2>\n\n\n\n<p>While Youth Demand claims to stand for human rights, their actions reveal a troubling disregard for the reality of the October 7 massacre committed by Hamas and the ongoing hostage crisis. By focusing their activism solely on condemning Israel, without acknowledging the violent actions of terrorist organizations like Hamas, Youth Demand effectively ignores the atrocities that continue to unfold.</p>\n\n\n\n<p>Since October 7, Hamas has held over 100 Israeli civilians hostage, hiding them in an intricate network of tunnels beneath Gaza. These civilians have been subjected to torture, rape, and other horrific abuses, yet Youth Demand remains silent on these human rights violations. Their failure to condemn Hamas or even acknowledge its existence in their calls for action sends a dangerous message of indirect support for the organization.</p>\n\n\n\n<p>Calling for an arms embargo on Israel, while ignoring the threats posed by Hamas and other regional terrorist groups such as Hezbollah, the IRGC, and the Houthis, positions Youth Demand closer to the goals of Hamas. This is a group whose mission includes the destruction of the state of Israel and the targeting of Jews worldwide. By focusing their efforts on undermining Israel’s right to self-defense, Youth Demand’s activism becomes more than just anti-Israel—it indirectly supports the very forces that perpetuate violence and terrorism in the region.</p>\n\n\n\n<p>Their selective outrage and refusal to address the broader conflict, including the suffering of Israeli civilians, reveal a disturbing alignment with narratives that weaken Israel and empower its enemies. Youth Demand’s activism, under the guise of human rights, dangerously emboldens terrorist groups, all while remaining blind to the complex and brutal reality of organizations like Hamas and Hezbollah, which operate with the goal of destroying Israel.</p>\n\n\n\n<p>This lack of balance in their activism, combined with their failure to acknowledge the atrocities committed by groups like Hamas, makes Youth Demand&#8217;s position deeply problematic. Their actions, whether intentional or not, contribute to a narrative that helps those who seek the destruction of Israel, rather than promoting genuine peace or justice.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Youth Demand’s anti-<a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> activism ignores <a  href=\"/hamas\">Hamas</a>’s atrocities, indirectly supporting terrorist groups and undermining Israel’s right to self-defense.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17700,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        57
    ],
    "class_list": [
        "post-17699",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-stupid-palestine-supporters"
    ],
    "lang": "en",
    "translations": {
        "en": 17699
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17699",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17699"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17699/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17703,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17699/revisions/17703"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17700"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17699"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17699"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17699"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}