{
    "id": 17783,
    "date": "2024-09-24T22:45:28",
    "date_gmt": "2024-09-24T19:45:28",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17783"
    },
    "modified": "2024-09-24T22:45:33",
    "modified_gmt": "2024-09-24T19:45:33",
    "slug": "un-human-rights-call-on-all-parties-to-immediately-stop-the-violence",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/fixed/un-human-rights-call-on-all-parties-to-immediately-stop-the-violence/",
    "title": {
        "rendered": "UN Human Rights: &#8220;call on all parties to immediately stop the violence&#8221;"
    },
    "content": {
        "rendered": "\n<p>The recent tweet from @UNHumanRights is yet another example of the UN’s astonishing disconnect from reality. For the past 11 months, Hezbollah—a recognized terrorist organization—has been relentlessly firing thousands of rockets, UAVs, and mortar shells at Israeli civilians. Innocent families have been living in constant fear under these terror attacks, yet the UN continues to remain blind to Hezbollah’s actions.</p>\n\n\n\n<p>Now, as Israel defends its citizens, the UN calls for &#8220;all parties&#8221; to stop the violence. But where was this concern when Hezbollah was launching its unprovoked attacks on Israel for nearly a year? The UN&#8217;s attempt to equate Israel—a nation defending itself from terrorism—with Hezbollah, a terror group that actively targets civilians, shows a clear misunderstanding of the situation and a troubling bias.</p>\n\n\n\n<p>It’s as if Hezbollah doesn’t exist in the eyes of the UN. They fail to recognize that Hezbollah is the root cause of this escalation. Israel has the right and the obligation to defend its people from terrorism, and any calls for a ceasefire that ignore the ongoing terror campaign by Hezbollah only embolden the terrorists.</p>\n\n\n\n<p>If the UN is truly concerned about &#8220;full respect for international law,&#8221; then it must start by holding Hezbollah accountable for its blatant violations of that very law. Calling for equal restraint from a sovereign nation defending its citizens and a terrorist organization is not only misguided, but it also undermines the core principles of justice and human rights that the UN claims to uphold.</p>\n\n\n\n<p>The hypocrisy in the UN’s latest statements is glaring. For months, Hezbollah—a terror organization operating from within Lebanon—has been firing thousands of rockets, UAVs, and mortar shells at Israeli civilians, yet the UN continues to treat them with the same level of concern as Israel, which is defending its people. Worse yet, Hezbollah has been using Lebanon’s civilian infrastructure as cover for its terrorist activities. Schools, hospitals, and residential areas have been turned into bases for their operations, putting innocent civilians in harm’s way. This is the same cowardly strategy employed by Hamas, the group that committed the October 7 massacre, using human shields to deflect accountability while waging war.</p>\n\n\n\n<p>Since the morning of October 7, Hezbollah has been firing rockets at Israeli civilians, officially igniting a war on October 8. The UN, however, has remained largely silent about this unprovoked aggression, only choosing to speak up once Israel launched <strong>Operation Northern Arrows</strong> to defend itself. Suddenly, the UN condemns Israel&#8217;s actions, as if Hezbollah&#8217;s monthslong attacks on Israeli civilians never happened. This selective outrage is not only baffling but outright dangerous. The UN Human Rights Office’s call to stop the violence and protect civilians disregards the reality that Hezbollah itself is using Lebanese civilians as human shields, further endangering lives while waging war on Israel.</p>\n\n\n\n<p>This hypocrisy extends to the UN&#8217;s reaction to the precision pager operation on September 17, 2024. In a strike targeting Hezbollah terrorists, explosions were triggered in pagers and walkie-talkies used solely by Hezbollah operatives, resulting in over 3,000 injuries and nine deaths—all confirmed terrorists. No civilians were harmed. Yet the UN and its supporters have twisted this into an alleged attack on civilians, completely ignoring the fact that Hezbollah’s communications infrastructure is deeply embedded within civilian areas. The precision and care Israel took to avoid civilian casualties should be recognized, not criticized. The narrative being pushed by Hezbollah sympathizers online, labeling this a &#8220;terrorist attack,&#8221; further distorts the truth and reinforces the double standards seen in global discourse about Israel’s right to defend itself.</p>\n\n\n\n<p>Since the October 7 massacre, Hezbollah has launched more than 7,500 rockets at Israel, targeting not only military installations but civilian populations as well. The attack on Majdal Shams in the Golan Heights, where 12 children were killed, is just one horrific example of how Hezbollah deliberately targets civilians. Yet, despite these constant provocations, the UN continues to maintain a false equivalence between Israel’s defensive actions and Hezbollah’s offensive terrorism.</p>\n\n\n\n<p>The fact is, Hezbollah&#8217;s disregard for international law and human life is what truly endangers the region. The UN&#8217;s continued failure to recognize Hezbollah&#8217;s terror tactics, including its abuse of civilian infrastructure to shield its military operations, emboldens their actions. Instead of addressing the real threat—Hezbollah’s unprovoked and ongoing aggression—the UN’s biased rhetoric only serves to protect terrorist organizations, while Israel remains on the frontlines, defending its people from constant attacks.</p>\n\n\n\n<p>Social media has played a significant role in spreading this distorted narrative. Accounts falsely labeling Israel&#8217;s pager operation as a “terrorist attack” and spreading propaganda in support of Hezbollah flood platforms, confusing the real issue at hand. Hezbollah&#8217;s use of social media to propagate lies and garner support for its terror operations only exacerbates the conflict and fuels further violence.</p>\n\n\n\n<p>The UN’s response to the escalating situation is a stark reminder of the dangerous double standards that continue to plague international discourse. Israel is fighting for its survival against a terror organization that hides behind civilians, while the UN remains oblivious to the root cause of the conflict. Hezbollah, not Israel, is responsible for the violence that has consumed the region. It’s time for the world to recognize this reality and hold Hezbollah accountable for its actions.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Alarm at sharp escalation in hostilities between <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and <a  href=\"/hezbollah\">Hezbollah</a></p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17749,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 343,
        "footnotes": ""
    },
    "categories": [
        343
    ],
    "tags": [
        1586
    ],
    "class_list": [
        "post-17783",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-fixed",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 17783
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17783",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17783"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17783/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17784,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17783/revisions/17784"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17749"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17783"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17783"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17783"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}