{
    "id": 17722,
    "date": "2024-09-22T20:16:07",
    "date_gmt": "2024-09-22T17:16:07",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17722"
    },
    "modified": "2024-09-22T20:16:11",
    "modified_gmt": "2024-09-22T17:16:11",
    "slug": "un-secretary-general-worried-that-lebanon-will-become-another-gaza",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/un-secretary-general-worried-that-lebanon-will-become-another-gaza/",
    "title": {
        "rendered": "UN Secretary General: &#8220;Worried that Lebanon will become another Gaza&#8221;"
    },
    "content": {
        "rendered": "\n<p>UN Secretary-General António Guterres recently voiced concerns that Lebanon is at risk of becoming &#8220;another Gaza.&#8221; This statement raises serious questions about the disconnect between his understanding of the situation and the harsh realities faced by Israel. For nearly a year, northern Israel has been relentlessly bombarded with thousands of rockets, drones, and anti-tank missiles launched by Hezbollah. These attacks have resulted in the deaths and injuries of dozens of civilians and soldiers, forcing tens of thousands of Israeli citizens to flee their homes, leaving behind entire communities to live as refugees in their own country.</p>\n\n\n\n<p>Yet, in the face of this ongoing terror campaign, Guterres remained silent. His sudden concern for Lebanon&#8217;s stability, framed as a potential humanitarian crisis, ignores the very real crisis Israel has been enduring under the constant threat of Hezbollah, a group operating with near impunity in southern Lebanon. His failure to address the widespread suffering and destruction caused by these terrorist groups exposes a glaring hypocrisy in his leadership. Where was this concern for human rights and peace when Israelis were being targeted daily?</p>\n\n\n\n<p>The UN Secretary-General’s remarks also betray a deeper bias that has characterized his approach to the Israeli-Palestinian conflict and regional instability. Guterres has consistently failed to condemn groups like Hezbollah and Hamas, both of which are recognized as terrorist organizations. His silence on their violence, while expressing disproportionate concern over Israel’s defensive actions, reflects an alarming double standard. His approach not only legitimizes these groups but also emboldens their violent tactics, undermining any genuine effort to secure peace in the region.</p>\n\n\n\n<p>It’s difficult to interpret Guterres&#8217; statements as anything other than a defense of terror organizations. By failing to hold groups like Hezbollah accountable for their attacks on Israel, he effectively aligns himself with their goals. This anti-Israel bias has become a persistent theme at the UN, where Israel’s right to defend itself is routinely questioned, while the actions of terror groups are downplayed or ignored altogether.</p>\n\n\n\n<p>In light of Guterres&#8217; recent comments, it is essential to call out the blatant contradictions in his rhetoric. His fear of Lebanon becoming another Gaza is deeply ironic given that it is Hezbollah’s unchecked terrorism, not Israel’s self-defense, that poses the greatest threat to regional stability. Instead of addressing the root cause of the violence—Hezbollah’s stranglehold on Lebanon and its campaign against Israel—the UN Secretary-General chooses to perpetuate a false narrative that casts Israel as the aggressor.</p>\n\n\n\n<p>This ongoing failure to confront the true sources of instability in the region not only undermines Israel’s security but also erodes the credibility of the United Nations as a neutral mediator. As long as figures like Guterres continue to shield terror organizations from accountability while condemning Israel’s legitimate efforts to protect its citizens, there can be no hope for lasting peace.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>UN Secretary-General Guterres&#8217; bias against <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> is clear, as he ignores <a  href=\"/hezbollah\">Hezbollah</a>’s terror while unjustly criticizing Israel&#8217;s defense.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17723,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        1584
    ],
    "class_list": [
        "post-17722",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-antonio-guterres"
    ],
    "lang": "en",
    "translations": {
        "en": 17722
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17722",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17722"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17722/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17724,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17722/revisions/17724"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17723"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17722"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17722"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17722"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}