{
    "id": 17838,
    "date": "2024-09-28T00:21:20",
    "date_gmt": "2024-09-27T21:21:20",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17838"
    },
    "modified": "2024-09-28T00:21:24",
    "modified_gmt": "2024-09-27T21:21:24",
    "slug": "un-secretary-general-we-must-avoid-original-war-at-all-costs",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/fixed/un-secretary-general-we-must-avoid-original-war-at-all-costs/",
    "title": {
        "rendered": "Un Secretary-General: &#8220;We Must avoid original war at all costs&#8221;"
    },
    "content": {
        "rendered": "\n<p>In a recent statement to the Security Council, UN Secretary-General António Guterres expressed his grave concerns about the violence in Gaza, condemning the acts of terror by Hamas and other Palestinian armed groups, and highlighting the severe humanitarian repercussions. However, the statement&#8217;s focus raises significant concerns about the balance and comprehensiveness of its perspective.</p>\n\n\n\n<p>The Secretary-General&#8217;s remarks come at a time when Israeli civilians have been under continuous assault from Hezbollah and Hamas for over a year. Since the horrific events of October 7, which saw a brutal massacre by Hamas, Hezbollah has escalated its attacks, firing thousands of missiles, drones, and UAVs into civilian areas in northern Israel. This relentless aggression has displaced over 100,000 Israeli citizens, creating a humanitarian crisis that has received scant mention in discussions focusing on Gaza.</p>\n\n\n\n<p>The stark disparity in the Secretary-General&#8217;s narrative and the ground realities in Israel is troubling. By emphasizing the casualties and destruction in Gaza without a corresponding acknowledgment of the terrorism perpetrated by Hezbollah and Hamas against Israeli civilians, the UN&#8217;s approach appears one-sided. This narrative not only overlooks the suffering of Israeli civilians but also indirectly lends legitimacy to the actions of terrorist organizations by failing to hold them accountable in the global arena.</p>\n\n\n\n<p>Moreover, recent actions by Israel, which have been defensive and targeted at mitigating the threat from recognized terrorist leaders, have been crucial in preventing further loss of Israeli lives. The elimination of a top Hezbollah leader, an individual directly involved in orchestrating attacks against Israeli civilians, is a significant step towards safeguarding civilians and striving for stability in the region.</p>\n\n\n\n<p>The call for a ceasefire and a two-state solution by the UN, while crucial, must recognize the complexities of the situation that include acknowledging the ongoing terrorist activities by Hamas and Hezbollah. True peace cannot be achieved through statements that fail to address the full scope of the violence or that equate the defensive actions of a sovereign nation with the aggressive tactics of terrorist organizations.</p>\n\n\n\n<p>For the international community to play a constructive role, it must adopt a balanced approach that condemns all forms of terrorism unequivocally, ensures the protection of all civilians regardless of nationality, and supports negotiations that acknowledge the rights and security concerns of all parties involved.</p>\n\n\n\n<p></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Violations by one side cannot be used to justify violations by the other.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17723,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 343,
        "footnotes": ""
    },
    "categories": [
        343
    ],
    "tags": [
        1586,
        1340
    ],
    "class_list": [
        "post-17838",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-fixed",
        "tag-northern-arrows",
        "tag-the-un"
    ],
    "lang": "en",
    "translations": {
        "en": 17838
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17838",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17838"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17838/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17839,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17838/revisions/17839"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17723"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17838"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17838"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17838"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}