{
    "id": 17755,
    "date": "2024-09-23T07:00:00",
    "date_gmt": "2024-09-23T04:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17755"
    },
    "modified": "2024-09-24T08:27:37",
    "modified_gmt": "2024-09-24T05:27:37",
    "slug": "update-from-the-idf-spokesman-09-23-morning",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/update-from-the-idf-spokesman-09-23-morning/",
    "title": {
        "rendered": "Update from the IDF spokesman &#8211; 09.23, morning"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 23.09, בוקר\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/chDr3U0Vd58?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good morning, about an hour ago, we began attacking terrorist targets in Lebanon. This was in response to Hezbollah&#8217;s intentions to launch fire at the territory of the State of Israel. We are continuously monitoring the situation regarding the home front and keeping our finger on the pulse. If necessary, we will update immediately regarding any changes and necessary precautions. The attacks will continue shortly. A short while ago, I recorded a clear message for all the villagers in Lebanon. I would like to present it here. In recent hours, we have identified Hezbollah&#8217;s intentions to attack the citizens of the State of Israel soon. We will attack terrorist targets in the Lebanese area to eliminate the threat in Southern Lebanon.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hezbollah&#8217;s Weapon Deployment in Southern Lebanon</strong></h3>\n\n\n\n<p>Along approximately 80 kilometers of the border, there are dozens of villages. For over 20 years, Hezbollah has deployed weapons inside homes, utilizing them, thereby turning Southern Lebanon into a combat zone. This is how a village in Southern Lebanon looks. Hezbollah stores drones, rockets, launchers, and unmanned aerial vehicles inside civilian homes, under the cover of the Lebanese population, endangering the residents of these villages. We are monitoring these actions, locating the weapons, and destroying them in precise attacks. I would like to show you an example of this, an attack carried out a few weeks ago. Now, for the first time, we are exposing the method used by Hezbollah terrorists to hide a cruise missile.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Exposing Hezbollah’s Missile Launching Method</strong></h3>\n\n\n\n<p>In a completely civilian home, Hezbollah created a special opening designed to launch the missile. From there, they launch the missile toward the State of Israel. Here, you can see how we identified the terrorists opening the special opening in the building, revealing the missile. We detected this from the air and accordingly carried out a focused attack. We eliminated the terrorists and then attacked the building and the missile precisely just before it was launched. To all the villagers in Lebanon, we will soon attack terrorist targets in Lebanon. We urge anyone near or inside homes where Hezbollah is hiding weapons to move away immediately. I repeat, we urge you to move away immediately for your safety.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hezbollah&#8217;s Threat to Civilian Lives</strong></h3>\n\n\n\n<p>Hezbollah is endangering you and your families. On October 8th, the Hezbollah terrorist organization decided to join the war alongside Hamas and ISIS. With this action, Hezbollah is dragging Lebanon and the entire region into a wide-scale confrontation. Hassan Nasrallah is responsible for this. For 11 months, we have been attacking Hezbollah with force, systematically following a structured plan to reduce the organization&#8217;s military capabilities and push Hezbollah away from the border. We are fighting with determination to achieve all the objectives of the war in Gaza – to dismantle Hamas and bring back all the hostages, while in the north, we are working to create security and bring the residents back to their homes.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Israeli Defense Forces’ Ongoing Operations</strong></h3>\n\n\n\n<p>The IDF is operating and will continue to operate to protect the citizens of the State of Israel wherever necessary. The statements I made here are now being broadcast in Arabic across all networks and platforms in Lebanon. Like every announcement, I am now live on all the Arab networks in the Middle East, with an emphasis on Lebanon. I repeat and warn the residents of the villages in Lebanon – move away from the weapons Hezbollah has stored in your homes or nearby. Move away immediately for your safety and for the safety of your families. Hezbollah is endangering you. Hezbollah is planning to launch these weapons toward the territory of the State of Israel. Move away immediately for your protection.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hezbollah’s Disinformation Campaign</strong></h3>\n\n\n\n<p>Citizens of Israel, the Hezbollah terrorist organization may attempt to spread rumors and psychological terror in the coming hours. I ask you not to spread rumors or unfounded information and to stick only to reports from official sources.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Israeli forces are attacking <a  href=\"/hezbollah\">Hezbollah</a> targets in Lebanon, urging civilians to avoid areas storing weapons, ensuring safety and security.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [
        32,
        1586
    ],
    "class_list": [
        "post-17755",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson",
        "tag-idf",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 17755
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17755",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17755"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17755/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17759,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17755/revisions/17759"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17755"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17755"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17755"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}