{
    "id": 17495,
    "date": "2024-09-06T15:00:00",
    "date_gmt": "2024-09-06T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17495"
    },
    "modified": "2024-09-22T00:49:45",
    "modified_gmt": "2024-09-21T21:49:45",
    "slug": "us-asks-is-there-any-deal-hamas-will-accept-with-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/he/israeli-citizen-spokesperson/us-asks-is-there-any-deal-hamas-will-accept-with-daniel-rubenstein/",
    "title": {
        "rendered": "US Asks: Is There Any Deal Hamas Will Accept? | with Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"US Asks: Is There Any Deal Hamas Will Accept? | with Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/d9QSthgCAos?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is day 335 of the October 7th War. Israeli journalist Barak Ravid reported in Axios that a Biden Administration official expressed concern after Hamas executed six Israeli hostages. The official stated that this act &#8220;called into question&#8221; Hamas&#8217; willingness to make any kind of deal. This, however, is an understatement. Hamas has shown time and again that they are a barbaric terrorist army with no regard for human life.</p>\n\n\n\n<p>President Biden is now questioning whether any hostage release deal could be made with Hamas. It&#8217;s a valid question. Every time Israel is pressured, Hamas raises its demands. Last week, Hamas increased the number of Palestinian terrorists they wanted released in exchange for hostages. The wrong approach is pressuring Israel. Instead, the world must apply <strong>massive pressure on Hamas</strong> and its backers—Qatar, Turkey, and Iran.</p>\n\n\n\n<h3 class=\"wp-block-heading\">U.S. Concerns Regarding IDF Deployment</h3>\n\n\n\n<p>In the same Axios report, there was a concern raised in The Situation Room about potentially reducing the Israel Defense Forces (IDF) along the Egypt-Gaza border. The fear is that even if Israel makes compromises, Hamas could reject parts of the deal. The issue is bigger than just the details of a potential deal. <strong>Hamas wants to survive</strong>, to hold onto hostages, maintain control of Gaza, and rearm for future attacks on Israel.</p>\n\n\n\n<p>Israel&#8217;s goals are clear:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Destroy Hamas&#8217; military and governmental capabilities</strong> in Gaza.</li>\n\n\n\n<li><strong>Ensure the immediate safe return of all hostages</strong>.</li>\n\n\n\n<li><strong>Prevent another attack like October 7th</strong>.</li>\n</ol>\n\n\n\n<h3 class=\"wp-block-heading\">Prime Minister&#8217;s Presentation: Key Points</h3>\n\n\n\n<p>Yesterday evening, the Prime Minister of Israel gave a presentation to international journalists, emphasizing three important points:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Israel is very small</strong>: Cities like Jerusalem, Tel Aviv, and Beersheba are all within a short distance from Gaza.</li>\n\n\n\n<li><strong>Hamas&#8217; massive military capability</strong>: Since Israel withdrew from Gaza in 2005, Hamas has built an enormous military infrastructure, revealed tragically on October 7th.</li>\n\n\n\n<li><strong>The importance of the Philadelphia Corridor</strong>: Israel cannot afford to leave Gaza’s border with Egypt. Hamas has used the corridor to smuggle weapons and could easily rearm if Israel were to withdraw again.</li>\n</ol>\n\n\n\n<h3 class=\"wp-block-heading\">The History Behind the Philadelphia Corridor</h3>\n\n\n\n<p>After Israel made peace with Egypt in 1979, it withdrew from the Sinai Peninsula but maintained control over Gaza and the Gaza-Egypt border. In 2005, Israel fully withdrew from Gaza, including the Philadelphia Corridor. In the years since, Hamas has used this border to smuggle in vast quantities of weapons.</p>\n\n\n\n<p>The Prime Minister stressed that Israel cannot leave the Philadelphia Corridor again, especially while hostages remain in Gaza. If Israel were to withdraw, hostages could be smuggled out to countries like Yemen or Iran, making rescue impossible. Furthermore, <strong>Hamas would resupply and attack Israel again</strong>. Any withdrawal would result in a massive loss of international legitimacy for Israel to retake the corridor.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Egypt’s Role in Gaza’s Weapon Smuggling</h3>\n\n\n\n<p>Egypt shares a border with Gaza. The Prime Minister noted that while Egypt’s policy has been to prevent smuggling, it has not always been effective. Weapons have continuously flowed into Gaza from Egypt, above and below ground.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Audience Questions</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Anger and Division Within the Israeli Public</h3>\n\n\n\n<p><strong>Question from Robin on Instagram:</strong><br><em>&#8220;I’m seeing and experiencing a lot of anger and hate within the Jewish Israeli side. Why are we fighting with each other?&#8221;</em></p>\n\n\n\n<p>There is indeed a wide range of opinions among the Israeli public regarding how to approach the war and its goals—destroying Hamas, returning hostages, and preventing future attacks. While Israel is open to a potential deal, one major sticking point is the Philadelphia Corridor. Hamas is actively using hostage videos to apply pressure on the Israeli public and government, further fueling these debates.</p>\n\n\n\n<h3 class=\"wp-block-heading\">International Response to Hostage Executions</h3>\n\n\n\n<p><strong>Question from Ed Bar on YouTube:</strong><br><em>&#8220;Are international NGOs, especially UN-affiliated ones, responding to the executions of the hostages? Are they condemning it?&#8221;</em></p>\n\n\n\n<p>The United Nations Human Rights Council tweeted that they were &#8220;horrified&#8221; by the reports of hostage executions but used vague language, saying they were concerned about &#8220;reports,&#8221; even though the executions were confirmed by multiple sources. The international community&#8217;s response has been unimpressive and lacks moral authority.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Attack Near Israeli Consulate in Munich</h3>\n\n\n\n<p><strong>Question from Lehi on Instagram:</strong><br><em>&#8220;I’ve heard reports of a gunman killed near the Israeli Consulate in Munich. Is this related to the 1972 attack anniversary?&#8221;</em></p>\n\n\n\n<p>Yes, this shooting near the Israeli Consulate in Munich occurred on the anniversary of the 1972 attack on Israeli athletes by Palestinian terrorists during the Munich Olympics. This underscores that the war Israel is fighting is not just limited to Israel’s borders—Jews and Israeli targets around the world are under threat.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Is It Safe to Travel to Israel as a Tourist?</h3>\n\n\n\n<p><strong>Question from Juliet Bravo on Instagram:</strong><br><em>&#8220;Is Israel safe to travel to as a tourist right now? I want to return but am unsure given the circumstances.&#8221;</em></p>\n\n\n\n<p>The best way to stand with Israel is to visit. While there are restrictions in the north due to Hezbollah’s rocket fire, the rest of Israel, including Jerusalem and Tel Aviv, is open and safe for tourists. The Israeli military is clear about where it’s safe to go, and life is continuing as much as possible.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Spokesdog Simka</h3>\n\n\n\n<p><strong>Question from AKA on Instagram:</strong><br><em>&#8220;When will the Israeli citizen spokesdog go live for a daily briefing?&#8221;</em></p>\n\n\n\n<p>Our official spokesdog, Simka, is still in training. While we’re not yet ready for a live briefing, Simka’s videos will be coming soon</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>Thank you for joining today’s briefing. Follow us on all our platforms, and we’ll be live again Sunday at 3 PM Israel time (8 AM EST). Stay informed, stay vigilant, and we’ll see you soon!</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On day 335 of the October 7th War, <a  href=\"/hamas\">Hamas</a> executed six <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>, raising concerns over potential deals. <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s goals include dismantling <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> and securing hostages. Prime Minister Netanyahu emphasized the significance of the Philadelphia Corridor. Meanwhile, international reactions are mixed, and Israel remains open for tourism despite the ongoing conflict.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        367
    ],
    "tags": [
        1582
    ],
    "class_list": [
        "post-17495",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "he",
    "translations": {
        "he": 17495
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17495",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17495"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17495/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17497,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17495/revisions/17497"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17495"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17495"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17495"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}