{
    "id": 4309,
    "date": "2024-01-02T07:21:00",
    "date_gmt": "2024-01-02T05:21:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8485/"
    },
    "modified": "2024-01-02T07:21:00",
    "modified_gmt": "2024-01-02T05:21:00",
    "slug": "8485",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8485/",
    "title": {
        "rendered": "&#8220;IDF Eliminates Terrorists and Seizes Weapons in High-Tension Anti-Terror Operations: An In-depth Look&#8221;"
    },
    "content": {
        "rendered": "<p>IDF spokesperson:</p>\n<p>IDF reservists eliminated four armed terrorists who barricaded themselves in a house during an operation in the village of Ezzon, under the command of the Ephraim brigade.</p>\n<p>During an operation to combat terrorism by IDF forces from the 8211 Reservist Battalion in the village of Ezzon, under the command of the Ephraim brigade, terrorists fired and hurled explosives at our forces. Our soldiers identified the structure where the terrorist cell was hiding, and after an exchange of fire, they eliminated the four terrorists and confiscated three &#8220;Carl Gustav&#8221; type weapons used by them. During the exchange of fire, an IDF reserve officer was moderately injured. He was evacuated for medical treatment at a hospital, and his family has been informed.</p>\n<p>In addition, during another operation to locate weapons in the city of Qalqilya under the brigade&#8217;s jurisdiction, reservist soldiers neutralized a terrorist who fired a pistol at them. No injuries were sustained by our forces. In addition, the forces confiscated the pistol used by the terrorist.</p>\n<p>Furthermore, IDF soldiers, Israeli Security Agency (ISA)/Shin Bet, and Border Police arrested seven wanted persons overnight throughout Judea and Samaria and the Jordan Valley and Emek brigades. The detainees and the confiscated weapons were handed over for further processing by the security forces.</p>\n<p>Thus far, since the beginning of the war, over 2,550 wanted persons have been arrested throughout the Judea and Samaria Division and the Jordan Valley and Emek Brigades, about 1,300 of whom are affiliated with the Hamas terrorist organization.</p>\n<p>Attached are photos of the confiscated weapons: https://IDFANC.activetrail.biz/ANC020120232514</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a>: IDF reservists eliminated four armed terrorists who barricaded themselves in a house during an operation in the village of Ezzon, under the command of the Ephraim brigade. During an operation to combat terrorism by IDF forces from the 8211 Reservist Battalion in the village of Ezzon, under the command of the Ephraim brigade, terrorists fired and hurled explosives at our forces. Our soldiers identified the structure where the terrorist cell was hiding, and after an exchange of fire, they eliminated the four terrorists and confiscated three &#8220;Carl Gustav&#8221; type weapons used by them. During the exchange of fire,</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4309",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4309
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4309",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4309"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4309/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4309"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4309"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4309"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}