{
    "id": 4283,
    "date": "2024-01-04T17:54:38",
    "date_gmt": "2024-01-04T15:54:38",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8512/"
    },
    "modified": "2024-01-04T17:54:38",
    "modified_gmt": "2024-01-04T15:54:38",
    "slug": "8512",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8512/",
    "title": {
        "rendered": "&#8220;IDF Neutralizes Terror Threats in Nur al-Shams: Rigged Kindergarten, Bomb Workshops, and Hundreds of Charges Destroyed&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The discovery and destruction of a rigged floor in a building housing a UNRWA kindergarten, the neutralization of weaponizing materials, and the elimination of hundreds of charges; IDF reserve, Shin Bet and Border Police forces completed a 40-hour operation to combat terror in the Nur al-Shams camp in the Menashe Brigade area.</p>\n<p>In an operation that lasted approximately 40 hours, IDF reserve and Border Police forces, under the guidance of the Shin Bet and EMAN Division in the Menashe Brigade, completed an operation to combat terror in the Nur al-Shams camp.</p>\n<p>The forces combed hundreds of buildings, detained hundreds of suspects for investigation, and arrested 11 wanted individuals. In addition, numerous weaponizing materials, military equipment and hundreds of charges were neutralized and destroyed.</p>\n<p>During the search, the forces discovered a rigged building in which a UNRWA kindergarten was located on the ground floor. The building was found to have a detonation system connected to charges around and in the access routes to the building. Additionally, a rigged vehicle was found near the building. The forces destroyed the rigged floor, the vehicle, and the charges found in the area.</p>\n<p>In addition, the soldiers located and destroyed two bomb-making workshops in the camp.</p>\n<p>At the start of the operation, under the guidance of Drone Unit 636, an IDF aircraft attacked terrorists who threw charges at the forces, endangering them. The soldiers fired at terrorists who shot and threw charges at them, and hits on terrorists were identified.</p>\n<p>During the operation, two IDF reserve soldiers were lightly and moderately injured by a charge shrapnel. The soldiers were evacuated to the hospital for medical treatment. Their families have been informed.</p>\n<p>In a separate operation to combat terror in the village of Sir in the Menashe Brigade area, an IDF soldier was seriously injured as a result of a charge explosion. The soldier was evacuated to the hospital for medical treatment. His family has been informed.</p>\n<p>Attached is documentation of the rigged floor, above a UNRWA kindergarten: https://bit.ly/3S5MMDf </p>\n<p>Attached is documentation of the destruction of charges in the camp and display of weaponry: https://bit.ly/3H75K63 </p>\n<p>Attached is a sync of the Commanding Officer of the 420th Reserve Battalion, Lt. Col (Res.) Rotem on the locating of a bomb-making workshop: https://bit.ly/3H75x2L </p>\n<p>Attached are photos of the force&#8217;s activities and the destruction of the located charges: https://IDFANC.activetrail.biz/ANC04012024.021561351 </p>\n<p>Attached are photos of the weapons and charges that were located: https://IDFANC.activetrail.biz/ANC04012024.02156</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The discovery and destruction of a rigged floor in a building housing a <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a> kindergarten, the neutralization of weaponizing materials, and the elimination of hundreds of charges; IDF reserve, Shin Bet and Border Police forces completed a 40-hour operation to combat terror in the Nur al-Shams camp in the Menashe Brigade area. In an operation that lasted approximately 40 hours, IDF reserve and Border Police forces, under the guidance of the Shin Bet and EMAN Division in the Menashe Brigade, completed an operation to combat terror in the Nur al-Shams camp. The forces combed hundreds of buildings, detained</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4283",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4283
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4283",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4283"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4283/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4283"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4283"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4283"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}