{
    "id": 4254,
    "date": "2024-01-08T08:33:36",
    "date_gmt": "2024-01-08T06:33:36",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8543/"
    },
    "modified": "2024-01-08T08:33:36",
    "modified_gmt": "2024-01-08T06:33:36",
    "slug": "8543",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8543/",
    "title": {
        "rendered": "&#8220;Decisive IDF Operations: Elimination of Terrorists and Disrupting Rocket Attacks in Khan Yunis&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The Maglan unit in Khan Yunis: Elimination of about ten terrorists preparing to launch rockets towards the country.</p>\n<p>The Fire Center of the 98th Division, in conjunction with the Air Force, attacked around 30 significant terror targets in Khan Yunis tonight, including subterranean targets, terror infrastructures and weapon storage facilities. These attacks support the ongoing fight to the forces operating in the area.</p>\n<p>In Khan Yunis, soldiers from the Maglan unit located more than ten terrorists in rocket launching areas towards the territory of the state of Israel. After identification, the soldiers directed a UAV that eliminated the terrorists. </p>\n<p>Also in Khan Yunis, combat team soldiers from the 55th Brigade identified a terrorist who had emerged from a building tens of meters away from them, where he was gathering intelligence on the force. An Air Force combat helicopter under the brigade&#8217;s fire direction system eliminated the terrorist minutes after identifying him.</p>\n<p>Paratrooper combat team soldiers identified a suspicious terrorist in a building in the area. They directed an Air Force aircraft towards the building, which eliminated the terrorist who was watching the soldiers. Shortly after, another terrorist was identified in that building and was also eliminated by the force.</p>\n<p>In a breaking of axes operation, combat team soldiers from the Kfir Brigade discovered a battle-ready vehicle belonging to a Hamas terrorist full of weapons.</p>\n<p>In a farming area in central Gaza Strip, a combat team from the 179th Brigade discovered a tunnel entrance, thousands of dollars, and many weapons.</p>\n<p>In Al-Mu&#8217;Azai in the central Gaza Strip, an Air Force combat aircraft directed by the Golani Brigade&#8217;s attack cell attacked a weapons warehouse that stored long-range rockets.</p>\n<p>Attached is documentation of the elimination of the terrorist cell which was identified by Maglan unit soldiers and eliminated by an Air Force aircraft: https://bit.ly/47H3FZD</p>\n<p>Attached is a video of the vehicle in which Kfir soldiers found weapons: https://bit.ly/3S6vwh0</p>\n<p>Attached are pictures of the weapons found by Kfir soldiers and by a combat team from the 179th Brigade: https://IDFANC.activetrail.biz/ANC08012024.32154</p>\n<p>Attached is documentation of IDF activities in the Gaza Strip: https://bit.ly/48ngiKs</p>\n<p>Attached is documentation of IDF attacks on the Gaza Strip: https://bit.ly/47lwyu0</p>\n<p>Attached are pictures of IDF activity in the Gaza Strip: https://IDFANC.activetrail.biz/ANC08012024.2010</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The Maglan unit in Khan Yunis: Elimination of about ten terrorists preparing to launch rockets towards the country. The Fire Center of the 98th Division, in conjunction with the Air Force, attacked around 30 significant terror targets in Khan Yunis tonight, including subterranean targets, terror infrastructures and weapon storage facilities. These attacks support the ongoing fight to the forces operating in the area. In Khan Yunis, soldiers from the Maglan unit located more than ten terrorists in rocket launching areas towards the territory of the state of <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>. After identification, the soldiers directed a UAV that eliminated the</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4254",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4254
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4254",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4254"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4254/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4254"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4254"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4254"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}