{
    "id": 4230,
    "date": "2024-01-10T11:02:54",
    "date_gmt": "2024-01-10T09:02:54",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8567/"
    },
    "modified": "2024-01-10T11:02:54",
    "modified_gmt": "2024-01-10T09:02:54",
    "slug": "8567",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8567/",
    "title": {
        "rendered": "&#8220;IDF, Shin Bet, and Border Police Thwart Major Terrorist Plot: Over 180 Charges Exposed and Destroyed, 14 Arrests Made Overnight&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF, Shin Bet, and Border Police soldiers raided last night one of the terrorists&#8217; houses involved in the attack near the British Police Junction. In the operation conducted in the Jenin refugee camp, over 80 charges designed to harm our forces were exposed and in the Tarqumiya village in Judea, the forces located about 100 additional charges that were destroyed. </p>\n<p>IDF, Shin Bet, and Border Police soldiers arrested 14 wanted individuals overnight throughout Judea and Samaria.</p>\n<p>Throughout the night, the forces operated in a mission to thwart terror in the Jenin refugee camp in the Menashe Brigade. During the operation, engineering equipment exposed over 80 charges ready for use that were buried under roads in order to harm our forces, and two wanted individuals were arrested.</p>\n<p>In another brigade operation in Nablus&#8217; Casbah in the Samaria brigade, reserve soldiers investigated suspects, arrested two wanted individuals, and after searching for weaponry, guns, weapons, ammunition, and military equipment were confiscated. In addition, the soldiers located several sites of charges ready for use and destroyed them. One of the sites of charges that were destroyed was in a coffee house in the Casbah. During the operation, riots broke out, including stone-throwing and charges, the forces responded by shooting, hits were identified.</p>\n<p>In the village of Atara in the Binyamin Brigade, the soldiers raided the house of one of the terrorists who carried out the shooting attack near the British Police junction earlier this week on January 7, 2024.</p>\n<p>In the village of Tarqumiya in the Judea Brigade, two wanted individuals were arrested and about 100 charges ready for use were destroyed, and in Bethlehem in the Etzion Brigade, weaponry was located. In addition, in the village of Dura and in the city of Hebron in the Judea Brigade, the forces confiscated large sums of terror money.</p>\n<p>The arrested wanted individuals and confiscated weaponry were transferred for further processing by the security forces, there were no casualties to our forces.</p>\n<p>Attached are photos of the charges that were located and destroyed: https://IDFANC.activetrail.biz/ANC10012024.321 </p>\n<p>So far, since the beginning of the war, over 2,600 wanted individuals have been arrested across the Judea and Samaria Division and the Jordan Valley and Valleys Brigade, about 1,300 of them are affiliated with the Hamas terrorist organization.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF, Shin Bet, and Border Police soldiers raided last night one of the terrorists&#8217; houses involved in the attack near the British Police Junction. In the operation conducted in the Jenin refugee camp, over 80 charges designed to harm our forces were exposed and in the Tarqumiya village in Judea, the forces located about 100 additional charges that were destroyed. IDF, Shin Bet, and Border Police soldiers arrested 14 wanted individuals overnight throughout Judea and Samaria. Throughout the night, the forces operated in a mission to thwart terror in the Jenin refugee camp in the Menashe Brigade. During</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4230",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4230
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4230",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4230"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4230/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4230"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4230"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4230"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}