{
    "id": 4211,
    "date": "2024-01-13T09:49:16",
    "date_gmt": "2024-01-13T07:49:16",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8586/"
    },
    "modified": "2024-01-13T09:49:16",
    "modified_gmt": "2024-01-13T07:49:16",
    "slug": "8586",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8586/",
    "title": {
        "rendered": "&#8220;IDF Soldiers Thwart Terrorism: A Detailed Account of Rocket Launcher Destruction and Terrorist Elimination Across the Gaza Strip&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF soldiers continue to thwart terrorism and eliminate terrorists across the Strip: Special documentation of the destruction of ready-to-launch rocket launchers</p>\n<p>In the center of the Strip, in the Al-Muarkha neighborhood, fighters from the 646th Brigade Combat Team located and destroyed two rocket launcher sites ready for launch. Additional fighters from the brigade located and destroyed dozens of launchers ready for immediate launch. In special documentation of their destruction, you can see that some of the launchers were loaded and ready for use.</p>\n<p>In Khan Yunis, a fire complex of the 7th Brigade destroyed a tunnel inside a building containing many explosives and ammunition. The fighters identified terrorists approaching our forces, who were eliminated by tank fire. </p>\n<p>In the Al-Atatra area in the north of the Gaza Strip, fighters from the 401st Brigade Combat Team located and destroyed launch pits during sweeps.</p>\n<p>Also in the Khan Yunis area, fighters from the Paratroopers Brigade Combat Team identified terrorists shooting from a building and fleeing. The forces directed an aircraft of the Air Force which attacked the terrorists. One of the terrorists was killed and another fled to another building. His escape was under the surveillance of the force and shortly afterwards another aircraft was directed which attacked the terrorist and he was killed. In the activity of the fighters from the 55th Brigade Combat Team in a terrorist&#8217;s house, Palestinian Islamic Jihad instruction booklets were found, sniper firing positions aimed at our forces, and other technological means were discovered. </p>\n<p>In addition, in Khan Yunis, Givati ​​Reconnaissance fighters identified hostile terrorists, they fired tank fire at them and the terrorists were killed.</p>\n<p>Attached is documentation of the destruction of the rocket launchers by fighters from the 646th Brigade Combat Team: https://bit.ly/3Hg73Q2</p>\n<p>Attached are photos from IDF forces activity in the Strip: https://IDFANC.activetrail.biz/ANC13012024.31312598</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF soldiers continue to thwart terrorism and eliminate terrorists across the Strip: Special documentation of the destruction of ready-to-launch rocket launchers In the center of the Strip, in the Al-Muarkha neighborhood, fighters from the 646th Brigade Combat Team located and destroyed two rocket launcher sites ready for launch. Additional fighters from the brigade located and destroyed dozens of launchers ready for immediate launch. In special documentation of their destruction, you can see that some of the launchers were loaded and ready for use. In Khan Yunis, a fire complex of the 7th Brigade destroyed a tunnel inside a</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4211",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4211
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4211",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4211"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4211/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4211"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4211"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4211"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}