{
    "id": 4205,
    "date": "2024-01-13T19:13:43",
    "date_gmt": "2024-01-13T17:13:43",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8592/"
    },
    "modified": "2024-01-13T19:13:43",
    "modified_gmt": "2024-01-13T17:13:43",
    "slug": "8592",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8592/",
    "title": {
        "rendered": "&#8220;100 Days of War: IDF&#8217;s Unyielding Fight Against Hamas and Resolute Mission to Bring Back Abductees&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesman:</p>\n<p>Chief of Staff: We are fighting for our right to live here safely</p>\n<p>Referring to the abductions: Every minute is critically important and we are not indifferent to this, we are working by all means, mostly covertly, until all are returned; we will not allow extortion attempts to cease fire</p>\n<p>Attached is the Chief of Staff&#8217;s statement, Lt. Gen. Herzi HaLevi: https://bit.ly/47zkYvl</p>\n<p>His full words are attached: &#8220;Today, we approved plans for the Southern Command to continue the fight and to escalate the military pressure on Hamas. Pressure that will lead to the dismantlement of Hamas and the return of the abductees. This pressure, and only it, has so far led to the release of many abductees.<br />\nTomorrow, we will mark one hundred days since the start of the war. One hundred days in which the abductees are still being held in Gaza by the ruthless Hamas terrorists. We are working by all means, mostly covertly, to bring them back and so, we will continue doing until all are returned. This mission is yet to be completed. I know that every minute holds critical importance and we are not indifferent to it. Time is pressing to bring back the abductees and we do not forget for a moment and do not abandon this high goal.<br />\nTo get real results, we need to continue and work on enemy territory, not to allow extortion attempts to cease fire which presumably won&#8217;t bring tangible results. We need to continue and push, and this exactly what we are doing.<br />\nThe Hamas leadership pins hopes on a ceasefire and they’re convinced that that moment is coming closer. For such worthy goals, we are determined and persistent. These goals are complicated to achieve and it will take a long time- we said this from the get-go. To break down Hamas, we need and it is necessary to have patience.<br />\nIn Gaza, four combat brigades are operating today. The forces are advancing in the field according to the plan and adapt their actions to the tasks, the area, and the enemy.<br />\nWe have completed the dismantling of Hamas’ military frameworks in the northern Strip, and now the forces are embarking on missions to deepen and preserve this achievement in that area. There are still terrorists there, there are some infrastructures, we will continue to hit, pursue and destroy.<br />\nWe have transferred the concentration of effort to the center and south of the Strip, where we exposed, including today, weapons production facilities above and below ground, including missiles destined for the outskirts of Israel, a real military industry. The demolition is very important to prevent future strengthening, and it is important to understand that without a presence in the field, it would not have been possible to do this. The forces are systematically destroying these infrastructures very fundamentally, and simultaneously the forces continue to eliminate terrorists from the air, sea, and in valiant face-to-face combat even on land in a very complex area.<br />\nAs part of the progression of the fight, we released some of the reserve forces, whose mobilization is commendable for the entire country. You, the dear reservists, are exemplary groups in Israeli society. We will of course need you also in &#8217;24.<br />\nWe will do this while providing adequate preparation time, alongside proper respect, and worthy compensation &#8211; for you and no less importantly to your families, who have kept the home throughout this period.<br />\nWe are conducting a war on several fronts at the same time, with varying intensity. Operating everywhere. There will be no immunity for those seeking to kill us: not in Gaza, not in Judea and Samaria, and not in other areas across the Middle East.<br />\nHezbollah chose to serve as a &#8220;Hamas shield&#8221; on an Iranian mission, and we are making it pay a growing price for this. Whoever links the end of the conflict in the north with the end of the fighting in the Gaza Strip will pay increasing prices. So it was, so it will be also in the future. The security situation in the north is already shaping up these days. We are pushing Radwan terrorists away from the border and striking at Hezbollah&#8217;s capabilities that he built over the years. We operate with freedom of action in Lebanon&#8217;s airspace and attack every threat we identify. The southern Lebanon area is a war zone, and it will remain so as long as Hezbollah operates from it. Hezbollah may turn all of Lebanon into a war zone, there will be a heavy price for this.<br />\nWe are ready for war today as well, and we are constantly improving our capabilities. We are committed to changing the security situation, in such a way that will allow the residents to return safely to their homes &#8211; in the north and the south.<br />\nIn Judea and Samaria, we are operating around the clock in settlements and at junctions. During the war, we carried out an unprecedented number of offensive activities, arresting terrorists, including those on their way to carry out attacks. Together with the settlement, we are investigating every incident and enhancing the defense. Last night too, at the Adora settlement, there was an attempted attack, a combination of local forces, with military forces, vigilance, determined actions, led to a result in which three terrorists were killed without reaching civilians, and importantly, without civilians being injured, we wish for a speedy recovery to a single soldier who was injured.<br />\nReal investigation is the essence of an army. We are investigating all the time. This is how it is in the IDF, it is our way to learn and improve. The IDF is responsible for the security of the state and is committed to improving and adapting itself to the battlefield.<br />\nOperational investigation of course does not replace external inspection or investigation. We understand that the war will continue for a long time, and so we began to plan the investigation structure. We must also learn during this war, when the fight will always be the first priority &#8211; it will not affect it, after all, we are the ones who are doing it too. We have not yet decided when we will start investigating, but we have determined that we will investigate the events that led to the outbreak of the war and its result as soon as possible.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF Spokesman: Chief of Staff: We are fighting for our right to live here safely Referring to the abductions: Every minute is critically important and we are not indifferent to this, we are working by all means, mostly covertly, until all are returned; we will not allow extortion attempts to cease fire Attached is the Chief of Staff&#8217;s statement, Lt. Gen. Herzi HaLevi: https://bit.ly/47zkYvl His full words are attached: &#8220;Today, we approved plans for the Southern Command to continue the fight and to escalate the military pressure on <a  href=\"/hamas\">Hamas</a>. Pressure that will lead to the dismantlement of <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> and the</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4205",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4205
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4205",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4205"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4205/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4205"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4205"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4205"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}