{
    "id": 4162,
    "date": "2024-01-17T14:25:48",
    "date_gmt": "2024-01-17T12:25:48",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8637/"
    },
    "modified": "2024-01-17T14:25:48",
    "modified_gmt": "2024-01-17T12:25:48",
    "slug": "8637",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8637/",
    "title": {
        "rendered": "&#8220;IDF&#8217;s Extensive Anti-Terror Operation: Home Demolitions, Arrests and Counter-Attacks &#8211; An Inside Look&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The IDF has demolished the homes of terrorists who carried out the attack in Ra&#8217;anana; an extensive operation to thwart terror is underway in the Tulkarem refugee camp; the IDF, Shin Bet, and Israeli Border Police have arrested 26 wanted individuals overnight in Judea, Samaria, Jordan Valley, and the Valleys Brigade.</p>\n<p>The forces have begun an operation to thwart terrorism in the Tulkarem refugee camp under the command of Menashe Brigade. The forces are scanning buildings, investigating tens of suspects, and arresting wanted individuals. So far, seven wanted individuals have been arrested and engineering equipment has exposed dozens of charges that were buried under roads intended to harm our forces.</p>\n<p>During the operation, explosives were thrown and fire was opened at our forces, who responded. A drone guided by Unit 636 attacked a group of armed terrorists who shot and threw explosives, endangering our forces, resulting in several terrorists killed. The operation is still ongoing.</p>\n<p>During the operation in Tulkarem, a reserve soldier was seriously wounded by gunfire. The soldier was evacuated for medical treatment at the hospital, his family has been notified.</p>\n<p>In the village of Bani Naim in the Judea Brigade, the soldiers demolished two houses of the terrorists who carried out the attack in Ra&#8217;anana and many suspects were investigated.</p>\n<p>In the village of Beit Anan in the Binyamin Brigade, the forces confiscated equipment and sealed off a printing house that printed propaganda materials for the Hamas terrorist organization.</p>\n<p>Since the beginning of the war, approximately 2,700 wanted individuals have been arrested across the Judea Brigade, Samaria Brigade, and the Jordan Valley and Valleys Brigade, over 1,300 of whom are affiliated with the Hamas terrorist organization.</p>\n<p>The arrested suspects have been transferred for further investigation by the security forces.</p>\n<p>Attached are photos of the IDF soldiers&#8217; activities: https://IDFANC.activetrail.biz/ANC17012024.9857</p>\n<p>Attached are pictures from the sealing of the printing house in the Binyamin Brigade: https://IDFANC.activetrail.biz/ANC17012024.524</p>\n<p>Attached are pictures from the demolition of the terrorists&#8217; houses who carried out the attack in Ra&#8217;anana: https://IDFANC.activetrail.biz/ANC17012024.369</p>\n<p>Attached is documentation from the attack on the terrorist cell: https://bit.ly/41YTSwF</p>\n<p>Attached is documentation from the forces&#8217; activities throughout Judea and Samaria: https://bit.ly/4b1omlO</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The IDF has demolished the homes of terrorists who carried out the attack in Ra&#8217;anana; an extensive operation to thwart terror is underway in the Tulkarem refugee camp; the IDF, Shin Bet, and Israeli Border Police have arrested 26 wanted individuals overnight in Judea, Samaria, Jordan Valley, and the Valleys Brigade. The forces have begun an operation to thwart terrorism in the Tulkarem refugee camp under the command of Menashe Brigade. The forces are scanning buildings, investigating tens of suspects, and arresting wanted individuals. So far, seven wanted individuals have been arrested and engineering equipment has exposed dozens</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4162",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4162
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4162",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4162"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4162/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4162"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4162"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4162"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}