{
    "id": 4152,
    "date": "2024-01-18T14:30:34",
    "date_gmt": "2024-01-18T12:30:34",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8647/"
    },
    "modified": "2024-01-18T14:30:34",
    "modified_gmt": "2024-01-18T12:30:34",
    "slug": "8647",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8647/",
    "title": {
        "rendered": "&#8220;Breaking Down the IDF&#8217;s 35-Hour Anti-Terror Operation: Arrests, Aerial Strikes, and Weapon Seizures in Tul Karem Camp&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>In an anti-terror operation that has been ongoing for over 35 hours at the Tul Karem camp in the Menashe Brigade&#8217;s command, at least eight terrorists have been killed, 15 suspects have so far been arrested, and dozens of charges have been destroyed; IDF soldiers, Shin Bet, and the Border Police arrested 21 wanted individuals across Judea and Samaria overnight.</p>\n<p>Reserve IDF soldiers, Shin Bet, Police, and Border Police continue to operate in an anti-terror operation at the Tul Karem camp under the command of the Menashe Brigade for over 35 hours. The soldiers continue to operate in the city even at this hour.</p>\n<p>So far, during the operation, engineering tools have uncovered dozens of charges that were exposed after being buried under roads with the intention of harming our forces. In addition, so far, the soldiers have stormed hundreds of buildings, arrested over 15 wanted individuals, and located many weapons, fighting means, vast military equipment, and explosives that were destroyed. In the course of the raids, the soldiers located and destroyed an explosives and observation CuriousPost apparatus.</p>\n<p>During the operation, the soldiers exchanged fire and encounters with armed terrorists who shot and threw explosives. So far at least eight terrorists have been killed, some of them from aerial strikes. </p>\n<p>In parallel to the operation, the soldiers arrested 21 wanted people across Judea and Samaria overnight. In the Al-Arroub camp in the Etzion Brigade, 10 wanted individuals were arrested, and dozens of suspects will be investigated in the Harmeila village in the brigade&#8217;s area. In the village of Ras Atiya in Ephraim, the soldiers found means of warfare. In the city of Qalqilya in the brigade&#8217;s area, a Border Police fighter was injured by charges activated towards him and was evacuated for medical treatment at the hospital, his family has been updated.<br />\nIn the city of Hebron, the soldiers found many means of warfare and flags of the Hamas terrorist organization.</p>\n<p>So far from the beginning of the war, about 2,700 wanted individuals have been arrested across the Judea and Samaria Division and the Jordan Valley and Valleys Brigade, over 1,300 of them are affiliated with the Hamas terrorist organization.</p>\n<p>Attached are photos of the warfare means that were exposed throughout Judea and Samaria: https://IDFANC.activetrail.biz/ANC18012024.156156156</p>\n<p>Attached is documentation of IDF forces operations throughout Judea and Samaria:  https://bit.ly/3U1fmXP</p>\n<p>Attached is documentation of means of warfare found inside a vehicle and shooting position in Tul Karem:  https://bit.ly/48Z8DC0</p>\n<p>Attached are photos from the operations of IDF forces throughout Judea and Samaria: https://IDFANC.activetrail.biz/ANC18012024.189189189</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: In an anti-terror operation that has been ongoing for over 35 hours at the Tul Karem camp in the Menashe Brigade&#8217;s command, at least eight terrorists have been killed, 15 suspects have so far been arrested, and dozens of charges have been destroyed; IDF soldiers, Shin Bet, and the Border Police arrested 21 wanted individuals across Judea and Samaria overnight. Reserve IDF soldiers, Shin Bet, Police, and Border Police continue to operate in an anti-terror operation at the Tul Karem camp under the command of the Menashe Brigade for over 35 hours. The soldiers continue to operate in</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4152",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4152
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4152",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4152"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4152/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4152"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4152"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4152"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}