{
    "id": 4145,
    "date": "2024-01-19T09:37:42",
    "date_gmt": "2024-01-19T07:37:42",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8654/"
    },
    "modified": "2024-01-19T09:37:42",
    "modified_gmt": "2024-01-19T07:37:42",
    "slug": "8654",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8654/",
    "title": {
        "rendered": "&#8220;Tri-Force Operation: IDF&#8217;s Land, Air, and Sea Forces Eliminate Key Palestinian Islamic Jihad Figure and Terrorists Across Gaza Strip&#8221;"
    },
    "content": {
        "rendered": "<p>Joint statement to the IDF spokesperson and the Shin Bet spokesperson: </p>\n<p>The collaboration between land, air, and sea forces leads to the elimination of terrorists across the Strip; armed terrorists are eliminated in the north of the Strip and many means of combat were located in the center of the Strip. </p>\n<p>IDF soldiers continue to operate in the Gaza Strip in coordination with the air forces that are carrying out precise attacks under the direction of the soldiers.<br />\nThe navy assists the operating forces and attacks from sea.</p>\n<p>Yesterday (Thursday), Walid Abu Fannuna, Deputy Head of the Explanation (Public Relations) Department of the Palestinian Islamic Jihad organization, was eliminated during an air force attack, led by the Southern Command and directed by the Intelligence Wing and Shin Bet. </p>\n<p>Walid Abu Fannuna served as the Deputy Head of the Explanation Department of the Palestinian Islamic Jihad organization. In this capacity, he served as assistant to Khalil Bathini, the Commander of the northern sector of the Palestinian Islamic Jihad, and from 2017 he was promoted to the position of Deputy Head of the Explanation Department of the organization. Abu Fannuna was responsible for producing terrorist organization&#8217;s videos regarding rocket fire towards Israeli territory, and creating and distributing abduction documentation as part of the psychological warfare of Gaza terrorist organizations against Israeli residents.</p>\n<p>In the central area of the Gaza Strip, IDF soldiers from Brigade 179 operated. As part of the activity, terrorists fired RPGs at the forces. Later, the soldiers swept the area and the building where the terrorist cell operated and located RPG tools, Kalashnikov weapons, and military equipment. </p>\n<p>In the northern area of the Gaza Strip, soldiers from the combat team of Brigade 5 eliminated a number of armed terrorists in the encounters that occurred with forces in the northern area of the Gaza Strip in the past day. The soldiers attacked and eliminated the terrorists with the help of tank firing and also under the direction of an air force aircraft. </p>\n<p>Documentation of IDF attacks in the Strip is attached: https://bit.ly/3SpCe0P </p>\n<p>Documentation of the elimination of the Deputy Head of the Explanation Department of the Palestinian Islamic Jihad organization is attached: https://bit.ly/4b6gLCz </p>\n<p>Photos from the IDF forces&#8217; activity in the strip are attached: https://IDFANC.activetrail.biz/ANC190120247319749379 </p>\n<p>Photos of the means of combat found in the central strip are attached: https://IDFANC.activetrail.biz/ANC190120249371917 </p>\n<p>Walid Abu Fannuna&#8217;s ID card is attached: https://IDFANC.activetrail.biz/ANC18012024.32147</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Joint statement to the <a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a> and the Shin Bet spokesperson: The collaboration between land, air, and sea forces leads to the elimination of terrorists across the Strip; armed terrorists are eliminated in the north of the Strip and many means of combat were located in the center of the Strip. IDF soldiers continue to operate in the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip in coordination with the air forces that are carrying out precise attacks under the direction of the soldiers. The navy assists the operating forces and attacks from sea. Yesterday (Thursday), Walid Abu Fannuna, Deputy Head of the Explanation (Public Relations)</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4145",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4145
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4145",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4145"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4145/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4145"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4145"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4145"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}