{
    "id": 4064,
    "date": "2024-01-30T07:09:06",
    "date_gmt": "2024-01-30T05:09:06",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8736/"
    },
    "modified": "2024-01-30T07:09:06",
    "modified_gmt": "2024-01-30T05:09:06",
    "slug": "8736",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8736/",
    "title": {
        "rendered": "&#8220;Unveiling Hamas&#8217; Terror Plot: IDF, Shin Bet and Israel Police Thwart Attack from Hospital Hideout&#8221;"
    },
    "content": {
        "rendered": "<p>Joint message from IDF Spokesperson, Shin Bet Spokespersons, and Israel Police Spokespersons:</p>\n<p>A Hamas terrorist cell was thwarted, armed and hidden in the &#8220;Ibn Sina&#8221; hospital in the city of Jenin in the Menashe Brigade, planning to carry out an attack in the immediate timeframe.</p>\n<p>Last night in a joint operation of Shin Bet, Israeli special police force, and IDF, we thwarted Mohammed Jalamneh, a military Hamas terrorist who recently engaged in significant terror activity and hid in the &#8220;Ibn Sina&#8221; Hospital in the city of Jenin in the Menashe Brigade. A pistol, prohibited by the forces, was located on the suspect.</p>\n<p>Mohammed Jalamneh, 27, who has been residing in the Jenin refugee camp for a while, was in contact with the Hamas command abroad and was even injured when he tried to promote a car-bombing attack. In addition, Jalamneh transferred weapons and ammunition to terrorists for the purpose of promoting shooting attacks and planned an infiltration attack inspired by the events of October 7th.</p>\n<p>Along with Jalamneh, two additional military terrorists were thwarted who were hiding at the location. Mohammed Al-Azawi, a resident of Jenin, involved in several terrorist activities and targeted IDF forces with shooting; and Basal Al-Azawi, a resident of Jenin, Mohammed&#8217;s brother, involved in Gazan terrorist activity.</p>\n<p>For a long time, a large number of wanted individuals have been hiding in hospitals, using them as bases for planning terror activities and going out to carry out attacks, while believing that the hospitals will protect them from the activity of the security forces. This is another example of the cynical use of civilian areas and hospitals as a shelter and human shield by terrorist organizations.</p>\n<p>Jalamneh planned to carry out an attack in the immediate timeframe and used the hospital as a hiding place. Therefore, he was thwarted. The security forces will continue to act against any threat that endangers the security of the citizens of the State of Israel.</p>\n<p>Attached are photos of the pistol found on the terrorist: https://IDFANC.activetrail.biz/ANC30012024237591384</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Joint message from <a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>, Shin Bet Spokespersons, and <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> Police Spokespersons: A <a  href=\"/hamas\">Hamas</a> terrorist cell was thwarted, armed and hidden in the &#8220;Ibn Sina&#8221; hospital in the city of Jenin in the Menashe Brigade, planning to carry out an attack in the immediate timeframe. Last night in a joint operation of Shin Bet, Israeli special police force, and IDF, we thwarted Mohammed Jalamneh, a military <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> terrorist who recently engaged in significant terror activity and hid in the &#8220;Ibn Sina&#8221; Hospital in the city of Jenin in the Menashe Brigade. A pistol, prohibited by the forces, was located on</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4064",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4064
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4064",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4064"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4064/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4064"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4064"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4064"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}