{
    "id": 17928,
    "date": "2024-10-02T00:03:39",
    "date_gmt": "2024-10-01T21:03:39",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17928"
    },
    "modified": "2024-10-02T10:13:08",
    "modified_gmt": "2024-10-02T07:13:08",
    "slug": "amr-waked",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/terrorist-sympathizer/amr-waked/",
    "title": {
        "rendered": "Amr Waked"
    },
    "content": {
        "rendered": "\n<p>Amr Waked is not just an actor—he’s a politically charged figure whose rhetoric and activism blur the lines between artistic expression and dangerous conspiracy-mongering. Known for his sharp criticism of the Egyptian government, Waked’s activism initially focused on domestic politics. However, over time, his outspoken comments on Israel and Hamas have raised significant concerns about where his sympathies truly lie.</p>\n\n\n\n<p>Despite claiming to oppose Hamas, Waked’s statements around their actions often serve as thinly veiled justifications for their atrocities. For example, in response to an Israeli Defense Forces (IDF) hostage rescue operation, Waked implied that Hamas allowed the rescue for political gain, hinting that the terror group was using innocent civilians as pawns. This twisted narrative downplays Hamas’s brutal tactics and serves to obscure the reality that Hamas deliberately targets civilians and uses human shields—actions that are unquestionably war crimes.</p>\n\n\n\n<p>Waked’s supposed opposition to both Hamas and Israel often ends up painting a false moral equivalence between a legitimate state defending its citizens and a terrorist organization committed to the destruction of Israel. By doing this, Waked aligns himself with the dangerous rhetoric that emboldens groups like Hamas, which thrive on this kind of intellectual cover from public figures.</p>\n\n\n\n<p>While Waked has denied accusations of working with Hamas, his comments, particularly after events like the October 7, 2023 massacre, reveal a troubling pattern. His remarks, in which he frequently undermines Israel’s right to defend itself, ultimately play into the hands of those who support terrorism against the Jewish state.</p>\n\n\n\n<p>Waked’s collaboration with Israeli actress Gal Gadot in <em>Wonder Woman</em> may have drawn accusations of &#8220;normalization&#8221; from some in the Arab world, but this doesn’t absolve him of his harmful rhetoric. His statements continually distort the reality of Hamas’s terrorist actions, making him complicit in the spread of ideas that fuel anti-Israel sentiment and ultimately lend tacit support to those who seek to destroy Israel.</p>\n\n\n\n<p>Amr Waked isn’t just a critic of the Egyptian regime or a dissident actor—he’s someone whose words provide dangerous cover for extremists. Anyone aligning with Waked should recognize that his rhetoric, whether intentional or not, empowers those who celebrate violence and terrorism. Supporting him means lending legitimacy to those who wish to see Israel and its people wiped off the map.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Amr Waked is not just an actor—he’s a politically charged figure whose rhetoric and activism blur the lines between artistic expression and dangerous conspiracy-mongering. Known for his sharp criticism of the Egyptian government, Waked’s activism initially focused on domestic politics. However, over time, his outspoken comments on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and <a  href=\"/hamas\">Hamas</a> have raised significant concerns about where his sympathies truly lie. Despite claiming to oppose <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>, Waked’s statements around their actions often serve as thinly veiled justifications for their atrocities. For example, in response to an Israeli Defense Forces (IDF) hostage rescue operation, Waked implied that Hamas allowed the rescue for</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17929,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-useful-idiots",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1578,
        "footnotes": ""
    },
    "categories": [
        1578
    ],
    "tags": [],
    "class_list": [
        "post-17928",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-terrorist-sympathizer"
    ],
    "lang": "en",
    "translations": {
        "en": 17928
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17928",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17928"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17928/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17930,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17928/revisions/17930"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17929"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17928"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17928"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17928"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}