{
    "id": 17990,
    "date": "2024-10-03T10:48:37",
    "date_gmt": "2024-10-03T07:48:37",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17990"
    },
    "modified": "2024-10-03T10:48:41",
    "modified_gmt": "2024-10-03T07:48:41",
    "slug": "antonio-guterres",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/terrorist-sympathizer/antonio-guterres/",
    "title": {
        "rendered": "António Guterres"
    },
    "content": {
        "rendered": "\n<p>António Guterres, the Secretary-General of the United Nations, has repeatedly proven himself to be an enabler of terrorist organizations like Hamas, Hezbollah, and other Iranian proxies. His statements and actions regarding Israel&#8217;s right to defend itself expose a deep and dangerous bias that openly sides with terrorists.</p>\n\n\n\n<p>When Hamas slaughtered over 1,400 Israeli civilians in the October 7 massacre — murdering children, raping women, and abducting innocent people — Guterres didn’t unequivocally condemn the attack. Instead, he had the audacity to claim the atrocity didn’t happen “in a vacuum,” suggesting Hamas somehow had justifiable reasons to commit these war crimes. This grotesque framing provides a veneer of legitimacy to terrorists, as if their brutal slaughter of civilians had an understandable context. By refusing to clearly and forcefully denounce Hamas&#8217; actions, Guterres actively encourages terrorism.</p>\n\n\n\n<p>Even worse, Guterres has remained silent on the plight of the hostages held in Hamas dungeons for nearly a year, while criticizing Israel for defending itself against terror on multiple fronts. Iranian-funded terror groups—Hamas, Hezbollah, and others—have launched relentless daily attacks on Israel from Gaza, Lebanon, Syria, and even Iraq and Yemen. Israel is not the aggressor here; it is a nation fighting for survival, surrounded by terrorist proxies bent on its destruction. Yet, Guterres’ response is to condemn Israel at every turn while turning a blind eye to the Iranian regime’s sponsorship of global terror. He refuses to even acknowledge Iran&#8217;s role in orchestrating these attacks, as if Israel were randomly targeting these nations without provocation.</p>\n\n\n\n<p>The clearest example of Guterres’ bias came on October 1, 2024, when Iran launched a massive ballistic missile attack targeting 10 million civilians in Israel. More than 200 missiles rained down, threatening the entire population. And what did Guterres do? He didn&#8217;t condemn Iran’s barbaric act. Instead, he immediately called for a ceasefire, effectively granting Iran and its terror proxies the freedom to continue their assault without consequence.</p>\n\n\n\n<p>For the past 11 months, Guterres has consistently shown that his sympathies lie with terrorist organizations, not with the innocent lives terrorized by them. He has failed to denounce Hezbollah&#8217;s attacks from Lebanon, failed to condemn Iranian militias in Syria and Iraq, and never acknowledged the constant barrage of rocket fire from Hamas in Gaza. Instead, his focus has been to criticize Israel&#8217;s efforts to defend itself, pretending as if these terror organizations don’t exist or have legitimate grievances that justify their brutality.</p>\n\n\n\n<p>Guterres’ actions are not just a dereliction of duty—they are an open endorsement of terrorism. By ignoring Iran’s role in funding and arming groups that seek Israel&#8217;s destruction, by failing to push for the release of hostages, and by consistently undermining Israel’s right to self-defense, António Guterres has made the United Nations a platform for terrorist sympathies. His moral failure emboldens groups like Hamas and Hezbollah to continue their campaign of terror, knowing they have a powerful ally in the Secretary-General of the United Nations.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Fuck you and your UN</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17991,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-useful-idiots",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1578,
        "footnotes": ""
    },
    "categories": [
        1578
    ],
    "tags": [
        1584,
        1340
    ],
    "class_list": [
        "post-17990",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-terrorist-sympathizer",
        "tag-antonio-guterres",
        "tag-the-un"
    ],
    "lang": "en",
    "translations": {
        "en": 17990
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17990",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17990"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17990/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17992,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17990/revisions/17992"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17991"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17990"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17990"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17990"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}