{
    "id": 18334,
    "date": "2024-10-22T15:00:00",
    "date_gmt": "2024-10-22T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18334"
    },
    "modified": "2024-10-25T16:57:10",
    "modified_gmt": "2024-10-25T13:57:10",
    "slug": "hezbollahs-billions-under-beirut-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollahs-billions-under-beirut-eylon-levy/",
    "title": {
        "rendered": "Hezbollah’s billions under Beirut | Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah’s billions under Beirut | Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Al8s8PvaDso?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a>This week is the Jewish holiday of Sukkot, and millions of Israeli families celebrate outdoors in a sukkah. But since the festival&#8217;s beginning on Wednesday one week ago, Hezbollah has fired around 1,000 rockets, missiles, and drones at our families. Just this morning, I was one of millions in the Tel Aviv metro area to run to a bomb shelter when Hezbollah fired on us before 8 a.m. Iran&#8217;s proxy army in Lebanon fired five missiles at Israelis this morning, most were intercepted. Last night, an Iranian missile from Lebanon hit an open area outside Tel Aviv. We&#8217;re approaching 15,000 rockets from Lebanon over the last year. That&#8217;s why the IDF is continuing to dismantle Hezbollah&#8217;s military infrastructure in Lebanon. This war cannot end with Hezbollah sitting on Israel&#8217;s northern border plotting another October 7th on a bigger scale. Hezbollah didn&#8217;t back off, so Israel is pushing it away. Israel is hitting Hezbollah where it hurts—in their wallet. Israel announced Hezbollah is hiding half a billion dollars under a hospital. Most banks protect your funds with deposit insurance; Hezbollah protects its money with the lives of Lebanese hospital patients. Hezbollah&#8217;s $500 million in cash and gold is sitting in a bunker dug underneath Beirut Sahel Hospital. Israel is telling Lebanon&#8217;s people that money is there. It&#8217;s yours—don’t let Hezbollah use you to protect their funds; instead, go take it, use the money to make Lebanon a better place. Hezbollah is hiding its criminal funds in other places in Lebanon.</p>\n\n\n\n<p>After urging Lebanese civilians to get out of harm&#8217;s way, Israel&#8217;s jets struck Hezbollah financial institutions to try to break Hezbollah&#8217;s war machine—the war machine it has used to wage war against Israel since October 8th last year. Billions in Hezbollah&#8217;s cash went up in smoke. Hezbollah is not just a terror organization; Hezbollah is a mafia with an army. Many of its billions come from Hezbollah&#8217;s patrons in the Islamic Republic of Iran, but Hezbollah is also a multinational crime syndicate. Hezbollah commits crimes in the West to fund its war crimes in the Middle East. Hezbollah may be a theocratic Iranian terror army in Lebanon, but it pays for its religious war against Israel&#8217;s people with drugs and sex and many other crimes. The Netflix show <em>Narcos</em> didn’t mention Hezbollah, but maybe it should. The U.S. DEA and Treasury Department a decade ago exposed Hezbollah laundering $20 million a month for Mexican and Colombian drug cartels. At least two-thirds of Hezbollah&#8217;s budget back then, in 2010, came from crime. Hezbollah agents in the tri-border area of South America—that’s a no-man’s-land between Brazil, Argentina, and Paraguay—were put on a U.S. watch list after starting to shift tons of cocaine, that could be $500 million a year or more.</p>\n\n\n\n<p>Heard of blood diamonds? Hezbollah agents in West Africa traffic hundreds of millions worth of blood diamonds, and blood timber, and people. Yes, Hezbollah traffics in people in Africa and around the world—all to fund its war against Israel. We&#8217;ve spoken of Hezbollah&#8217;s role in murdering thousands in Syria&#8217;s civil war. Hezbollah also enslaved nearly 100 Syrian women as sex slaves. And Hezbollah operates labs across Lebanon making captagon, a synthetic cocaine, to poison customers across the Arab world for tens of millions in earnings. Remember, Hezbollah isn&#8217;t only murdering Israel&#8217;s people with rockets; it has blood on its hands from untold victims of its immoral organized crime around the world. Destroying Hezbollah and deterring Iran makes the whole world safer.</p>\n\n\n\n<p>One final item today: here&#8217;s a quiz. What do Adolf Hitler, Saddam Hussein, Osama Bin Laden, and Yahya Sinwar have in common? After they died, they were all on the cover of <em>Time</em> magazine with a giant &#8220;X&#8221; over their face. That&#8217;s because they were some of the most evil men who have ever lived. It&#8217;s a good thing that Hamas leader Yahya Sinwar—the mastermind of the October 7th massacre—is dead, but the war against Hamas is not over. Hamas is still holding 100 Israeli hostages in underground terror dungeons in Gaza. Israel wants to make a deal to bring them home now. The Prime Minister of Israel offered an amnesty to Hamas terrorists who are holding hostages in exchange for releasing the hostages. Here’s the deal: let them go, and we’ll let you live. The most senior Hamas terrorist who is still alive is Khaled Mashal. He lives in Qatar. He needs to understand—and everyone still surviving in Hamas needs to understand—release the hostages and you can live. Continue holding hostages and you may find yourself on the next cover of <em>Time</em> magazine. And you won’t be Man of the Year.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q&amp;A Session</strong></h2>\n\n\n\n<p><strong>Question:</strong> &#8220;Thank you, Alon. The top item in the news right now in Israel is that U.S. Secretary of State Antony Blinken is here in Israel meeting with the Israeli Prime Minister Benjamin Netanyahu. What do you think they&#8217;re discussing?&#8221;</p>\n\n\n\n<p><strong>Answer:</strong> Israel has made clear, after Iran&#8217;s unprecedented ballistic missile attack two weeks ago, that Israel will retaliate against Iran. And Israel will retaliate against Iran because if it doesn&#8217;t, that will send a message to Iran&#8217;s leaders that it can fire ballistic missiles at Israel without consequence, and then they will do it next time. That’s why Israel is warning that its response will be significant, that it will be a surprise, and that it will be harsh, because the Iranian regime needs to understand that there are consequences to their aggression. I imagine the Prime Minister will thank the Secretary of State for dispatching the world&#8217;s most sophisticated anti-ballistic missile technology to Israel—the THAAD system—to help protect Israel from Iranian ballistic missiles. I imagine they will also talk about the progress in the war against Hezbollah in the north, and how we make sure that there is a real solution to push Hezbollah away from the border, and not simply a piece of paper that leaves Hezbollah sitting on Israel&#8217;s border free to attack again. And also the question of Gaza: how do we get to a deal to get the hostages out? Yahya Sinwar was one of the last remaining obstacles to a hostage deal. He didn’t want to let the hostages out; he understood that the longer he holds on to the hostages and the more this war goes on and the more people suffer in Gaza, the better it is for him, because he&#8217;s waging a jihadi war against Israel. And we now have an opportunity to leverage the achievement of Sinwar&#8217;s elimination to cut a deal to get the hostages out. So Iran, Lebanon, Gaza—those will be the top items on the agenda.</p>\n\n\n\n<p><strong>Question:</strong> &#8220;This is a question from our YouTube Live: Does Iran have nuclear capabilities right now? And should we expect that an Israeli response in Iran will include certain nuclear sites?&#8221;</p>\n\n\n\n<p><strong>Answer:</strong> Iran is a nuclear threshold state. What that means is that if the Iranian regime decides that it wants to build nuclear weapons, it can do so extremely quickly, possibly as quickly as a matter of weeks. In order to build a nuclear weapon, you need highly enriched uranium. Iran has enough highly enriched uranium for at least four or five nuclear bombs, according to the latest assessment. Iran has over 160 kilos of uranium enriched at 60%. I won&#8217;t bore you with the science, but that&#8217;s only a short technical hop to 90% enriched uranium, which is weapons-grade. U.S. intelligence has concluded that Iran can upgrade that into weapons-grade uranium at multiple facilities at a time of its choosing; it just depends on Iran making the decision to do so. Iran would then need to take that uranium and turn it into a nuclear bomb, and while U.S. intelligence has not concluded that the Iranian regime has decided to build a bomb, it is conducting research that will bring it closer to the ability to build a bomb the day that the Ayatollahs decide to do so. Israel must stop Iran from acquiring nuclear weapons capability; that is a strategic necessity. Israel has a doctrine. That doctrine is called the Begin Doctrine. That doctrine says that Israel will not allow enemy regimes that want to destroy Israel to acquire the weapons to do so. That&#8217;s why, in the 1980s, Israel destroyed Saddam Hussein&#8217;s nuclear reactor—the world should say thank you. In 2007, it destroyed Bashar al-Assad&#8217;s nuclear reactor in Syria—the world should say thank you too. And I&#8217;m hearing voices around the world saying that if Israel destroys Iran&#8217;s nuclear facilities, the world should say thank you as well. There are voices in Israel calling on the government to use this window of opportunity to destroy Iran&#8217;s nuclear facilities. We don&#8217;t know what Israel is going to do, how it is going to retaliate for the ballistic missiles, but one thing is clear: we&#8217;re very lucky that the last Iranian ballistic missile attack happened before Iran acquired nuclear weapons, because it doesn&#8217;t bear thinking how aggressive the Ayatollahs would be if they thought that they could protect their proxy armies around the Middle East with a nuclear umbrella. So we need urgent international action to contain the Iranian regime so that Israel doesn&#8217;t find itself forced to make that impossible decision of whether to take military action to stop the Ayatollahs from gaining the weapons to destroy this country.</p>\n\n\n\n<p><strong>Question:</strong> &#8220;Our next question comes also from YouTube, our live stream from the channel ‘Unuka’: What is your opinion about yesterday&#8217;s report by Al Jazeera magazine about Arab countries’ consent to Israel&#8217;s attack on the Islamic Republic of Iran? In other words, what do you think the surrounding countries of Israel in the region feel about the Iranian regime and Israel&#8217;s potential response?&#8221;</p>\n\n\n\n<p><strong>Answer:</strong> Israel is not alone in the Middle East. Over the last few years, we saw a process of Israel coming closer to other Arab countries—a wave of normalization—for two reasons. One, they understand there’s no point boycotting Israel; it’s bad for them. Two, because we share a common enemy. The Iranian regime is as much a threat to Saudi Arabia, as much a threat to the UAE, as much a threat to Morocco for that matter, as it is to Israel. And they want to defend themselves against the Iranian regime. They have no interest in Iran acquiring nuclear weapons; they have no interest in Iran having terrorist proxies around the region because they attack them too. Israel comes under fire nearly every day from the Houthi pirates in Yemen—the same Houthi pirates who have launched ballistic missiles and drones at Saudi Arabia and the UAE as well. Israel would like to continue that process of normalization, of having normal peaceful relations with our neighbors, and then to upgrade that into defense cooperation, understanding that the Israeli-Arab conflict is over. Israel doesn’t have a conflict with much of the Arab world; we have a conflict with the Iranian regime and its proxy armies attacking us on seven fronts. And I very much hope that Israel and those Arab countries will come closer together, understanding that if we want a future of peace and stability and prosperity in the Middle East, we have to work together against the number one destabilizing factor in the Middle East—that’s the Iranian regime.</p>\n\n\n\n<p><strong>Final Question:</strong> &#8220;This is our final question today. We are coming up on the holiday of Simchat Torah. It’s been one year since the last Simchat Torah, which is when the October 7th massacre took place. How do you plan on marking the day of Simchat Torah, and how would you suggest that other people commemorate the one-year anniversary since the Simchat Torah massacre?&#8221;</p>\n\n\n\n<p><strong>Answer:</strong> This is going to be a very difficult Simchat Torah, because it is the first anniversary since the October 7th massacre—a day that, perhaps more than any other in the Jewish calendar, is supposed to be filled with joy and happiness. It’s literally in the name. And Jewish communities around the world are going to face a challenge: how do they celebrate and commemorate at the same time? How do they live out the commandment to be happy while mourning the savage murder of 1,200 people and abduction of 251 hostages, many of whom are still trapped in Gaza? And there are several initiatives trying to square that circle. One initiative that I’ve been very proud to support is called the Simchat Torah Project. It aims to distribute hundreds of Torah covers to synagogues around the world, each embroidered with the name of either one of the victims of the October 7th massacre or one of the fallen soldiers killed in action defending our country in the October 7th War, so that Jewish communities around the world can dance around their synagogues on Simchat Torah together with the names and the souls of those we’ve lost over the last year. I think it’s a really heartwarming initiative, and anyone looking to find a way for their communities to commemorate Simchat Torah and strike the right tone this year, check out the Simchat Torah Project and see if you can still plug into that initiative.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Closing Remarks</strong></h2>\n\n\n\n<p>Okay, that’s all we have time for today. We will not be back tomorrow because it&#8217;s Erev Chag. We will be back next week with our regular roster of Citizen Spokespeople. Please, please follow us on all the social media platforms—Instagram, Twitter, Facebook, YouTube. Share the links with friends. Take this offline. Take the messages that we are giving you. Speak out. Have those difficult conversations with your friends, with your neighbors, with your colleagues. Because if it doesn&#8217;t come from you, no one else is going to have that difficult conversation. Thank you very much, everyone.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>During Sukkot, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> faced <a  href=\"/hezbollah\">Hezbollah</a>’s intensified attacks. The IDF responded by targeting <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>’s assets, revealing hidden funds under a Lebanese hospital. Hezbollah’s operations extend globally, trafficking drugs, diamonds, and people. Discussions also covered <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>’s missile threat and nuclear threshold, Israel&#8217;s alliances with Arab countries, and commemorating Simchat Torah amidst recent losses.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18013,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-18334",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 18334
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18334",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18334"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18334/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18336,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18334/revisions/18336"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18013"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18334"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18334"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18334"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}