{
    "id": 18934,
    "date": "2024-10-31T15:00:00",
    "date_gmt": "2024-10-31T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18934"
    },
    "modified": "2024-11-29T21:57:52",
    "modified_gmt": "2024-11-29T19:57:52",
    "slug": "hezbollah-may-be-ready-to-make-concessions-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-may-be-ready-to-make-concessions-ruth-wasserman-lande/",
    "title": {
        "rendered": "Hezbollah May Be Ready to Make Concessions | Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah May Be Ready to Make Concessions | Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/RD36unmyr0E?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Israel has been breaking Hezbollah in Lebanon. Now Hezbollah wants Israel to stop. Iran&#8217;s terror army, Lebanon, claims that it has agreed to move its weapons from Israel&#8217;s border. That’s what Lebanese media is reporting today. How kind of Hezbollah to agree to move its weapons after Israel has already destroyed so many of them. Remember, Hezbollah has been raining fire on Israel for a year: 15,000 Iranian rockets, missiles, drones, and guided missiles aimed at houses. 60,000 people were forced to leave their homes, and Hezbollah planned to attack Israeli villages and do their own October 7th massacre. What the Israeli Defense Forces have found in the south of Lebanon confirms it: huge attack tunnels with loads of weapons and enough food and other necessities to maintain Hezbollah terrorists for many, many months.</p>\n\n\n\n<p>Following Israel’s taking out Hezbollah’s commanders and demolishing their terror tunnels and other equipment and armament aimed to attack Israel, Arab media is now reporting that Hezbollah terrorists are fleeing—many of them to Syria. De facto, many of them have actually fled to the north of Lebanon to settle there temporarily, regroup, and rearm, all on account and backs of the Lebanese people and their beautiful country. Meanwhile, Hezbollah appointed a new leader who immediately moved to Iran.</p>\n\n\n\n<p>We know why Hezbollah wants Israel to stop today and agree to a ceasefire. If Israel agrees to that, what will stop Hezbollah from returning the weapons tomorrow or firing them from slightly further away? Israeli soldiers are in Lebanon in order to make sure that this cannot happen and don’t want to leave until we make sure that it doesn’t happen.</p>\n\n\n\n<h4 class=\"wp-block-heading\">On UN Resolution 1701</h4>\n\n\n\n<p>This follows reports that there may be an agreement on the table to end the war on the basis of UN Security Council Resolution 1701. The agreement reportedly says Resolution 1701 will be recognized and that Hezbollah will leave southern Lebanon and be replaced by the Lebanese military and UNIFIL.</p>\n\n\n\n<p>Now a quick reminder, friends: Resolution 1701 is already in effect. Hezbollah is already supposed to have left southern Lebanon, to have disarmed, and to have been replaced by the Lebanese army and UNIFIL. That has been the case since 2006—18 years ago. Well, we know how that turned out. Israel is clearing Hezbollah from the south of Lebanon because UNIFIL and the Lebanese army did not.</p>\n\n\n\n<p>We shouldn’t be fooled by Hezbollah conceding to what Israel has already accomplished by force. Officials in Israel have said, “We will not stop pushing away Hezbollah until there is a solution preventing them from returning to the border.” You see, Israel doesn’t want 60,000 internally displaced Israelis to return home this week only for Hezbollah to try to murder them again next month or next year.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Critique of UNRWA</h4>\n\n\n\n<p>Another topic: the UN agency. Have you heard of UNRRA? That’s an acronym for the United Nations Korean Reconstruction Agency. Probably not, right? But you have heard of UNRWA, which stands for United Nations Relief and Works Agency for Palestine Refugees. UNRWA is supposed to provide relief to all refugees resulting from the 1948 conflict—that’s around 700,000 people.</p>\n\n\n\n<p>Now, when I say 1948 conflict, I refer to when Israel survived an invasion from five-plus Arab armies, approximately 76 years ago. The Korean War ended in 1953, 71 years ago. After the war, UNRRA settled 3 million refugees in three years. UNRRA did what it should have done with a third of the budget allocated to UNRWA, and after five years, UNRRA closed after no more funding was made available. UNRWA has instead sucked in tens of billions of dollars to preserve the refugee problem of Palestine forever, while feeding their dream of destroying Israel.</p>\n\n\n\n<p>Over and above that, UNRWA has been found on so many occasions to be complicit with Hamas in its heinous acts of terrorism on October 7th, but also in playing a critical role in promoting its incitement among the children of Gaza and the West Bank for years. Defunding UNRWA is a step for tomorrow’s peace.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Audience Q&amp;A</h4>\n\n\n\n<p><strong>Question:</strong> Thank you, Ruth. I’m seeing right now the headline: Five killed, one seriously wounded in a direct Hezbollah rocket strike near Metula. One victim is Israeli; four are foreign nationals. What is your reaction to this Hezbollah strike and how it might affect the ongoing negotiations for a ceasefire?<br><strong>Answer:</strong> Well, there we have it again. Hezbollah doesn’t even give one minute to breathe, but it proves yet again that all it wants to do is kill Israeli civilians. In fact, four of those five, as you have said yourself, are foreign nationals coming here to help, to work. They’re not Jewish; they’re not Israeli. They did nothing wrong, and so did the civilians that were killed in that particular attack—the Israeli civilians. So, what is Hezbollah talking about? A ceasefire? There will be no ceasefire until they actually go back, not sit on the border with Israel, disarm, and stop shooting at Israeli civilians.</p>\n\n\n\n<p><strong>Question:</strong> This is a question about the American diplomatic approach. For a long time, the Americans thought that a ceasefire in Gaza would lead to a ceasefire in Lebanon. Now it appears that the Americans are trying to negotiate a ceasefire in Lebanon and hoping that leads to a ceasefire in Gaza. How do you assess the ongoing diplomatic efforts to achieve a ceasefire both in Gaza and in Lebanon?<br><strong>Answer:</strong> The issue of a ceasefire is completely a non-issue. Why do I say that? Just today, Hamas said yet again, “We don’t want a ceasefire; we want the end of the war.” What does that mean? When it comes from the Hamas operatives or terrorists, it means that the entire Israeli army withdraws from Gaza, withdraws from the Philadelphia line—in other words, allowing more smuggling of weapons to go on yet again. That means that Hamas will regroup, rearm itself, and do exactly what it says it will do again and again against Israeli civilians, which is October 7th.</p>\n\n\n\n<p>Likewise with Hezbollah, it’s not about a ceasefire. It’s about who is the strong man in the region. That is the neighborhood we’re in, unfortunately. And what we are doing right now is making sure that neither Hamas is on our borders from the south, nor Hezbollah is on our borders from the north, in order not to take chances with Israeli civilians. Plus, they are doing that on the backs of the Palestinians in Gaza—the Palestinian civilians—and the Lebanese civilians in Lebanon. And that’s the shame that should be called out by the international arena, and not talk about a ceasefire, but rather how does one make Hezbollah not rearm itself on the backs of Lebanese people while regrouping in the north of Lebanon.</p>\n\n\n\n<p><strong>Question:</strong> This is a question from our live stream: How would you assess Israel’s relations with the United Nations as a whole? Is it worth trying to stay in the United Nations and fix it, or should Israel be talking about leaving the United Nations?<br><strong>Answer:</strong> First of all, as long as there is a United Nations, which means a body representing the countries in the global arena, Israel should be part and parcel of that. And no attempt by any members, as had been recently, of the United Nations to oust Israel from it should be accepted under any circumstances. That’s number one. But we need to understand how challenging that whole body is. That whole body was actually concocted after World War II in order to maintain stability and prevent war and conflict. It does no such thing. On the contrary, countries like the Islamic Republic of Iran, like Qatar, like other warmongering countries, actually rule and prevail in all sorts of committees that are supposedly there to prevent hurting human rights and other very, very funny notions that these countries do not do in their own territories. So, it has become, unfortunately, a sham, and it has to be looked at with very critical eyes because it has lost a lot of its legitimacy.</p>\n\n\n\n<p><strong>Question:</strong> This is our last question today. People are asking about the gold in Lebanon. The Israel Defense Forces made a number of videos giving specific instructions for where $500 million worth of cash and gold could be found in Lebanon. Has anyone found it, and where did all that money come from in the first place?<br><strong>Answer:</strong> So, a lot of funding, a lot of gold reserves, a lot of the finances of terrorism—and among the terrorist groups, also for Hezbollah—comes from drug trafficking. Now, how does this work? The Islamic Republic of Iran misused the territory of Jordan—the Hashemite Kingdom of Jordan—in order to smuggle drugs and weapons. But now we’re talking about drugs through Jordan into the West Bank, but also to Lebanon. And all of this is tied to yet another country in South America, in Latin America. And all of these bodies, these rogue bodies—the Islamic Republic of Iran, those countries such as Venezuela in Latin America, and others—are making a ton of money from this, also Hezbollah. That’s one source of the funding.</p>\n\n\n\n<p>Now, why has it not been found? Because Hezbollah’s very strong men are preventing people and journalists from going into the real place—not under the hospital, but next to the hospital—where they are actually buried, and preventing those journalists from photographing and showing. But some journalists, some brave journalists, I must say, from Lebanon, have said that they are being prevented from showing it, unlike the BBC, which went into the hospital where the gold is not to be found and said that there’s nothing at all. So, we need to be critical: Who is trying to prevent this exposure from being shown to the entire world?</p>\n\n\n\n<p>Thank you so much for being with us today. Not tomorrow, but on Sunday, we’ll have you yet again with us at 3 PM as always. And in the meantime, Shabbat Shalom to all. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"/hezbollah\">Hezbollah</a> is offering to move its weapons, after <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> already destroyed them. In this Daily Briefing, Citizen Spokeswoman <a  href=\"https://iron-swords.co.il/t/ruth-wasserman-lande/\">Ruth Wasserman Lande</a> discusses reports of a ceasefire in Lebanon.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17996,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1586,
        492
    ],
    "class_list": [
        "post-18934",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-northern-arrows",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 18934
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18934",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18934"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18934/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18935,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18934/revisions/18935"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17996"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18934"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18934"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18934"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}