{
    "id": 18323,
    "date": "2024-10-15T15:00:00",
    "date_gmt": "2024-10-15T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18323"
    },
    "modified": "2024-10-25T16:18:19",
    "modified_gmt": "2024-10-25T13:18:19",
    "slug": "hezbollah-needs-ceasefire-to-rearm-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-needs-ceasefire-to-rearm-ruth-wasserman-lande/",
    "title": {
        "rendered": "Hezbollah Needs Ceasefire to Rearm | Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Needs Ceasefire to Rearm | Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/LcGM79dfoD4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today, a policeman was murdered, and four others were injured when a terrorist came up to a major highway and opened fire. This is the fourth deadly terror attack in the last two weeks, as Israel continues to be fired upon by Hamas, Hezbollah, the Houthis, Iran, and other proxies. Remember, Israel is fighting for the defense of its citizens on seven fronts.</p>\n\n\n\n<p>That’s why Israel&#8217;s soldiers are in Lebanon. Israel&#8217;s troops are degrading Hezbollah’s ability to murder Israelis—taking out Hezbollah’s commanders, destroying Hezbollah’s launchers, and sealing Hezbollah tunnels. It’s working. How do we know? Hezbollah and Iran are signaling yet again that they want a ceasefire. Israel is receiving indirect requests from Hezbollah and Iran for a ceasefire, a source told the <em>Jerusalem Post</em>. We&#8217;ve spoken about similar reports in the past. Iran and its proxy army in Lebanon want Israel to stop hammering away at them—but not because they want peace. Hezbollah and the Islamic Republic of Iran want a chance to rebuild, rearm, and again be ready to rocket Israel&#8217;s people while invading its northern towns.</p>\n\n\n\n<p>That is why Israel is responding with a &#8220;no, thank you.&#8221; Israel doesn’t want that kind of ceasefire. Instead, it needs a new reality where Hezbollah cannot fire 13,000 Iranian rockets, missiles, and drones as they have been doing since October 8, 2023. Israel needs a new reality in which 60,000 people who were displaced from their homes can safely return.</p>\n\n\n\n<h4 class=\"wp-block-heading\">UN Security Council&#8217;s Call for Diplomacy</h4>\n\n\n\n<p>It’s not just Hezbollah and the Islamic Republic of Iran talking about a ceasefire. The UN Security Council emphasized the need for a diplomatic endeavor that would bring a durable end to the conflict and allow civilians on both sides of the Israeli-Lebanese border to safely return to their homes. The council statement also called for the full implementation of United Nations Security Council Resolution 1701. I’m just reminding everyone: 1701 has not been implemented for the last 18 years. Instead, Hezbollah continued to fortify southern Lebanon right under UNIFIL’s noses and continued to rain hellfire on Israeli civilians.</p>\n\n\n\n<p>Resolution 1701 and UNIFIL have failed. The UN Security Council is responsible for that particular, abject failure. Calling for more of the same will simply lead to more Hezbollah wars and further destabilization of Lebanon itself, which Hezbollah is supposedly protecting. Whatever comes next must address the shortfalls of 1701 and UNIFIL and create a reality where Hezbollah is not armed and not on Israel’s border.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Israel’s Request for UNIFIL to Withdraw</h4>\n\n\n\n<p>As we mentioned yesterday, UNIFIL—the UN peacekeepers in southern Lebanon—say they are at risk. Israel continues to tell UNIFIL: leave, get out of harm’s way. In fact, Israel officially stated again last night that Hezbollah uses UNIFIL facilities and positions as cover while it attacks Israeli cities and communities. These attacks have claimed the lives of many Israelis, including yesterday. UNIFIL troops who refuse to leave the area are endangering themselves and enabling Hezbollah to use them for cover. In fact, UNIFIL failed to stop Hezbollah until now, and now it is kindly requested to get out of the way so that Israel can do what they did not.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section:</h3>\n\n\n\n<p><strong>Q1:</strong> <em>What’s holding the Lebanese Army back from standing against Hezbollah?</em><br>That’s a brilliant question, Laya. In fact, this is an amazing opportunity for Lebanon and the Lebanese people—including all the different groups within Lebanon—to regain their independence and sovereignty, and for the Lebanese Army to take control. Israel doesn’t want Lebanon, and it doesn’t want to occupy Lebanon; it just wants peace and an end to a terrorist organization shooting at our civilians. Therefore, this is an excellent opportunity for the Lebanese Army and the Lebanese people, in general, to build capacity within their own government and take control. However, they are still not taking action, probably due to fear of Hezbollah, which has effectively taken Lebanon hostage.</p>\n\n\n\n<p><strong>Q2:</strong> <em>Will the IDF work around UNIFIL if it won’t move back?</em><br>The IDF has repeatedly warned that UNIFIL, the so-called peacekeeping forces, are in harm&#8217;s way. When an antagonistic terrorist organization is firing at Israeli civilians, it is the responsibility of Israel&#8217;s government and army—the IDF—to eliminate that threat. The UN peacekeepers are effectively inhibiting the IDF from defending Israel’s civilians. They’re not protecting Lebanese civilians by doing this; they are simply hindering the IDF’s ability to protect its own people.</p>\n\n\n\n<p><strong>Q3:</strong> <em>Why should Israel heed pressure to uphold international law when fighting against terrorist organizations that have no regard for it?</em><br>Israel is a democracy with a deep respect for international law, no matter how many people in the world might laugh or belittle that fact. Experts in urban warfare—non-Jewish, not Israeli, not affiliated with any Jewish or Israeli organization—are continually pointing out that Israel operates according to international law. Bodies like the ICJ (International Court of Justice) and others have not produced convincing evidence that Israel is acting against international law. Israel doesn’t aspire to resemble designated terrorist organizations; it has humanitarian values and ethics and will continue to uphold them, as the Jewish people have done for thousands of years.</p>\n\n\n\n<p><strong>Q4:</strong> <em>Can you give an update on efforts to bring the hostages home?</em><br>The head of Mossad is currently in Cairo, holding talks about a potential solution or deal regarding the hostages. I can’t share much more on this at the moment, as the less said, the better for their safety. Unfortunately, the hostages are being used as a human shield by Sinwar, showing a complete disregard for international law. He’s keeping Israeli civilians hostage to protect himself, which makes negotiations extremely difficult. However, the Israeli government remains committed to doing everything it can to bring our people back home.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>Thank you so much for joining us today. Tomorrow is our festival, so I’d like to wish everyone celebrating at home a wonderful time with family. We’ll see you again on Sunday. Thank you.<a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>A terrorist attack today left one policeman dead and four others injured as <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> faces ongoing threats from multiple fronts. Israel’s military action in Lebanon continues to degrade <a  href=\"/hezbollah\">Hezbollah</a>’s ability to attack Israeli civilians. Israel has rejected recent calls for a ceasefire, viewing them as an opportunity for <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a> and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> to rebuild and rearm. <a  href=\"https://iron-swords.co.il/t/the-un/\">The UN</a> Security Council’s calls for diplomatic measures have been criticized due to UNIFIL’s past inability to prevent Hezbollah’s buildup. During the Q&#038;A, audience questions address Lebanon’s army’s role, Israel’s adherence to international law, and the ongoing hostage negotiations.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17996,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-18323",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 18323
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18323",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18323"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18323/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18324,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18323/revisions/18324"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17996"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18323"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18323"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18323"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}