{
    "id": 18115,
    "date": "2024-10-10T16:52:14",
    "date_gmt": "2024-10-10T13:52:14",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18115"
    },
    "modified": "2024-10-11T17:09:18",
    "modified_gmt": "2024-10-11T14:09:18",
    "slug": "how-israel-has-made-trauma-a-weapon-of-war",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/fixed/how-israel-has-made-trauma-a-weapon-of-war/",
    "title": {
        "rendered": "How Israel has made trauma a weapon of war"
    },
    "content": {
        "rendered": "\n<p>This is a corrected article form the original that was written by Naomi Klein and published on The Guardian</p>\n\n\n\n<p>Klein&#8217;s criticism tends to downplay the reality that Hamas is a terrorist organization. The article focuses more on condemning Israel&#8217;s actions. <br>It rarely emphasizes the fact that Palestinian attacks target civilians and aim for the destruction of Israel, as clearly stated in their charter​.<br>While the article doesn&#8217;t directly support &amp; praise Hamas, it largely ignores or underplays the group&#8217;s role as a terrorist organization, instead portraying Israel as the aggressor.<br>This type of framing has one goal to lead readers to sympathize more with Hamas by shifting the focus away from their acts of terrorism and onto Israel&#8217;s defensive measures.</p>\n\n\n\n<div class=\"wp-block-gutenverse-divider guten-element guten-divider guten-9BZhDW\"><div class=\"guten-divider-wrapper\"><div class=\"guten-divider-default guten-divider-line guten-divider-regular\"></div></div></div>\n\n\n\n<p><strong>As Israel faces ongoing terrorist threats from Hamas and other Iranian-backed groups, the nation stands united in honoring the victims of the October 7th massacre. </strong></p>\n\n\n\n<p>On October 7th, 2023, thousands of Palestinians infiltrated Israel, brutally slaughtering, pillaging, raping, and torturing Israeli civilians, shamelessly filming and broadcasting the atrocities worldwide. More than 250 hostages were kidnapped to Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Honoring Victims Amid the Fight for Survival</strong></h3>\n\n\n\n<p>As Israel grapples with the fallout of these brutal attacks, the nation&#8217;s focus remains on honoring the victims and showing solidarity with the families affected. Criticism of these efforts as a form of &#8220;weaponizing trauma&#8221; overlooks the reality that Israel is under constant threat from Palestinian organizations. The commemoration of these tragic events is not about exploiting grief but about strengthening national unity and determination to prevent such atrocities from happening again.</p>\n\n\n\n<p>The criticism directed at Israel&#8217;s memorial efforts fails to acknowledge that this is a country fighting for its very survival. This isn&#8217;t mere politics—this is about defending its citizens from real, immediate dangers. While some families may prefer private remembrance, Israel’s broader society recognizes the importance of public memorials in uniting against terrorism and highlighting the need for a robust defense.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Reality of Israel&#8217;s Defensive Actions</strong></h3>\n\n\n\n<p>The portrayal of Israel&#8217;s response as an act of unchecked aggression ignores the context of Hamas’s open commitment to Israel&#8217;s destruction, as outlined in its charter​. <br>Hamas and its affiliates (Palestinians, UNRWA) continue to use Gaza as a launching pad for terrorist attacks, deliberately targeting Israeli civilians in violation of international law. Israel’s defensive actions are a necessary response to these attacks and are in line with its right to protect its citizens.</p>\n\n\n\n<p>Far from indiscriminate violence, Israel has made significant efforts to deliver humanitarian aid to Gaza, despite the security risks. Coordinated aid flows of food, medical supplies, and other essential goods continue to reach Gaza, highlighting Israel’s commitment to distinguishing between terrorists and the civilian population​ (even tho 70% support Hamas).</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Bigger Picture</strong></h3>\n\n\n\n<p>Since October 7th, Israel has been defending itself on multiple fronts—not only against Hamas in Gaza but also from attacks by Hezbollah in the north and other threats from Iran-backed militias in Syria, Iraq, and Yemen. The scope of these challenges goes beyond a single incident; it represents an existential battle against a network of terrorist organizations determined to destroy the Jewish state.</p>\n\n\n\n<p>Critics who focus solely on Israel’s military actions often ignore the fact that Israel is responding to these orchestrated attacks to ensure its survival. The world must understand that groups like Hamas and Hezbollah are not freedom fighters; they are terrorist organizations whose goal is the annihilation of Israel, as clearly stated in their ideologies and actions.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Standing United Against Terrorism</strong></h3>\n\n\n\n<p>Israel’s efforts to honor the victims of October 7th while defending itself against ongoing threats are a testament to the nation&#8217;s resilience and determination. The criticism that these actions are a form of manipulation or propaganda does a disservice to the memory of those who suffered and to Israel’s legitimate right to defend itself against terrorism.</p>\n\n\n\n<p>Commemorating the victims is about educating future generations and the global community on the true nature of the threat posed by terrorist groups. It is also about ensuring that the world does not forget the brutality that Israel faces at the hands of these enemies, whose attacks are rooted in hatred and whose ambitions are genocidal.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>A Call for Global Solidarity</strong></h3>\n\n\n\n<p>Israel calls on its allies and the international community to stand with it in this critical fight against terrorism. The focus should be on supporting Israel&#8217;s efforts to protect its citizens and secure peace in the region, rather than undermining its right to remember and honor its victims. The real issue is the ongoing threat from Hamas, Hezbollah, and other terrorist organizations that continue to seek Israel’s destruction.</p>\n\n\n\n<p>As Israel defends itself against these relentless threats, let us recognize its right to protect its people and remember that the fight against terrorism is a global struggle. <br>Standing with Israel means standing up for the values of life, freedom, and the right of every nation to defend itself against those who wish to destroy it.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>A year later, memorials to the 7 October attacks use art, virtual reality and dark tourism to stir support for limitless violence. But there is a different way to remember</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18116,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 343,
        "footnotes": ""
    },
    "categories": [
        343
    ],
    "tags": [
        1628
    ],
    "class_list": [
        "post-18115",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-fixed",
        "tag-the-guardian"
    ],
    "lang": "en",
    "translations": {
        "en": 18115
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18115",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18115"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18115/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18117,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18115/revisions/18117"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18116"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18115"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18115"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18115"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}