{
    "id": 18932,
    "date": "2024-10-30T15:00:00",
    "date_gmt": "2024-10-30T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18932"
    },
    "modified": "2024-11-29T21:36:04",
    "modified_gmt": "2024-11-29T19:36:04",
    "slug": "how-to-reach-a-ceasefire-in-lebanon-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/how-to-reach-a-ceasefire-in-lebanon-asher-westropp-evans/",
    "title": {
        "rendered": "How to Reach a Ceasefire in Lebanon | Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"How to Reach a Ceasefire in Lebanon | Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/kuvG5GF7PzE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Is there about to be a diplomatic solution that will end Israel&#8217;s war against Hezbollah and Lebanon? Well, talks are in advanced stages, and U.S. envoy Amos Hochstein may arrive in Israel soon in order to finalize an agreement. But what exactly is being discussed?<br>According to reports, Israel is demanding an improved version of UN Security Council Resolution 1701, which is the resolution that ended the last war with Hezbollah back in 2006. This resolution from 18 years ago called for the Lebanese Army to disarm Hezbollah and take responsibility for what happens inside Lebanon, but this never happened. It required Hezbollah to withdraw from the Blue Line in southern Lebanon to an area north of the Litani River, but this never happened. Resolution 1701 failed. The Security Council failed. And ultimately, diplomacy failed. Israel cannot and will not accept the same failed piece of paper that led to the reality that we now find ourselves in. That&#8217;s why Israel is demanding a better and clearer Security Council resolution. Israel wants to see the heavy deployment of the Lebanese Army at the Israeli border and not Hezbollah on the Israeli border. Hezbollah needs to be far away from the Israeli border in order to give space to breathe and for people to live.</p>\n\n\n\n<p>There is another important Israeli demand: Israel demands freedom of operation in Lebanon for the IDF if there are new threats in Lebanon that need to be removed. Israel will never again allow a situation where a terrorist army can mobilize on its border and threaten its population.<br>Israel will never again be in a situation where another October 7th massacre can happen. Israel has made this very clear every single day for the past more than one year now.<br>Right now, it&#8217;s too soon to say if there will be some kind of ceasefire deal that ends the war in Lebanon. But if it happens, if there is a ceasefire in Lebanon in the days ahead, and if Israel&#8217;s demands are met, it means something. It means that Hezbollah has backed down. Let&#8217;s remember: Hezbollah decided to join Hamas&#8217;s war on October 8th of last year, one day after the October 7th massacre. Hezbollah said that it would not stop attacking Israel until there was a ceasefire in Gaza.</p>\n\n\n\n<p>There hasn’t been a ceasefire in Gaza because Hamas has continued to attack Israel and it continues to hold 101 hostages. The fact that there are negotiations now for ending the war in Lebanon means that Hezbollah, what&#8217;s left of its leadership, has decided to stop tying its fate to Hamas. Hassan Nasrallah, Hezbollah&#8217;s longtime warlord, went to war for Yahya Sinwar and Hamas. Nasrallah and Sinwar are both now dead. So let&#8217;s hope that the region can build a better future without Hamas in power in Gaza and without Hezbollah terrorizing Israel from Lebanon. But right now, the war continues. A Hezbollah drone just struck the Israeli coastal city of Nahariya, and the IDF continues its operations in Lebanon.</p>\n\n\n\n<p>Israeli soldiers continue to risk their lives to fight Hezbollah and protect the people of Israel. We&#8217;ll have to wait and see if diplomacy can end the war or if Hezbollah wants to keep fighting. Right now, there are also reports of hostage negotiations with Hamas in Gaza. The details that are leaked to the media are less important than the big picture. Hamas continues to hold 101 Israeli hostages in its underground terror dungeons inside Gaza. It&#8217;s frankly barbaric. We want—or rather, I should say—we need them home now. We need more pressure on Hamas and Hamas’s patrons: Qatar, Turkey, and Iran, so that Hamas will lay down its weapons and release the hostages.</p>\n\n\n\n<p>There still remain so many open questions: How many hostages are still alive? Who’s holding them and where are they exactly? Who represents the terrorists holding hostages in Gaza now that Yahya Sinwar and most of Hamas&#8217;s senior leadership in Gaza are dead? Some of these questions will be answered by the negotiations that are taking place currently in Qatar, and Israel will gain information on how Hamas is currently operating. But this is what&#8217;s very clear right at this moment: The Prime Minister of Israel, Benjamin Netanyahu, has offered amnesty to any Hamas terrorist who is holding Israeli hostages. If the terrorists release the hostages, the terrorists can live.</p>\n\n\n\n<h4 class=\"wp-block-heading has-text-align-center\">I wish that more world leaders would tell Hamas this simple message: Take the deal.</h4>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Audience Q&amp;A</strong></h3>\n\n\n\n<p class=\"has-text-align-left\"><strong>Question from Sarah:</strong> Why, if Israel is clearly winning the war on Hezbollah, are we talking about a ceasefire and not a capitulation? Are we going back to 2006?</p>\n\n\n\n<p>No, let&#8217;s make something very clear: We are most certainly not going back to 2006. That is the change in the status quo that Israel is looking to implement when it comes to southern Lebanon and what&#8217;s happening inside that country.<br>Ultimately, we need to consider what we&#8217;re thinking about when we talk about capitulation.<br>Since 2006, the political reality in Lebanon has fundamentally changed. Hezbollah now stands as one of the primary political powers inside Lebanon.<br>It is not to Israel&#8217;s interest or advantage for the entirety of Lebanon to collapse and crumble to its knees.<br>As we&#8217;ve said repeatedly, Israel&#8217;s war is not with the Lebanese people—it is with Hezbollah.<br>It is absolutely critical that Israel find a way to create a sustainable situation at the border to allow Lebanon to continue to function as a state, and to bring their troops—the regular Lebanese Army—into the area between the Blue Line and the Litani River to provide security and stability in that region.<br>Israel will not allow a power vacuum to be filled by Hezbollah or other militant groups.</p>\n\n\n\n<p><strong>Question from Itai:</strong> Is Israel waiting for Iran to attack again in order to strike back and finally target Iran&#8217;s nuclear facilities?</p>\n\n\n\n<p>It’s a critical question. No one is quite sure if we’ve seen the last of these back-and-forth strikes between Iran and Israel.<br>Israel has demonstrated its ability to target Iranian missile facilities and air defenses with surgical precision, sending a clear message to Iran.<br>The conflict is with the Iranian regime, not the Iranian people, and aims to prevent further destabilization in the region.<a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n\n\n\n<p><strong>Question from Marty:</strong> Why is there no discussion about the Hamas Covenant of 1988, which expresses the ideology to end Israel and kill Jews?</p>\n\n\n\n<p>This is a critical philosophical question. Many fail to address Hamas’s genocidal ideology and instead infantilize the group.<br>Educating the public about Hamas’s goals is vital to understanding the fundamental ideological differences in this conflict.</p>\n\n\n\n<p><strong>Question about UNRWA:</strong> Israel’s recent legislation effectively bans cooperation with UNRWA. What does this mean?</p>\n\n\n\n<p>UNRWA has long outlived its original mandate and has been complicit in aiding militant groups like Hamas. Israel&#8217;s move reflects its position that UNRWA no longer fits the modern Middle East.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>There are intense diplomatic efforts underway to end <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>’s war against <a  href=\"/hezbollah\">Hezbollah</a> in Lebanon. In this Daily Briefing, Citizen Spokesman Asher Westropp-Evans explains what Israel is demanding in order for the fighting in Lebanon to end</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18066,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306,
        1586
    ],
    "class_list": [
        "post-18932",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 18932
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18932",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18932"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18932/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18933,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18932/revisions/18933"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18066"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18932"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18932"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18932"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}