{
    "id": 18339,
    "date": "2024-10-01T13:00:00",
    "date_gmt": "2024-10-01T10:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18339"
    },
    "modified": "2024-10-26T11:45:51",
    "modified_gmt": "2024-10-26T08:45:51",
    "slug": "idf-spokesman-update-1-10-noon",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-1-10-noon/",
    "title": {
        "rendered": "IDF Spokesman Update &#8211; 1.10, Noon"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 1.10, צהריים\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/1iBjneLPR6o?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good afternoon. In the last hour, following the shooting in the center of the country and in accordance with the easing of the situation, the Minister of Defense will change the directives of the Home Front Command in the center of the country. As part of the changes, it was decided on restrictions in other areas around the country. Reduction of activity and incidents in the Carmel and Di Hera area. Education and work activities will be held in places where it is possible to arrive in the time required for standard protection.</p>\n\n\n\n<p>I want to repeat this: in places where it is possible to arrive in the time required for standard protection. This is the important thing to remember. Gatherings in closed buildings are allowed for up to 300 people, and outdoors for up to 30 people. The full instructions are on the Home Front Command website. We explain in the studios that we are taking all necessary precautions to maintain your safety. Continue to follow the Home Front Command&#8217;s instructions. These are life-saving instructions. Immediately on the official platforms of the Home Front Command, I will inform you here immediately of any change.</p>\n\n\n\n<p>In the last day, the IDF launched a targeted ground operation and underground action against Hezbollah terrorist targets in the area near the border. For decades, Hezbollah built terrorist and combat infrastructures in the villages near the border, through which they planned to penetrate the territory of Israel and carry out attacks. This plan was referred to as the &#8220;plan for the occupation of the Galilee.&#8221; They built tunnels under houses in the villages and used them to store weapons and means of warfare.</p>\n\n\n\n<p>Now we can say that following intelligence information gathered over the course of many years, since the beginning of the war, we have carried out dozens of ground operations inside the territory of Lebanon. These operations aimed at neutralizing and destroying Hezbollah&#8217;s capabilities in the villages and in the areas near the border. IDF fighters entered the heart of Hezbollah’s combat compounds in southern Lebanon, gathered intelligence, and thoroughly destroyed their means of warfare and terrorist infrastructure.</p>\n\n\n\n<p>The fighters entered the villages and troubled areas, breaking through underground openings at dozens of targets along the entire border, conducting and destroying the means of warfare in a thorough manner, including advanced equipment supplied by Iran. In total, during these operations, IDF fighters exposed, neutralized, and destroyed more than 700 targets.</p>\n\n\n\n<p>Today, I will present three examples from the dozens of operations that we carried out. Far from Kiryat Shmona, since the beginning of the war, we have attacked hundreds of different terrorist targets in the village. Following our activity against Hezbollah infrastructure, most of the village&#8217;s population fled to the north, and the village&#8217;s infrastructure suffered a lot of damage.</p>\n\n\n\n<p>As part of this operation, we gathered intelligence on a house on the outskirts of the village, close to the border with Israel. This house was used by Hezbollah terrorists, under which they dug an underground infrastructure. This combat infrastructure, although not crossing into Israeli territory, was used to store weapons and as a staging point for planned infiltrations. Our fighters uncovered a tunnel about 150 meters long, hidden beneath the house. After mapping it with special means, we destroyed the tunnel and the house through ground and air attacks.</p>\n\n\n\n<p>Another example is from a location not far from Metula. At the beginning of the war, we attacked hundreds of Hezbollah infrastructures in this village. Again, most residents abandoned the village and fled north. In a specific operation there, based on accurate intelligence, our fighters raided a house and discovered an underground shaft beneath a child&#8217;s bed. The fighters went down the shaft, uncovering a tunnel about 100 meters long, where they found a cache of weapons hidden in barrels. At the end of the operation, both the tunnel and the house were destroyed by strikes from the ground and from the air.</p>\n\n\n\n<p>The latest example involves the attack on Hezbollah infrastructure in the Nurit area, located between the Israeli border and the Lebanese village of Aita Ashiv. The extensive damage caused to the village stems from Hezbollah&#8217;s use of the area for terror-related activities. Using classified technological means, we identified an underground Hezbollah combat system and kits near the village. The compound included a network of combat trenches, both above and below ground level, connecting to an underground tunnel housing a weapons warehouse, a command room, and living quarters for Hezbollah operatives. Our forces raided these trenches and uncovered the tunnel&#8217;s opening, leading to a system that Hezbollah had been developing over years.</p>\n\n\n\n<p>These operations represent only a small fraction of the dozens conducted, aimed at destroying and neutralizing Hezbollah’s strategic capabilities and assets, which they had long been preparing to use against Israel. We have evidence of these plans, including a map discovered in one of the compounds showing detailed plans for a broad incursion into Israeli territory, marking settlements, IDF posts, and routes of attack. This map was intended to guide thousands of Hezbollah terrorists in a coordinated invasion, akin to what Hamas did on October 7.</p>\n\n\n\n<p>Our actions throughout the war have caused severe damage to Hezbollah&#8217;s capabilities. Despite Hezbollah&#8217;s decision on October 8 to join the war, their actions have severe consequences, and yet they persist in endangering Lebanon and the entire region by risking a broader conflict. We are determined to prevent this, and we have the right and duty to ensure no deadly terrorist organization operates along our border.</p>\n\n\n\n<p>Dozens of international journalists have been shown these findings in the Northern Command, and we will present this evidence in a broad international effort to highlight our actions. From the first day of the war, we have focused on securing our abductees&#8217; return, which remains a central mission, alongside ongoing operations to maintain security on the northern front.</p>\n\n\n\n<p>I want to appeal to the residents of the north: We have been preparing for this for many months, and we are now implementing a plan to restore security to the northern border. We are determined to bring about a change that will allow the safe return of the residents.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions &amp; Answers</h3>\n\n\n\n<p><strong>News Question 12:</strong> <em>What is the reason for tightening the restrictions?</em></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>We are acting to thwart attempts to fire into our territory, with incidents occurring both in the north and now also in the center of the country. We are taking precautions to ensure people can reach protected areas, allowing gatherings of up to 30 people outdoors and up to 300 indoors. It is vital to follow Home Front Command&#8217;s instructions.</li>\n</ul>\n\n\n\n<p><strong>News Question 11:</strong> <em>How long is the ground operation expected to last in Lebanon?</em></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Our mission is to eliminate the threat along the border. The duration depends on the scope of the infrastructure we need to neutralize. We are expanding the operation as needed and will complete it as quickly as possible, without revealing specific timeframes to the enemy.</li>\n</ul>\n\n\n\n<p><strong>News 13:</strong> <em>Are there concerns about firing from Iran?</em></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Throughout the war, we have encountered threats from various directions, including Iran, Yemen, and Syria. Our goal remains to thwart these threats around the clock, both through offensive and defensive measures. We are committed to reducing the enemy&#8217;s ability to succeed.</li>\n</ul>\n\n\n\n<p><strong>Israel&#8217;s question today:</strong> <em>Are we preparing for further attacks amidst the threat of launches?</em></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>We are actively working to thwart threats, including in Lebanon. Operations continue day and night to ensure the safety of Israel&#8217;s citizens.</li>\n</ul>\n\n\n\n<p><strong>Knitted question:</strong> <em>What can be said about the scope of the fighting in the north?</em></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>We continue to weaken Hezbollah’s capabilities, but they still possess certain capacities. We have also seen a recent launch towards the center, underscoring the need for continued vigilance.</li>\n</ul>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The Defense Minister updated safety directives; IDF operations in Lebanon weakened <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s infrastructure, ensuring northern border security.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [
        1586
    ],
    "class_list": [
        "post-18339",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 18339
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18339",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18339"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18339/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18342,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18339/revisions/18342"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18339"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18339"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18339"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}