{
    "id": 18365,
    "date": "2024-10-21T20:00:00",
    "date_gmt": "2024-10-21T17:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18365"
    },
    "modified": "2024-10-26T12:06:51",
    "modified_gmt": "2024-10-26T09:06:51",
    "slug": "idf-spokesman-update-21-10-24-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-21-10-24-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 21.10.24, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 21.10.24, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/phoYJilo0xU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good evening. Today, I will present the recent assaults targeting Hezbollah&#8217;s economic system, which funds their military operations. Our efforts aim to severely damage their financial infrastructure, making it difficult for them to sustain and rebuild their military capabilities.</p>\n\n\n\n<p>In total, we attacked more than 20 targets, mostly in Beirut. One major target was an underground money warehouse used by the Al-Qard Al-Hassan Association, located beneath a residential building. This warehouse held tens of millions of dollars intended to fund Hezbollah’s activities, including warfare and post-war recovery.</p>\n\n\n\n<p>Lebanon has faced a deep economic crisis, worsened by the explosion in the Beirut port in 2020, caused by Hezbollah. Taking advantage of this crisis, Hezbollah created a parallel economy to fund its military activities. This economic network operates outside the legal framework of Lebanon’s economy, primarily through the Al-Qard Al-Hassan Association, which has been heavily sanctioned by the U.S. and Western countries due to its direct ties to terrorist activities.</p>\n\n\n\n<p>On the recommendation of the Chief of Staff and the head of Shebak, the Minister of Defense has now added the Al-Qard Al-Hassan Association to Israel’s list of declared terrorist organizations. Hezbollah’s economic network enables it to act as a &#8220;state within a state,&#8221; using civilian institutions and associations as fronts to transfer funds for terror.</p>\n\n\n\n<p>One key method involves transferring oil and money from Iran to Syria, where it is sold to companies. These funds are then funneled through Hezbollah&#8217;s Unit 4400 to finance their activities in Lebanon. This economic flow amounts to tens of millions of dollars. Muhammad Jafar Kasir, also known as Sheikh Salah, led Unit 4400 and managed these financial transfers until he was eliminated in early October. His replacement was also eliminated recently in Syria, and we will continue to act against Hezbollah in Syria and beyond.</p>\n\n\n\n<p>Another major source of funding for Hezbollah is from Lebanese citizens, often channeled through Al-Qard Al-Hassan. In a functioning state, this money could support Lebanon&#8217;s recovery, rather than fueling the creation of missiles.</p>\n\n\n\n<p>We have gathered extensive intelligence over the years, including on a bunker under a hospital in Dahiya, where at least half a billion dollars in cash and gold are stored. This bunker is one of Hassan Nasrallah’s strongholds, built under civilian infrastructure. We urge Lebanese citizens, government institutions, and international organizations to prevent Hezbollah from storing terrorist funds in such locations.</p>\n\n\n\n<p>The IDF continues to monitor these sites, and further strikes are planned. Our war is against Hezbollah, not the citizens of Lebanon, and we remain committed to weakening the group&#8217;s strategic capabilities, which serve Iran’s interests.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions &amp; Answers</h3>\n\n\n\n<p><strong>Yov Borowitz, Network B:</strong> <em>Tonight, we published eavesdropped information on a cabinet discussion. Can you comment on plans regarding Sinwar and Nasrallah?</em></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Our focus remains on dismantling Hamas and disrupting Hezbollah. Operations in Lebanon continue, guided by decisions from the political echelon, and aim to secure the northern region for residents to return home safely. Military actions, including strikes, are all approved under defense and political guidance.</li>\n</ul>\n\n\n\n<p><strong>Follow-up:</strong> <em>Was broadcasting the video of Sinwar interacting with an IDF drone a strategic decision?</em></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Our operational decisions prioritize security. The video was released to reflect operational transparency, showcasing how Sinwar was eliminated, without compromising intelligence.</li>\n</ul>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF targets <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s funding network, striking financial hubs to weaken military capabilities. Continued operations aim to disrupt economic flow.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [
        1586
    ],
    "class_list": [
        "post-18365",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 18365
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18365",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18365"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18365/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18366,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18365/revisions/18366"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18365"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18365"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18365"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}