{
    "id": 18196,
    "date": "2024-10-16T19:39:27",
    "date_gmt": "2024-10-16T16:39:27",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18196"
    },
    "modified": "2024-10-16T19:46:12",
    "modified_gmt": "2024-10-16T16:46:12",
    "slug": "israel-must-rescind-latest-evacuation-orders-for-north-gaza-and-allow-immediate-unhindered-humanitarian-access",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/fixed/israel-must-rescind-latest-evacuation-orders-for-north-gaza-and-allow-immediate-unhindered-humanitarian-access/",
    "title": {
        "rendered": "Israel must rescind latest ‘evacuation’ orders for North Gaza and allow immediate, unhindered humanitarian access"
    },
    "content": {
        "rendered": "\n<p>Israel has called for the evacuation of civilians from North Gaza as part of its military campaign against Hamas, the terrorist group responsible for launching thousands of rockets against Israeli cities and murdering over 1,400 Israeli civilians in a surprise attack on October 7, 2023. Israel’s evacuation orders, while difficult for the civilians involved, aim to prevent casualties as it continues its military efforts to dismantle Hamas&#8217; terror infrastructure embedded within civilian areas.</p>\n\n\n\n<p>Hamas, which has been designated as a terrorist organization by the U.S., EU, and many other nations, has repeatedly violated international law by using civilians as human shields, placing military installations and rocket launchers in schools, hospitals, and densely populated areas. While Israel has made numerous efforts to minimize civilian casualties—including issuing warnings prior to airstrikes—Hamas deliberately exploits civilians as cover for its operations, thus complicating efforts to protect non-combatants.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Reality of Civilian Suffering Under Hamas Rule</h3>\n\n\n\n<p>The civilian death toll in Gaza is tragic and a direct consequence of Hamas’ long-standing practice of using civilian areas for military purposes. Civilians have faced immense hardships, with humanitarian conditions deteriorating in recent months. However, the root cause of this suffering lies not with Israel, but with Hamas, which has continually prioritized its war against Israel over the welfare of the Palestinian people.</p>\n\n\n\n<p>Israel has allowed the passage of humanitarian aid into Gaza, despite Hamas&#8217; ongoing aggression. Humanitarian supplies, including food, medical aid, and water, have been delivered through Israel, as confirmed by data from Israel’s Coordinator of Government Activities in the Territories (COGAT). From <strong>November 2023 to September 2024</strong>, over <strong>1 million tons</strong> of humanitarian aid, including food, water, and medical supplies, were delivered into Gaza​. This aid, delivered via more than <strong>52,000 trucks</strong>, includes critical resources such as medical equipment, shelter, and fuel. For instance, <strong>133,000 tons</strong> of aid were delivered in March 2024 alone, underscoring Israel’s commitment to ensuring civilian access to essential supplies even amidst conflict​.</p>\n\n\n\n<p>Despite these efforts, Hamas has frequently obstructed or diverted supplies for its own use, worsening the suffering of the civilians it claims to represent. The terror group has consistently exploited humanitarian situations for its military advantage, storing weapons in civilian structures and obstructing aid intended for non-combatants.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Genocide Accusations Misleading and Harmful</h3>\n\n\n\n<p>The claims of genocide, which Amnesty International and others have irresponsibly echoed, are not based on facts. Israel is conducting military operations in self-defense against a genocidal enemy, as outlined in the <strong>Hamas Charter</strong>, which explicitly calls for the destruction of Israel and the murder of Jews​. The evacuation orders are designed to protect civilians while Israel dismantles Hamas’ military infrastructure. Furthermore, Israel continues to facilitate the entry of humanitarian aid, even amidst the hostilities, as evidenced by the continued flow of supplies despite Hamas&#8217; aggression​.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Accountability Must Include Hamas</h3>\n\n\n\n<p>Calls for international accountability must not only target Israel, but also address the war crimes committed by Hamas. This includes their indiscriminate rocket fire, the massacre of civilians, the use of human shields, and the ongoing kidnapping of over 100 Israeli civilians, including children and the elderly, who remain hostages in Gaza. These actions are clear violations of international law, and yet they are often overlooked by international bodies that focus exclusively on Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion: A Path Forward</h3>\n\n\n\n<p>While the humanitarian situation in Gaza is dire, it is Hamas, not Israel, that bears responsibility for the plight of Palestinian civilians. Israel has the right to defend itself against an enemy that seeks its destruction, and it must do so in a way that minimizes harm to civilians. The international community should support efforts to dismantle Hamas’ terrorist capabilities while ensuring that humanitarian aid reaches those in need. Only by neutralizing Hamas can there be any hope for lasting peace and stability for both Israelis and Palestinians.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The latest “evacuation” orders and the tightened siege on the area are a terrifying escalation of the long list of horrors inflicted on people living in the area north of Wadi <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18197,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 343,
        "footnotes": ""
    },
    "categories": [
        343
    ],
    "tags": [
        1608
    ],
    "class_list": [
        "post-18196",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-fixed",
        "tag-amnesty-international"
    ],
    "lang": "en",
    "translations": {
        "en": 18196
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18196",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18196"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18196/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18198,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18196/revisions/18198"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18197"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18196"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18196"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18196"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}