{
    "id": 18930,
    "date": "2024-10-29T15:00:00",
    "date_gmt": "2024-10-29T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18930"
    },
    "modified": "2024-11-29T21:27:46",
    "modified_gmt": "2024-11-29T19:27:46",
    "slug": "israel-severs-its-ties-with-unrwa",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/israel-severs-its-ties-with-unrwa/",
    "title": {
        "rendered": "Israel Severs Its Ties With UNRWA | Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Israel Severs Its Ties With UNRWA | Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/fWJel_xDDLw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>This is the big news right now. The Israeli Parliament has voted to approve legislation that effectively ends Israel&#8217;s relationship with the United Nations Relief and Works Agency, or UNRWA. The new law prohibits UNRWA from maintaining any representation, providing services, or conducting activities either directly or indirectly within Israel&#8217;s sovereign territory.</p>\n\n\n\n<p>Under the new law, all Israeli government representatives will be barred from maintaining contact with UNRWA. The Foreign Ministry and the Interior Ministry will be prohibited from issuing entry visas to UNRWA employees. Israeli customs officials will be unable to process goods imported by the agency. UNRWA’s tax benefits will also be revoked.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Reasons for the Legislation</strong></h4>\n\n\n\n<p>&#8220;Why did Israel pass this law?&#8221; The Chairman of the Foreign Affairs and Defense Committee in the Knesset, Yuli Edelstein, explained:</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;During the committee&#8217;s deliberations on the law, we were shown video evidence of UNRWA personnel involved in transporting a body to the Gaza Strip, along with other evidence of their involvement in terrorism. This included the fact that the commander of the massacre at The Rim Shelter, where 16 Israelis were killed and four were kidnapped to Gaza, was an UNRWA operative.&#8221;</p>\n</blockquote>\n\n\n\n<p>Edelstein continued:</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;Given this background and having proved that UNRWA and its employees acted against Israel, the state must determine that UNRWA’s activities in its territory will cease. To be clear, Israel will provide all services it is obligated to provide to its citizens and residents in all areas where UNRWA operates, in coordination with the Jerusalem municipality. There is no place for enemies in the heart of the Jewish people&#8217;s capital.&#8221;</p>\n</blockquote>\n\n\n\n<p>This legislation was spearheaded by Yulia Malinovsky of the Israel Beitenu Party, which is part of the opposition in the Parliament. Interestingly, members of both the opposition and the ruling coalition agreed that UNRWA&#8217;s ties with Hamas and its refusal to reform itself justified its removal.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Implementation Timeline</strong></h4>\n\n\n\n<p>The law takes effect in 90 days, during which Israel is expected to face international pressure to revoke it.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;But this is the bottom line: The people of Israel have spoken. They want UNRWA gone. The Israeli Parliament passed a law that says UNRWA is a security threat to the State of Israel, and the State of Israel must end its ties with UNRWA.&#8221;</p>\n</blockquote>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Criticism of UNRWA</strong></h4>\n\n\n\n<p>This should have happened a long time ago. UNRWA is not a neutral UN organization. It’s a Palestinian organization that is committed to the destruction of Israel.</p>\n\n\n\n<p>The criticism went further:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>&#8220;The people at the top of UNRWA are white saviors like Philippe Lazzarini, but the rest of UNRWA&#8217;s employees are locals. Who are the locals? A lot of them are terrorists.&#8221;</li>\n\n\n\n<li>&#8220;The Hamas terrorists who carried out the October 7th massacre were graduates of UNRWA schools. UNRWA staff participated in the October 7th massacre. UNRWA teachers celebrated the massacre in a public Telegram group. An UNRWA teacher held an Israeli hostage in his home.&#8221;</li>\n\n\n\n<li>&#8220;The head of the UNRWA Teachers Association in Lebanon was a senior Hamas commander. Hamas built a server farm under UNRWA’s headquarters in Gaza City. And you want to tell me nobody in UNRWA knew about it?&#8221;</li>\n</ul>\n\n\n\n<p>UNRWA guys and Hamas guys are the same guys. Humanitarian aid should be provided by real humanitarian aid organizations, not by a Hamas front organization. Is that too much to ask?</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Message to Donors</strong></h4>\n\n\n\n<p>This is my message to UNRWA’s donors: The US, the UK, Germany, the EU, Sweden—the ones who say that UNRWA is irreplaceable. I don’t agree with you. There are other organizations that can drive trucks and unload boxes. But I’ll play along. If you want to keep UNRWA around, this is what you need to do:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>&#8220;Demand that UNRWA have a rigorous vetting process to screen new hires for ties to terrorist groups.&#8221;</li>\n\n\n\n<li>&#8220;Monitor UNRWA employees’ public social media posts in order to enforce UN’s own neutrality rules.&#8221;</li>\n\n\n\n<li>&#8220;Call out incitement immediately when you see it.&#8221;</li>\n\n\n\n<li>&#8220;Carry out a rigorous review of UNRWA’s current employee roster and fire any UNRWA employees who have ties to or sympathies for terrorist organizations.&#8221;</li>\n\n\n\n<li>&#8220;Ban any Palestinian who has links to terrorist groups from receiving UNRWA services.&#8221;</li>\n</ul>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;You shouldn’t get benefits from international donors if you are a terrorist. Is that fair? UNRWA’s donors should demand that UNRWA take the steps I’ve given, or UNRWA will lose funding.&#8221;</p>\n</blockquote>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Further Concerns About Gaza</strong></h4>\n\n\n\n<p>Something I don’t understand: The Palestinian government in Gaza—that’s Hamas—had enough money to build a war machine that could carry out a surprise invasion and then fight the Israeli military for a year. But you want me to believe that the children of Gaza needed international donors to pay for their education? It makes no sense.<br>If the issue is providing humanitarian assistance for the people of Gaza, then there are other UN agencies for this very purpose, such as the World Food Program, World Health Organization, UNICEF, and others.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;Could it be that the humanitarian issue is just an excuse? Is the real objective something else? I think yes.&#8221;</p>\n</blockquote>\n\n\n\n<p><strong>Evidence From UNRWA’s Website</strong><br>Here’s a hint of UNRWA’s real agenda. I saw on the UNRWA website—you can go to it right now—it says, quote: &#8220;More than two million registered Palestine refugees live in Jordan. Most, but not all, have full citizenship.&#8221;</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;Refugees with full citizenship. You’re not a refugee if you’re a citizen of the place where you live. Why are these fake refugees called refugees? It’s because they insist that the only solution for them is to immigrate to Israel, dissolve the State of Israel, and change its name to Palestine from the river to the sea.&#8221;</p>\n</blockquote>\n\n\n\n<p>They are fighting for the destruction of Israel. UNRWA is a political organization pretending to be a humanitarian organization. We need to demand more from UN institutions if we want a future with less war.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Q&amp;A Section</strong></h4>\n\n\n\n<p><strong>Sufan Lear:</strong> <em>If UNRWA were removed, how would Israel ensure that the same issues do not repeat themselves and that terrorists don&#8217;t take control of any replacement organization?</em></p>\n\n\n\n<p>First of all, let’s be clear about why UNRWA needs to be replaced. It’s because it’s a clear security threat to the State of Israel. It has been completely infiltrated by terrorists, terrorist sympathizers on the payroll, and individuals receiving its services. It is completely corrupt and infiltrated—it is effectively a Hamas front.<br>Now, a lot of people, when they talk about this UNRWA issue, want to focus solely on UNRWA in Gaza. But UNRWA is also operating in Jerusalem, Israel’s capital. Why does UNRWA need to operate in Jerusalem? What’s the humanitarian situation there?<br>UNRWA is also operating in the West Bank in places that it calls refugee camps. These are areas under the control of the Palestinian Authority government. They do not receive services from the Palestinian Authority, their own government, because there’s an international institution that is willing to keep their dream alive of one day destroying Israel.<br>UNRWA also operates in Jordan. Most of the UNRWA so-called refugees in Jordan, as I said, are citizens of Jordan. Why should they not receive their services from the government of Jordan? Why do they need to receive their services from an international organization?<br>It makes no sense. So if UNRWA were completely dissolved, first of all, these so-called refugees, wherever they are living, should receive the services from the government under whose authority they live. That’s a very easy fix.<br>Now, specifically in Gaza, where there is a humanitarian need, that can be assessed, and other humanitarian aid organizations that are able to scale up humanitarian aid delivery can take UNRWA’s place.<br>UNRWA has failed with the humanitarian aid delivery. There’s enough aid sitting on the other side of the border crossing in Gaza that UNRWA needs to pick up. They failed to do so. So we definitely need a replacement. There are organizations that can take over for humanitarian aid.<br>But ultimately, Palestinians need to take responsibility for their own future. They’re capable people. They can educate themselves, they can have their own health clinics, and they can have their own government.</p>\n\n\n\n<p><strong>Multiple Foreign Ministers:</strong> <em>Many foreign ministers have condemned Israel for banning UNRWA, even though they know many of its staff were involved in October 7th. Do you have any thoughts on this?</em></p>\n\n\n\n<p>Yes. I have noted that Israel is under enormous pressure from many important countries to keep UNRWA in place. Talking about the US, the UK, Germany, France—many others have issued statements pressuring Israel to not pass this legislation.<br>But I think it’s very important that Israel has taken the step to say that we are going to make decisions by ourselves, about ourselves, for ourselves, and other people are going to have to deal with it.<br>There’s no reason that UNRWA should keep existing in Gaza when it is an infiltrated by Hamas organization.<br>I think many countries around the world are under enormous political pressure from many of their own constituents who would like to see much more pressure on Israel, and aid for UNRWA is one of the ways that this pressure can be maintained.<br>But I think after October 7th, people need to get used to a new reality, which is that Hamas is not going to be the military or governing authority in Gaza, and that the situation that existed before October 7th—where UNRWA and Hamas cooperated, which left Hamas free to build a massive military infrastructure without having to take care of the needs of its own citizens—those days are behind us.</p>\n\n\n\n<p><strong>Audrey Middleman:</strong> <em>Why hasn’t the Red Cross seen the hostages? Why is this acceptable?</em></p>\n\n\n\n<p>Yes, this is a great question. Right now, there are 101 Israeli hostages still in Hamas terror dungeons in Gaza. Most of them we have not seen a sign of life. The Red Cross should be entering Gaza and walking around and checking for signs of life.<br>This is what the Red Cross does—they facilitate exchanges between enemy combatants. But Gaza is so unsafe for anyone looking for the hostages because Hamas has put so many resources into keeping the hostages that the Red Cross is not able to enter.<br>It’s quite unfortunate that this is the situation, but it just goes to remind us that Hamas is a barbaric terrorist organization. It has no regard for human life, no regard for international humanitarian law, no regard for the laws of war, and it is holding hostages, including a baby, in barbaric conditions without visits from the Red Cross.<br>It’s time that the entire world put pressure on Hamas, and especially pressure on those countries that can pressure Hamas. I’m talking about Qatar, Turkey, Iran, even Egypt. The message needs to be made clear that the hostages need to be freed immediately.</p>\n\n\n\n<p><strong>Christine D:</strong> <em>Is there any news on hostage release?</em></p>\n\n\n\n<p>There’s no clear news about hostage relief, but I have seen some headlines about new negotiations. Why might there be a little bit of optimism, or at least some hope, that maybe the current round of negotiations could end differently from how previous rounds ended, which was with virtually nothing?<br>The main answer being that Hamas leader Yahya Sinwar is off the scene. He was killed by Israeli forces. And now the big question for Hamas, and for anyone who wants to reach and communicate with Hamas, is: Who’s really calling the shots? Who’s really holding the hostages? Who’s really answering to Hamas officials in Qatar?<br>So I think what Israel is doing now is trying to find out if there is a way to communicate with those Hamas guys who are still holding hostages. And Israel—the Prime Minister—has offered amnesty to any Hamas terrorist who is holding hostages. Amnesty for the Hamas terrorist if the hostages are released.<br>So this is the deal that’s already on the table. More negotiations are ongoing. We’ll have to wait and see how they end up.</p>\n\n\n\n<p>Thank you so much for watching. This has been the live daily briefing. I’m Daniel Rubenstein. We are live tomorrow at 3 p.m. Israel time, which is 9 a.m. on the East Coast. See you then!</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The Israeli parliament passed legislation that requires the Israeli government to end its contacts with <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a>. In this Daily Briefing, Citizen Spokesman <a  href=\"https://iron-swords.co.il/t/daniel-rubenstein/\">Daniel Rubenstein</a> explains the new law, why it’s a good thing that it was passed, and what we should expect in the days ahead.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18067,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312
    ],
    "class_list": [
        "post-18930",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "en",
    "translations": {
        "en": 18930
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18930",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18930"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18930/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18931,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18930/revisions/18931"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18067"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18930"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18930"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18930"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}