{
    "id": 18928,
    "date": "2024-10-27T15:00:00",
    "date_gmt": "2024-10-27T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18928"
    },
    "modified": "2024-11-29T21:11:53",
    "modified_gmt": "2024-11-29T19:11:53",
    "slug": "israel-struck-iran-back-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/israel-struck-iran-back-ruth-wasserman-lande/",
    "title": {
        "rendered": "Israel Struck Iran Back | Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"guten-element guten-video guten-wJhJId\"><div class=\"guten-video-wrapper\" data-property=\"{&quot;url&quot;:&quot;https://youtu.be/TOQwMqUzrJQ&quot;,&quot;class&quot;:&quot;guten-video-background&quot;,&quot;width&quot;:&quot;100%&quot;,&quot;height&quot;:&quot;500px&quot;,&quot;controls&quot;:true,&quot;playsinline&quot;:true,&quot;style&quot;:{},&quot;config&quot;:{&quot;youtube&quot;:{&quot;playerVars&quot;:{}}}}\"></div></figure>\n\n\n\n<p>Today, a truck rammed into a huge group of people near Tel Aviv. Arab language media is reporting that this is a terrorist attack. At least 35 people were hit, six are in critical condition. While we are awaiting confirmation from official authorities, Israel&#8217;s people have actually faced multiple ramming attacks in past months. Imagine, on your way to work, someone passing by was so filled with hatred that they decided that they would try to murder you and dozens of innocent people around you. That is the enemy that Israel faces on seven fronts and at home. There are people who would end their own lives just to end ours.</p>\n\n\n\n<p>That&#8217;s why Israel&#8217;s people are fighting for their lives. That&#8217;s why Israel&#8217;s troops, many of them ordinary people taken out of regular life and drafted for months on end into reserve duty, are putting themselves in harm&#8217;s way. They are doing what they must to ensure that tomorrow is safer for their families at home. Some of them were protecting Israel&#8217;s people from up in the sky.</p>\n\n\n\n<p>You&#8217;ve no doubt heard of Israel&#8217;s strikes in the Islamic Republic of Iran. Yesterday, over 100 of Israel&#8217;s Air Force planes attacked military targets across Iran. Targets included ballistic missile production facilities and Iran&#8217;s air defense capabilities. Without air defense, the Iranian skies are exposed to further strikes. Israel knocked down Iran&#8217;s walls but did not burn down their cities nor did it hurt the Iranian people, whom Israelis do not hate nor wish to hurt.</p>\n\n\n\n<p>What Israel did was intended to get the Islamic Republic of Iran to stop its aggression and murder of our people, the Palestinian people, the Yemeni people, the Syrian people, the Lebanese people, the Iraqi people, and basically every nation whose country they had disintegrated and took over. Remember, on October 1st, the Islamic Republic of Iran fired around 200 ballistic missiles at Israel, maybe the largest attack of its kind ever. No country in the entire world ever had to deal with anything like that.</p>\n\n\n\n<p>But that&#8217;s not all. On April 14th, the Iranian regime and its proxies fired over 300 ballistic and cruise missiles, as well as attack drones, at Israeli military and civilian targets. Since October 8th of last year, Iran&#8217;s terror army in Lebanon, Hezbollah, fired around 15,000 Iranian rockets, missiles, and drones at people in Israel.</p>\n\n\n\n<p>On October 7th of last year, Iran&#8217;s terror proxies in the Gaza Strip launched this war with the deadliest day for the Jewish people since the Nazi Holocaust. This is in addition to multiple attacks from Iran&#8217;s terror pirates in Yemen—the Houthis—and the Iran-backed Shia militias in Syria and in Iraq.</p>\n\n\n\n<p>In Tehran right now, there&#8217;s a massive billboard threatening Israel with yet another October 7th massacre. Hamas has multiple times said they would repeat the October 7th massacre, just given the chances. And Hezbollah just released a video explicitly announcing they are targeting tens of towns and villages with all of their civilians in Israel.</p>\n\n\n\n<p>This is not a normal reality—not by any standards at all. Not one other country in the entire universe has to put up with such a situation. You see, as a mother of four children, every time a motorcycle drives by, every one of the kids is on edge as it sounds like the start of a siren. Staying for hours on end, 17 times a day, in the safe room with children, given the incessant barrage of rockets from the Islamic Republic of Iran and its proxies, is not something which any country can demand of Israel to normalize.</p>\n\n\n\n<p>And yet, people who lived in the south of Israel had, for over 20 years prior to October 7th, a reality in which they had rockets flying over their heads from Hamas in Gaza, and that was supposedly normal. The world did not condemn Hamas nor the Islamic Republic of Iran once. Think about that.</p>\n\n\n\n<p>Now that Israel has finally taken action to defend itself, Israel is now clearly telling the Islamic Republic of Iran: Stop threatening our lives. Back off, or we will do what we must do to make sure that you cannot hurt us nor our children any longer.</p>\n\n\n\n<p>Now let&#8217;s take some questions from our audience watching live on social media.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Q&amp;A Section</strong></h4>\n\n\n\n<p><strong>Erman Beat:</strong> Does the atmosphere in the Arab-Israeli community support terrorism, or is this just an exception to the rule?<br><strong>Ruth Wasserman Lande:</strong> Thank you for your question. In fact, between 20 and 25% of Israel&#8217;s population, for those who don&#8217;t know, are Arabs who are Israeli. They have Israeli citizenship. They can vote. They can have high-ranking positions in all of Israeli ministries and so on. Most of them are amazing citizens. They are law-abiding citizens, and they back the country. Some of them even serve in the IDF, and they serve in the security forces of the country. There are some who are indoctrinated by the horrid incitement that is sent either by ISIS videos or other things shown on Al Jazeera and other social media aspects. But the vast majority are law-abiding citizens that support the country and support normality.</p>\n\n\n\n<p><strong>My Police:</strong> Saudi Arabia publicly condemns Israel&#8217;s strike on Iran. How do you interpret the actions and intentions of Egypt and others who seem to want to have their cake and eat it too?<br><strong>Ruth Wasserman Lande:</strong> Very often, for those who understand the mentality of the Middle East, there&#8217;s a declarative aspect and there is the reality—what they really mean. It&#8217;s usually between the lines and not the line itself. In other words, there is a sort of condemnation—a fairly weak condemnation—from Saudi Arabia. But in actual fact, they are not even mentioning the word Israel here. They are basically thankful for Israel that is doing the job for them. Not only Saudi Arabia but all Arab regimes that want stability within their country. They don&#8217;t want the extremism, whether it&#8217;s Shiite extremism led by the Islamic Republic of Iran or Sunni extremism led by Qatar. They don&#8217;t want that because that is also a threat to their own regimes as well, and they therefore support Israel and the fact that it&#8217;s trying to take away those threats from the entire world and especially from the region.</p>\n\n\n\n<p><strong>Hillary Granfield:</strong> Is there a hostage deal ongoing with Egypt to release the hostages? If so, please explain.<br><strong>Ruth Wasserman Lande:</strong> At the moment, there is something that&#8217;s cooking. All of the details are not quite clear at the moment. Hamas is again saying they are not willing to receive a temporary ceasefire. The Israeli side is not saying much, but there are very high-ranking persons moving to Egypt to Cairo and also talking with Qatar in Doha. The details are not yet clear, but very definitely on the agenda of Israel at the moment—and very, very high on the priority list—is getting our people back. There are over 100 hostages that are held against international law, against any kind of humanity, still by the Hamas terrorists and by some people in Gaza that don&#8217;t even necessarily belong to Hamas. But there are the so-called civilians; some of them are also holding some of our hostages. And yes, there are actual movements towards getting them back. It’s perhaps better not to go into the details in order to make this actually happen.</p>\n\n\n\n<p><strong>Sarah:</strong> When is UNRWA stepping out of Israel?<br><strong>Ruth Wasserman Lande:</strong> If it was up to me, it would be yesterday. But there are certain steps that need to take place in a democratic country with a legal system, and that&#8217;s what Israel is. There is a legal process taking place to make way with this particular arm of Hamas—the designated terrorist organization—that is in place not only in Israel but in other places. In fact, in the West Bank and Gaza, actually lending a hand to the terrorists to make sure that what they want implemented is in fact implemented. It&#8217;s absolutely unreal that the entire international arena is funding, with taxpayers’ money, this organization that should have been made away with tens of years ago. So, as far as I&#8217;m concerned—yes, today. It&#8217;ll take a little bit more time, but God willing, it will happen soon enough.</p>\n\n\n\n<p><strong>Norse Mythology:</strong> What can citizens of other countries do to help Israel?<br><strong>Ruth Wasserman Lande:</strong> Brilliant question—perhaps the best one. Why? Because it gives you the power to do, and that&#8217;s what I appreciate the most. Every single one of us can do. We have circles of influence, whether we are students, whether we are in professional syndicates, whether we are at schools, whether we are at universities, whether we are speakers. We can write to our elected officials. We can write an op-ed in newspapers, whether they&#8217;re local or national. We can speak on certain social media that every single person has. We can get a group on WhatsApp to explain what&#8217;s happening and have them then explain as well. There are so many things that each one of us can do, and sometimes it seems as if it&#8217;s a small thing to do and it takes a little energy. And yet the ripple effect of every one of us is a world in its own. So I encourage you—take an initiative. Do. You make a huge difference, and thank you for asking that.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Closing Remarks</h4>\n\n\n\n<p>Thank you so much for being with us. As you know, the clock was moved in Israel, so tomorrow at 3 p.m. Israel time from the winter clock, we&#8217;ll see you again. Take care.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> faces relentless terrorist threats, including ramming attacks and missile barrages from <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> and its proxies. Recent airstrikes targeted Iranian military facilities, defending against aggression while avoiding harm to civilians.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17996,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-18928",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 18928
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18928",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18928"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18928/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18929,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18928/revisions/18929"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17996"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18928"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18928"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18928"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}