{
    "id": 18130,
    "date": "2024-10-07T15:00:00",
    "date_gmt": "2024-10-07T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18130"
    },
    "modified": "2024-10-12T11:33:20",
    "modified_gmt": "2024-10-12T08:33:20",
    "slug": "one-year-since-the-october-7-massacre-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/one-year-since-the-october-7-massacre-eylon-levy/",
    "title": {
        "rendered": "One Year Since the October 7 Massacre | Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"One Year Since the October 7 Massacre | Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/oOMK9qxO9Oc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>We’ll start with an important announcement. Today, we will be hosting a special event to commemorate one year since the October 7th Massacre. Citizen spokeswoman and IDF captain in reserves, Maya Bentwich, and I will be going live from right here in Tel Aviv at 6:29 p.m. Eastern Time — that&#8217;s 1:29 a.m. in Israel. We want to make sure our audience in the Western Hemisphere will be able to watch this important and moving event.</p>\n\n\n\n<p>This event will be an opportunity for friends of Israel to connect with each other, remember the lives that were lost, listen to survivors, and share a vision for a better future. We will be here with several special guests, including greetings from the President of Israel, His Excellency Isaac Herzog, Ephraim Mirvis, the Chief Rabbi of the UK, and a special Misha Barak from the IDF Chief Cantor, Shai Abramson, and Hatikva, courtesy of Israeli-American duo Yonina.</p>\n\n\n\n<p>Please check our social media platforms for more information and to sign up for the live stream.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Reflecting on One Year Since October 7th</strong></h4>\n\n\n\n<p> Today marks one year of the October 7th War, one year since Hamas death squads tortured, raped, and executed 1,200 innocent people: young and old, men and women. One year since Hamas executed parents in front of their children and children in front of their parents. One year since Hamas kidnapped over 250 people into the terror dungeons under Gaza, where they face torture, sexual assault, starvation, and, for many, execution.</p>\n\n\n\n<p>Israel’s military Chief Herzi Halevi has said Hamas in the Gaza Strip has been militarily defeated. What he means is that Israel&#8217;s brave soldiers have broken Hamas. They have significantly degraded Hamas’s ability to carry out organized attacks. But Hamas terrorists are still active, and they are still holding hostages. Since October 7th, Hamas has fired over 13,000 rockets at Israel’s people. Even today, just a few hours ago, Hamas fired rockets at Tel Aviv. It was a clear reminder that the war that Hamas started cannot end with Hamas still in power in Gaza, free to wage war again.</p>\n\n\n\n<p>Israel has, up until this point, eliminated close to 20,000 Hamas terrorists from the Gaza Strip. That’s estimated to be about half of Hamas&#8217;s pre-October 7th strength. Some residents of the south, who fled after Hamas murdered their neighbors and families, have been able to return home. But the war Hamas started a year ago is still raging. Israel’s soldiers are still operating right now in Gaza to prevent Hamas — now a guerrilla force — from rebuilding, rearming, and attacking again.</p>\n\n\n\n<p>Israel is fighting to ensure that Israeli families living near the Gaza border can live free from fear of rocket attacks when the Hamas terror regime is no longer their neighbor. Israel isn’t fighting today out of vengeance for last October 7th, although we have reasons to be angry. Israel is fighting to prevent the next October 7th. Remember, right after that horrific massacre one year ago, Hamas made a promise to do October 7th again and again and again until Israel is destroyed.</p>\n\n\n\n<p>This is what the whole world needs to know, and it’s what we expect world leaders to say. Hamas is still cruelly holding 101 innocent hostages, some no doubt as human shields around Hamas’s leadership. Hamas is holding a baby, Bias. He was abducted when he was 9 months old. He’s now one year and 9 months old. Where is he? Where are all of the hostages? Where is the international pressure on Hamas and on Hamas’s patrons — Iran, Turkey, and Qatar — to pressure Hamas to end the war that it started one year ago, lay down its arms, and free the hostages?</p>\n\n\n\n<p>We must continue to demand answers from our allies because lip service is not enough. The hostages’ families are saying they’ve met with presidents and prime ministers who offered them a sympathetic shoulder and said, “We’ll do whatever it takes to get the hostages out,” but never use their own leverage to pressure Hamas to let them go. The leader of Hamas, the mastermind of October 7th, Yahya Sinwar, is still at large. It’s been reported that Israel held off on eliminating Sinwar because he had surrounded himself with hostages. That’s the kind of barbaric enemy that Israel faces.</p>\n\n\n\n<p>It’s one year since Hamas declared war, and Israel’s people are under attack as the Iranian regime and its proxy armies continue their war on seven fronts. I hear calls for diplomacy. I hear calls for de-escalation. Nobody wants this war to end more than the people of Israel because we’re the ones coming under rocket attacks. Our friends, our families are the ones in reserves in the army right now, risking their lives. But right now, there is no diplomatic off-ramp from Israel’s seven-front war against terrorist armies that are promising more October 7th massacres until Israel is destroyed.</p>\n\n\n\n<p>This war cannot end until Hamas is defeated, the hostages are home, Hezbollah is pushed back, the Houthis stop firing ballistic missiles from Yemen, and the Iranian regime abandons its efforts to destroy Israel. We know that the world wants this war to go away. We need the threats to go away. We, the people of Israel, the citizens of Israel, are fighting for our lives. Never forgive, never forget, never again.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>International Reactions</strong></h4>\n\n\n\n<p>French President Emmanuel Macron posted in Hebrew that, a year after the October 7th Massacre, he won’t forget the pain of those abducted and executed by Hamas. He’s correct; the people of Israel will never forget. British Prime Minister Sir Keir Starmer posted that the 7th of October 2023 was the darkest day in Jewish history since the Holocaust. He’s correct. October 7th was the bloodiest day for the Jewish people since the Nazi genocide.</p>\n\n\n\n<p>But Starmer’s British government, just last month, announced sanctions on Israel while increasing funding to UNRWA, a subsidy to Hamas. It’s denying Israel significant weapon systems, including for its fighter aircraft. It echoed the Hamas claims that the Jewish state was engaging in war crimes. And President Macron, just this week, also called for a weapons embargo on Israel. He echoed the Hezbollah claims that the Jewish state was responsible for an escalation.</p>\n\n\n\n<p>We, the Israeli people, are fighting for our lives on seven fronts. The hundreds of Iranian ballistic missiles fired at Israel’s people should remove any doubt of the deadly threat we face. Israel’s people do not need crocodile tears at their funerals. We cannot fight with your thoughts or your prayers. Israel’s people need allies to stand beside us in the face of the Iranian regime’s murderous assault. President Macron, Prime Minister Starmer, and others undermining Israel’s ability to fight are telling Iran to keep pushing.</p>\n\n\n\n<p>Israel doesn’t just need help knocking missiles out of the sky, as gracious as it is for the French and the British to help, and we appreciate it. Israel needs to knock out the missile launchers. Anyone who wants the war to end and Israel’s people to be safe must stand behind that. We don’t want just to intercept missiles when they’re fired at us. We don’t want missiles to be fired at us, and we don’t think that’s too much to ask for.</p>\n\n\n\n<p>The Iranian regime and its proxy armies are counting on Western states to abandon a major ally and to leave themselves exposed against the same enemies of civilization. They want you to bottle it. Don’t.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q&amp;A Section:</strong></h2>\n\n\n\n<p><strong>Leora’s Question:</strong><br>Leora asks about Ohad Hemo&#8217;s report on Channel 12 yesterday. He said that he’s hearing that about 80% of casualties in Gaza were Hamas terrorists or their families. What is the likelihood that this is true, and what do you know about the rate of Hamas casualties in Gaza?</p>\n\n\n\n<p><strong>Response:</strong><br>Thank you for your question. You’re referring to a report from one of Israel’s most veteran Arab affairs reporters, Ohad Hemo, that according to his sources, 80% of those who’ve been killed in Gaza are either Hamas or Hamas family members. Now, I don’t know who his sources are, but it sounds right. We know that around 50% of the casualties in Gaza are Hamas terrorists, according to Israel’s numbers. We’re approaching 20,000 Hamas terrorists killed inside Gaza. We know that the numbers supplied by the Hamas Health Ministry are manipulated. They include natural deaths — yes, people who died of natural causes. They include people killed from Hamas’s own rockets, just like the al-Ahli Hospital incident at the beginning of the war when an Islamic Jihad rocket crashed in the car park of a hospital, and allegedly 500 people were killed. They’re still counted in that list. They also don’t differentiate between civilian and military casualties. In every previous war, Hamas has lied about military casualties until much later when no one cared anymore.</p>\n\n\n\n<p>We know something about the way Israel has been targeting Hamas. In this war, Hamas started, Israel has been targeting Hamas, not civilians, and it’s taken so much more care to avoid civilians than any other military in history. Don’t take my word for it; listen to the former Deputy Supreme Commander of NATO. He knows a thing or two about what urban warfare looks like in Iraq and Afghanistan. He wrote in The Times that this is the most efficient&#8230; He said he came away convinced that Israel’s rules of engagement are every bit as rigorous as the UK’s and other Western allies. Israel is targeting Hamas leaders and their terrorists with incredible precision, using precise munitions based on intelligence, urging civilians to leave time and time again when Hamas tries to use them as human shields.</p>\n\n\n\n<p>It’s been blatantly obvious for the last year that for us in Israel, civilian casualties on the other side are a tragedy. For Hamas, they are a strategy. We’re trying to minimize civilian casualties on the other side; Hamas is trying to maximize them. Hamas sees civilians not only as human shields but as human sacrifices. So it would make sense that not only are around half of the casualties Hamas terrorists, but a large share would be their own families that they put in harm’s way.</p>\n\n\n\n<p><strong>Next Question from Alon:</strong><br>Alon, you posted this morning that you were in Kfar Aza very early. Can you talk a bit about what you experienced there and who you met?</p>\n\n\n\n<p><strong>Response:</strong><br>There is a very somber feeling in Israel today as we try to commemorate an event that isn’t really over. It’s hard to believe it’s been a whole year since October 7th and that it’s been only a year since October 7th because it’s been a whole year of October 7th. We’re still in this crisis; we’re still in the war that started with October 7th. We’re still in the October 7th hostage crisis.</p>\n\n\n\n<p>I went down to Kfar Aza this morning. It was one of the epicenters of the massacre. Kfar Aza was literally decimated — that’s a word that means reduced by one tenth. One in 10 residents of Kfar Aza were massacred or abducted on October 7th. Five of them are still hostages in Gaza: Doron Steinbrecher, Emily Dery, Kfir Segev, and Gal and Ziv Biran, who are twins. They’re still trapped in the Hamas terror dungeons.</p>\n\n\n\n<p>Kfar Aza hasn’t been able to rebuild. The rubble is all around, and people know that they cannot go back and rebuild their lives while Hamas is still there. It was a somber memorial ceremony this morning without much pomp and circumstance. In the distance, we heard booms from the fighting in the Gaza Strip. That’s a reminder that this war is still going on because just a few hours later, Hamas fired missiles at Tel Aviv. We’re not willing to live with that threat anymore. We’re fighting this war not because we’re angry at the loss of October 7th, but because Hamas is still a clear and present threat to Israelis all across the country.</p>\n\n\n\n<p><strong>Reminder about the Event:</strong><br>I encourage everyone, please join us tonight at the Israeli Citizen Spokesperson’s Office. We’re putting on a special virtual commemoration at 6:29 p.m. Eastern Time. It’s the middle of the night here in Israel, but it’s important for us that our audiences in the United States, and for those in Australia getting up early, will have a taste of what’s going on in Israel.</p>\n\n\n\n<p>We’ve sent camera crews across the country, down south at Kfar Aza, at the scene of the Nova massacre, at Hostage Square. We’re bringing the voices of survivors of the massacre, residents of Kfar Aza, and a wounded soldier to give you a taste of how Israelis have been marking the one-year anniversary of the October 7th Massacre. Please go to our social media platforms, the links are there. It’s free to watch. Click the link, and we’ll send you an email reminder. 6:29 p.m. tonight Eastern Time — join us at the Citizen Spokesperson’s Office.</p>\n\n\n\n<p><strong>Next Question from the Live Stream:</strong><br>It’s been a number of days since Iran fired 180 ballistic missiles at Israel. Where is the Israeli response? What should we expect?</p>\n\n\n\n<p><strong>Response:</strong><br>It’s been only a few days since one of the biggest ballistic missile attacks in history when Iran fired 180 ballistic missiles at Israel, forcing almost the entire country into bomb shelters. It was a major act of aggression. Iran built up Hamas, Hezbollah, and its proxy armies to try to protect the regime, and the regime just launched an act of war to protect its proxy armies. That’s an act of aggression that has to go answered.</p>\n\n\n\n<p>It’s not an option for Israel to sit on its hands and say, “We’ll take the hit,” because de-escalation means appeasement. It tells Iran: fire rockets at us, there are no consequences. Every world leader who tells Israel to do nothing, to turn the other cheek, is encouraging the Iranian regime to fire more missiles at Israel and try to kill more Israelis because there will be no consequences.</p>\n\n\n\n<p>Israel is preparing for a very serious response in Iran. Just yesterday, the Defense Minister Yoav Gallant said all options are still on the table. Many people have speculated whether it could be a strike on oil facilities all the way to Iran’s nuclear facilities, because they are on the threshold of getting nuclear weapons. But Defense Minister Yoav Gallant is on his way to the United States. He’ll be there and back before Yom Kippur to coordinate with the Pentagon because the Iranian regime is not just an Israeli problem. The Iranian regime is a threat to the entire Middle East, and therefore to the entire world. It is important that Israel’s allies stand together with it and help not only blow Iran’s missiles out of the sky but fight back against the threat that Iran can fire ballistic missiles at us whenever it wants and continue to hide behind its proxy armies in Gaza, in Lebanon, in Yemen, and around the region.</p>\n\n\n\n<p><strong>Final Question from the Live Stream:</strong><br>Can you please share a message for the Jewish people and the friends of Israel around the world who are also commemorating October 7th, what they should expect to experience in their communities around the world, and also a final word about how people can watch our virtual commemoration this evening, which is the only English-language commemoration coming out of Israel today?</p>\n\n\n\n<p><strong>Response:</strong><br>The October 7th Massacre was the trigger of a war in which Israel is under attack on seven fronts — or I always add eight, including the Diaspora, including attacks on Jews around the world. You should be vigilant today. There is every prospect that people sympathetic to Hamas will try to attack Jewish targets. You need to be on alert. One such attack in New York was recently foiled. When people go through the streets of Paris, New York, or Toronto chanting “globalize the intifada,” that’s just the politically correct way of saying “death to the Jews.”</p>\n\n\n\n<p>I don’t know whether we should have been shocked by Hamas’s barbarity on October 7th, but we should all be shocked by the support that it’s received around the world. I just saw one particularly shocking poll by YouGov of the British public: 5% of people in Britain, three and a half million people, believe that the October 7th Massacre was justified. That’s terrifying.</p>\n\n\n\n<p>My message, though, to Jewish communities around the world is that you have been incredible since October 7th. Keep going. In Israel, we saw an amazing awakening of civil society, where people dropped their politics and came together and said, “Only one thing matters: we have to win this war, we have to bring Hamas down, and we have to bring the hostages home.” It’s been so inspiring to see that happen across the Diaspora — a great Diaspora awakening. People fighting for the hostages, wearing the dog tags, sticking up the hostage posters, calling in to radio shows, going to protests. People who never thought they would be at protests before are going week after week to show that they will not be intimidated; they will not be scared.</p>\n\n\n\n<p>We need you to continue keeping your heads up and speaking up for Israel because if you don’t stand up for yourselves, no one else will. You can’t expect your countries, your neighbors, or your governments to be more pro-Israel, more pro-Jewish community, than you are willing to be yourselves.</p>\n\n\n\n<p><strong>Closing Remarks and Event Details:</strong><br>And on a final note: tonight, at 6:29 p.m. Eastern Time, 1:30 a.m. in Israel, we will be hosting, from the Citizen Spokesperson’s Office, a special virtual commemoration event. I’m going to be co-hosting it together with Captain in reserves Maya Bentwich. She led all the major tours of Kfar Aza and Be&#8217;eri for the first six months of the war, and that’s where we met. I’m very proud that she’s now part of our team.</p>\n\n\n\n<p>We’ll have special messages from the President of Israel, Isaac Herzog, the Chief Rabbi of the UK, Ephraim Mirvis, a Misha Barak prayer from the amazing Shai Abramson, the Chief Cantor of the IDF. We’ll bring you voices and stories of what’s been going on around the country: a Nova survivor, a wounded soldier, and give you a taste of what’s been happening today in Israel as Israelis try to come to terms with it.</p>\n\n\n\n<p>So, go to our social media platforms. You’ll see it advertised everywhere: on Instagram, on Facebook, on LinkedIn, on YouTube. You’ll find the link to the special commemoration event. You can watch it on YouTube; you don’t need to sign up, but please sign up and we will send you a reminder to watch across our social media platforms. We will be humbled and honored to share the stories and voices of Israelis — ordinary citizens and everyday heroes — with you as we mark one year since the worst day of our lives.</p>\n\n\n\n<p>Thank you very much, everyone. We have a ceremony to prepare for.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>A special event will commemorate the one-year anniversary of the <a  href=\"https://iron-swords.co.il/c/october-7th/\">October 7th Massacre</a>, where <a  href=\"/hamas\">Hamas</a> killed 1,200 people and kidnapped hundreds. Israeli Citizen Spokesperson Maya Bentwich and other guests will discuss the war’s ongoing impact, survivors’ stories, and <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>’s fight to prevent future attacks and free <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18013,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-18130",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 18130
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18130",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18130"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18130/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18131,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18130/revisions/18131"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18013"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18130"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18130"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18130"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}