{
    "id": 18136,
    "date": "2024-10-08T15:00:00",
    "date_gmt": "2024-10-08T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18136"
    },
    "modified": "2024-10-12T11:48:02",
    "modified_gmt": "2024-10-12T08:48:02",
    "slug": "one-year-since-hezbollah-joined-hamass-war-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/one-year-since-hezbollah-joined-hamass-war-daniel-rubenstein/",
    "title": {
        "rendered": "One Year Since Hezbollah Joined Hamas&#8217;s War | Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"One Year Since Hezbollah Joined Hamas&#039;s War | Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/vFHNTkuL2fA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is October 8th, another grim anniversary Hezbollah is celebrating today. Today marks exactly one year since the terrorist army Hezbollah in Lebanon joined Hamas&#8217;s war against Israel by opening a second front from Lebanon. Hezbollah saw what Hamas did on October 7th, decided it was wonderful, and started a war against Israel on October 8th.</p>\n\n\n\n<p>Since it joined Hamas&#8217;s war exactly one year ago, Hezbollah has fired more than 9,000 rockets, guided anti-tank missiles, and suicide drones into Israel. The rocket attacks continue: Hezbollah fired over 100 rockets today at Haifa, Israel&#8217;s third-largest city. Hezbollah&#8217;s war against Israel that started on October 8th has forced more than 60,000 Israelis living near the border with Lebanon to flee their homes because Hezbollah was shooting guided anti-tank missiles at their homes. Millions of other Israelis are running to their bomb shelters every day because Hezbollah doesn&#8217;t want to stop the war that it started.</p>\n\n\n\n<p>Since October 8th one year ago, Hezbollah never stopped its attacks, and as a result, Israel has acted in self-defense against Hezbollah and Lebanon because the government of Lebanon has failed for decades to take responsibility for what happens in Lebanon. Israeli ground forces are operating inside Lebanon right now, and what they are discovering is terrifying. Hezbollah had plans for an October 7th-style massacre of its own. Hezbollah had plans to invade Israel, capture villages, and carry out horrific atrocities. Hezbollah had a plan to conquer the Galilee. The IDF is dismantling Hezbollah&#8217;s capabilities and pushing it away from the Israeli border so that the 60,000 Israelis who fled their homes inside Israel can return to their homes safely.</p>\n\n\n\n<p>Hamas in the south, in Gaza, Hezbollah in the north, in Lebanon—these are two of the seven fronts in which Israel is fighting. Israel is also fighting terrorists in the West Bank, Houthis in Yemen, Iranian-backed militias in Iraq that are attacking Israel with suicide drones, Iranians in Syria, and the Iranian regime itself from inside Iran.</p>\n\n\n\n<p>Let&#8217;s talk about where we are with Iran. Iran fired ballistic missiles at Israel last April. Israel&#8217;s response in Iran after that was quite limited. Iran got the message that it can fire ballistic missiles at Israel and get away with it, so Iran fired more ballistic missiles—180 of them last week. We should expect a strong Israeli response to this Iranian attack. It&#8217;s not a matter of if, but when and how.</p>\n\n\n\n<p>Everything I&#8217;ve said up to this point should be widely known: that Israel is under attack from seven fronts, that the Iranian regime built a ring of fire around Israel, that Hamas is holding 101 Israeli hostages in its terror dungeons under Gaza. And yet everyone is asking: How does this end? When I go on television, I&#8217;m asked, &#8220;Is this just going to be a forever war? What is the political solution that ends the October 7th war? What is the diplomatic off-ramp to the war that Iran and its proxies have waged for an entire year?&#8221;</p>\n\n\n\n<p>The most honest answer I can give you—the most honest answer I can give you—is I don&#8217;t know how this all ends. But what I can tell you is this: If Israel ends its military operations in Gaza right now, the Hamas rapist regime will still be the government of Gaza. The 101 Israeli hostages that the Hamas rapist regime is holding in its underground terror dungeons will still be in the underground terror dungeons. If Israel ends its military operations in Gaza right now and withdraws from Gaza, Hamas will continue to attack Israelis who live near the Gaza border. Hamas will rebuild, rearm, and recommit to carrying out more October 7th-style massacres. That&#8217;s what Hamas promised to do from the beginning. That&#8217;s why Hamas and its supporters celebrated the anniversary of the October 7th massacre—they celebrated October 7th.</p>\n\n\n\n<p>This is what will happen if Israel retreats from Gaza and goes back to an October 6th reality. What about the Lebanon front in the north? Israel wasn&#8217;t attacking Lebanon. The border was quiet. Hezbollah in Lebanon attacked Israel, which means that if Israel stops defending itself, Hezbollah will keep attacking. Hezbollah said that it will not stop attacking Israel until there&#8217;s a ceasefire in Gaza. There&#8217;s not going to be a ceasefire in Gaza if it&#8217;s a ceasefire that guarantees that Hamas will remain in power and hostages will remain in captivity.</p>\n\n\n\n<p>What Hezbollah has done is tie its fate to Hamas. Hezbollah kept its word to Hamas and has attacked Israelis every day for the past year. Hezbollah opened a second front against Israel one year ago on October 8th in order to help Hamas survive the consequences of the October 7th massacre. Hezbollah opened a second front in order to help Hamas achieve its war goals. Hezbollah made that choice. Hezbollah made that choice, and there are consequences for it.</p>\n\n\n\n<p>Hamas is welcome to come out of the tunnels and say, &#8220;We&#8217;re done. We&#8217;re releasing the hostages.&#8221; It&#8217;s not doing that. Palestinian leaders are not calling on Hamas to do that. Turkey is not calling on Hamas to do that. Qatar is not calling on Hamas to do that. The government of South Africa is not calling on Hamas to do that. So the war goes on.</p>\n\n\n\n<p>The war cannot end with Iran&#8217;s ring of fire still entrenched around Israel and ready to open fire at any time. Israel doesn&#8217;t have just the right to defend itself against such aggression, it has the obligation to defeat its enemies and ensure a safe and secure future for its people. All nations of the world that care about the future of humanity must side with Israel in this fight.<a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On the one-year anniversary of <a  href=\"/hezbollah\">Hezbollah</a> joining <a  href=\"/hamas\">Hamas</a>’s war against <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>, the speaker details the escalating attacks from <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>, including over 9,000 rockets fired and the impact on Israeli civilians. They emphasize the ongoing threat from <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> and Hezbollah, <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s role in fueling the conflict, and the necessity for Israel to continue its military operations to secure its future and free <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18067,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312,
        1586
    ],
    "class_list": [
        "post-18136",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 18136
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18136",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18136"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18136/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18137,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18136/revisions/18137"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18067"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18136"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18136"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18136"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}