{
    "id": 17924,
    "date": "2024-10-01T23:28:28",
    "date_gmt": "2024-10-01T20:28:28",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17924"
    },
    "modified": "2024-10-02T10:05:37",
    "modified_gmt": "2024-10-02T07:05:37",
    "slug": "sean-padraig-mccarthy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/terrorist-sympathizer/sean-padraig-mccarthy/",
    "title": {
        "rendered": "Sean Padraig McCarthy"
    },
    "content": {
        "rendered": "\n<p>Sean Padraig McCarthy isn’t just a comedian or podcast host—he’s an enabler of hate, known for spewing anti-Semitic, anti-Israel rhetoric that directly aligns him with extremists and terror sympathizers. McCarthy has carved out a niche for himself as a provocateur, using his platform on podcasts like <em>Out for Smokes</em> and his social media presence to push a vile, dangerous agenda.</p>\n\n\n\n<p>McCarthy’s commentary on Israel and Jews reveals an undeniable pattern of anti-Semitism disguised as political critique. He regularly engages in anti-Zionist rhetoric that crosses the line into outright hate. McCarthy isn’t just expressing an opinion—he’s echoing the same propaganda used by groups like Hamas and Hezbollah, who seek to destroy Israel and target Jewish civilians in the process. His social media bio, with its anti-war slogan, masks his far more insidious views. Beneath his self-proclaimed identity as an &#8220;internet troll,&#8221; McCarthy peddles conspiracy theories that vilify Jews, attempting to legitimize violence against them.</p>\n\n\n\n<p>His podcast, newsletter, and online presence are filled with toxic content that emboldens others who harbor hate. McCarthy’s defense of extremist ideologies and his anti-Israel stance have landed him in controversy, but these aren’t just missteps—they are a clear indication of where his loyalties lie. He sides with those who glorify terror and dehumanize Jewish people, aligning himself with groups who call for Israel&#8217;s destruction. In doing so, McCarthy stands with terrorists, not just by words but by promoting ideas that directly fuel the violence seen in events like the October 7, 2023, massacre.</p>\n\n\n\n<p>Following the atrocities of October 7, where Hamas slaughtered over 1,200 innocent Israelis, McCarthy showed his true colors. His comments and lack of empathy for the Jewish victims were a chilling reminder of how his rhetoric aligns with those who celebrate such violence. Instead of condemning these brutal acts, McCarthy uses his platform to shift blame and perpetuate the same anti-Semitic narratives that terrorists use to justify their attacks.</p>\n\n\n\n<p>Sean Padraig McCarthy is not just a controversial figure—he is a purveyor of hate. His supporters and followers aren’t just participating in online banter—they are aligning themselves with someone who sympathizes with terror and celebrates the murder of innocents. Those who give McCarthy a platform or follow his ideas are standing shoulder-to-shoulder with extremists who seek to destroy Israel and target Jewish civilians. His brand of anti-Semitism is dangerous, and anyone supporting him is complicit in spreading hatred and violence.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Sean Padraig McCarthy isn’t just a comedian or podcast host—he’s an enabler of hate, known for spewing anti-Semitic, anti-<a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> rhetoric that directly aligns him with extremists and terror sympathizers. McCarthy has carved out a niche for himself as a provocateur, using his platform on podcasts like Out for Smokes and his social media presence to push a vile, dangerous agenda. McCarthy’s commentary on Israel and Jews reveals an undeniable pattern of anti-Semitism disguised as political critique. He regularly engages in anti-Zionist rhetoric that crosses the line into outright hate. McCarthy isn’t just expressing an opinion—he’s echoing the same propaganda used</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17925,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-useful-idiots",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1578,
        "footnotes": ""
    },
    "categories": [
        1578
    ],
    "tags": [],
    "class_list": [
        "post-17924",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-terrorist-sympathizer"
    ],
    "lang": "en",
    "translations": {
        "en": 17924
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17924",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17924"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17924/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17926,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17924/revisions/17926"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17925"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17924"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17924"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17924"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}