{
    "id": 18012,
    "date": "2024-10-01T15:00:00",
    "date_gmt": "2024-10-01T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18012"
    },
    "modified": "2024-10-04T13:00:23",
    "modified_gmt": "2024-10-04T10:00:23",
    "slug": "the-us-secretary-of-defense-agrees-with-israel",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/the-us-secretary-of-defense-agrees-with-israel/",
    "title": {
        "rendered": "The US Secretary of Defense Agrees With Israel | Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"The US Secretary of Defense Agrees With Israel | Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/D2AYxlFWJsI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is day 361 of the October 7th war—a war that Hamas started from Gaza. Hezbollah joined the conflict the next day from Lebanon, and now it involves the Islamic Republic of Iran and its proxy armies on a total of seven fronts around Israel. Hezbollah&#8217;s war against Israel has entered a new phase as Israel takes action to return displaced families to their homes.</p>\n\n\n\n<p>For a whole year, Israel has warned Iran&#8217;s proxy army in Lebanon: <strong>&#8220;Back off, or we will have to push you away.&#8221;</strong> Hezbollah did not back off. Now Israel is pushing it away. Last night, the IDF began <strong>limited, localized, and targeted ground raids</strong> based on precise intelligence against Hezbollah targets in southern Lebanon. These Hezbollah targets are located in villages close to the border with Israel and pose an immediate threat to Israeli communities in northern Israel.</p>\n\n\n\n<p>One reason these areas pose an immediate threat to our people is because the Hezbollah army of terror has been attacking Israelis from these areas for the past year. Since October 8th, Hezbollah hasn&#8217;t stopped firing over <strong>9,000 rockets</strong>, <strong>guided anti-tank missiles</strong>, and <strong>suicide drones</strong> into Israeli cities and towns. For 12 months, the distance between Hezbollah and Israeli families has been very short.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hezbollah&#8217;s Threat to Israel</h4>\n\n\n\n<p>There&#8217;s another threat from Hezbollah that the whole world needs to understand: <strong>Hezbollah planned to use villages in Lebanon along the border with Israel as launch points for an October 7th-style massacre.</strong> Hamas stole Hezbollah&#8217;s idea. Hezbollah had a plan to invade Israel, conquer parts of the Galilee region, and massacre countless Israelis. Hezbollah still dreams of doing what Hamas did on October 7th, but Israel will not allow Hezbollah to carry out its vision. Every day that Iran&#8217;s proxy army still sits on Israel&#8217;s northern border is <strong>October 6th</strong>—what happened on October 7th from Gaza can never happen again, anywhere.</p>\n\n\n\n<p>There is one main goal of Israeli military operations in Lebanon: <strong>to allow the 60,000 residents of northern Israel who fled their homes last October and have been homeless for the last year to return to their homes safely, without the fear that Hezbollah will shoot them or worse.</strong> In order for Israelis to feel safe in their homes, Hezbollah must not only stop shooting rockets, it must back off. It was warned for the past year that it needed to back off. Hezbollah has not backed off, and that is why the Israel Defense Forces are currently pushing Hezbollah away.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hezbollah&#8217;s Attack on Israel</h4>\n\n\n\n<p>Today, Hezbollah fired rockets at central Israel. Sirens sounded here in Tel Aviv. One of the rockets struck a highway next to a village in Israel called Kafr Qassem. It&#8217;s a <strong>Muslim Arab village</strong>. Hezbollah tries to kill Jews, and it hits Muslims—it doesn&#8217;t care. Hezbollah doesn’t care at all for human life: <strong>not Israeli human life, and not Lebanese human life.</strong> Two people were wounded in the attack and are receiving treatment.</p>\n\n\n\n<p>Here&#8217;s the good news: <strong>the United States supports Israel&#8217;s operation in Lebanon to push Hezbollah away from the Israeli border.</strong> You heard that right—the U.S. is behind us. U.S. Secretary of Defense Lloyd Austin said it was necessary to dismantle Hamas&#8217;s attack infrastructure, and Hezbollah&#8217;s attack infrastructure along the border, in order to ensure that Hezbollah cannot conduct October 7th-style attacks on Israel’s northern communities. Austin also said that a diplomatic resolution is required to ensure residents of northern Israel can return safely to their homes.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Path to Peace</h4>\n\n\n\n<p>Of course, nobody wants a diplomatic resolution more than Israel. We don’t want to have to send our friends to fight in the north. The question is how. Hezbollah has been attacking the people of Israel for an entire year—what deal is on the table? A return to the past is unacceptable. Israel will not allow a ceasefire that allows an <strong>armed and dangerous terrorist army</strong> to mobilize on any Israeli border, whether in Gaza or in Lebanon. That’s not going to happen anymore.</p>\n\n\n\n<p>We’ve been here before. Eighteen years ago, the <strong>Second Lebanon War</strong> ended with <strong>UN Security Council Resolution 1701</strong> that ordered Hezbollah to disarm and move north of the Litani River. That resolution was never enforced. Israel is demanding a diplomatic solution that will see Hezbollah removed from the border and disarmed, just like that UN resolution was meant to do 18 years ago. It&#8217;s time for the government of Lebanon to take responsibility for the future of Lebanon, disarm the Iranian proxy army that operates on its soil, and make peace with Israel.</p>\n\n\n\n<h4 class=\"wp-block-heading\">International Response and Support</h4>\n\n\n\n<p>Yes, a ceasefire is not enough—we should demand <strong>peace.</strong> The entire international community, the United Nations, European Union, United States, UK, France—everyone who cares or says they care about what is happening in Lebanon—needs to make their voices heard and demand nothing less than <strong>normal, peaceful, open relations between Israel and Lebanon</strong> because this is not a war against Lebanon or its people. It is a war against Hezbollah, the Iranian proxy army that has taken over their country. And Israel is now giving the Lebanese people an opportunity to take their country back.</p>\n\n\n\n<p>We cannot afford to miss this opportunity.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The UK&#8217;s Solidarity with Israel</h4>\n\n\n\n<p>Finally, it may feel like Israel is alone, but it’s not true. We have friends in the United Kingdom. Aspiring leaders of the Conservative Party are expressing very supportive messages. <strong>Kemi Badenoch</strong> is one of them. She said Israel should be congratulated for eliminating Hezbollah warlord <strong>Hassan Nasrallah.</strong> She praised Israel&#8217;s targeted strikes as extraordinary. <strong>Robert Jenrick</strong> wore a hoodie that said “Hamas are terrorists,” and even said the Star of David should be displayed at every point of entry to the UK to show that the UK stands with Israel. Another candidate, <strong>Tom Tugendhat</strong>, said that Hezbollah is evil and vile, and that he supports Israel&#8217;s right to target Hezbollah terrorists in Lebanon.</p>\n\n\n\n<p><strong>James Cleverly</strong>, a former Foreign Secretary who came to visit right after October 7th, was asked if he supports Israel’s ground operation in Lebanon, and he said, <strong>&#8220;I do.&#8221;</strong> What does all this indicate? It indicates that a significant portion of the British public expects their leaders to stand with their ally Israel, fighting on the front lines against the same enemies as the United Kingdom.</p>\n\n\n\n<p>It also indicates that our messages have an audience. We must keep speaking the truth, sharing the facts, refuting the lies, and standing up for what is right, because we cannot expect anyone to stand up more loudly for us than we are willing to stand up for ourselves. Israel is on the front lines of humanity, fighting for humanity, fighting against the same terrorist enemies threatening the whole of the West and the whole free world. And they need us to stand up for ourselves in order to help them stand up for themselves.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Q&amp;A Section</strong></h3>\n\n\n\n<p><strong>Alon, you referenced the statement of Secretary of Defense Austin. Naomi is watching on our live screen, and she&#8217;s asking: Didn&#8217;t Biden call yesterday for a ceasefire? How do you explain the messages from the United States and interpret them?</strong></p>\n\n\n\n<p>Sometimes world leaders do not say in public what they say in private. In fact, Politico published just this morning that in private, U.S. officials have been supportive of Israel&#8217;s ground operation, even as President Biden calls for a ceasefire. Why? Well, they were hoping to get to a diplomatic resolution. We’d like to get to a diplomatic resolution, one that actually does what the last diplomatic resolution was meant to do. But they thought that would happen if it was possible to reach a ceasefire in Gaza, and that would lead to a ceasefire in Lebanon. But then the U.S. realized Hamas isn’t interested in a ceasefire in Gaza, and that means there’s no way to get a ceasefire in Lebanon right now. So, according to Politico, U.S. officials support Israel’s ground operation as a way of putting pressure on Hezbollah to get it to agree to a diplomatic resolution.</p>\n\n\n\n<p>None of us want war. We don’t want to go into Lebanon. We don’t want to send our friends, whether in the regular army or reserves, up in the north to fight—it’s dangerous, and people will get hurt and killed. We need a diplomatic resolution. But here’s our question for people who are calling for a diplomatic resolution now: <strong>How will it look any different from Resolution 1701</strong>, which ended the Second Lebanon War and was never enforced? It was meant to disarm Hezbollah and push it north of the Litani River. That never happened, not in 18 years. <strong>UNIFIL did nothing</strong>, the <strong>Security Council did nothing</strong>, the <strong>government of Lebanon did nothing.</strong> How will it be different from Resolution 1701, and why do you think this one will be enforced when the last one wasn’t?</p>\n\n\n\n<p>Unfortunately, the only thing that Hezbollah will respond to is <strong>force</strong>. In the last few weeks, Israel has been degrading Hezbollah’s capabilities at a dizzying scale. You’ll be on top of what’s been happening if you’ve been following these briefings of the Citizen Spokesperson’s Office. The <strong>entire leadership of Hezbollah</strong> has been killed. The <strong>entire command structure</strong> has been destroyed. There was the <strong>Beirut port attack</strong> that many have attributed to Israel, which would be not only the most precise military strike in human history but the most precise strike in military <strong>future</strong>—because no one is ever going to pull off something on the same level of science fiction, making <strong>thousands of pages explode</strong> simultaneously in terrorists&#8217; faces.</p>\n\n\n\n<p>Israel has destroyed tens of thousands of Hezbollah rockets pointed at Israel and <strong>massively degraded</strong> its capabilities. We need a diplomatic resolution, but one in which Hezbollah is not armed and is not positioning those arms right on Israel’s northern border.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On the 361st day of the October 7th war, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> continues its efforts to combat <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s growing threats from Lebanon. The Israeli Defense Forces (IDF) have initiated targeted ground raids against <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>&#8216;s positions near the Israeli border to ensure the safety of displaced residents in northern Israel. International support for Israel’s actions, particularly from the U.S., underscores the gravity of the situation. Diplomatic solutions are urged, but military action remains necessary due to Hezbollah’s persistent attacks.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18013,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-18012",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 18012
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18012",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18012"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18012/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18014,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18012/revisions/18014"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18013"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18012"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18012"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18012"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}