{
    "id": 18320,
    "date": "2024-10-14T15:00:00",
    "date_gmt": "2024-10-14T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18320"
    },
    "modified": "2024-10-25T16:58:05",
    "modified_gmt": "2024-10-25T13:58:05",
    "slug": "un-forces-endangered-israels-lives-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/un-forces-endangered-israels-lives-eylon-levy/",
    "title": {
        "rendered": "UN Forces Endangered Israel’s Lives | Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"UN Forces Endangered Israel’s Lives | Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/vv6W_xXL4KY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Israel is now having to clean up <em>decades</em> of the UN&#8217;s failure in Lebanon. You may have seen videos showing Hezbollah fortifications, including tunnels just 100 meters from UNIFIL bases. The UN peacekeepers watched as Hezbollah drilled rock, brought in supplies, and had terrorists coming in and out—all while UNIFIL did nothing for 18 years.</p>\n\n\n\n<p>Hezbollah has attacked Israel 25 times from near UNIFIL positions just in the past month, with some attacks resulting in fatalities. Yesterday, Iran’s terror army in Lebanon launched a deadly, mass-casualty drone attack, killing four soldiers and injuring 51. This attack was launched from an area that UNIFIL was supposed to have disarmed. UNIFIL literally had one job: to disarm Hezbollah. But instead, UNIFIL watched as Hezbollah fortified southern Lebanon right under its nose.</p>\n\n\n\n<p>UNIFIL observed Hezbollah deploy tens of thousands of terrorists and hundreds of thousands of heavy weapons, rockets, and missiles. Over the past year, UNIFIL watched as Hezbollah rained attacks on Israel’s people. Since October 8, 2023, Hezbollah has fired 13,000 Iranian rockets, missiles, and drones, forcing 60,000 Israelis to flee their homes—all as UNIFIL watched and did nothing.</p>\n\n\n\n<p>Now, as Israel moves in to clean out Hezbollah positions, UNIFIL forces refuse Israel&#8217;s request to move out of harm’s way. The UN has even accused Israel of endangering UNIFIL’s lives. But the reality is, UNIFIL endangered Israeli lives by failing to disarm Hezbollah and is now holding Israel responsible for Hezbollah’s war against Israeli civilians. The UN attacks Israel because acknowledging its failure to disarm Hezbollah would mean admitting it failed its own mandate.</p>\n\n\n\n<p>Israel did not want to send its soldiers to disarm Hezbollah; we spent a year warning Hezbollah to stand down. We would have preferred that the UN handle this, as it was intended to under UN Security Council Resolution 1701. But after 18 years of inaction, Israel is taking necessary action—not because it wants to, but because no one else will.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Background on UN Security Council Resolution 1701</h4>\n\n\n\n<p>For those unfamiliar with UN Security Council Resolution 1701, here’s a recap: the resolution was adopted to end the 2006 war between Israel and Hezbollah, which had escalated because Hezbollah operated as an armed group separate from Lebanon’s military. To end Hezbollah’s ability to wage war, Resolution 1701 called for the removal of Hezbollah from southern Lebanon and its general disarmament. UNIFIL’s job, under this resolution, was to enforce this disarmament and prevent southern Lebanon from being used for hostile activities against Israel.</p>\n\n\n\n<p>UNIFIL, however, failed to act. Instead, it allowed itself to be pushed around by Hezbollah. If UNIFIL had fulfilled its mandate, there would be no war today. But Israel is now doing what it must to end Hezbollah’s attacks today and prevent the next war tomorrow.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Humanitarian Situation in Gaza</h4>\n\n\n\n<p>Meanwhile, Hamas is preventing Gazan civilians from leaving combat areas for humanitarian zones. Israel released a recording in which a Palestinian in Gaza reports being stopped and beaten by people who forced them back into danger zones. When asked who was stopping them, they said it was Hamas. Early in the war, Hamas terrorists even shot at Gazans to prevent them from escaping, once even destroying a vehicle attempting to flee. Israel’s objective remains to dismantle Hamas’s terror regime and rescue hostages, ensuring they cannot bring such ruin again.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section:</h3>\n\n\n\n<p><strong>Q1:</strong> <em>Has UNIFIL or the UN made a statement acknowledging its failure after the recent discovery of Hezbollah&#8217;s tunnel?</em><br>Yes, the UN has made a statement, but not to acknowledge its failure in allowing Hezbollah’s buildup under its watch. Instead, it has criticized Israel for dismantling Hezbollah’s military infrastructure—a task UNIFIL should have handled in the first place.</p>\n\n\n\n<p><strong>Q2:</strong> <em>Do you believe that UN forces in Lebanon have befriended Hezbollah?</em><br>There’s no evidence that UNIFIL has intentionally befriended Hezbollah, but UNIFIL&#8217;s passive stance allowed Hezbollah to grow unchecked in southern Lebanon, a fact that has allowed Hezbollah to strengthen significantly.</p>\n\n\n\n<p><strong>Q3:</strong> <em>How is Israel dealing with the threat of drone attacks?</em><br>Drone attacks represent a new and serious challenge in this war. Unlike rockets, drones are small, maneuverable, and difficult to intercept, especially for systems like Iron Dome. In recent months, drones have targeted multiple areas across Israel, making it clear that Israel must invest in advanced defense systems capable of countering drone attacks.</p>\n\n\n\n<p><strong>Q4:</strong> <em>Can Israel stop allowing UNRWA to operate in Gaza and the West Bank, and will Palestinians be de-radicalized post-war?</em><br>For sustainable peace, three steps are essential: destroying Hamas, demilitarizing Gaza, and de-radicalizing Palestinian society. The international community must recognize that terrorist aggression should not be rewarded. When countries endorse organizations like UNRWA, they indirectly support a system that perpetuates anti-Israel sentiments rather than fostering peace.</p>\n\n\n\n<p><strong>Q5:</strong> <em>How will Israel respond to the recent ballistic missile attacks from Iran?</em><br>Israel is assessing its response carefully. This attack involved 200 ballistic missiles, a significant escalation. Israel recently received advanced anti-ballistic systems from the U.S. and is planning a strong response to make clear that aggression from Iran will not be tolerated.</p>\n\n\n\n<p><strong>Q6:</strong> <em>How do Israelis cope with the constant pressure from these threats?</em><br>Israelis are under immense stress, but resilience is critical. People are encouraged to take breaks, enjoy time with loved ones, and find ways to decompress despite the constant threat.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>Thank you for tuning in. We’ll be back tomorrow at 3 p.m. Israel time. Please follow the Israeli Citizen Spokesperson’s Office on social media to support our message to the world.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> is addressing <a  href=\"https://iron-swords.co.il/t/the-un/\">the UN</a>’s failure to disarm <a  href=\"/hezbollah\">Hezbollah</a> in Lebanon, as UNIFIL peacekeepers allowed <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>’s militarization. Recent drone and missile attacks prompted Israel’s intervention to dismantle Hezbollah’s infrastructure. The update also covers <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>’s humanitarian crisis under <a  href=\"/hamas\">Hamas</a>, Israel’s response to ballistic threats from <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>, and the UN’s indirect support of anti-Israel sentiment.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18013,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-18320",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 18320
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18320",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18320"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18320/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18337,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18320/revisions/18337"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18013"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18320"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18320"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18320"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}