{
    "id": 18139,
    "date": "2024-10-10T15:00:00",
    "date_gmt": "2024-10-10T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18139"
    },
    "modified": "2024-10-12T11:53:11",
    "modified_gmt": "2024-10-12T08:53:11",
    "slug": "un-warns-of-war-one-year-in-jonathan-elkhoury",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/un-warns-of-war-one-year-in-jonathan-elkhoury/",
    "title": {
        "rendered": "UN Warns of War – One Year In | Jonathan Elkhoury"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"UN Warns of War – One Year In | Jonathan Elkhoury\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/JNG45umhQj0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h4 class=\"wp-block-heading\">Opening Remarks</h4>\n\n\n\n<p>The UN Secretary-General has said we are on the verge of an all-out war in Lebanon, calling for respect for the sovereignty and territorial integrity of all countries. However, where has he been for the past year? Hezbollah, Iran&#8217;s terror army in Lebanon, declared war on Israel on October 8, 2023. Since then, they have fired 13,000 Iranian rockets, missiles, and drones at Israel daily. Isn&#8217;t that a violation of Israel&#8217;s sovereignty and territorial integrity?</p>\n\n\n\n<p>Sixty thousand people have fled their homes as Hezbollah rains fire upon them. The Secretary-General&#8217;s words are worse than hollow because the UN&#8217;s own troops, UNIFIL, are supposed to prevent Hezbollah from using southern Lebanon to attack Israel, even using force if necessary. That&#8217;s in accordance with UN Security Council resolutions. Yet, instead of stopping Hezbollah, UNIFIL allowed them to come right up to Israel&#8217;s border. And now, as Israel finally acts to remove Hezbollah, which is what UNIFIL should have done, UNIFIL&#8217;s Irish component is refusing to leave. UNIFIL is actually trying to protect Hezbollah.</p>\n\n\n\n<p>Just yesterday, Israel eliminated two more Hezbollah commanders. One, in the village of Houla opposite Israel&#8217;s border, was responsible for hundreds of missile and anti-tank missile attacks on the Galilee. Another, in the hills along the border, orchestrated guided anti-tank missile strikes into Israeli homes. Neither of them nor their weapons should have been there at all—they were only there because the UN didn&#8217;t do its job.</p>\n\n\n\n<p>The UN Secretary-General and UNIFIL failed to prevent war, but now Israel will not allow them to stop it from ending. Do you know who else wants Hezbollah disarmed and out of southern Lebanon? The people of Lebanon.</p>\n\n\n\n<p>UN Resolution 1701 says that southern Lebanon should be free of Hezbollah, but now many Lebanese are referring to another UN resolution—1559. This resolution declared that Hezbollah must be fully disarmed and that Lebanon&#8217;s military should control the country. Neither resolution has been enforced.</p>\n\n\n\n<p>What many people don&#8217;t know is that Lebanon used to have many armed groups—Jews, Christians, Sunnis, and Shias, each with their own weapons and militias. All of them disarmed—except for Hezbollah. Hezbollah is still holding guns long after everyone else in Lebanon put theirs down. This is how Hezbollah, with Iran&#8217;s help, took over Lebanon, using it as a base for their wars against Israel. That&#8217;s why the Lebanese people are fed up with Hezbollah.</p>\n\n\n\n<p>As we look to Lebanon&#8217;s future, let us remember what the UN demanded and what the Lebanese people are hoping for: Lebanon should be run by Lebanon, not by Hezbollah.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p><strong>Jonathan from Instagram Live:</strong><br><em>Who are the groups opposing Hezbollah in Lebanon, and why do they oppose them?</em></p>\n\n\n\n<p>Thank you very much, Jonathan, for the question. Lebanon is made up of several factions: Sunni Muslims, Shia Muslims, Christians of various denominations, and Jews. Most of these groups, including people from all religions and factions, oppose Hezbollah because Hezbollah has been responsible for assassinating people from all these groups who oppose their grip on Lebanon.</p>\n\n\n\n<p>That&#8217;s why it&#8217;s essential to amplify the voices of the Lebanese people who are against Hezbollah. Hezbollah still controls parts of Lebanon—southern Lebanon, parts of Beirut, and the Bekaa Valley. They continue to terrorize the Lebanese people, many of whom cannot speak out. That&#8217;s why I&#8217;m here today, speaking for many Lebanese. Many who fled Hezbollah are also speaking out, and you can find them online.</p>\n\n\n\n<p><strong>Samantha from X:</strong><br><em>How did the Lebanese people receive Israel&#8217;s Prime Minister&#8217;s speech?</em></p>\n\n\n\n<p>Thank you, Samantha, for the question. Prime Minister Benjamin Netanyahu addressed the Lebanese people, recognizing Lebanon&#8217;s sovereignty and its people&#8217;s right to live in peace, free from Hezbollah&#8217;s terror. I believe many Lebanese received this message well because they already believe in it themselves. It&#8217;s not just because the Israeli Prime Minister said it—they genuinely believe Lebanon should be free from Iran&#8217;s grip and Hezbollah&#8217;s hold on their country. We should all amplify those Lebanese voices calling for freedom from Hezbollah&#8217;s control.</p>\n\n\n\n<p><strong>Vegan Loris from X:</strong><br><em>Why doesn&#8217;t the IDF take out Iran&#8217;s nuclear program immediately?</em></p>\n\n\n\n<p>Thank you for your question. We are indeed on the verge of an all-out war with Iran. Just a few days ago, Iran fired 180 ballistic missiles at Israel. The international community needs to support Israel in standing against Iran and its proxies. Right now, Israel is fighting on seven fronts: Hezbollah in Lebanon, Hamas in Gaza, the Houthis in Yemen, and other groups in Iraq and Syria. At the same time, Israel is coordinating with the U.S. on how to respond, and we believe Israel should respond with as much power as possible.</p>\n\n\n\n<p><strong>Lehi from Instagram Live:</strong><br><em>What would it mean to the Lebanese people if Hezbollah was completely obliterated?</em></p>\n\n\n\n<p>Thank you for that question, Lehi. This is what everyone in Lebanon is talking about—the freedom they would have if Hezbollah were gone. Without Hezbollah&#8217;s grip on their country, the Lebanese could finally prosper and live in peace. They could negotiate peacefully with others and live in a democracy. That&#8217;s what the elimination of Hezbollah would mean for Lebanese people—Christians, Muslims, Jews, and even Israelis. It would mean freedom and a better future.</p>\n\n\n\n<p>That&#8217;s all we have time for today. Thank you for tuning in, and we&#8217;ll be back on Sunday at 3 PM Israel time. Shabbat Shalom.</p>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/the-un/\">The UN</a> Secretary-General has warned of an impending war in Lebanon, yet the speaker criticizes the UN for failing to act for a year as <a  href=\"/hezbollah\">Hezbollah</a> continues to attack <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>. Despite UN resolutions, <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a> still operates freely in southern Lebanon, with the Lebanese people themselves yearning for its disarmament and freedom from its control.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18140,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1630,
        1586
    ],
    "class_list": [
        "post-18139",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-jonathan-elkhoury",
        "tag-northern-arrows"
    ],
    "lang": "en",
    "translations": {
        "en": 18139
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18139",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18139"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18139/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18141,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18139/revisions/18141"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18140"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18139"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18139"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18139"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}