{
    "id": 18133,
    "date": "2024-10-09T15:00:00",
    "date_gmt": "2024-10-09T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18133"
    },
    "modified": "2024-10-12T11:44:04",
    "modified_gmt": "2024-10-12T08:44:04",
    "slug": "weakened-hezbollah-hints-at-ceasefire-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/weakened-hezbollah-hints-at-ceasefire-ruth-wasserman-lande/",
    "title": {
        "rendered": "Weakened Hezbollah hints at ceasefire | Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Weakened Hezbollah hints at ceasefire | Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/sKM8rwYd0_E?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>A few hours ago, a terrorist in the Israeli city of <strong>Hadera</strong> ran around stabbing people. Police killed him, ending the stabbing spree. The terrorist was one of many radical Islamists who had been indoctrinated with radical ideology and made it their life mission to murder Jewish people. They believe it is their religious duty, bringing them closer to Allah and granting them 72 virgins in heaven.</p>\n\n\n\n<p>Last week, civilians in Jaffa were murdered in cold blood; this week in Be’er Sheva, and now in Hadera.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hezbollah and the Ceasefire Proposal</h4>\n\n\n\n<p>On the Hezbollah front, Hezbollah is suddenly hinting that it wants a ceasefire after a year of trying to murder Israelis—both Arab and Jewish—by firing 13,000 Iranian rockets, missiles, and drones at them daily. Hezbollah Deputy Naim Qassem said that after the issue of a ceasefire takes shape and diplomacy achieves it, all other details can be discussed. This suggests that the terrorist organization is ready for a ceasefire.</p>\n\n\n\n<p>What changed? Israel first took out thousands of terrorists, including Nasrallah himself, his replacement, and the replacement of his replacement. Simultaneously, Israeli soldiers are destroying dozens of Hezbollah tunnels along the Lebanese border, filled with weapons and equipment, meant to carry out Hezbollah’s version of October 7th in northern Israel.</p>\n\n\n\n<p>The U.S. State Department spokesperson said it best: &#8220;Obviously, we don&#8217;t trust Hezbollah.&#8221; He clarified that Hezbollah’s ceasefire offer is meaningless without disarming and withdrawing from Israel’s border, per the UN Security Council Resolution 1701. He added that Hezbollah’s talk of a ceasefire shows Israel is successfully weakening it.</p>\n\n\n\n<p>It is heartwarming that Hezbollah is suddenly interested in a ceasefire after incessantly bombarding Israeli civilians for a year, including right now. But with all due respect, it is not as if they are suddenly interested in peace. After all, they knowingly fired at a soccer field in an Arabic-speaking village in the north of Israel, murdering 12 innocent children and wounding many more.</p>\n\n\n\n<p>What Hezbollah is really interested in is not ending up like Hamas. What Israel is doing in southern Lebanon is to push Hezbollah away in self-defense, as it said it would, so 60,000 Israeli civilians—both Jewish and Arab—who had been evacuated can return home safely.</p>\n\n\n\n<p>Lebanon’s Christians, Druze, and Sunnis hate Hezbollah, a Shiite arm of the Islamic Republic of Iran. They remember Hezbollah’s assassination of their former prime minister, Rafik Hariri. They also remember Hezbollah dragging them into the 2006 war with Israel, using Lebanon as a platform to attack Israel rather than protecting Lebanon, as Hezbollah claims. The terror group endangers its civilians and uses them as human shields.</p>\n\n\n\n<p>This is an amazing opportunity for Lebanon to regain its sovereignty and independence from Hezbollah, which has oppressed the Lebanese people for decades.</p>\n\n\n\n<h4 class=\"wp-block-heading\">one-year of the October 7th massacre</h4>\n\n\n\n<p>Two days ago marked the one-year of the October 7th massacre. At 11:00 a.m., Tel Aviv was fired on from Gaza by Hamas. At 5:45 p.m., Tel Aviv was attacked from the east by the Houthis in Yemen. At 11:15 p.m., Tel Aviv was fired on from the north by Hezbollah in Lebanon.</p>\n\n\n\n<p>Israel is not just in a war with Hamas, Hezbollah, or the Houthis. It is under attack from the Islamic Republic of Iran’s terror branches in Gaza, Lebanon, and Yemen. Iran’s agents in Judea and Samaria (the West Bank), its militias in Syria and Iraq, and Iran’s regime itself have launched direct attacks on Israel, firing hundreds of missiles and drones from Iranian soil.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section</h3>\n\n\n\n<h4 class=\"wp-block-heading\">1. Comment on the Kiryat Shmona Attack</h4>\n\n\n\n<p><em>Question</em>: We have an update: unfortunately, there has been a Hezbollah rocket attack in Kiryat Shmona along Israel’s northern border. Israeli emergency services have declared the death of a man and a woman in their 40s. Do you have any comment about that and what it means for the future of the war?</p>\n\n\n\n<p><em>Answer</em>: First of all, my heart breaks, and I send my condolences to the poor families whose loved ones were killed. This emphasizes how recklessly and indiscriminately Hezbollah shoots at Israeli civilians. The Islamic Republic of Iran is trying to demonize Israel and weaken it by attacking its civilians. They want to divert attention from their nuclear ambitions.</p>\n\n\n\n<p>However, we must be united, strong, and continue without allowing Hezbollah, the Houthis, the Iranian regime, or Hamas to break our spirit.</p>\n\n\n\n<h4 class=\"wp-block-heading\">2. UNIFIL’s Role and Irish Forces</h4>\n\n\n\n<p><em>Question</em>: We have several questions about UNIFIL and specifically about the Irish Prime Minister boasting that Irish forces have not left the border area. Could you comment on that?</p>\n\n\n\n<p><em>Answer</em>: UNIFIL is a UN peacekeeping force established 18 years ago to ensure two things: that Hezbollah does not come close to the Israeli border and that Hezbollah is disarmed. UNIFIL has utterly failed at both tasks. Hezbollah not only stayed near the border but came closer, armed, and using those arms against Israel.</p>\n\n\n\n<p>The Irish government is putting its civilians and soldiers in danger by keeping them in the area, knowing that the IDF will retaliate to protect Israeli civilians.</p>\n\n\n\n<h4 class=\"wp-block-heading\">3. Trusting Hezbollah in Ceasefire Talks</h4>\n\n\n\n<p><em>Question</em>: Jane Tarzan asks, “What’s the trust test with Hezbollah, an entity that has spent decades wanting to destroy Israel?”</p>\n\n\n\n<p><em>Answer</em>: It’s not by accident that I didn’t hear your question clearly. The words “trust” and “Hezbollah” don’t connect in my brain. Hezbollah is a terrorist organization, like Hamas. There is no trust with a terrorist group whose declared, public goal is to destroy Israel, massacre, and harm civilians.</p>\n\n\n\n<p>The solution is not trust but disarming Hezbollah and dismantling their infrastructure near the Israeli border to prevent them from perpetrating atrocities.</p>\n\n\n\n<h4 class=\"wp-block-heading\">4. Improving Israel’s International PR</h4>\n\n\n\n<p><em>Question</em>: Chuck Chek asks, &#8220;How can Israel improve its PR internationally?&#8221;</p>\n\n\n\n<p><em>Answer</em>: The million-dollar question! Israel doesn’t put enough effort into this. We need a narrative explaining what’s happening here from our perspective: the trauma, the displacement of civilians for over a year, and the emotional toll. This isn’t being communicated effectively.</p>\n\n\n\n<p>We need more spokespersons, both in Israel and abroad, to tell our story—especially in English and Arabic. Arab-speaking audiences mostly hear lies from networks like Al Jazeera, while the Western media often only broadcasts negativity. We must work to get our message across.</p>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>A terrorist in <a  href=\"https://iron-swords.co.il/t/hadera/\">Hadera</a>, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>, stabbed civilians before being neutralized by police, part of ongoing attacks from radical Islamists. <a  href=\"/hezbollah\">Hezbollah</a> is hinting at a ceasefire after a year of attacks, while Israeli operations have weakened them. <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>-backed groups continue attacking Israel from multiple fronts. The spokesperson emphasizes the need for Israel&#8217;s continued strength and addresses concerns about <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>, UNIFIL, and international PR</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17996,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1586,
        492
    ],
    "class_list": [
        "post-18133",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-northern-arrows",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 18133
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18133",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18133"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18133/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18134,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18133/revisions/18134"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17996"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18133"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18133"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18133"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}