{
    "id": 18317,
    "date": "2024-10-13T15:00:00",
    "date_gmt": "2024-10-13T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18317"
    },
    "modified": "2024-10-25T16:02:39",
    "modified_gmt": "2024-10-25T13:02:39",
    "slug": "why-are-un-forces-in-lebanon-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/why-are-un-forces-in-lebanon-daniel-rubenstein/",
    "title": {
        "rendered": "Why are UN forces in Lebanon? | Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Why are UN forces in Lebanon? | Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/zQy8drbnrk0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Israel&#8217;s seven-front war against the Iranian regime and its proxies continues. I’m going to speak now mostly about one of those fronts, and that is Lebanon. The war against Hezbollah in Lebanon continues. In recent hours, Hezbollah has fired rocket barrages at Haifa, Israel&#8217;s third-largest city, and elsewhere in northern Israel. The Israeli military is operating on the ground in Lebanon, based on precise intelligence of where Hezbollah&#8217;s positions are located inside the border villages.</p>\n\n\n\n<p>The reason that the Israeli military is operating on the ground in Lebanon should be clear: Hezbollah opened a second front against Israel on October 8, 2023. Hezbollah joined the war that Hamas started the day before, on October 7. We warned for 11 months that Hezbollah must back off or we will have to push it away. Hezbollah didn&#8217;t back off, now it&#8217;s being pushed away.</p>\n\n\n\n<p>Hezbollah is being pushed away because it has not only been firing rockets into Israel, but has also been shooting guided anti-tank missiles into Israeli houses. Hezbollah terrorists can see deep into Israel from their firing positions on the border—they can see houses and aim their guided anti-tank missiles at the houses or any other building they want to hit. That&#8217;s what&#8217;s been happening.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Civilians Displaced</h4>\n\n\n\n<p>As a result of this threat, more than 60,000 Israelis fled their homes a year ago. They can&#8217;t go back to safety until Hezbollah is no longer on the border. We&#8217;ve been here before: 18 years ago, in 2006, Hezbollah terrorists at that time crossed into Israel, ambushed Israeli reservists on patrol, killed a number of them, abducted two Israeli soldiers into Lebanon—who we later learned were killed—and proceeded to fire 4,000 rockets into Israel over the next 34 days. There was no Iron Dome to shoot down any of Hezbollah&#8217;s rockets in the summer of 2006.</p>\n\n\n\n<h4 class=\"wp-block-heading\">United Nations Security Council Resolution 1701</h4>\n\n\n\n<p>That war in 2006 ended with the government of Israel and the government of Lebanon accepting the terms of UN Security Council Resolution 1701. That resolution called for the disarmament of all armed groups in Lebanon so that there will be no weapons or authority in the country other than that of the Lebanese state. A UN peacekeeping force, known as the United Nations Interim Force in Lebanon, or UNIFIL, was supposed to monitor the implementation of Security Council Resolution 1701 and ensure that Hezbollah disarmed and withdrew from the border area.</p>\n\n\n\n<p>It never happened. The Lebanese state grew weaker and Hezbollah grew stronger. Hezbollah has enough power in the Lebanese government that it can prevent any attempt to disarm it. The United Nations completely failed for 18 years to do anything to prevent Hezbollah from starting another war at a time and place of its choosing, which is exactly what happened. The United Nations failed, the United States failed, France failed—anyone who cared about what was going on in Lebanon failed. And now there’s a war going on.</p>\n\n\n\n<p>Israel has taken many steps to encourage the residents of southern Lebanon to move out of harm&#8217;s way—TV broadcasts, radio, SMS messages, leaflets, and social media posts. Residents of southern Lebanon understand that Hezbollah has turned southern Lebanon into a war zone, and it is not safe.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Criticism of UNIFIL&#8217;s Role</h4>\n\n\n\n<p>There is a group that hasn&#8217;t gotten the message about the fact that anyone in southern Lebanon now is in harm&#8217;s way. The group that hasn&#8217;t gotten the message is UNIFIL. Israel requested that UNIFIL move five kilometers away from the border; UNIFIL said no.</p>\n\n\n\n<p>I have a question: what are UN peacekeepers doing in Lebanon? I mean this question literally. What are they doing? What&#8217;s their day like? Do they have meetings? Do they do team-building exercises? Do they enjoy long lunch breaks? I can tell you what they aren&#8217;t doing—they aren&#8217;t keeping any peace.</p>\n\n\n\n<p>There&#8217;s a war going on now because the United Nations failed to disarm Hezbollah and push it away from the Israeli border. Hezbollah started a war and attacked Israelis from Lebanon while the so-called UN peacekeepers in Lebanon did nothing. Now these UN forces are caught in a war zone. Israel asked them to move out of harm&#8217;s way. They refused to leave. Their spokesman said it&#8217;s important for the UN flag to still fly high in this region.</p>\n\n\n\n<p>My question remains: what are UN peacekeepers doing in Lebanon? Give me your best answer in the comments.</p>\n\n\n\n<p>UNIFIL has said that five members of its forces have been injured in a few separate incidents in recent days. UNIFIL said an Israeli tank fired at their position, which wounded two, and in a separate incident, two others were injured in explosions near a UNIFIL observation tower. The exact circumstances of the incidents remain under investigation.</p>\n\n\n\n<p>I can guess what may be causing UNIFIL to get caught in the middle of the war between Israel and Hezbollah. Two months ago, Israel&#8217;s ambassador to the United Nations, Dan Danon, presented images at the UN Security Council that exposed how Hezbollah is launching rockets from areas next to UNIFIL bases. It&#8217;s in Hezbollah&#8217;s interest to draw Israeli fire to areas near UNIFIL positions. Hezbollah wants more international pressure on Israel to stop its defensive operations. Israel obviously has no interest in harming anyone from UNIFIL right now. I just don&#8217;t know what the UN forces are doing all day or what they plan to do differently in the future to ensure that Lebanon and Israel can live in peace.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hamas and Iranian Support</h4>\n\n\n\n<p>Finally today, an item you should all read: the New York Times has a story headlined <em>Secret Documents Show Hamas Tried to Persuade Iran to Join Its October 7th Attack.</em> The Times got their hands on—I assume the Israeli military gave it to them—the minutes of 10 meetings among Hamas&#8217;s leaders. The Times verified the authenticity of the minutes. The record shows Hamas&#8217;s preparations and considerations in the lead-up to the October 7th massacre. It shows that Hamas avoided several escalations since 2021 to trick Israel into thinking that it had been deterred.</p>\n\n\n\n<p>One reason that Hamas delayed its invasion was because it was seeking Iranian support for its war. In July 2023, Hamas dispatched a top official to Lebanon, where he met with a senior Iranian commander and requested help with striking sensitive sites in Israel. Hamas leaders in Gaza said they briefed Ismail Haniyeh on what they called the &#8220;big project.&#8221; Haniyeh lived in Qatar. Haniyeh knew about October 7th in advance.</p>\n\n\n\n<p>The bottom line: we already know Hamas wants to destroy Israel and annihilate the Jewish people. It won&#8217;t stop until it is stopped.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Q&amp;A Section</h4>\n\n\n\n<p><strong>Q1:</strong> <em>Why aren’t UNIFIL forces evacuating as they did during the Syrian Civil War?</em><br>I wish I knew the answer to this question. The UNIFIL spokesman himself was asked, &#8220;Why aren’t UNIFIL forces evacuating? Why aren’t they moving out of harm&#8217;s way?&#8221; And he gave the answer, which is he’s not the one setting UNIFIL policy. The UN’s policy is set by the United Nations and especially by the influential countries that are either part of the Security Council or sending their own citizens to be part of this UNIFIL force. So, we&#8217;re talking about France, Italy, Ireland, and many other countries. The spokesman of UNIFIL said it’s important that the UN flag continue to fly in Lebanon. He didn’t say why, didn’t say what they hope to accomplish—it just seems that they&#8217;re standing ground to make a point. Instead of doing anything to counter Hezbollah for almost two decades, finally they’ve decided to stand their ground against Israel, and perhaps that’s the reason.</p>\n\n\n\n<p><strong>Q2:</strong> <em>Are UNIFIL acting as a human shield for Hezbollah?</em><br>I wouldn’t go so far as to say that UNIFIL is acting as a human shield for Hezbollah, no, not at all. But what is happening is that UNIFIL has many positions in southern Lebanon. Southern Lebanon is also where Hezbollah has positions, and many of these positions are concealed—they’re difficult to spot from far away—and there are positions from which Hezbollah fires rockets into Israel. So wherever there is a Hezbollah position, wherever Hezbollah is sending rockets into Israel, it’s likely that that spot is going to be targeted by the Israel Defense Forces. So if such a position is near a UNIFIL position, that would put UNIFIL forces in danger. It’s not that the UNIFIL forces want to be in danger; it’s that Hezbollah wants to put them in danger.</p>\n\n\n\n<p><strong>Q3:</strong> <em>Are there internal IDF investigations about claims of war crimes? Does the criminal investigation division of the army check these claims?</em><br>The shortest answers that I can give you right now are yes and yes. This is part of the internal processes of the Israel Defense Forces, investigating claims of wrongdoing by its own soldiers. This is a process that takes time; it is in the middle of a war. Beyond that, I don’t have further details.</p>\n\n\n\n<p><strong>Q4:</strong> <em>My flight from a non-Israeli carrier was canceled. Should I try to come another way?</em><br>The people of Israel are always excited and happy to see flights with tourists arriving to Israel. I always say that the best way to stand with Israel is to stand in Israel—come to Israel, experience what life is like here, and how we’re dealing with the fact that 101 hostages still remain in Hamas’s terror dungeons, and the war goes on on seven different fronts. If you can find a flight into Israel and book a hotel, I recommend that you come. Unfortunately, I&#8217;m not able to serve as your travel agent, but I recommend trying Google Flights, seeing what you can find, and hoping for the best. Always take a look at El Al, the Israeli national carrier, because they have not canceled flights.</p>\n\n\n\n<p><strong>Q5:</strong> <em>How will Israel recover from the economic impact of the war?</em><br>It must be so hard for everyone, and this is our final question. It’s a question that I don’t have an answer to aside from the fact that we’re going to have to recover. There are so many more pressing questions right now, chief among them that there are 101 hostages in Hamas dungeons in Gaza, that there is a seven-front war going on. Israel is dealing with Gaza, Hezbollah in Lebanon, the West Bank, Syria, Iranian militias in Iraq, the Houthis in Yemen, and Iran itself—so there are seven fronts that we’re dealing with in a war. We have a hostage crisis; there’s a lot of things that we need to deal with, and we’ll only be able to address the day after&#8230; the day after.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>That’s all the time we have today for our live daily briefing. I thank you, everyone, for watching. You can find this online on YouTube, on the podcast platforms, wherever you are watching. We are live again tomorrow out of Israel at 3 p.m. Israel time—that’s 8 a.m. on the East Coast. I welcome you to follow me also on my personal platforms. You can look me up, Daniel Rubenstein, and also please follow all the platforms of the Israeli Citizen Spokesperson&#8217;s Office.</p>\n\n\n\n<p>This has been the live daily briefing. I’m Daniel Rubenstein. Have a lovely day.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> continues its multi-front conflict with Iranian-backed <a  href=\"/hezbollah\">Hezbollah</a> in Lebanon. In the latest developments, <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a> launched rockets toward Israeli cities, prompting Israeli military operations based on specific intelligence. Israel’s requests for UNIFIL’s withdrawal from the combat zone remain unheeded. Additionally, UNIFIL’s proximity to Hezbollah sites complicates its safety, as the IDF targets Hezbollah’s launch positions.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18067,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312
    ],
    "class_list": [
        "post-18317",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "en",
    "translations": {
        "en": 18317
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18317",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18317"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18317/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18318,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18317/revisions/18318"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18067"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18317"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18317"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18317"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}