{
    "id": 18406,
    "date": "2024-10-31T14:18:18",
    "date_gmt": "2024-10-31T12:18:18",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18406"
    },
    "modified": "2024-10-31T14:18:24",
    "modified_gmt": "2024-10-31T12:18:24",
    "slug": "why-antonio-guterres-standing-with-russia",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/why-antonio-guterres-standing-with-russia/",
    "title": {
        "rendered": "Why Antonio Guterres Standing with Russia?"
    },
    "content": {
        "rendered": "\n<p>UN Secretary-General Antonio Guterres’s recent actions are nothing short of a disgrace to the principles of global peace and justice that his office is meant to uphold. By choosing to attend the BRICS conference in Kazan, Russia, and shaking hands with Vladimir Putin—a war criminal pursued by the ICC for brutal assaults on Ukraine—Guterres has exposed a shocking disregard for democratic values. His refusal to attend the Ukraine-led peace summit in Switzerland amplifies this betrayal, aligning him with authoritarian regimes and signaling tacit support for some of the world’s most dangerous forces, including Iran and its sprawling terror network. In siding with oppressive powers, Guterres undermines the UN’s mission, empowering those who perpetuate violence, destabilize the Middle East, and threaten the very existence of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Guterres’s Position: A Shift Toward Authoritarian Regimes</h3>\n\n\n\n<p>Guterres’s participation at the BRICS summit, where he fraternized with Turkish President Erdogan, further illustrates a willingness to engage with leaders who have consistently acted against democratic values. Erdogan, notorious for his heavy-handed tactics in the Kurdish regions and illegal military incursions into Syria, has amplified regional tensions. Such meetings detract from the UN&#8217;s purpose of fostering peace and cooperation while aligning Guterres with regimes notorious for violating human rights and disregarding international borders.</p>\n\n\n\n<p>These alignments not only set a dangerous precedent for global diplomacy but also signal tacit support for Iran’s extensive web of terrorist proxies, who directly threaten Israel’s security. Iran, through its Revolutionary Guard Corps (IRGC), arms and funds groups like Hamas and Hezbollah, whose sole mission, as codified in their founding charters, is to dismantle Israel and execute terrorist attacks against civilians​.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Strengthening Iranian Influence and the Aftermath of the October 7 Massacre</h3>\n\n\n\n<p>Iran’s influence in the Middle East has surged as it supports violent factions operating from multiple fronts against Israel. Hamas’s recent massacre of over 1,000 Israeli civilians on October 7 was not a standalone incident but part of a broader Iranian strategy to destabilize the region and intimidate democracies through proxies like Hezbollah and Hamas. These organizations, driven by an extremist ideology, target not only Israel but also Western interests. The Hamas Charter of 1988 explicitly rejects any peace initiatives, affirming a permanent conflict with Israel​.</p>\n\n\n\n<p>As Guterres’s actions embolden regimes and groups tied to Iran, his decisions undercut efforts to isolate and counteract IRGC-backed entities. Notably, despite widespread international condemnation of Iran’s support for terrorist factions, Guterres’s choice to sidestep key forums for peace sends a message that resonates with Iran’s anti-Israel rhetoric and emboldens these hostile entities. This is evident as Iran continues to finance, arm, and train these groups to keep Israel perpetually under threat.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Undermining Israel’s Right to Defend Against Terrorism</h3>\n\n\n\n<p>Guterres’s alignment with BRICS undermines Israel’s sovereign right to self-defense. Israel currently faces a complex and unprecedented seven-front conflict, contending with threats from IRGC proxies in Gaza, Lebanon, Syria, Iraq, and even Yemen, where the Houthis—another Iranian ally—have expressed hostility toward Israel. These groups share a goal: to undermine Israeli security and stability through continuous aggression and terror tactics.</p>\n\n\n\n<p>Guterres’s public actions signal to Iran and its allies that their campaign against Israel may proceed without the risk of isolation or condemnation from influential global bodies like the United Nations. This implicitly encourages Hamas, Hezbollah, and their backers to continue escalating, threatening civilians and thwarting peace in the region. By alienating democratic nations while embracing authoritarian states, Guterres compromises the UN’s role as a balanced mediator and inadvertently supports a network of anti-Israel violence and extremism.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>UN Secretary-General Guterres’s choice to join BRICS and meet with Putin shows a dangerous disregard for democratic values, empowering oppressive regimes.</p>\n",
        "protected": false
    },
    "author": 47,
    "featured_media": 18407,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        1584,
        1340
    ],
    "class_list": [
        "post-18406",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-antonio-guterres",
        "tag-the-un"
    ],
    "lang": "en",
    "translations": {
        "en": 18406
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18406",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/47"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18406"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18406/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18408,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18406/revisions/18408"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18407"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18406"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18406"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18406"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}