{
    "id": 17993,
    "date": "2024-10-03T10:57:15",
    "date_gmt": "2024-10-03T07:57:15",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=17993"
    },
    "modified": "2024-10-03T10:57:20",
    "modified_gmt": "2024-10-03T07:57:20",
    "slug": "why-antonio-guterres-loves-iran",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/why-antonio-guterres-loves-iran/",
    "title": {
        "rendered": "Why António Guterres Loves Iran"
    },
    "content": {
        "rendered": "\n<p>António Guterres, the Secretary-General of the United Nations, has repeatedly demonstrated a troubling affection for the Iranian regime—a regime that stands as the world&#8217;s leading state sponsor of terrorism. Under his leadership, the UN has increasingly turned a blind eye to Iran’s blatant acts of aggression, terror sponsorship, and destabilization of the Middle East. While Iran orchestrates terror across the region, Guterres shields its actions, portraying Iran not as the villain but as a misunderstood actor.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ignoring Iran’s Terror Machine</h3>\n\n\n\n<p>Iran’s fingerprints are all over the violence plaguing the Middle East. From funding Hamas in Gaza to arming Hezbollah in Lebanon and deploying militias in Syria and Iraq, Iran’s terror proxies relentlessly target Israel and destabilize neighboring countries. Yet, time and again, António Guterres avoids condemning Iran for these acts of war. In fact, he often pretends that Iran’s role in these conflicts simply doesn’t exist.</p>\n\n\n\n<p>Instead of calling out the Islamic Republic for its relentless support of terror, Guterres shifts focus to criticizing Israel whenever it defends itself. Whether it’s Hezbollah launching rockets from Lebanon or Hamas committing atrocities in southern Israel, Guterres consistently overlooks Iran’s role in pulling the strings. He offers no criticism of Iran&#8217;s Quds Force, the arm of the Islamic Revolutionary Guard Corps (IRGC) responsible for exporting terror across the globe. Rather than exposing Tehran’s terror machine, Guterres seems determined to protect it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Deafening Silence on Iranian Missile Strikes</h3>\n\n\n\n<p>Perhaps the most glaring example of Guterres&#8217; affinity for Iran came in October 2024, when Iran launched over 200 ballistic missiles at Israel, aiming to kill millions of civilians. This was a direct, unprovoked act of war. And what was Guterres’ response? Silence. Not a word of condemnation for Iran’s brazen attempt to wipe Israeli cities off the map. Instead, Guterres immediately called for a ceasefire, as if Israel’s defensive measures against a genocidal regime were the problem.</p>\n\n\n\n<p>By refusing to denounce Iran for such an extreme act of aggression, Guterres made it clear where his loyalties lie. He will condemn Israel for defending itself, but when Iran tries to commit mass murder, Guterres barely flinches. This blatant double standard reveals an alarming bias in favor of the mullahs in Tehran.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The UN Shielding Iran’s Proxies</h3>\n\n\n\n<p>It’s no secret that Iran pulls the strings behind most of the terror targeting Israel. Groups like Hamas, Hezbollah, and the Houthis are essentially Iranian extensions, carrying out the regime’s agenda while wreaking havoc across the region. Yet, whenever Israel retaliates against these terror proxies, Guterres and the UN rush to issue condemnations of Israel’s actions, while remaining silent on the provocations by Iran and its militias.</p>\n\n\n\n<p>Guterres has become an apologist for Iran’s terror network, acting as though Israel’s retaliations occur in a vacuum, with no mention of the years of missile attacks, suicide bombings, and kidnappings perpetrated by these Iranian-backed groups. Every time he condemns Israel for striking back, Guterres gives Tehran more breathing room to continue funding and arming terror without consequence.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Empowering Iran on the World Stage</h3>\n\n\n\n<p>Under Guterres’ leadership, the UN has also been astonishingly soft on Iran’s nuclear ambitions. Despite clear evidence of Iran’s violations of international agreements and its pursuit of nuclear weapons, Guterres consistently downplays the threat. His unwillingness to confront Iran’s nuclear aspirations not only emboldens the regime but endangers the entire region. A nuclear-armed Iran would be a catastrophic development for global security, yet Guterres treats the regime as though it&#8217;s simply misunderstood rather than an imminent threat.</p>\n\n\n\n<p>By refusing to take a hard line against Iran, Guterres allows the regime to act with impunity. Whether it&#8217;s nuclear escalation, terror funding, or ballistic missile attacks, Iran knows that it will face little to no pushback from the United Nations as long as António Guterres is in charge.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Guterres’ Dangerous Affinity for Iran</h3>\n\n\n\n<p>António Guterres’ record speaks for itself: he consistently shields Iran from international scrutiny while condemning those who defend themselves against Iranian-backed terror. His refusal to hold Iran accountable, even in the face of its most heinous actions, reveals a disturbing level of favoritism towards the regime. Under his leadership, the United Nations has become a platform for Iran to expand its influence, spread terror, and destabilize the Middle East—all without fear of repercussions.</p>\n\n\n\n<p>In siding with Iran, Guterres betrays not only Israel but every nation threatened by Iran’s growing web of terror. His willingness to ignore Iran’s atrocities and aggression is not just a dereliction of duty; it’s an endorsement of the Iranian regime’s quest for dominance. By allowing Iran to operate unchecked, António Guterres is showing the world where his true sympathies lie—with Tehran, not with the victims of its terror.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/antonio-guterres/\">António Guterres</a>’ record speaks for itself: he consistently shields <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> from international scrutiny while condemning those who defend themselves against Iranian-backed terror. </p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17991,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        1584,
        1340
    ],
    "class_list": [
        "post-17993",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-antonio-guterres",
        "tag-the-un"
    ],
    "lang": "en",
    "translations": {
        "en": 17993
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17993",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=17993"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17993/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17994,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/17993/revisions/17994"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17991"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=17993"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=17993"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=17993"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}