{
    "id": 18127,
    "date": "2024-10-06T15:00:00",
    "date_gmt": "2024-10-06T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18127"
    },
    "modified": "2024-10-12T11:21:31",
    "modified_gmt": "2024-10-12T08:21:31",
    "slug": "why-israel-must-strike-iran-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/why-israel-must-strike-iran-ruth-wasserman-lande/",
    "title": {
        "rendered": "Why Israel Must Strike Iran | Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Why Israel Must Strike Iran | Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/kEgyj7SKBTY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Tomorrow we&#8217;ll be hosting a special event to commemorate one year since the October 7th Massacre. Elon Levy and IDF captain in reserves Maya Bentt will be going live at 6:29 p.m. Eastern time (that&#8217;s 1:29 a.m. in Israel). It is very worthwhile to watch. We want to ensure that our audience in the Western Hemisphere can participate in this important and moving event.</p>\n\n\n\n<p>This event will be an opportunity for friends of Israel to connect with each other, remember the lives that were lost, listen to survivors, and share a vision for a better future. Please check our social media platforms for more information.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Update on Middle East Developments</h4>\n\n\n\n<p>Meanwhile, there&#8217;s a lot happening in the Middle East, and the whole world needs to understand what is about to happen. Some ask why Israel responded as it did. A few days ago, the Islamic Republic of Iran actually fired 180 ballistic missiles at Israel. Iran and its proxies have been attacking Israel for the past year on seven different fronts.</p>\n\n\n\n<p>De-escalation actually means that the Islamic Republic of Iran can fire ballistic missiles whenever it wants without any consequences. But there will be significant Israeli responses to Iran&#8217;s attack. It’s not a matter of if Israel responds, but when and how.</p>\n\n\n\n<p>The Iranian regime, which calls for Israel to be destroyed, chose war, and there are consequences for that choice. In fact, the Iranian regime has been waging war on Israel’s people for years, long before October 7th, while stating they want to destroy Israel since the 1979 revolution.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Iran’s Nuclear Threat</h4>\n\n\n\n<p>The Islamic Republic is also racing towards a nuclear bomb, which would give it the capability to carry out its threats. Israel cannot and will not allow a regime that wants to destroy it to acquire the means to do so. Imagine if Iran had a nuclear weapon on October 7th.</p>\n\n\n\n<p>Until 1979, Israel and Iran were at peace. Israelis and Iranians have much in common. Inshallah, one day Iran’s theocratic regime will fall, and the people of Iran and Israel will again be able to connect. Until that day comes, like every country, Israel has the right and responsibility to protect its people from murder.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Developments in Gaza</h4>\n\n\n\n<p>In recent hours, there have been dramatic developments in Gaza. The IDF announced that it is expanding the humanitarian zone in southern Gaza, where civilians can go to receive food, water, medicine, and shelter. This expansion is due to Hamas attempting to reestablish itself in northern Gaza.</p>\n\n\n\n<p>The IDF has urged Palestinians who remain in northern Gaza to move south for their own safety, as it prepares to carry out operations in northern Gaza. The IDF does not want any civilians to be in harm’s way—exactly the opposite of what is being said in the international media.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hamas and Hostages</h4>\n\n\n\n<p>The big question on everyone’s mind is the fate of Hamas leader Yahya Sinwar. He has not communicated with the outside world for some time now but is reportedly holding Israeli hostages as human shields, quietly awaiting a wider regional war to save him. American officials have said that Sinwar has hardened his stance in recent weeks and has no intention of reaching a deal to free the remaining hostages in Hamas&#8217; terror dungeons.</p>\n\n\n\n<p>As long as Hamas remains in power in Gaza and holds Israeli hostages, expect Israeli military operations to continue. It’s time for the world to apply more pressure on Hamas and its patrons—Iran, Turkey, and Qatar—until Hamas lays down its weapons and frees the hostages.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section:</h3>\n\n\n\n<h4 class=\"wp-block-heading\">Terror Attack in Be&#8217;er Sheva</h4>\n\n\n\n<p><strong>Question:</strong> There’s breaking news: nine hurt, one critically, in a terror attack at Be&#8217;er Sheva Central Bus Station. What are your thoughts on this, and what is the threat to the people of Israel from terrorists?</p>\n\n\n\n<p><strong>Answer:</strong> First of all, I’m praying and hoping for the recovery of those hurt, and my condolences go to the families who have lost loved ones. This is something we in Israel face all the time. The Iranian Islamic Republic encourages this violence, smuggling weapons via Jordan into the West Bank for Palestinian commandos and jihadis. Despite Israel&#8217;s extensive security apparatus, some attacks get through. Unfortunately, we have faced this in the past and will continue to face it as long as the Iranian regime of terror exists.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hezbollah Rocket Attacks</h4>\n\n\n\n<p><strong>Question:</strong> The IDF recently announced drone attacks from Hezbollah and 25 rockets from Lebanon. What is your assessment of the situation in Lebanon and IDF operations there?</p>\n\n\n\n<p><strong>Answer:</strong> IDF operations in Lebanon are focused on defending Israeli civilians. Thousands of rockets are being fired daily at northern Israeli cities like Acre and Haifa. Imagine being in a shelter 17 times a day just to protect yourself and your family. Hezbollah is an army, funded and trained by Iran, with thousands of commandos and rockets. Despite the IDF’s success in striking Hezbollah, the group remains a significant threat. Israel will continue defending its civilians to allow the displaced people in the north to safely return home.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hamas Stealing Humanitarian Aid</h4>\n\n\n\n<p><strong>Question:</strong> What can be done to prevent Hamas from stealing humanitarian aid?</p>\n\n\n\n<p><strong>Answer:</strong> That’s a brilliant question. Hamas has been stealing humanitarian aid and using it to maintain its power, redistributing it to control the population. They resell food, water, and medicine—aid given freely by international efforts. They also keep civilians above ground while they shelter in tunnels. The IDF needs to ensure humanitarian aid reaches the people, while preventing Hamas from exploiting it.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Arms Embargo by France</h4>\n\n\n\n<p><strong>Question:</strong> French President Emmanuel Macron has called for an arms embargo on Israel. How will this affect Israel, and what can be done to ensure self-sufficiency in arms production?</p>\n\n\n\n<p><strong>Answer:</strong> One lesson from the October 7th war is that Israel needs to be more self-sufficient in weapons production. The arms embargo from France, and pressure from other nations, is a political move, not based on understanding the situation. Israel is fighting a global war on seven fronts. France is on the wrong side of history by giving in to radical Islamist pressure. It’s shameful.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Israeli Response to Iranian Aggression</h4>\n\n\n\n<p><strong>Question:</strong> What can we expect from Israel in response to Iranian aggression? Will it be a tactical response or something more significant?</p>\n\n\n\n<p><strong>Answer:</strong> It appears that a significant response will be forthcoming. Israel needs to place the Iranian regime in its place. No sovereign state can allow its civilians to be bombarded with no consequences. A proper, significant retaliation is inevitable.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Commemorating October 7th</h4>\n\n\n\n<p><strong>Question:</strong> Tomorrow marks one year since the October 7th Massacre. What should our audience know about this anniversary?</p>\n\n\n\n<p><strong>Answer:</strong> All Jewish people, and everyone hurt by the events of October 7th, should hold their heads up high. We have nothing to be ashamed of. Israel is fighting a war for the Free World, standing up for values against an evil regime. We should be proud of our courageous people and those who stand with us on the right side of history.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Tomorrow, a special event will be held to commemorate one year since the <a  href=\"https://iron-swords.co.il/c/october-7th/\">October 7th Massacre</a>, featuring Elon Levy and IDF Captain Maya Bentt. The live event will focus on honoring those lost, hearing survivors&#8217; stories, and envisioning a better future. <a  href=\"https://iron-swords.co.il/c/updates/\">Updates</a> on the Middle East, including Israeli responses to Iranian aggression and developments in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, will also be discussed.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 17996,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-18127",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 18127
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18127",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18127"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18127/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18128,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18127/revisions/18128"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/17996"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18127"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18127"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18127"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}