{
    "id": 16053,
    "date": "2024-04-26T00:00:00",
    "date_gmt": "2024-04-25T21:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/26-04-2024/"
    },
    "modified": "2024-08-27T22:33:16",
    "modified_gmt": "2024-08-27T19:33:16",
    "slug": "26-04-2024",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/aid/26-04-2024/",
    "title": {
        "rendered": "Israel Aid and Humanitarian Efforts in Gaza: Apr. 26, 2024"
    },
    "content": {
        "rendered": "<h1>Latest Humanitarian Aid Updates for Gaza (April 25-26, 2023)</h1>\n<h2>Aid Truck Distribution</h2>\n<p>344 aid trucks were inspected and transferred to the Gaza Strip yesterday (Apr. 25). Out of these, 214 trucks were distributed within Gaza, including 151 trucks loaded with food. Currently, the contents of 300 aid trucks are waiting on the Gazan side of Kerem Shalom to be collected by <strong>UN aid agencies</strong>.</p>\n<h2>Airdrops and Additional Aid</h2>\n<p>Airdrops are actively contributing to aid efforts, with <strong>199 pallets</strong> containing tens of thousands of packages of food aid airdropped over northern Gaza yesterday (Apr. 25). Additionally, 100 food aid trucks were coordinated to northern Gaza via humanitarian corridors on the same day.</p>\n<p>Furthermore, 4 tankers of cooking gas and 2 tankers of fuel intended for the operation of essential infrastructure in Gaza successfully entered the territory on Apr. 25. In another initiative, 65 trucks were coordinated via the Jordanian Route.</p>\n<p>From the Ashdod Port program, 8 trucks of flour were coordinated for entry into Gaza on Apr. 25.</p>\n<h2>Coordination and Approval Statistics</h2>\n<p>On Apr. 25, out of 46 general coordination requests, 39 (85%) were approved. Specifically, 12 UN requests for coordination were submitted, with 9 approved. Additionally, 16 requests for coordination to northern Gaza were made, leading to 12 (75%) approvals. Since January 1, 2024, 87% of all coordination requests have been approved.</p>\n<h2>Bakeries and Evacuations</h2>\n<p>Currently, 26 bakeries are operational in Gaza, providing nearly 5 million breads, rolls, and pita breads daily. Thus far, 3,204 injured and sick individuals, along with 725 escorts, have been evacuated from the strip. Additionally, 27 foreign nationals were scheduled to leave Gaza yesterday (Apr. 25).</p>\n<h2>Humanitarian Aid Pauses</h2>\n<p>The repair of vital infrastructure is underway. On April 26, between 10:00 and 14:00, the IDF will pause operations in the Rafah refugee camp to facilitate the movement of humanitarian aid.</p>\n<h2>Medical Supplies Delivery</h2>\n<p>Since the onset of the war, more than <strong>21,700 tons</strong> of medical supplies have entered the Gaza Strip to support the medical response for civilians. These supplies have been distributed across various hospitals and clinics, including those in northern Gaza.</p>\n<p>The COGAT has established a designated team in coordination with the Ministry of Health, the Ministry of Foreign Affairs, and other security forces, to promote medical initiatives. A daily humanitarian assessment is conducted with representatives from international organizations and Israeli healthcare professionals.</p>\n<p>A prioritized list of essential medical supplies for the Gaza Strip has been compiled by this team, based on the needs identified by the medical staff on the ground. A full list can be found here.</p>\n<h2>Medical Efforts and Airdrops</h2>\n<p>6,700 pallets of medical supplies were airdropped by the Hashemite Kingdom of Jordan in coordination with Israel, with the latest drop occurring on Feb. 5. Additionally, packages of medical supplies were airdropped by both Jordan and France, as well as by Jordan and The Netherlands.</p>\n<p>On Nov. 24, following the IDF&#8217;s offer of humanitarian assistance to the director general of the Shifa Hospital, the IDF transferred 3 incubators, 100 packages of baby formula, and 14 boxes of medical supplies to the hospital. This assistance came in addition to 300 liters of fuel, which Hamas prevented from being accepted at the hospital.</p>\n<p>In total, over 2.5 million doses of vaccines for <em>diphtheria</em>, <em>tetanus</em>, <em>whooping cough</em>, and <em>hepatitis B</em> have been distributed in Gaza.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Aid trucks and medical supplies delivered to <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>; operations ongoing.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 15696,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        1338
    ],
    "tags": [
        1352
    ],
    "class_list": [
        "post-16053",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-aid",
        "tag-daily-humanitarian-aid-update"
    ],
    "lang": "en",
    "translations": {
        "en": 16053,
        "he": 16054,
        "ru": 16055
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16053",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=16053"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16053/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16056,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16053/revisions/16056"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/15696"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=16053"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=16053"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=16053"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}