{
    "id": 3482,
    "date": "2024-04-03T20:09:18",
    "date_gmt": "2024-04-03T17:09:18",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9331/"
    },
    "modified": "2024-04-03T20:09:18",
    "modified_gmt": "2024-04-03T17:09:18",
    "slug": "9331",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9331/",
    "title": {
        "rendered": "&#8220;IDF Chief of Staff Prioritizes Release of Kidnappees: The Strategy and On-Ground Actions Explained&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The Chief of Staff Bahan Yunes: Achieving a deal to release the kidnappees is a top priority. It can only come from increasing pressure, and we will pressure as much as necessary.</p>\n<p>The Chief of Staff visited Khan Yunis today (Wednesday) and conducted a situation assessment with the commander of the Southern Command, Major General Yaron Finkelman, the commander of Brigade 98, Brigadier General Dan Goldfus, the commander of the Commando formation, Brigadier General Omer Cohen, and other commanders.</p>\n<p>During the visit, he spoke with commanders and soldiers of the commando unit, presented them with the operational situation, and praised them for their fighting and actions in the Gaza Strip.</p>\n<p>Attached is a video of the Chief of Staff&#8217;s remarks: https://bit.ly/3xwHmsQ</p>\n<p>Attached is a video on the topic: https://bit.ly/3TLmu8H</p>\n<p>Attached are photos on the topic: https://idfanc.activetrail.biz/ANC0304245141</p>\n<p>The complete remarks are attached: &#8220;On Sunday we came out of Shifaa, you are still here. We continue to pressure, both to deepen the achievement, and to try and push forward in the negotiations, to reach a deal to release the kidnappees, this is a top priority, very important. It can only come from increasing pressure, and we will increase pressure, as much as necessary. We will increase the pressure, you are doing this excellently. Another battalion dismantling, another slain commander, another destroyed infrastructure, this is the way to cause pressure that will eventually lead to the release of the kidnappees. One thing is sure &#8211; as long as you keep doing what you&#8217;re doing, our ability and the national ability to solve these things in a better way is significantly higher, keep going strong, keep bringing good achievements, an end to a procedure, a quality battle drill and move forward&#8221;.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The Chief of Staff Bahan Yunes: Achieving a deal to release the kidnappees is a top priority. It can only come from increasing pressure, and we will pressure as much as necessary. The Chief of Staff visited Khan Yunis today (Wednesday) and conducted a situation assessment with the commander of the Southern Command, Major General Yaron Finkelman, the commander of Brigade 98, Brigadier General Dan Goldfus, the commander of the Commando formation, Brigadier General <a  href=\"https://iron-swords.co.il/t/omer/\">Omer</a> Cohen, and other commanders. During the visit, he spoke with commanders and soldiers of the commando unit, presented them with the operational situation,</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3482",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3482
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3482",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3482"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3482/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3482"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3482"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3482"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}