{
    "id": 3477,
    "date": "2024-04-04T13:18:39",
    "date_gmt": "2024-04-04T10:18:39",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9336/"
    },
    "modified": "2024-04-04T13:18:39",
    "modified_gmt": "2024-04-04T10:18:39",
    "slug": "9336",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9336/",
    "title": {
        "rendered": "&#8220;Joint IDF, ISA, and Police Operation: Thwarting Terror in Judea, Samaria and Jordan Valley &#8211; 20 Arrests, Multiple Weapons Seized&#8221;"
    },
    "content": {
        "rendered": "<p>Joint message to the IDF spokesperson and the police spokespersons:</p>\n<p>Tonight, the IDF, the ISA (Israel Security Agency), and the Judea and Samaria Division worked in a joint operation to combat terror in Jenin, during which they eliminated a wanted man, arrested two, and confiscated weapons in the area. 20 wanted individuals were arrested across Judea and Samaria, and in the Jordan Valley and Valleys Brigade.</p>\n<p>IDF soldiers, Border Police, and ISA forces worked tonight to arrest 20 wanted individuals across Judea and Samaria, and in the Jordan Valley and Valleys Brigade.</p>\n<p>In an operation to thwart terror in the Jenin area, of the Menashe Brigade, Border police of Judea and Samaria operated to arrest a wanted man. After he tried to escape, the forces fired at him and neutralized him. The soldiers arrested two wanted individuals and located and confiscated a &#8220;M16&#8221; type weapon and a handgun.</p>\n<p>Additionally, in the same operation, undercover units of the Judea and Samaria Division identified a terrorist who threw an explosive device at the forces and fired at him, neutralizing him.</p>\n<p>In an operation by the Battalion in the Za&#8217;atara area, in the Etzion Brigade, the soldiers arrested two wanted individuals and investigated many suspects. The soldiers located and confiscated two handguns and another weapon.</p>\n<p>In the Bido area of the Binyamin Brigade, the soldiers arrested a wanted man and investigated many suspects. In Beit Ijza, in the division&#8217;s area, IDF soldiers located and confiscated weapons.</p>\n<p>In the Qalqilya region of the Ephraim Brigade, the soldiers located and confiscated many weapons, including firearms and explosives.</p>\n<p>The arrested wanted individuals and confiscated weapons were handed over for further handling by the security forces. There were no casualties among our forces.</p>\n<p>So far since the beginning of the war, approximately 3,700 wanted individuals have been arrested across the Judea and Samaria Division and in the Jordan Valley and Valleys Brigade. About 1,600 of them are affiliated with the Hamas terror organization.</p>\n<p>Attached are photos from the IDF forces&#8217; operation across Judea and Samaria: https://idfanc.activetrail.biz/ANC04042024658587</p>\n<p>Attached is documentation from the forces&#8217; operation: https://bit.ly/4cCBcI1</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Joint message to the <a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a> and the police spokespersons: Tonight, the IDF, the ISA (<a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> Security Agency), and the <a  href=\"https://iron-swords.co.il/t/judea-and-samaria-division/\">Judea and Samaria Division</a> worked in a joint operation to combat terror in Jenin, during which they eliminated a wanted man, arrested two, and confiscated weapons in the area. 20 wanted individuals were arrested across Judea and Samaria, and in the Jordan Valley and Valleys Brigade. IDF soldiers, Border Police, and ISA forces worked tonight to arrest 20 wanted individuals across Judea and Samaria, and in the Jordan Valley and Valleys Brigade. In an operation to thwart terror in the</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3477",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3477
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3477",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3477"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3477/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3477"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3477"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3477"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}