{
    "id": 3469,
    "date": "2024-04-05T14:38:04",
    "date_gmt": "2024-04-05T11:38:04",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9344/"
    },
    "modified": "2024-04-05T14:38:04",
    "modified_gmt": "2024-04-05T11:38:04",
    "slug": "9344",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9344/",
    "title": {
        "rendered": "&#8220;Analyzing the IDF&#8217;s Response: The Abduction and Tragic Loss of Efrat Katz during the October 7 Hamas Attack on Kibbutz Nir Oz&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Summary of the findings of the conduct of the Air Force during the abduction of Efrat Katz z&#8221;l on October 7 from Kibbutz Nir Oz</p>\n<p>The findings of the examination of the Air Force&#8217;s functioning during the abduction of Efrat Katz z&#8221;l from her home at Kibbutz Nir Oz, during the surprise murderous attack led by the Hamas terror organization on October 7, were presented today (Friday) to her family and the families of the abductees involved in the incident.</p>\n<p>The examination was conducted by a special team established under the guidance of the Air Force commander, in order to examine the issue, parallel to the in-depth investigations of all combat events on 07/10. The examination was based on attack footage from a combat helicopter fighting in Gaza at that time, remotely piloted aircraft, the security cameras of Kibbutz Nir Oz, and on the testimonies of air crews operating in the area, as well as Efrat Katz&#8217;s z&#8221;l family members and additional witnesses who were on site at the time of the event.</p>\n<p>On October 7, the IDF failed to protect citizens and went to war. During the surprise attack, Hamas and other terror organizations invaded several Israeli settlements, killing Israeli and foreign civilians.</p>\n<p>The findings of the examination reveal that during the battles and airstrikes, one of the combat helicopters that participated in the fighting, fired at a vehicle carrying terrorists, which it later turned out based on testimonies, also had abductees in it.<br />\nAs a result of the shooting, most of the terrorists who manned the vehicle were killed, and apparently also Efrat Katz z&#8221;l.</p>\n<p>The team&#8217;s findings imply that as long as there were Israeli abductees in the moving vehicle, they could not be identified by the existing observation systems, and that the gunfire was defined as firing on a vehicle with terrorists.</p>\n<p>The Air Force commander, Major General Tomer Bar, summarized the findings of the event and emphasized that the Air Force conducted a thorough and transparent investigation, out of a deep commitment to the bereaved family and the families of the abductees.<br />\nHe also accepted the team&#8217;s examination results while noting that the findings relate to the Air Force&#8217;s part in this event.<br />\nThis is a tragic and sad event that occurred during intense fighting under uncertain conditions. The Air Force commander found no fault in the helicopter team&#8217;s actions, which operated according to commands under a complex wartime reality.</p>\n<p>The investigation team&#8217;s findings were presented to the bereaved family and the families of the abductees. The IDF shares the sorrow of the Katz family and the Nir Oz community.<br />\nAlongside the continuation of the war, the IDF continues investigating the events of 07/10, including the events in Nir Oz. At their end, the findings will be presented transparently to the public.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Summary of the findings of the conduct of the Air Force during the abduction of Efrat Katz z&#8221;l on October 7 from Kibbutz <a  href=\"https://iron-swords.co.il/t/nir-oz/\">Nir Oz</a> The findings of the examination of the Air Force&#8217;s functioning during the abduction of Efrat Katz z&#8221;l from her home at Kibbutz Nir Oz, during the surprise murderous attack led by the <a  href=\"/hamas\">Hamas</a> <a  href=\"https://iron-swords.co.il/t/terror-organization/\">terror organization</a> on October 7, were presented today (Friday) to her family and the families of the abductees involved in the incident. The examination was conducted by a special team established under the guidance of the Air Force commander, in</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3469",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3469
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3469",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3469"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3469/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3469"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3469"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3469"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}