{
    "id": 3461,
    "date": "2024-04-06T20:38:55",
    "date_gmt": "2024-04-06T17:38:55",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9352/"
    },
    "modified": "2024-04-06T20:38:55",
    "modified_gmt": "2024-04-06T17:38:55",
    "slug": "9352",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9352/",
    "title": {
        "rendered": "&#8220;IDF&#8217;s Persistent War Against Gaza Strip Tunnels: A Detailed Account of Three Major Operations&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The IDF continues to destroy underground infrastructures in the Gaza Strip; 3 tunnels were demolished in the Khan Yunis Brigade area.</p>\n<p>Since the beginning of the &#8220;Iron Blades&#8221; war, the IDF has been operating against underground infrastructures in the Gaza Strip. In recent months, IDF forces led by the 98th Division and the Yahalom Unit have been involved in locating, mapping, and destroying tunnels in the Hamas Khan Yunis brigade area. As part of this operation, 3 offensive tunnels were discovered through intelligence and technological tracking by the IDF in recent years, and following a focused ground operation, they were mapped and destroyed. The operation was carried out in coordination between the Engineering Corps of the Southern Command, the Gaza Division, the 98th Division, and the Yahalom Unit.</p>\n<p>One of the tunnels was exposed about a decade ago, and during the 2021 &#8220;Guardian of the Walls&#8221; operation, it was attacked from the air and several Hamas terrorists were killed there. At the beginning of the war, it was attacked at several points to prevent offensive operations, and in recent weeks it was destroyed by an explosive.</p>\n<p>Another tunnel was exposed in 2014 as a terror tunnel that crossed into Israeli territory and was destroyed. The terrorist organization Hamas has not rebuilt the tunnel since, and in recent weeks, another section of the tunnel has been destroyed by an explosive deep inside the Strip.</p>\n<p>The third tunnel that was destroyed in recent weeks was exposed in 2019, before the establishment of the underground barrier when one branch of the tunnel crossed several hundred meters into Israeli territory. The branch was under full operational and intelligence control by the IDF since then, with sensors and charges placed in it with the intention of assisting the IDF if needed, as part of a special operation against the underground system of the terrorist organization Hamas. Since the beginning of the war, the tunnel was attacked numerous times, alongside other actions that neutralized the branch that crossed into Israeli territory. The tunnel did not serve to slaughter on 7/10 and was controlled by observation and fire throughout the war.</p>\n<p>The IDF will continue to take action to destroy all the tunnels in the Strip and to denounce the capabilities of terrorist organizations, led by Hamas, to harm the citizens of Israel.</p>\n<p>Attached is documentation from the destruction of the tunnels: https://bit.ly/3J6s015</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The IDF continues to destroy underground infrastructures in the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip; 3 tunnels were demolished in the Khan Yunis Brigade area. Since the beginning of the &#8220;Iron Blades&#8221; war, the IDF has been operating against underground infrastructures in the Gaza Strip. In recent months, IDF forces led by the 98th Division and the Yahalom Unit have been involved in locating, mapping, and destroying tunnels in the <a  href=\"/hamas\">Hamas</a> Khan Yunis brigade area. As part of this operation, 3 offensive tunnels were discovered through intelligence and technological tracking by the IDF in recent years, and following a focused ground operation,</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3461",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3461
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3461",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3461"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3461/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3461"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3461"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3461"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}