{
    "id": 3400,
    "date": "2024-04-12T09:40:29",
    "date_gmt": "2024-04-12T06:40:29",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9414/"
    },
    "modified": "2024-09-04T21:50:18",
    "modified_gmt": "2024-09-04T18:50:18",
    "slug": "9414",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9414/",
    "title": {
        "rendered": "&#8220;IDF and Shin Bet Neutralize Key Hamas Officials: A Blow to Terror in Jabalya&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The IDF and Shin Bet have eliminated the internal security chief in Jabalya area of the Hamas terrorist organization; Brigade 162 soldiers continue to operate in the central strip</p>\n<p>An aircraft of the Air Force, in collaboration with the Gaza Division and Shin Bet, attacked and eliminated yesterday (Thursday) Ridwan Mohammed Abdullah Ridwan, internal security chief in the Jabalya area of the Hamas terrorist organization, who also served as an activist in the military arm of the organization. Ridwan was involved in instructing terrorist organization operatives and directed several hijackings of armed terrorists by humanitarian aid trucks in the northern part of the strip. His elimination damages <a href=\"https://iron-swords.co.il/hamas/\"  data-wpil-monitor-id=\"36\">Hamas&#8217;s</a> ability to harm and take over humanitarian aid in the Jabalya area.</p>\n<p>In addition, Hamad Mohammed Ali Ahmad, a commander in the military arm of the Hamas terrorist organization who simultaneously served as operations chief in the organization&#8217;s internal security in Jabalya, and another Hamas activist from the Jabalya battalion, were eliminated yesterday (Thursday).</p>\n<p>Soldiers of the Combat Team of Brigade 401 and the Nahal Artillery Brigade, alongside other units under the command of Brigade 162, continue the targeted operation to eliminate terrorists and destroy terror infrastructure in the central Gaza Strip.</p>\n<p>As part of the operation, the soldiers have eliminated several terrorists in face-to-face battles and in airstrike attacks by the Air Force in the past day. The forces located and destroyed underground rocket-launching positions, as well as several launchers ready for firing, which were used by terrorist organizations in the Strip. Simultaneously, the soldiers raided terrorist infrastructure, where they located military equipment of the terrorist organization PIJ.</p>\n<p>In the past day, combat planes of the Air Force attacked more than 60 terror targets in the Gaza Strip, including underground rocket-launching positions, terror infrastructure, and military buildings where armed terrorists from terror organizations operated. Simultaneously, the 215 Artillery Brigade force attacked multiple terror infrastructures with artillery fire as part of the force&#8217;s operations in the central strip.</p>\n<p>Attached are pictures of IDF forces operating in the strip: https://IDFANC.activetrail.biz/ANC12042024346638396</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The IDF and Shin Bet have eliminated the internal security chief in Jabalya area of the <a  href=\"/hamas\">Hamas</a> terrorist organization; Brigade 162 soldiers continue to operate in the central strip An aircraft of the Air Force, in collaboration with the <a  href=\"https://iron-swords.co.il/t/gaza-division/\">Gaza Division</a> and Shin Bet, attacked and eliminated yesterday (Thursday) Ridwan Mohammed Abdullah Ridwan, internal security chief in the Jabalya area of the <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> terrorist organization, who also served as an activist in the military arm of the organization. Ridwan was involved in instructing terrorist organization operatives and directed several hijackings of armed terrorists by humanitarian aid trucks in</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3400",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3400
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3400",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3400"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3400/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17458,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3400/revisions/17458"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3400"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3400"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3400"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}