{
    "id": 2779,
    "date": "2024-04-06T20:00:00",
    "date_gmt": "2024-04-06T17:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=2779"
    },
    "modified": "2024-05-30T13:18:25",
    "modified_gmt": "2024-05-30T10:18:25",
    "slug": "idf-spokesman-update-06-04-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-06-04-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 06.04, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 06.04, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/zNfMN3Cvj7M?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Rescue Operation Overview</strong></h2>\n\n\n\n<p>Last night, following intelligence from Shin Bet and Mossad, IDF commando units successfully recovered the body of the kidnapped Eldad Katzir, may his memory be a blessing, from a parking area. Eldad was brutally killed by Islamic Jihad terrorists along with Hana, who was released from captivity and has returned home to Israel. According to our intelligence, Eldad was murdered by his captors in January. This morning, IDF representatives delivered this somber news to Eldad’s family, participating in their grief during this difficult time.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Family and Community Response</strong></h2>\n\n\n\n<p>I spoke with Karmi, Eldad’s sister, who shared her profound sorrow and concern for the condition of other hostages, emphasizing that every moment is critical for them. There are 133 hostages in Gaza, and we are committed to doing everything in our power to bring them home. We will not miss any opportunity to fulfill this paramount mission.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Ongoing Combat Operations</strong></h2>\n\n\n\n<p>IDF forces continue to engage in combat throughout the Gaza Strip. In the south, Brigade 98 is actively fighting in the parking areas and has focused its efforts in the Almal neighborhood in recent weeks. The battles are sometimes fierce, including face-to-face combat where terrorists are eliminated. Beyond the ground combat, we also conduct aerial operations across the neighborhood and parking areas.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Tunnel Destruction</strong></h2>\n\n\n\n<p>Currently, we are completing the destruction of three offensive tunnels that were under surveillance by IDF intelligence and technology. One of these tunnels had extended into our territory. All were located in the parking area space. Our forces discreetly maintained and monitored this tunnel, placing explosives and sensors inside. On October 7th, Hamas did not use this tunnel as part of our renewed defensive measures in the Gaza Brigade area. We destroyed the tunnel in the north and remain on high alert.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Recent Combat Achievements</strong></h2>\n\n\n\n<p>In the last day, we eliminated seven terrorists—three from the Almal organization and four from Hezbollah. Last evening, an IDF fighter jet attacked and destroyed a military structure of the Amal movement in the Marjeyoun area in southern Lebanon, killing three terrorists planning a terror attack against Israel. Our fighter jets also targeted several Hezbollah terror infrastructures in southern Lebanon.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Operational Readiness and Public Guidance</strong></h2>\n\n\n\n<p>We maintain a wide deployment and high readiness across all fronts, addressing threats throughout the region responsibly and wisely. There is no change in civil defense instructions; should there be any updates, we will inform you through the Home Front Command and IDF spokesperson channels. Tomorrow marks six months since the war began, during which IDF regular and reserve forces have been active on all fronts, defending and attacking to achieve the war&#8217;s objectives and secure a different security reality for the residents and citizens of Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Addressing Public Questions</strong></h2>\n\n\n\n<p>Josh Brainer from Haaretz asked about the tragic death of Eldad Katzir and how we can be certain he was murdered as stated and not killed accidentally, as has happened in other cases. We rely on very reliable intelligence from Shin Bet and Mossad, unlike the other case you mentioned. Regarding the dismissal of the commander of the Nahal Brigade related to last week&#8217;s incident, whether it was due to American pressure and why similar actions haven&#8217;t been taken against other officers, especially concerning the military failure on October 7th, I assure you, the investigations we conduct are thorough. Whenever we conclude an investigation, we draw clear conclusions and lessons. In this case, the Nahal Brigade operated excellently since the war began. The officer in question fought bravely in Gaza on October 7th. There was a serious violation of rules and guidelines, hence the decisions taken.</p>\n\n\n\n<p>Thank you, and have a good evening.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF recovers hostage&#8217;s body, continues <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> operations, destroys tunnels, and addresses public questions on military conduct and readiness.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-2779",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 2779
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2779",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=2779"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2779/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 2780,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2779/revisions/2780"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=2779"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=2779"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=2779"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}