{
    "id": 785,
    "date": "2024-04-09T11:58:05",
    "date_gmt": "2024-04-09T08:58:05",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=785"
    },
    "modified": "2024-04-09T12:03:28",
    "modified_gmt": "2024-04-09T09:03:28",
    "slug": "what-did-the-pins-worn-by-celebrities-at-the-2024-oscars-mean",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/what-did-the-pins-worn-by-celebrities-at-the-2024-oscars-mean/",
    "title": {
        "rendered": "What Did the Pins Worn by Celebrities at the 2024 Oscars Mean?"
    },
    "content": {
        "rendered": "\n<p>The red pin was not just another accessory, but was intended to be used as a political statement representing, according to those who wore it, their support for the call for a ceasefire in Gaza in the war between Israel and Hamas.</p>\n\n\n\n<p>Among the wearers of the pin, it was possible to distinguish the singer Billie Eilish and her brother Phineas O&#8217;Connell, who won a statuette for them for the theme song they created for the movie &#8220;Barbie&#8221;, the actor Mark Ruffalo (who was nominated for his role in &#8220;Such Poor People&#8221;, and who previously criticized Israel on several occasions), the acclaimed director Ava Dobernay (&#8220;Selma&#8221;) and past winners Maharsala Ali (&#8220;Moonlight&#8221;, &#8220;The Green Book&#8221;) and Riz Ahmed (&#8220;Metal Sounds&#8221;).</p>\n\n\n\n<h2 class=\"wp-block-gutenverse-heading guten-element guten-LQZ9DJ\">The real meaning behind it</h2>\n\n\n\n<p>Behind the round red pin, in the center of which is a red hand with a black heart, there is a rather shocking meaning symbolizing the horrific lynching that happened in Ramallah in 2000,<br>during which the reserve soldiers the late Vadim Norzitz and the late Yossi Abrahami were brutally murdered by Palestinians</p>\n\n\n\n<h3 class=\"wp-block-gutenverse-heading guten-element guten-fJYT4O\">2000 Ramallah lynching</h3>\n\n\n\n<p>The lynching in Ramallah took place on Thursday, October 12, 2000, (the beginning of the second intifada) in Ramallah, during which a Palestinian mob attacked two IDF reserve soldiers, Yossi Abrahami Wadim Norzitz, murdered them and mutilated their bodies.<br>The documentation of the event was published by Italian television, [1] Despite attempts by the Palestinian Authority to hide any documentation of the event. [2] <br>The event and the discussion surrounding it caused a shock in public opinion and a demand in the Israeli public for a toughening of the policy against Palestinian terrorism.</p>\n\n\n\n<h3 class=\"wp-block-gutenverse-heading guten-element guten-KliJm5\">background</h3>\n\n\n\n<p>On October 1, 2000, on the fourth day after the outbreak of the Second Intifada, a reserve cycle of jeep drivers was recruited on the basis of routine employment for the Regional Brigade (Hatmar) in Binyamin. Among them were the soldiers Master Sergeant Yossi Abrahami (38) of Petach Tikva and Lance Corporal Vadim Norzitz (35) from Or Akiva. The two were assigned the task of escorting buses to protect them from Palestinian attacks and were ordered to arrive the next day at 10:00 a.m. On October 11, the soldiers were sent on a one-day vacation by the third lieutenant of the brigade without receiving a briefing on how to arrive Back to the brigade at the Iosh junction.</p>\n\n\n\n<p>The next day, Thursday morning, October 12, Abrahami and Norzic returned to the base in Norzic&#8217;s private car. During their journey on Route 443, the soldiers lost their way, and instead of continuing to the Hizma checkpoint and bypassing Ramallah, they continued towards the city when on their way they crossed an IDF checkpoint in Beitonia.</p>\n\n\n\n<h3 class=\"wp-block-gutenverse-heading guten-element guten-jJLk2r\">the lynching</h3>\n\n\n\n<p>While entering Ramallah, Abrahami and Nurzic were identified as Israelis by Palestinian passers-by, according to the yellow license plate. As soon as they were identified as such, the Palestinians began throwing stones at the vehicle and blocking their way.</p>\n\n\n\n<p>In the heart of the hostile city, the soldiers got stuck in a traffic jam. Their vehicle could not move forward or backward. Palestinian police officers in uniform came to the car, and Nurzic and Abrahami pleaded with them that they had just taken a wrong turn and wanted to call on the cell phone. The police prevented them from doing so and demanded that the soldiers accompany them for questioning at the &#8220;Al-Bira&#8221; police station while holding guns to their heads.[3] Taking the soldiers out of the car and taking them to the police station was carried out while dragging them with brutality and acts of violence by the Palestinian crowd, while being enraged by the Palestinian policemen. When they were taken out of the vehicle, the policemen took their personal weapons, another gun they had in their possession, as well as their bags. When they arrived at the police station at 10:15 in the morning, they led the soldiers to the commander&#8217;s office on the second floor. At this time, the Palestinian crowd tried to murder the soldiers while they were inside the station, but the police ordered the crowd to wait outside the station gate until they took the soldiers out of the station, and then gave them to them to be killed. However, within moments one of the officers opened the office doors for them, and many Palestinians filled the station and the office. Despite the pleas of the soldiers,[3] the crowd as well as over ten policemen resorted to severe violence against them and beat them with police batons, iron rods and blunt objects, and also stabbed them several times.</p>\n\n\n\n<p>In a short time, the news spread about the presence of the Israeli soldiers at the police station, and hundreds of Palestinians gathered in the police yard equipped with sticks and blocks and encouraged the abusers with calls to kill the soldiers. Within 15 minutes, the news reached Israel about people trapped in Ramallah, but the IDF decided that a rescue operation would be too dangerous due to the expected resistance of the Palestinian security forces, who are well trained in the urban area of their city. The enraged crowd set fire to the soldiers&#8217; car and demanded that the soldiers be handed over to them. Norez Yitz was thrown through the window on the second floor (from a height of about 8 meters), and Abrahami through the door, into the hands of the angry crowd, who gouged out their eyes, stabbed, trampled and beat them. At about 10:30, the Palestinian crowd dragged the soldiers down the street to Al-Manara Square in the heart of Ramallah and continued abusing them and dismembering them. Norzitz was set on fire, and the rioters tore out their internal organs and waved them in jubilation of victory. The celebration in the square of the crowd and the police and the retouching of the bodies continued until the rumor spread that the IDF was about to take retaliatory action, and then the crowd suddenly dispersed and the bodies were left [4][2][5][6][7]</p>\n\n\n\n<p>One of the main participants in the lynching, Aziz Zalha, who threw Norzic out of the window, stuck his head out of the window and displayed his bloodied hands, while the crowd cheered. According to the battalion doctor, Yossi Abrahami was severely beaten and arrived in a state of clinical death at the military headquarters in the area and died on his way to the helicopter. At 11:00 in the morning, when Abrahami&#8217;s wife called her husband&#8217;s phone to demand his safety, one of his killers answered her boasting and mocking: &#8220;I slaughtered Your husband a few minutes ago.&#8221; This is how she first heard about her husband&#8217;s death.[8]</p>\n\n\n\n<h3 class=\"wp-block-gutenverse-heading guten-element guten-2HWwIS\">by wearing the red pin you support Murder of Jews<br>Billie Eilish, Finneas, Mark Ruffalo, Ramy Youssef, Mahershala Ali, Ava DuVernay<br>you stand with <a href=\"https://iron-swords.co.il/hamas/\" data-type=\"page\" data-id=\"86\"><mark style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-custom-hamas-color-color\">hamas</mark></a></h3>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"268\" height=\"170\" src=\"https://iron-swords.co.il/wp-content/uploads/2024/04/image-4.png\" alt=\"\" class=\"wp-image-786\" style=\"width:1163px;height:auto\"/><figcaption class=\"wp-element-caption\">Aziz Salaha, one of the perpetrators of the lynching, waves his blood-stained hands</figcaption></figure>\n\n\n\n<h3 class=\"wp-block-gutenverse-heading guten-element guten-Z3qWca\">sources</h3>\n\n\n\n<ol class=\"wp-block-list\">\n<li> Carroll, Rory (2000-10-20). <a href=\"http://www.guardian.co.uk/world/2000/oct/20/israel2\" target=\"_blank\" rel=\"noreferrer noopener\">&#8220;TV row over mob footage &#8216;betrayal'&#8221;</a>. <em><a href=\"https://www.hamichlol.org.il/The_Guardian\">The Guardian</a></em>. London.</li>\n\n\n\n<li> <a href=\"http://web.archive.org/web/20060306060053/http://www.mfa.gov.il/MFA/MFAArchive/2000_2009/2000/10/Coverage%20of%20Oct%2012%20Lynch%20in%20Ramallah%20by%20Italian%20TV\" target=\"_blank\" rel=\"noreferrer noopener\">&#8220;Coverage of Oct 12 Lynch in Ramallah by Italian TV Station RAI&#8221;</a>. <em><a href=\"https://www.hamichlol.org.il/%D7%9E%D7%A9%D7%A8%D7%93_%D7%94%D7%97%D7%95%D7%A5\">משרד החוץ</a></em>. 2000-10-17.</li>\n\n\n\n<li>גיל מלצר, <a href=\"http://rotter.net/User_files/forum/gil1/4350359d3081ac59.jpg\" target=\"_blank\" rel=\"noreferrer noopener\">וידויה של מפלצת</a>, 14.10.2005, המוסף לשבת של ידיעות אחרונות</li>\n\n\n\n<li>Philps, Alan (2000-10-13). <a href=\"http://www.telegraph.co.uk/news/worldnews/middleeast/israel/1370229/A-day-of-rage%2C-revenge-and-bloodshed.html\" target=\"_blank\" rel=\"noreferrer noopener\">&#8220;A day of rage, revenge and bloodshed&#8221;</a>. <em><a href=\"https://www.hamichlol.org.il/The_Daily_Telegraph\">The Daily Telegraph</a></em>. London.</li>\n\n\n\n<li><a href=\"http://news.bbc.co.uk/1/hi/world/middle_east/969778.stm\" target=\"_blank\" rel=\"noreferrer noopener\">&#8220;Lynch mob&#8217;s brutal attack&#8221;</a>. <em><a href=\"https://www.hamichlol.org.il/BBC_News\">BBC News</a></em>. 2000-10-13.</li>\n\n\n\n<li>Whitaker, Raymond (2000-10-14). <a href=\"http://www.independent.co.uk/news/world/middle-east/a-strange-voice-said-i-just-killed-your-husband-635341.html\" target=\"_blank\" rel=\"noreferrer noopener\">&#8220;A strange voice said: I just killed your husband&#8221;</a>. <em><a href=\"https://www.hamichlol.org.il/The_Independent\">The Independent</a></em>. London.</li>\n\n\n\n<li><a href=\"http://www.israelnationalnews.com/News/news.aspx/140113\" target=\"_blank\" rel=\"noreferrer noopener\">Last Ramallah Lynch-Mobster Acquitted</a>, 17 באוקטובר 2010, באתר israelnationalnews.com</li>\n\n\n\n<li>אלון חכמון ואבי מוססקו, <a href=\"https://www.ynet.co.il/articles/0,7340,L-174408,00.html\" target=\"_blank\" rel=\"noreferrer noopener\">&#8220;שחטתי את בעלך לפני כמה דקות&#8221;</a>, באתר <a href=\"https://www.hamichlol.org.il/Ynet\">ynet</a>, 13 באוקטובר 2000</li>\n\n\n\n<li><a href=\"https://www.hamichlol.org.il/%D7%94%D7%9C%D7%99%D7%A0%D7%A5'_%D7%91%D7%A8%D7%9E%D7%90%D7%9C%D7%9C%D7%94\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.hamichlol.org.il/הלינץ&#8217;_ברמאללה</a></li>\n</ol>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>By wearing the red pin you support Murder of Jews</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 788,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        54,
        57
    ],
    "class_list": [
        "post-785",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-education",
        "tag-stupid-palestine-supporters"
    ],
    "lang": "en",
    "translations": {
        "en": 785
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/785",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=785"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/785/revisions"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/788"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=785"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=785"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=785"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}