{
    "id": 19038,
    "date": "2024-12-16T22:17:45",
    "date_gmt": "2024-12-16T20:17:45",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=19038"
    },
    "modified": "2024-12-16T22:17:51",
    "modified_gmt": "2024-12-16T20:17:51",
    "slug": "the-plo-and-hamas-are-political-organizations-not-terrorists",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/the-plo-and-hamas-are-political-organizations-not-terrorists/",
    "title": {
        "rendered": "The PLO and Hamas are political organizations, not terrorists"
    },
    "content": {
        "rendered": "\n<p>There has been an ongoing and deliberate effort by certain groups, activists, and political figures to reframe the Palestinian Liberation Organization (PLO) and Hamas as mere &#8220;political organizations,&#8221; downplaying or outright ignoring their long-standing history of terrorism, violence, and extremist ideologies. This narrative seeks to shift focus away from the indiscriminate attacks on civilians, the glorification of martyrdom through violence, and the rejection of peaceful coexistence with Israel—hallmarks of both organizations since their inception. By presenting them as legitimate political actors, this revisionism attempts to sanitize decades of atrocities and cast them as freedom fighters rather than perpetrators of terror. While it is true that these entities have engaged in political activities, including governance in the case of Hamas and diplomatic maneuvering by the PLO, these roles cannot erase their foundational principles and consistent reliance on violence to achieve their goals. From suicide bombings and rocket attacks to hijackings and massacres, both organizations have consistently targeted civilians, undermined peace efforts, and fueled regional instability. This makes the claim that they are “not terrorists” not only misleading but dangerous, as it legitimizes violence and rewards extremism. Let us examine why this narrative is fundamentally flawed and explore the evidence that underscores their true nature as terrorist organizations.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The PLO’s Violent Roots</strong></h3>\n\n\n\n<p>The Palestinian Liberation Organization (PLO), now operating under the guise of the &#8220;Palestinian Authority&#8221; (PA), has long been a central force in orchestrating and financing terrorism against Israeli civilians. While many attempt to portray the PLO as a legitimate political body, its financial and operational support for terror reveals its true nature. The bloodshed documented in the long history of Palestinian suicide bombings and attacks, including those listed above, was not simply the work of militant factions acting independently—it was <strong>funded, enabled, and orchestrated by the PLO itself.</strong></p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Terrorism Financed by the PLO</strong></h4>\n\n\n\n<p>From its inception, the PLO has allocated significant resources to support terrorist groups such as Hamas, the Palestinian Islamic Jihad (PIJ), and the Popular Front for the Liberation of Palestine (PFLP), as well as its own militant offshoots like Fatah’s Al-Aqsa Martyrs&#8217; Brigades. These organizations have used PLO funding to carry out some of the deadliest attacks against innocent civilians:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The <strong>Beit Lid Massacre (1995)</strong> where 21 people were murdered by suicide bombers financed by Palestinian Islamic Jihad with PLO-provided resources.</li>\n\n\n\n<li>The <strong>Dizengoff Street Bombing (1994)</strong> that killed 22 civilians, executed by Hamas operatives using logistical networks enabled by PLO support.</li>\n\n\n\n<li><strong>Suicide bombings during the Second Intifada (2000-2005),</strong> responsible for the deaths of hundreds of Israelis, many financed directly through PLO and PA-backed payments and logistical assistance.</li>\n</ul>\n\n\n\n<p>The PLO’s role wasn’t limited to tacit support—it actively orchestrated the funding and direction of these attacks, ensuring that terror groups had the financial backing needed to wreak havoc.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>&#8220;Pay-for-Slay&#8221; – The Palestinian Authority&#8217;s Martyrdom Fund</strong></h4>\n\n\n\n<p>The PLO’s involvement in terrorism hasn’t stopped with the Second Intifada. Even now, under its rebranded image as the Palestinian Authority, it openly finances terrorists through a despicable system commonly referred to as <strong>“Pay-for-Slay.”</strong> The PA uses millions of dollars in international aid and donations to reward Palestinians who commit terrorist attacks against Israelis. Those who murder civilians are glorified as &#8220;heroes&#8221; and &#8220;martyrs,&#8221; and their families are provided with generous monthly stipends as part of this program.</p>\n\n\n\n<p>In fact, terrorists who are arrested and imprisoned in Israel receive <strong>higher salaries based on the severity of their crimes</strong>—a system that explicitly incentivizes mass murder. For example:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>A terrorist who murders innocent civilians receives far more money than someone arrested for a lesser crime.</li>\n\n\n\n<li>Families of suicide bombers are paid large sums as a &#8220;reward&#8221; for their &#8220;sacrifice.&#8221;</li>\n</ul>\n\n\n\n<p>This grotesque practice turns murder into a lucrative career path for Palestinians, ensuring that terrorism continues to be a viable and celebrated option for those who seek to attack Israelis.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Where Does the Money Come From?</strong></h4>\n\n\n\n<p>Shockingly, the funds used to pay terrorists come primarily from <strong>international donations</strong> intended for humanitarian aid. Countries around the world, including the United States, European nations, and others, contribute billions of dollars in aid to the Palestinian Authority, under the pretense of supporting education, healthcare, and infrastructure. Instead, these funds are siphoned off to bankroll terrorism.</p>\n\n\n\n<p>In 2022 alone, the Palestinian Authority allocated <strong>$335 million</strong> to pay imprisoned terrorists and their families. This practice, well-documented and widely condemned, has not stopped, and as of this writing, the PA continues to funnel millions to terrorists sitting in Israeli prisons or to their families. Every dollar donated to the PA effectively becomes blood money, financing the murder of civilians and perpetuating a culture of violence.</p>\n\n\n\n<p>Even as this article is being written, the PLO and its successors are actively supporting terrorism. The system of “Pay-for-Slay” remains fully operational, ensuring that terrorists are rewarded while their families are honored as heroes. These payments are not symbolic—they send a clear and dangerous message that <strong>terrorism is not only acceptable but profitable.</strong></p>\n\n\n\n<p>The PLO’s hands are stained with the blood of thousands of innocent victims, and its transformation into the Palestinian Authority has done nothing to change its core mission of destroying Israel through terror. By financing and incentivizing terrorism, it has ensured that peace remains out of reach and that innocent lives continue to be lost.</p>\n\n\n\n<p>The international community must stop turning a blind eye to this reality. <strong>Every dollar sent to the Palestinian Authority directly funds terrorism, incentivizes murder, and perpetuates the cycle of violence.</strong> The world must demand accountability and refuse to enable this horrific system any longer.</p>\n\n\n\n<p>The PLO is not a legitimate political body—it is a <strong>terrorist organization</strong> in disguise, and its continued existence is a direct threat to peace and stability in the region.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Hamas: Terrorism by Design</strong></h3>\n\n\n\n<p>Hamas is not merely a political organization—it is a terrorist organization founded in 1987 with one unyielding goal: to obliterate the state of Israel and replace it with an Islamic state. Its charter is a manifesto of hatred, calling for the destruction of Israel and the genocide of Jews, while peddling some of the most vile antisemitic conspiracy theories. Hamas thrives on violence, chaos, and bloodshed, weaponizing its twisted ideology to justify atrocities against civilians.</p>\n\n\n\n<p>The horror Hamas unleashed on <strong>October 7, 2023</strong>, will forever be etched in history as an unthinkable act of terror. This was not just a “military operation” or an “uprising”—it was a <strong>massacre</strong> of unparalleled brutality, carried out with the explicit intent to commit genocide against the people of Israel. In the early hours of that day, Hamas terrorists launched a meticulously planned assault, infiltrating Israeli communities near the Gaza border. Over <strong>1,200 innocent people</strong> were butchered in their homes, on the streets, and at a music festival.</p>\n\n\n\n<p>Hamas made no distinction between its victims. They slaughtered <strong>Jews, Christians, Muslims, women, children, and even infants</strong> in their cribs. Entire families were executed together, and neighborhoods were set ablaze. The attack was not only violent but deeply depraved. Survivors and investigators have confirmed harrowing accounts of <strong>rape, mutilation, and torture</strong> committed by Hamas terrorists, all while gleefully broadcasting their atrocities on social media. These acts were not collateral damage or unintended consequences of war—they were the very purpose of the operation: to maximize suffering and terror.</p>\n\n\n\n<p>In a grotesque display of inhumanity, over <strong>200 hostages</strong>, including women, children, and the elderly, were dragged into Gaza to be paraded, humiliated, and used as bargaining chips. The footage of young children ripped from their homes and terrified grandmothers held captive serves as chilling proof of Hamas’s depravity. This is the true face of Hamas: an organization that weaponizes human lives, driven by a genocidal ideology that glorifies the murder of innocents.</p>\n\n\n\n<p>Even as it carries out these heinous acts, Hamas continues to exploit the people of Gaza, using civilians as human shields and turning schools, hospitals, and mosques into military command centers. By doing so, it cynically sacrifices Palestinian children to further its twisted goals and then manipulates their suffering to vilify Israel on the world stage. This is not governance—it is a sick political strategy that thrives on the death and despair of its own people.</p>\n\n\n\n<p>Hamas’s October 7 massacre was not an isolated incident. It represents decades of terror that began long before and will persist unless the world unequivocally rejects and condemns this terrorist organization. Hamas has pioneered suicide bombings, indiscriminately fired rockets at Israeli civilians, and executed brutal campaigns of violence during the Second Intifada. Every act underscores its commitment to its genocidal mission, one that targets Jews and anyone else who stands in the way of its hateful vision.</p>\n\n\n\n<p>To refer to Hamas as a “political organization” is to whitewash its blood-soaked history and give legitimacy to its reign of terror. It is a betrayal of every victim—Israeli or Palestinian—who has suffered under its tyranny. Hamas is not a resistance movement, a political actor, or a defender of Palestinian rights. It is a genocidal terrorist organization, and its actions on October 7, 2023, serve as chilling evidence of its true nature.</p>\n\n\n\n<p>The world must stop enabling this barbaric organization by excusing its crimes or downplaying its atrocities. Hamas thrives on the destruction of innocent lives, the manipulation of its own people, and the perpetuation of hatred. To support Hamas, defend it, or even downplay its actions is to stand with terrorism, genocide, and the utter rejection of humanity.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The PLO funds terrorism through the Palestinian Authority, using international aid to reward and incentivize deadly attacks against civilians</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 19039,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        54
    ],
    "class_list": [
        "post-19038",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-education"
    ],
    "lang": "en",
    "translations": {
        "en": 19038
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19038",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=19038"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19038/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 19040,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19038/revisions/19040"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/19039"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=19038"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=19038"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=19038"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}