{
    "id": 4819,
    "date": "2023-11-23T16:43:42",
    "date_gmt": "2023-11-23T14:43:42",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/7968/"
    },
    "modified": "2023-11-23T16:43:42",
    "modified_gmt": "2023-11-23T14:43:42",
    "slug": "7968",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/7968/",
    "title": {
        "rendered": "&#8220;Massive IDF Operations: Overcoming Hamas Threats and Arresting Wanted Men Across Israel&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The IDF, the Shin Bet and the Israel Border Police are working against the terrorist organization Hamas across the Central Command.</p>\n<p>Tonight, the forces completed two brigade operations; In the operation commanded by Brigade 646 in the Latrun refugee camp, 14 wanted men were arrested and three HAMAS observation spots that had previously been used to target our forces were eliminated. During an operation in Eizun village against popular terrorism, ten wanted men were arrested and ten illegal vehicles and incitement materials from the terrorist organization Hamas were eliminated.</p>\n<p>In a joint operation of the IDF, Shin Bet and the Border Police, 40 wanted men were arrested across Judea, Samaria, the Jordan Valley and the Valleys Division. Three of them are affiliated with the Hamas terrorist organization.</p>\n<p>Hundreds of IDF reservists and Border Police forces under the command of Reserves Brigade 646 worked for about 14 hours in a brigade operation in the refugee camp in Nablus, aiming at Shin Bet and IDF. The forces arrested 14 wanted men, neutralized an armed terrorist, located and eliminated three HAMAS observation posts from which explosives were recently used on our troops. In addition, two guns and improvised weaponry, explosives, additional weapons and military equipment were located and eliminated.</p>\n<p>In another brigade operation to thwart popular terror within the Eizun village under the Ephraim Division, hundreds of reservist soldiers and Border Police forces searched and investigated dozens of buildings and suspects, arrested ten wanted men, located war materials, ammunition, ingredients for explosives production and Hamas incitement materials. In addition, Border Police forces eliminated ten illegal vehicles.</p>\n<p>During searches for war materials in Eizariya in Gush Etzion, parts of a gun and an air gun were found. In Jabel Mukaber in Jerusalem, the forces found a bag with ready-to-use improvised explosives that were neutrailzed, and a gun.</p>\n<p>During a suppression operation in the Al-Aroub refugee camp in Gush Etzion, five wanted men were arrested, and 15 illegal cars were eliminated. During the operation, stones were thrown massively, and the force responded with firing, and a hit was identified. In Tubas, three wanted men suspected of shooting at the forces were arrested. During the arrest, explosives were thrown at the force which responded with fire, and hits were identified.</p>\n<p>So far, since the beginning of the war, about 1,950 wanted men have been arrested across the Judea and Samaria Division and the Jordan Valley and the Valleys Division. Approximately 1,100 of them are affiliated with the Hamas terrorist organization.</p>\n<p>Attached are photos of the warfare means from the operation in the Latrun refugee camp:https://IDFANC.activetrail.biz/ANC23112023EROFERUIV%D7%99</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The IDF, the Shin Bet and the <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> Border Police are working against the terrorist organization <a  href=\"/hamas\">Hamas</a> across the Central Command. Tonight, the forces completed two brigade operations; In the operation commanded by Brigade 646 in the Latrun refugee camp, 14 wanted men were arrested and three <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">HAMAS</a> observation spots that had previously been used to target our forces were eliminated. During an operation in Eizun village against popular terrorism, ten wanted men were arrested and ten illegal vehicles and incitement materials from the terrorist organization Hamas were eliminated. In a joint operation of the IDF, Shin Bet</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4819",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4819
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4819",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4819"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4819/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4819"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4819"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4819"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}