{
    "id": 4794,
    "date": "2023-11-26T10:23:32",
    "date_gmt": "2023-11-26T08:23:32",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/7994/"
    },
    "modified": "2023-11-26T10:23:32",
    "modified_gmt": "2023-11-26T08:23:32",
    "slug": "7994",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/7994/",
    "title": {
        "rendered": "&#8220;IDF, SHABAK and MAGAV Conquer Terrorism: Night Raid Results in Arrests, Demise of Five Terrorists, and Destruction of Explosives Lab&#8221;"
    },
    "content": {
        "rendered": "<p>Joint message to IDF Spokesperson and SHABAK Spokespersons:</p>\n<p>IDF forces, SHABAK and MAGAV operated last night across the Central Command</p>\n<p>Activity in the Jenin refugee camp: In the operation under the command of the 646 Reserve Division, five terrorists were killed, 21 wanted individuals were arrested, an explosives lab was destroyed and an aircraft attacked an armed terrorist cell that endangered our forces.</p>\n<p>The IDF and SHABAK arrested the terrorist from the Hamas terror organization who carried out the shooting attack on 19.8.23 in which Shai and Aviad Nigerker, may their memory be a blessing, were murdered while he hid in his hideout apartment.</p>\n<p>In a joint operation of IDF forces, SHABAK and MAGAV, 29 wanted individuals were arrested across Judea and Samaria.</p>\n<p>Last night, for the first time under the command of the 646 Reserve Division, IDF and MAGAV reserve soldiers on an intelligence base of AMAN and SHABAK operated a campaign against terror in the Jenin refugee camp in the Menashe division.</p>\n<p>During the operation, engineering vehicles exposed explosives beneath and at the sides of the road that were intended to harm our forces. Our soldiers had a firefight with the terrorists and killed five, injured some more terrorists and arrested 21 wanted individuals. Extensive searches uncovered several weapons, a large amount of ammunition, explosives, military equipment, and two explosive devices that trailed our forces.<br />\nIn addition, an aircraft attacked an armed terrorist cell that endangered our forces.<br />\nA number of terrorists who were injured by the airstrike were arrested by the soldiers and transferred for further investigation by security forces.</p>\n<p>During the operation, a reserve force from the 6646 Regime, based on precise intelligence information from SHABAK, arrested the terrorist affiliated with the Hamas terror organization, Osama Issa Mohamad Benny Fidl, suspected of carrying out the shooting attack in Hawara on 19.8.23 in which Shai and Aviad Nigerker, may their memory be a blessing, were murdered. The terrorist was found while hiding in his hideout apartment. Along with him were confiscated his M-16 type weapon, magazines, and Hamas flags.</p>\n<p>In addition, the forces located an explosives lab and destroyed it.</p>\n<p>At the end of the operation, intelligence information was received following which the forces tracked a vehicle containing suspects who had left the Jenin refugee camp. At the end of the pursuit, the forces caught them and arrested three more wanted terror activists.</p>\n<p>So far, since the beginning of the war, about 2,000 wanted individuals have been arrested across the Judea and Samaria brigade, and the Rift Valley and Valleys division, about 1,100 of them affiliated with the Hamas terror organization.</p>\n<p>Attached are pictures of the fighting means and military equipment confiscated: https://IDFANC.activetrail.biz/ANC26112023.4567894564</p>\n<p>Attached is documentation of the activity for the arrest of the terrorist involved in the Hawara attack affiliated with the Hamas terror organization: https://bit.ly/3Rfj7H5.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Joint message to <a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a> and SHABAK Spokespersons: IDF forces, SHABAK and MAGAV operated last night across the Central Command Activity in the Jenin refugee camp: In the operation under the command of the 646 Reserve Division, five terrorists were killed, 21 wanted individuals were arrested, an explosives lab was destroyed and an aircraft attacked an armed terrorist cell that endangered our forces. The IDF and SHABAK arrested the terrorist from the <a  href=\"/hamas\">Hamas</a> <a  href=\"https://iron-swords.co.il/t/terror-organization/\">terror organization</a> who carried out the shooting attack on 19.8.23 in which Shai and Aviad Nigerker, may their memory be a blessing, were murdered while he hid</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4794",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4794
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4794",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4794"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4794/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4794"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4794"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4794"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}