{
    "id": 4791,
    "date": "2023-11-26T14:30:44",
    "date_gmt": "2023-11-26T12:30:44",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/7997/"
    },
    "modified": "2023-11-26T14:30:44",
    "modified_gmt": "2023-11-26T12:30:44",
    "slug": "7997",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/7997/",
    "title": {
        "rendered": "&#8220;Decisive Strike: IDF and Shin Bet Eliminate Five Top Hamas Commanders in Gaza Strip&#8221;"
    },
    "content": {
        "rendered": "<p>Joint message from the IDF Spokesperson and Shin Bet Spokesperson: </p>\n<p>The IDF and Shin Bet have eliminated five senior commanders of the terror organization Hamas in the Gaza strip; among the commanders who were killed – The commander of the Northern Strip Brigade in Hamas, his deputy, and the head of the engineering unit.</p>\n<p>During the fighting in the Gaza Strip and before the ceasefire, IDF aircraft with intelligence guidance from Shin Bet and AMAN (Military Intelligence Directorate), eliminated five Hamas senior officials in the Strip.</p>\n<p>Ahmad Andur, who served as the commander of the Northern Brigades in the terror organization Hamas. He was responsible for directing and managing all of Hamas&#8217; terror activities in the northern Gaza Strip, to initiate, promote and approve actions and terrorist plots including shooting attacks, explosives, rocket fire against residents of the State of Israel, and also planning terrorist attacks throughout Judea and Samaria.<br />\nAndur was one of the leaders in the planning and execution of the raid and brutal massacre that the terror organization Hamas carried out in the Gaza envelope on Saturday, October 7.</p>\n<p>Iman Tziam, who served as the head of the engineering unit in the terrorist organization Hamas for about 15 years. As part of his last role, Tziam was responsible for building and managing the arsenal of the unit, release guidance and direction of all of Hamas&#8217; rocket launches towards Israel. Tziam was a significant knowledge hub in the military arm of Hamas, and in all the recent significant rounds of fighting, he was responsible for operating Hamas&#8217;s fire and carrying out terrorist plots.</p>\n<p>Wael Rajeb, the deputy commander of the Northern Brigade in the Gaza Strip in the terror organization, also served as a divisional operations officer. He previously served as the Hamas police commander in the Northern Gaza Strip and then as the commander of the Bet Lahia battalion. Regarded as a central figure in the brigade, connected to battalion commanders.</p>\n<p>Farasan Khalifa, a senior member of the Hamas West Bank, head of the Tol Karem committee, served as an assistant and confidant to senior Hamas officials. He assisted, promoted and directed attacks against Israeli citizens and security forces. Recently involved in developing terrorist cells in the Nur al-Shams refugee camp in Judea and Samaria.<br />\nKhalifa was killed in an attack that also killed Ahmad Andur and Iman Tziam.</p>\n<p>Rafiq Salman, head of the combat support unit in the North Gaza Strip, is a senior figure in the Gaza city brigade&#8217;s hierarchy. Salman formerly served as the brigade&#8217;s deputy commander which makes him highly knowledgeable in everything related to defensive preparedness and attacks on Israeli territory.<br />\nIn his current role, he was part of the planning of the drone paratroopers raid carried out by the Gaza City Brigade in the massacre that occurred on October 7.<br />\nSalman was killed along with Andur and Rajeb.</p>\n<p>Attached are pictures of the terrorists who were killed: (URL provided) </p>\n<p>(Note: The specific date of &#8220;7.10.&#8221; suggests a notable event or attack allegedly carried by Hamas on October 7th; however, as the context doesn&#8217;t provide a specific year or additional details, the nature or importance of this event is unclear without further information.)</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Joint message from the <a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a> and Shin Bet Spokesperson: The IDF and Shin Bet have eliminated five senior commanders of the <a  href=\"https://iron-swords.co.il/t/terror-organization/\">terror organization</a> <a  href=\"/hamas\">Hamas</a> in the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> strip; among the commanders who were killed – The commander of the Northern Strip Brigade in <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>, his deputy, and the head of the engineering unit. During the fighting in the Gaza Strip and before the ceasefire, IDF aircraft with intelligence guidance from Shin Bet and AMAN (Military Intelligence Directorate), eliminated five Hamas senior officials in the Strip. Ahmad Andur, who served as the commander of the Northern Brigades in the terror</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4791",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4791
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4791",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4791"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4791/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4791"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4791"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4791"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}