{
    "id": 4773,
    "date": "2023-11-28T13:01:20",
    "date_gmt": "2023-11-28T11:01:20",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8016/"
    },
    "modified": "2023-11-28T13:01:20",
    "modified_gmt": "2023-11-28T11:01:20",
    "slug": "8016",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8016/",
    "title": {
        "rendered": "&#8220;IDF and Border Police Demolish Terrorist&#8217;s Home, Arrest 13 Suspects Amid Violent Riots: A Comprehensive Report on Recent Operations&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Last night, the IDF and Border Police engineering forces demolished the apartment of the terrorist who carried out the car-ramming attack near the Maccabim checkpoint, in which Corporal Maxim Molchanov, may his memory be a blessing, was killed; last night, soldiers arrested 13 wanted individuals throughout the Central Command area.</p>\n<p>IDF soldiers, along with the Shin Bet and Border Police, arrested 13 wanted individuals throughout Judea, Samaria, and the Jordan Valley area.</p>\n<p>The IDF and Border Police Engineering Corps demolished tonight the house of terrorist Dawood Faiz, who carried out a car-ramming attack near the Maccabim checkpoint on August 31, 2023. In the attack, Corporal Maxim Molchanov was killed, may his memory be a blessing, and others were injured.</p>\n<p>During the operation, violent riots developed, during which suspects set tires on fire, threw stones, and hurled Molotov cocktails at the forces, who responded with crowd dispersal methods and gunfire, a hit was identified.</p>\n<p>In the Deheisheh refugee camp located in the Gush Etzion area, soldiers arrested two wanted individuals. During the operation, a violent riot broke out during which suspects threw stones, Molotov cocktails, and explosive devices at the soldiers, who responded with gunfire, a hit was identified.</p>\n<p>In the city of Hebron, located in the Judea area, and in the Fakua village located in the Menashe area, forces located and confiscated an M-16 weapon, knives, incitement materials, and military equipment. During the activity in which two wanted individuals were arrested in the city of Tubas in the Jordan Valley area, armed suspects fired at the soldiers who responded with gunfire, hits were identified. In addition, the forces fired a rocket toward the building where the arrested suspects were hiding.</p>\n<p>The arrested wanted individuals and the confiscated combat equipment were transferred for further processing by security forces, there were no casualties among our forces.</p>\n<p>Since the beginning of the war, about 2,000 wanted individuals have been arrested throughout the Judea and Samaria Division and the Jordan Valley area, about 1,100 of them are affiliated with the Hamas terrorist organization.</p>\n<p>Attached are pictures of the confiscated combat equipment and incitement materials from the night: https://IDFANC.activetrail.biz/ANC2811202325451</p>\n<p>Attached are pictures of the demolition of the terrorist&#8217;s apartment: https://IDFANC.activetrail.biz/AANC2811202349384587</p>\n<p>Attached is footage of the demolition of the terrorist&#8217;s apartment: https://bit.ly/47w70LL</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Last night, the IDF and Border Police engineering forces demolished the apartment of the terrorist who carried out the car-ramming attack near the Maccabim checkpoint, in which Corporal Maxim Molchanov, may his memory be a blessing, was killed; last night, soldiers arrested 13 wanted individuals throughout the Central Command area. IDF soldiers, along with the Shin Bet and Border Police, arrested 13 wanted individuals throughout Judea, Samaria, and the Jordan Valley area. The IDF and Border Police Engineering Corps demolished tonight the house of terrorist Dawood Faiz, who carried out a car-ramming attack near the Maccabim checkpoint on</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4773",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4773
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4773",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4773"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4773/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4773"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4773"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4773"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}