{
    "id": 4762,
    "date": "2023-11-29T15:08:35",
    "date_gmt": "2023-11-29T13:08:35",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8027/"
    },
    "modified": "2023-11-29T15:08:35",
    "modified_gmt": "2023-11-29T13:08:35",
    "slug": "8027",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8027/",
    "title": {
        "rendered": "&#8220;Joint IDF, SHABAK, and Border Police Operation Neutralizes Senior Terrorists: An Inside Look at Anti-Terrorism Efforts in Jenin Refugee Camp&#8221;"
    },
    "content": {
        "rendered": "<p>Joint message to the IDF spokesperson, SHABAK spokesperson, and the police spokesperson:</p>\n<p>In a joint operation of the IDF, SHABAK, and the Border Police in the Jenin refugee camp, two senior terrorists were killed by Yamam fighters, including the camp commander, Mohammed Zubeidi, who carried out shooting attacks in the area and was involved in sending terrorists to attacks.</p>\n<p>At the end of an anti-terrorism operation in the Jenin refugee camp under the command of the Menashe brigade of the 646th Reserve Division, Duvdevan reserve unit, Yamam fighters, engineering, and Border Police, under the intelligence direction of SHABAK and the IDF, Mohammed Zubeidi, the commander of the Jenin refugee camp, was killed.</p>\n<p>Zubeidi, a high-ranking PLO operative and one of the main terrorists in the Jenin refugee camp, was involved in extensive terrorist activity, carried out shooting attacks, and also promoted other attacks in various disguises. He was involved, among others, in the shooting attack at Harmeish Junction on 30/05/2023 in which Meir Tamari was killed, and in another shooting attack in the area on 13/05/2023 in which a civilian and four IDF soldiers were injured. Zubeidi was implicated in investigations as involved in supplying vehicles for attacks and dispatching terrorists.</p>\n<p>The Yamam fighters surrounded the building where Zubeidi and other terrorists were holed up and opened fire on the building. After sweeps of the building, two terrorists who were killed were found &#8211; Mohammed Zubeidi and Husam Hanun, and with them three M-16 rifles and magazines used by them.</p>\n<p>In addition, during the operation, 17 wanted individuals were arrested, and during sweeps for weapons, the forces located and confiscated seven weapons, homemade explosives, ammunition, and military equipment. One of the weapons was found on an armed man after he was captured and handed over to the forces.<br />\nDuring the activity, exchanges of fire developed and explosives were thrown at the forces, who shot at the terrorists and hit them.</p>\n<p>During the night, an IDF aircraft attacked an armed terrorist cell that was identified in the area and posed a threat to our forces. Also, during the operation, the fighters located and destroyed an underground tunnel and a workshop for the production of weapons.</p>\n<p>At the Jabr refugee camp, the fighters destroyed explosives that were located, and in Hebron, five wanted individuals were arrested, including a senior Hamas member, and Hamas flags were confiscated.</p>\n<p>To date, since the beginning of the war, over 2,000 wanted individuals have been arrested across the Judea and Samaria Brigade and the Rift and Valleys Division, about 1,100 of them affiliated with the Hamas terror organization.</p>\n<p>Attached are pictures of the weapons, an underground tunnel, and a workshop for the production of weapons found by the forces: https://IDFANC.activetrail.biz/ANC29112023.47812318168.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Joint message to the <a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a>, SHABAK spokesperson, and the police spokesperson: In a joint operation of the IDF, SHABAK, and the Border Police in the Jenin refugee camp, two senior terrorists were killed by Yamam fighters, including the camp commander, Mohammed Zubeidi, who carried out shooting attacks in the area and was involved in sending terrorists to attacks. At the end of an anti-terrorism operation in the Jenin refugee camp under the command of the Menashe brigade of the 646th Reserve Division, Duvdevan reserve unit, Yamam fighters, engineering, and Border Police, under the intelligence direction of SHABAK and the</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4762",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4762
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4762",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4762"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4762/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4762"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4762"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4762"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}