{
    "id": 4009,
    "date": "2024-02-05T09:16:26",
    "date_gmt": "2024-02-05T07:16:26",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8794/"
    },
    "modified": "2024-02-05T09:16:26",
    "modified_gmt": "2024-02-05T07:16:26",
    "slug": "8794",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8794/",
    "title": {
        "rendered": "&#8220;Intense IDF Operations: Eliminating Terrorist Cells Across the Gaza Strip&#8221;"
    },
    "content": {
        "rendered": "<p>IDF spokesperson:</p>\n<p>Cooperation of sea, air, and ground forces in the center of the Strip: Five terrorists were identified near the forces of the Nahal Brigade, ground forces, aircraft of the Air Force, and naval vessels eliminated the cell in a short time.</p>\n<p>In the center of the Strip, a cell of five terrorists was identified in an area where the Nahal Brigade&#8217;s combat team is operating. In a joint operation of the ground forces, the brigade&#8217;s fire ensemble, aircraft, vessels, and tanks, the terrorists were eliminated in a short time.</p>\n<p>The forces of the 162nd Division continue to operate in the north of the Strip and in its center in focused raids on Hamas&#8217;s terror targets. In the last day, combat teams of the Nahal Brigade and the 401 Brigade eliminated dozens of terrorists.</p>\n<p>In Khan Yunis, a combat plane of the Air Force directed towards the fire center of the 98th Division, it attacked a terrorist infrastructure in which a Hamas militant cell was preparing to activate explosives against our forces operating in a nearby building.</p>\n<p>In the west of Khan Yunis, the combat team of the Givati Brigade continues to raid terror targets and eliminates terrorists in clashes. In the last day, the fighters eliminated dozens of armed terrorists who ambushed forces throughout the city.</p>\n<p>In operations of the Paratroopers Brigade&#8217;s combat team, the brigade&#8217;s fire ensemble directed an air force aircraft that swept the area where the forces were operating and identified a terrorist carrying explosives a few meters from them, the terrorist was eliminated and secondary explosions were identified signifying the explosives in his possession.</p>\n<p>Elsewhere in the city, fighters from the 646th Brigade&#8217;s combat team raided intelligence-directed terror targets and found Kalashnikov type weapons, sniper rifles, grenades, and ammunition depots. The fighters eliminated ten terrorists in close-range shooting and using aerial fire.</p>\n<p>In addition, the IDF attacked in the last day, using missile boats, terror infrastructures that serve the terror organizations in the Gaza Strip.</p>\n<p>Attached is documentation of the cooperation that led to the elimination of the cell of terrorists: https://bit.ly/490LLlX</p>\n<p>Attached are pictures from IDF operations in the Strip: https://IDFANC.activetrail.biz/ANC0502202465841264851</p>\n<p>Attached is documentation of IDF attacks in the Strip: https://bit.ly/3UucGSO</p>\n<p>Attached is documentation from IDF operations in the Strip: https://bit.ly/49nbu80</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a>: Cooperation of sea, air, and ground forces in the center of the Strip: Five terrorists were identified near the forces of the <a  href=\"https://iron-swords.co.il/t/nahal-brigade/\">Nahal Brigade</a>, ground forces, aircraft of the Air Force, and naval vessels eliminated the cell in a short time. In the center of the Strip, a cell of five terrorists was identified in an area where the Nahal Brigade&#8217;s combat team is operating. In a joint operation of the ground forces, the brigade&#8217;s fire ensemble, aircraft, vessels, and tanks, the terrorists were eliminated in a short time. The forces of the 162nd Division continue to operate</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4009",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4009
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4009",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4009"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4009/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4009"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4009"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4009"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}