{
    "id": 4005,
    "date": "2024-02-06T08:42:52",
    "date_gmt": "2024-02-06T06:42:52",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8798/"
    },
    "modified": "2024-02-06T08:42:52",
    "modified_gmt": "2024-02-06T06:42:52",
    "slug": "8798",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8798/",
    "title": {
        "rendered": "&#8220;IDF&#8217;s Strategic Counter-Terror Operations: Above and Below Ground Battles in Khan Yunis and the Northern Strip&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Above and below ground: IDF forces continue to fight in western Khan Yunis and to conduct operations in the North and central strip; a fighter plane, guided by intelligence, eliminated a PIJ terrorist who took part in the murderous massacre at Kibbutz Nir Oz on 7.10.</p>\n<p>98th Division forces continue to fight in Western Khan Yunis, to clean new areas above and below ground and encounter Hamas terrorists who are disguised as civilians and prepared to attack our forces in the field. In the last day, the forces eliminated dozens of terrorists and arrested about 80 suspects involved in terrorism, including several terrorists who took part in the murderous massacre on October 7th.</p>\n<p>Givati Brigade combat team snipers eradicated over 15 terrorists. The 646 Brigade combat team fighters identified and eliminated an observer hiding in a building. The Paratroopers and EGOZ located weapons during operations such as grenades, Kalashnikov rifles, RPG rockets, “swaaz” charges, and arsenals.</p>\n<p>A PIJ activist who took part in the murderous massacre at Kibbutz Nir Oz on 7.10 was eliminated by a combat plane guided by the Gaza Division in the Dir El Balah area.</p>\n<p>Observatories of unit 414 identified four terrorists who tried to set up an observation point in the Beit Hanoun area intending to restore the intelligence gathering system of terrorist organizations in the north strip. A combat helicopter attacked and eliminated the cell.</p>\n<p>As part of the activity of the 162 division forces in the North and central strip, the Nahal Brigade&#8217;s combat team eradicated many terrorists in the last day during raids and ambushes in the field. A missile ship detected a terrorist cell in the area where the Nahal Brigade&#8217;s combat team was operating in the central strip. In joint operations by the brigade’s soldiers, a divisional fire complex, a vessel, and an aircraft, the cell was attacked, and some of the terrorists were killed.</p>\n<p>The 401 Brigade combat team eliminated over 15 terrorists during encounters and destroyed a building that served terrorists to fire at the forces and in which explosives were stored.</p>\n<p>Attached is documentation of the aerial elimination of the PIJ terrorist who took part in the attack on Kibbutz Nir Oz on 7.10: https://bit.ly/3UpDfZf</p>\n<p>Attached is a picture of the weapons found by Paratrooper Brigade combat team fighters: https://IDFANC.activetrail.biz/ANC06022024.05056156189</p>\n<p>Attached is documentation of IDF attacks in the Gaza Strip: https://bit.ly/3untsZ3</p>\n<p>Attached is documentation of IDF forces activity on the Strip: https://bit.ly/49l4mc7</p>\n<p>Attached are pictures of IDF forces activity on the Strip: https://IDFANC.activetrail.biz/ANC06022024.156156156</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Above and below ground: IDF forces continue to fight in western Khan Yunis and to conduct operations in the North and central strip; a fighter plane, guided by intelligence, eliminated a PIJ terrorist who took part in the murderous massacre at Kibbutz <a  href=\"https://iron-swords.co.il/t/nir-oz/\">Nir Oz</a> on 7.10. 98th Division forces continue to fight in Western Khan Yunis, to clean new areas above and below ground and encounter <a  href=\"/hamas\">Hamas</a> terrorists who are disguised as civilians and prepared to attack our forces in the field. In the last day, the forces eliminated dozens of terrorists and arrested about 80 suspects involved</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4005",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4005
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4005",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4005"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4005/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4005"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4005"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4005"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}