{
    "id": 3974,
    "date": "2024-02-09T11:16:08",
    "date_gmt": "2024-02-09T09:16:08",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8829/"
    },
    "modified": "2024-02-09T11:16:08",
    "modified_gmt": "2024-02-09T09:16:08",
    "slug": "8829",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8829/",
    "title": {
        "rendered": "&#8220;Joint Military Efforts Thwart Terrorist Activities in Gaza Strip: Inside Look at IDF&#8217;s Strategic Operations&#8221;"
    },
    "content": {
        "rendered": "<p>IDF spokesman:</p>\n<p>The fighting in the Gaza Strip continues; documentation: The commando forces&#8217; closure of a terrorist cell that tried to activate explosives near soldiers in west Khan Yunis.</p>\n<p>In the last day, the navy, the air force, and ground forces continue to jointly fight in the Gaza Strip, closing down quickly on armed terrorist cells and destroying terror infrastructures.<br />\nParallel to the fighting in Khan Yunis, our soldiers eliminate many terrorists in the northern and central Strip.</p>\n<p>The commando brigade continues to clear terror zones in west Khan Yunis. In one activity, fighters from the Egoz unit raided an area used by Hamas terrorists for attacks against our forces.</p>\n<p>The commando brigade’s firepower complex identified a terrorist cell that had laid explosive charges near IDF forces operating in the area. Minutes after the identification, the complex directed an aircraft that attacked and eliminated the cell of terrorists.</p>\n<p>As part of the fighting in Khan Yunis, fighters from unit 414 identified two terrorists emerging from a terror funnel in the area, carrying warfare means. After the unit&#8217;s collaboration with the air force, the terrorists were successfully targeted and eliminated.</p>\n<p>As part of the activities of the Paratrooper brigade&#8217;s combat team in west Khan Yunis, the soldiers eliminated 15 terrorists and stormed terror infrastructures in which they located many weapons including several Kalashnikov guns, ammunition, and grenades.</p>\n<p>In another activity in the area, the combat team of brigade 646 directed an aircraft that attacked a number of booby-trapped buildings near the forces. During the raids on terror targets, the soldiers located warfare aids, military equipment, and technological means.</p>\n<p>In the Beit Lahiya sector, the northern brigade’s firepower complex identified an armed terrorist cell operating near a military outpost of the Hamas terror organization. Simultaneously, as an aircraft was directed to the location to attack the cell, the forces identified two additional armed terrorists operating in the area. Subsequently, an aircraft targeted and eliminated the cell along with the two additional terrorists.</p>\n<p>Attached is documentation of the elimination of the terror cells in Beit Lahiya and Khan Yunis sectors: https://bit.ly/3UvCoq1</p>\n<p>Attached is documentation of the elimination of the terrorists who planted explosives in west Khan Yunis: https://bit.ly/3HQWS4S</p>\n<p>Attached are photos from IDF operations in the Strip: https://IDFANC.activetrail.biz/ANC090220244279509</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF spokesman: The fighting in the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip continues; documentation: The commando forces&#8217; closure of a terrorist cell that tried to activate explosives near soldiers in west Khan Yunis. In the last day, the navy, the air force, and ground forces continue to jointly fight in the Gaza Strip, closing down quickly on armed terrorist cells and destroying terror infrastructures. Parallel to the fighting in Khan Yunis, our soldiers eliminate many terrorists in the northern and central Strip. The commando brigade continues to clear terror zones in west Khan Yunis. In one activity, fighters from the Egoz unit raided an</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3974",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3974
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3974",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3974"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3974/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3974"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3974"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3974"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}