{
    "id": 3958,
    "date": "2024-02-11T21:20:44",
    "date_gmt": "2024-02-11T19:20:44",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8845/"
    },
    "modified": "2024-02-11T21:20:44",
    "modified_gmt": "2024-02-11T19:20:44",
    "slug": "8845",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8845/",
    "title": {
        "rendered": "&#8220;IDF&#8217;s Strategic Capture of Terrorists from Al Amal Hospital: An Operation Ensuring Medical Safety Amidst Conflict&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF fighters captured about 20 terrorists hiding in Al Amal Hospital, without affecting the hospital&#8217;s operation.</p>\n<p>The combat team of the Givati Brigade, Shayetet 13, and other special forces, operated earlier this week, under the intelligence direction of the Israeli Security Agency (Shabak) and Aman in Al Amal Hospital in western Khan Yunis. As part of the operation, the forces captured about 20 terrorists, including terrorists belonging to the Hamas terror organization who were hiding in the hospital. The detainees were brought to continue the investigation of the Israeli security forces.</p>\n<p>The operation included prior coordination with the hospital, and the forces meticulously and selectively scanned the hospital without firing or harming patients or the medical team. After the operation, the IDF, through the Coordination and Liaison Administration for Gaza of COGAT, facilitated the entry of dozens of oxygen balloons donated by international organizations to the hospital&#8217;s patients.</p>\n<p>IDF fighters were trained in advance on the importance of preventing harm to patients, medical teams, civilians, and medical equipment, in accordance with international law. This operation again proves the cynical pattern of action of the Hamas terrorist organization that uses hospitals and uses population camouflage for terrorist hiding purposes.</p>\n<p>This operation joins the intense fighting in western Khan Yunis and the strengthening of the ground operation in the area, during which hundreds of terrorists were killed and hundreds of terrorists trying to flee under the cover of the population were arrested.</p>\n<p>Attached is a video of oxygen balloons that were brought into the hospital by IDF forces: https://bit.ly/49zwM2h</p>\n<p>Attached are photos of the oxygen balloons brought in for treatment of the hospital&#8217;s patients: https://IDFANC.activetrail.biz/ANC68324543</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF fighters captured about 20 terrorists hiding in Al Amal Hospital, without affecting the hospital&#8217;s operation. The combat team of the <a  href=\"https://iron-swords.co.il/t/givati-brigade/\">Givati Brigade</a>, Shayetet 13, and other special forces, operated earlier this week, under the intelligence direction of the Israeli Security Agency (Shabak) and Aman in Al Amal Hospital in western Khan Yunis. As part of the operation, the forces captured about 20 terrorists, including terrorists belonging to the <a  href=\"/hamas\">Hamas</a> <a  href=\"https://iron-swords.co.il/t/terror-organization/\">terror organization</a> who were hiding in the hospital. The detainees were brought to continue the investigation of the Israeli security forces. The operation included prior coordination with the</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3958",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3958
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3958",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3958"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3958/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3958"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3958"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3958"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}