{
    "id": 3952,
    "date": "2024-02-12T13:12:43",
    "date_gmt": "2024-02-12T11:12:43",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8851/"
    },
    "modified": "2024-02-12T13:12:43",
    "modified_gmt": "2024-02-12T11:12:43",
    "slug": "8851",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8851/",
    "title": {
        "rendered": "&#8220;Anti-Terror Operations: IDF and ISA Apprehend 17 Suspects, Thwart Stabbing Attack in Gush Etzion&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>&#8220;The IDF, the Israel Security Agency (ISA) and the Police Border Unit apprehended 17 suspects across the central command area last night; the teams initiated an anti-terror operation in the village of Aram, located in the Binyamin district.</p>\n<p>The IDF, ISA and the Police Border Unit apprehended 17 suspects across Judea and Samaria, and in the Jordan Valley and Emek divisions last night. </p>\n<p>In an anti-terror operation in the village of Tel in the Samaria infantry division, IDF reserve soldiers and Police Border Unit apprehended seven suspects under the direction of the ISA, searched buildings, and confiscated military equipment. Yesterday, the soldiers arrested a suspect, located and confiscated an M16 firearm at the village of Izria, located in the Gush Etzion district.</p>\n<p>In addition, this morning an operation began to thwart terror in the village of Aram, also in the Binyamin district, which is still ongoing. Thus far the forces have interrogated multiple suspects and discovered weapons and military equipment.</p>\n<p>Furthermore, yesterday evening, IDF soldiers thwarted a stab attack near the village of Husan in the Gush Etzion district. The forces identified a terrorist attempting to stab an IDF soldier and in response neutralized the assailant. There were no casualties amongst our forces during the incident.</p>\n<p>The apprehended suspects and confiscated weapons were handed to the security forces for further discussions, our troops did not suffer any casualties.</p>\n<p>So far, since the beginning of the war, over 3080 suspects were detained across the Judea and Samaria Brigade and the Jordan Valley and Emek divisions, of which over 1350 are affiliated with the Hamas terrorist organization.</p>\n<p>Attached is a photo of the gun that was confiscated in the village of Izria in the Gush Etzion area: https://IDFANC.activetrail.biz/ANC1202202423099087</p>\n<p>Attached is a link of the press briefing by Major &#8216;L&#8217;, deputy of the Tabor Battalion of the Rescue and Instruction Brigade, discussing thwaring the attempted stabbing attack in the Gush Etzion area last night: https://bit.ly/3utGzrK.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: &#8220;The IDF, the <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> Security Agency (ISA) and the Police Border Unit apprehended 17 suspects across the central command area last night; the teams initiated an anti-terror operation in the village of Aram, located in the Binyamin district. The IDF, ISA and the Police Border Unit apprehended 17 suspects across Judea and Samaria, and in the Jordan Valley and Emek divisions last night. In an anti-terror operation in the village of Tel in the Samaria infantry division, IDF reserve soldiers and Police Border Unit apprehended seven suspects under the direction of the ISA, searched buildings, and confiscated military</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3952",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3952
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3952",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3952"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3952/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3952"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3952"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3952"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}