{
    "id": 3907,
    "date": "2024-02-17T09:09:57",
    "date_gmt": "2024-02-17T07:09:57",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8896/"
    },
    "modified": "2024-02-17T09:09:57",
    "modified_gmt": "2024-02-17T07:09:57",
    "slug": "8896",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8896/",
    "title": {
        "rendered": "&#8220;IDF Forces Intensify Anti-Terror Operations in the Strip: 100 Suspects Arrested and Multiple Targets Eliminated&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF soldiers continue to operate in the Strip; Brigade 98 forces continue to operate in the Khan Yunis area, and have so far arrested about 100 suspects involved in terror activities at Nasser Hospital, alongside the operations of the Nahal Brigade combat team in central Strip.</p>\n<p>In southern Strip, the forces continue to operate against terror targets in Khan Yunis area.<br />\nThe Combat Collection Unit, Shayetet 13 soldiers, and special forces under Brigade 98, operate at Nasser Hospital based on intelligence information indicating terror activities at the hospital. This activity has led to the arrest of approximately 100 terror-activity suspects at the hospital.<br />\nSimultaneously with the searches, Maglan and Egoz unit fighters eliminated terrorists around the hospital area.</p>\n<p>Also in the Khan Yunis area, Brigade 7 combat team fighters invaded many terror targets in the area where they found war equipment including explosives, grenades, and Kalashnikov weapons.<br />\nFurthermore, in collaboration with brigade&#8217;s fire complexes, the forces identified and targeted an aircraft that destroyed two terrorists who were riding a motorcycle and advancing towards them.</p>\n<p>The fire complex of Brigade 98, collaborating with the forces in the area, identified three terrorists traveling to an area suspected of being a launching site and targeted an aircraft that eliminated them.</p>\n<p>During the intense battles with terrorists in Khan Yunis, the Paratrooper combat team fighters identified a terrorist cell within meters from them and eliminated them with close-range fire.</p>\n<p>Meanwhile, in central Strip, the Nahal Brigade combat team eliminated several terrorists throughout the last day.<br />\nIn one of the operations, the brigade&#8217;s fire complex identified two Hamas activists, and within a short time a combat plane attacked the terrorists and eliminated them.</p>\n<p>Attached is the documentation of IDF attacks in the Strip area: https://bit.ly/3ONKvKH</p>\n<p>Attached are the pictures from the operations of the forces in the Strip area: https://IDFANC.activetrail.biz/ANC17022024.156191</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF soldiers continue to operate in the Strip; Brigade 98 forces continue to operate in the Khan Yunis area, and have so far arrested about 100 suspects involved in terror activities at Nasser Hospital, alongside the operations of the <a  href=\"https://iron-swords.co.il/t/nahal-brigade/\">Nahal Brigade</a> combat team in central Strip. In southern Strip, the forces continue to operate against terror targets in Khan Yunis area. The Combat Collection Unit, Shayetet 13 soldiers, and special forces under Brigade 98, operate at Nasser Hospital based on intelligence information indicating terror activities at the hospital. This activity has led to the arrest of approximately 100</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3907",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3907
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3907",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3907"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3907/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3907"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3907"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3907"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}