{
    "id": 3896,
    "date": "2024-02-18T14:48:45",
    "date_gmt": "2024-02-18T12:48:45",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8907/"
    },
    "modified": "2024-02-18T14:48:45",
    "modified_gmt": "2024-02-18T12:48:45",
    "slug": "8907",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8907/",
    "title": {
        "rendered": "&#8220;IDF and Shin Bet Joint Operation: Senior Wanted Individuals Arrested, Over 3,100 Arrests Since War Start&#8221;"
    },
    "content": {
        "rendered": "<p>Joint statement to the IDF spokesperson, Shin Bet spokespersons, and Police spokespersons:</p>\n<p>IDF forces, undercover police from the Judea and Samaria area, and Shin Bet eliminated a senior wanted individual in Tul Karm in the Menashe Unit; a senior Hamas member and three people wanted were arrested in the forces&#8217; operation in Judea and Samaria.</p>\n<p>Undercover police from the Judea and Samaria area acted on Shin Bet intelligence and in collaboration with IDF forces to arrest Ahmed Oufi, a senior wanted individual in Tul Karm in the Menashe Unit. Oufi was involved in shooting attacks against IDF forces and Israeli settlements, and was suspected of involvement in the murder of Tul Karm residents suspected of cooperating with Israeli security forces. After an exchange of fire with the forces and the application of the &#8220;pressure cooker&#8221; procedure, the wanted person was eliminated and the weapon found on him was seized.</p>\n<p>During the operation, the soldiers shot and hit armed terrorists who opened fire and threw explosive devices at them, one terrorist was eliminated.</p>\n<p>During the exchange of fire, a police officer was seriously wounded by the terrorists&#8217; shooting at the force and was evacuated to receive medical treatment at the hospital.</p>\n<p>Guided by the Shin Bet, another senior wanted person from the Hamas terrorist organization was arrested last night in an operation in the city of Ramallah. In Balata area of Nablus, IDF soldiers arrested two more people wanted. The forces in the Judea Unit were also investigating a number of suspects throughout the region.</p>\n<p>The wanted persons who were arrested were transferred for further investigation by the security forces.</p>\n<p>So far, since the beginning of the war, over 3,100 people wanted have been arrested across the Judea and Samaria Brigade and the Rift Valley and Valleys Unit, more than 1,350 of them affiliated with the Hamas terrorist organization.</p>\n<p>Attached is documentation of the forces&#8217; operations: https://bit.ly/3I3hrLv</p>\n<p>Attached photos on the topic: https://IDFANC.activetrail.biz/ANC18022024.156189</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Joint statement to the <a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a>, Shin Bet spokespersons, and Police spokespersons: IDF forces, undercover police from the Judea and Samaria area, and Shin Bet eliminated a senior wanted individual in Tul Karm in the Menashe Unit; a senior <a  href=\"/hamas\">Hamas</a> member and three people wanted were arrested in the forces&#8217; operation in Judea and Samaria. Undercover police from the Judea and Samaria area acted on Shin Bet intelligence and in collaboration with IDF forces to arrest Ahmed Oufi, a senior wanted individual in Tul Karm in the Menashe Unit. Oufi was involved in shooting attacks against IDF forces and Israeli</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3896",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3896
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3896",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3896"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3896/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3896"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3896"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3896"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}