{
    "id": 3866,
    "date": "2024-02-22T09:07:50",
    "date_gmt": "2024-02-22T07:07:50",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8937/"
    },
    "modified": "2024-02-22T09:07:50",
    "modified_gmt": "2024-02-22T07:07:50",
    "slug": "8937",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8937/",
    "title": {
        "rendered": "&#8220;Ongoing IDF Offensive: Eliminating Terrorists and Destroying Infrastructures in Gaza Strip&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Elimination of terrorists and raids on terror targets; the activities of the 162 Brigade are ongoing in the Zeitoun area, while the air forces and the navy continue to destroy terror infrastructures across the strip.</p>\n<p>In the last day, the forces of the 162 Brigade has continued their offensive activities in the Zeitoun area in the northern part of the strip. Concurrently, the forces of the 98 Brigade continue to exterminate terrorists and destroy terror infrastructures as part of the fighters’ activities in Khan Yunis city. Marines attacked and destroyed several Hamas and PLO vessels in the southern part of the strip overnight.</p>\n<p>The 215 Fire Brigade directed combat aircraft and drones to attack over 10 terror targets in the Zeitoun area, where attacks against our forces were carried out and orchestrated.</p>\n<p>As part of the activities of the 401 Brigade’s combat team in the Zeitoun area, the forces destroyed several terror infrastructures and eliminated around 20 terrorists in the last day, as part of their encounters and a successful collaboration with the air forces and the brigade’s fire complex. During one of the forces’ activities, the fighters identified a terrorist with an RPG operating nearby. In response, the fighters approached and eliminated the terrorist at close range before he could harm them.</p>\n<p>While conducting sweeps, the Nahal Brigade’s combat team in the central part of the strip, the forces located and destroyed a rigged rocket launcher, which was likely planned to be used for launching rockets towards Israel.</p>\n<p>In the last day, the 7 Brigade’s combat team eliminated over 15 terrorists in west Khan Yunis. As part of the raids on terror targets carried out by the forces, the fighters located Kalashnikovs, grenades, military equipment, and explosives intended to harm the forces. In addition, the brigade’s attack complex directed a drone that attacked a military building in which a group of terrorists were located.</p>\n<p>In another activity in the area, the Givati Brigade’s combat team eliminated a group of armed terrorists as part of a successful sniper ambush. Also, the Commando Brigade’s fighters located many weapons along with documents and military equipment of the Hamas terror organization in west Khan Yunis.</p>\n<p>Attached is documentation of IDF attacks in the strip:  https://bit.ly/434m6Xv</p>\n<p>Attached are photos from the forces&#8217; activities in the strip: https://IDFANC.activetrail.biz/ANC2202202482989525</p>\n<p>Attached is documentation of IDF forces&#8217; activities in the strip: https://bit.ly/4bIxD2r.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Elimination of terrorists and raids on terror targets; the activities of the 162 Brigade are ongoing in the Zeitoun area, while the air forces and the navy continue to destroy terror infrastructures across the strip. In the last day, the forces of the 162 Brigade has continued their offensive activities in the Zeitoun area in the northern part of the strip. Concurrently, the forces of the 98 Brigade continue to exterminate terrorists and destroy terror infrastructures as part of the fighters’ activities in Khan Yunis city. Marines attacked and destroyed several <a  href=\"/hamas\">Hamas</a> and PLO vessels in the southern</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3866",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3866
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3866",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3866"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3866/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3866"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3866"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3866"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}