{
    "id": 3839,
    "date": "2024-02-25T13:08:44",
    "date_gmt": "2024-02-25T11:08:44",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8964/"
    },
    "modified": "2024-02-25T13:08:44",
    "modified_gmt": "2024-02-25T11:08:44",
    "slug": "8964",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8964/",
    "title": {
        "rendered": "&#8220;Operation Nazzer: IDF&#8217;s Successful Anti-Terrorism Campaign at Hospital Ensures Continuous Medical Aid in Gaza&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Over the past week, the focused operation at the &#8216;Nazzer&#8217; Hospital against the terrorist organization Hamas has ended.</p>\n<p>After about 200 suspects involved in terrorist activities were arrested at the hospital and additional findings indicating terrorist activity from within the premises were discovered; the humanitarian aid activities to the hospital continued, led by the Commando Brigade and the Coordination and Liaison Administration for Gaza.</p>\n<p>Over the past week, the focused activity of the 98th Division and Flotilla 13 at the premises of Nazzer Hospital against the terrorist organization Hamas was concluded.</p>\n<p>In the operation, sealed drugs that had not been used and on which the names of Israeli kidnapped people were found, many weapons were discovered, and about 200 terrorists and suspects in terrorist activity were apprehended.</p>\n<p>The operation at the hospital was carried out with a commitment to minimal disruption to the hospital&#8217;s routine activity and without harming the patients and medical staff.</p>\n<p>The IDF forces provided an alternative generator that allowed the continued operation of the hospital and treating the patients, and throughout all the operation, the vital systems of the hospital continued to function based on an uninterrupted power supply (UPS) system.<br />\nThe officers of the Coordination and Liaison Administration for Gaza coordinated the entry of professionals to examine the electricity problem in the hospital.</p>\n<p>The hospital received a supply of hundreds of food parcels this past week, including water, food, medical equipment, and baby food formulas. In addition, the entry of a solar powered generator was coordinated with the international community for the continuation of the operation of the generators in the hospital.</p>\n<p>As part of the effort to treat patients, the officers of the Coordination and Liaison Administration for Gaza coordinated, at the request of the hospital staff and in collaboration with the international community, the transfer of several urgent patients to other hospitals in the area.</p>\n<p>Prior to the forces&#8217; departure from the hospital, the premises were cleaned and an additional food shipment was sent to the hospital.</p>\n<p>The IDF will continue to operate, in accordance with international law, against the terrorist organization Hamas, which systematically operates from hospitals and civilian infrastructures.</p>\n<p>Enclosed is a link from the commander of the fighters&#8217; platoon in Flotilla 13, Lieutenant A: https://bit.ly/3IcAsez</p>\n<p>Enclosed is documentation of the entry of the solar generator to Nazzer Hospital: https://bit.ly/3OXpCgp</p>\n<p>Additional photos on the topic attached: https://IDFANC.activetrail.biz/anc240220246845126845120</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Over the past week, the focused operation at the &#8216;Nazzer&#8217; Hospital against the terrorist organization <a  href=\"/hamas\">Hamas</a> has ended. After about 200 suspects involved in terrorist activities were arrested at the hospital and additional findings indicating terrorist activity from within the premises were discovered; the humanitarian aid activities to the hospital continued, led by the Commando Brigade and the Coordination and Liaison Administration for <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>. Over the past week, the focused activity of the 98th Division and Flotilla 13 at the premises of Nazzer Hospital against the terrorist organization <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> was concluded. In the operation, sealed drugs that had</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3839",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3839
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3839",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3839"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3839/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3839"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3839"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3839"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}