{
    "id": 3827,
    "date": "2024-02-26T17:02:33",
    "date_gmt": "2024-02-26T15:02:33",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8976/"
    },
    "modified": "2024-02-26T17:02:33",
    "modified_gmt": "2024-02-26T15:02:33",
    "slug": "8976",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8976/",
    "title": {
        "rendered": "&#8220;Unearthing Gaza: IDF Forces Expose Extensive Underground Tunnel Network&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>A subterranean system was located that connects the northern part of the Gaza Strip to the south: approximately 10 km of underground tunnels that passed beneath a hospital and a university.</p>\n<p>Forces of the 162th Division, led by the fighting team of the Nahal Brigade, and in collaboration with Yahalom forces and Engineering personnel, discovered a system of subterranean tunnels connecting the north and south of the Gaza Strip. The forces gained operational control of the tunnels and following their investigation, destroyed large sections of the system.</p>\n<p>The system connected the Turkish hospital bordering the Central Camp, to the Al-Azhar University building in the south of Gaza City and extended to the Zeitoun area. This is an inter-brigade system used for the movement of operatives between different brigades during operations. The tunnels connect the central brigade and the urban brigade of Gaza City &#8211; including the Nasseriyah, Zabrak and Zeitoun regiments.</p>\n<p>In the tunnels, they found rooms for living quarters which included facilities, storage rooms for weapons and combat equipment, a complex pits system, as well as the bodies of terrorists that were left in the tunnel.</p>\n<p>In the words of the commander of the Nahal Brigade, Colonel Yair Zuckerman: &#8220;In recent weeks, together with Engineering forces, we conducted significant activities to locate an underground tunnel network that spreads from north to south of the Strip, understanding that part of the Strip&#8217;s endowment is also in the ground and sub-ground effort. The destruction of the underground was made possible following the activity of the Nahal Combat Engineering Force in the Nizirim corridor, and also following a divisional operation in which the Nahal Combat Engineering Force operates in Zeitoun, following the operation in the Shati area.&#8221;</p>\n<p>Attached is an illustrated depiction of the subterranean tunnels connecting the north and south of the Gaza Strip: https://bit.ly/4bRIN56</p>\n<p>Attached is an illustration of the subterranean tunnel connecting the north and south of the Gaza Strip: https://idfanc.activetrail.biz/ANC2602243434</p>\n<p>Attached is documentation from within the tunnel and its destruction: https://bit.ly/3USGB76</p>\n<p>Attached is documentation of the discovery of pits near the hospital: https://bit.ly/49LIGWW</p>\n<p>Attached is a statement from the Commander of the Nahal Brigade, Colonel Yair Zuckerman: https://bit.ly/4bIwAPY</p>\n<p>Attached is a statement from the Commander of the Nahal Reconnaissance Unit, Lieutenant Colonel Ron: https://bit.ly/3Td4S6X</p>\n<p>Attached are images of combat means, explosives, and pits found in the area: https://IDFANC.activetrail.biz/ANC9204785</p>\n<p>Attached is a picture of terrorist bodies that were left in the tunnel: https://idfanc.activetrail.biz/ANC260224567</p>\n<p>Attached are images related to the topic: https://idfanc.activetrail.biz/ANC2602241234</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: A subterranean system was located that connects the northern part of the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip to the south: approximately 10 km of underground tunnels that passed beneath a hospital and a university. Forces of the 162th Division, led by the fighting team of the <a  href=\"https://iron-swords.co.il/t/nahal-brigade/\">Nahal Brigade</a>, and in collaboration with Yahalom forces and Engineering personnel, discovered a system of subterranean tunnels connecting the north and south of the Gaza Strip. The forces gained operational control of the tunnels and following their investigation, destroyed large sections of the system. The system connected the Turkish hospital bordering the Central Camp, to</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-3827",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 3827
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3827",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=3827"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/3827/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=3827"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=3827"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=3827"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}