{
    "id": 6987,
    "date": "2024-08-01T15:00:00",
    "date_gmt": "2024-08-01T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6987"
    },
    "modified": "2024-08-02T00:10:07",
    "modified_gmt": "2024-08-01T21:10:07",
    "slug": "%d0%bc%d0%b5%d1%81%d1%82%d1%8c-%d0%b8%d1%80%d0%b0%d0%bd%d0%b0-%d1%8d%d1%82%d0%be-%d0%bd%d0%b5-%d1%81%d0%b0%d0%bc%d0%be%d0%be%d0%b1%d0%be%d1%80%d0%be%d0%bd%d0%b0-%d0%b5%d0%b6%d0%b5%d0%b4",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/ru/israeli-citizen-spokesperson/%d0%bc%d0%b5%d1%81%d1%82%d1%8c-%d0%b8%d1%80%d0%b0%d0%bd%d0%b0-%d1%8d%d1%82%d0%be-%d0%bd%d0%b5-%d1%81%d0%b0%d0%bc%d0%be%d0%be%d0%b1%d0%be%d1%80%d0%be%d0%bd%d0%b0-%d0%b5%d0%b6%d0%b5%d0%b4/",
    "title": {
        "rendered": "Месть Ирана — это не самооборона | Ежедневный брифинг с Эшли Ваксман Бакши"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Iran’s Revenge is Not Self-Defense | Daily Briefing with Ashley Waxman Bakshi\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/EHPPbL2r6WM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Всем привет. Я пресс-секретарь граждан Израиля Эшли Ваксман Баки. Сегодня 1 августа 2024 года. Это ежедневный прямой брифинг офиса пресс-секретаря граждан Израиля. Мы в прямом эфире на Instagram, X, YouTube и LinkedIn, а затем запись доступна на всех популярных платформах для подкастов. Пожалуйста, начинайте отправлять вопросы в чат и, как всегда, ставьте лайки и подписывайтесь, чтобы помочь нам достичь более широкой аудитории.</p>\n\n\n\n<h3 class=\"wp-block-heading\">300-й день войны 7 октября</h3>\n\n\n\n<p>Сегодня 300-й день войны 7 октября и кризиса с заложниками ХАМАС. Уже 300 дней заложников морят голодом, пытают, насилуют и казнят в террористических подземельях ХАМАС. Нам нужен ваш голос, чтобы требовать освобождения заложников сейчас.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ответ Ирана и эскалация</h3>\n\n\n\n<p>Израиль готовится к ответу Ирана. Иран открыто обещает месть и угрожает эскалацией своей семифронтовой войны против Израиля. Иран зол на Израиль за предполагаемую ликвидацию террориста ХАМАС в Тегеране, так как хочет защитить лидеров своих прокси-армий, чтобы те могли продолжать атаковать Израиль. Предполагаемая ликвидация Хания Израилем не была эскалацией. Массовое убийство 7 октября со стороны ХАМАС было эскалацией. Вход Хезболлы в эту войну 8 октября, запуск 6500 ракет, ракет и дронов был эскалацией. Исламские пиратские атаки Хути были эскалацией. Атаки прокси-армий Ирана в Ираке и Сирии были эскалацией. Наполнение Западного берега оружием для джихада против евреев было эскалацией. Прямое массовое воздушное нападение Ирана в апреле с 350 ракетами и дронами было эскалацией.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Самооборона Израиля</h3>\n\n\n\n<p>Израиль ведет оборонительную войну. Он защищает своих людей от иранского режима и его прокси-армий в жестокой семифронтовой региональной войне. Он хочет снизить напряженность, устранив угрозы. Прокси Ирана объявили войну Израилю. Израиль защищается. Угроза мести Ирана &#8211; это не самооборона; это продолжение агрессии. Мир должен остановить агрессию Ирана, а не потакать ей, потому что Ближний Восток, доминируемый аятоллой Ирана, не будет безопасным ни для кого, ни для израильтян, ни для арабов, ни для Запада.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Привлечение Ирана к ответственности</h3>\n\n\n\n<p>Израиль понимает, что проблема не в ХАМАСе или Хезболле, а в Иране. Иран ежедневно разжигает пламя войны. Иран должен быть привлечен к ответственности за свои прямые и косвенные военные действия против народа Израиля. Его преступный халифат должен быть остановлен. Ранее Иран понимал, что в худшем случае его атаки и атаки его прокси-армий будут подавлены, и иногда Иран может добиться успеха в жестоком убийстве невинных людей в Израиле. Израиль говорит Ирану, что он ошибается. Мир должен сказать то же самое. Иран должен понять реальную цену за финансирование ракетных, ракетных и дроновых атак и за варварское насилие и убийства, совершенные 7 октября. Цена должна быть настолько высокой, чтобы Иран предпочел прекратить свою семифронтовую войну против еврейского народа. Скажите своим лидерам, чтобы сказали иранскому пироману-аятолле прекратить разжигать огонь вокруг Израиля, прежде чем Израилю придется бороться с этим огнем.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Подтвержденный удар по террористическому мастермайнд ХАМАС</h3>\n\n\n\n<p>Сегодня Израиль подтвердил, что удар по террористическому мастермайнд ХАМАС Мухаммаду Дейфу был успешным. Дейф присоединяется к Исмаилу Хании, Марвану Иссе, Салеху Аль-Арури и длинному списку командиров ХАМАС в аду, больше не атакующим израильтян и не угнетающим газанцев. Руководство ХАМАС рушится. Сообщается, что большинство из 24 батальонов ХАМАС были расформированы. Израиль сейчас контролирует многие ключевые точки в секторе Газа, включая коридор Филадельфия, границу Газы с Египтом и в значительной степени перекрыл оружейный канал, использованный для массовых убийств мирных жителей 7 октября.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Успехи и текущие вызовы Израиля</h3>\n\n\n\n<p>Очевидно, что Израиль побеждает. Он предположительно ликвидировал Ханию в Тегеране, и ХАМАС не отомстил. Почему? Потому что не хочет или не может. Израиль уничтожил лидера ХАМАС, и не было ракетных атак на Тель-Авив. ХАМАС не стал менее жестоким, и бои все еще продолжаются, но силы Израиля значительно уменьшили способность ХАМАС наносить вред нашему народу. Мы благодарны, что многие из поставленных целей на начало войны &#8211; уничтожение способности ХАМАС угрожать народу Израиля &#8211; были достигнуты. Мы благодарны, что те, кто утверждал, что ХАМАС &#8211; это идеология, которую невозможно победить, оказались абсолютно неправы.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Возвращение заложников</h3>\n\n\n\n<p>Цель, которая была достигнута лишь частично &#8211; это возвращение наших заложников. 115 заложников все еще удерживаются тем, что осталось от ХАМАС, включая мою кузину, 19-летнюю Аелет Гринберг, и двух малышей. Сегодня 300 дней, как ХАМАС жестоко разлучил этих детей, молодых людей и пожилых, некоторых переживших Холокост, с их семьями. 15 женщин все еще находятся в руках насильников ХАМАС. Прошло почти 10 месяцев; вы можете сами посчитать. Каждый день, который проходит, представляет непосредственную угрозу для жизни этих женщин. ХАМАС и их катарские хозяева морочили нас месяцы. Израиль продолжит бороться с ХАМАС, и мы просим вас усилить призыв: безоговорочно сдаться и освободить наших заложников.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Поддержка и участие</h3>\n\n\n\n<p>Несколько слов для наших зрителей: для всех, кто спрашивает, чем можно помочь, на всех наших платформах в социальных сетях есть ссылки на кампанию JGive. Эти пожертвования обеспечивают поддержку, необходимую для продолжения распространения информации. Также я прошу вас подписаться на наш список рассылки. Обещаю, мы не будем беспокоить вас спамом; это позволит нам напрямую передавать вам наши сообщения и время от времени делиться специальным контентом.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Вопросы от аудитории</h3>\n\n\n\n<p><strong>Вопрос от Джоан в Instagram Live:</strong> Почему вы, израильтяне, так злитесь из-за 12 погибших детей в Израиле, когда Израиль убил тысячи детей в Газе?</p>\n\n\n\n<p><strong>Ответ:</strong> Мы злимся на смерть каждого ребенка, каждого ребенка. Но вы не можете сравнивать террористическую организацию Хезболла, которая решила начать войну против нас 8 октября и нацелилась на Мадждал-Шамс, который является гражданским сообществом в Голанских высотах. В Мадждал-Шамсе нет военных целей. Он специально нацелился на гражданский город, в то время как ЦАХАЛ (Армия обороны Израиля) защищается от террористической организации ХАМАС, и ХАМАС буквально встраивается под гражданское население в туннелях и под гражданскую инфраструктуру. ХАМАС использует свое гражданское население как живой щит. Израиль никогда не нацеливается на детей и гражданское население; он всегда нацеливается на ХАМАС, его оружие и заводы по производству оружия, которые встроены в гражданское население. Если вы собираетесь обвинять кого-то в гибели гражданского населения Газы, ответственность лежит на ХАМАСе.</p>\n\n\n\n<p><strong>Вопрос от нескольких зрителей:</strong> Действительно ли вы думаете, что убийство Хании что-то изменит?</p>\n\n\n\n<p><strong>Ответ:</strong> Это отличный вопрос, и я думаю, что время покажет. Но если бы мне пришлось делать оценку, я думаю, что это огромный удар по ХАМАСу, его репутации и тому, как окружающие арабские прокси и террористические прокси и Иран видят их предполагаемые возможности. Не только он был ликвидирован, но это также было сделано на тегеранской земле. Это посылает очень громкое</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Пресс-секретарь Израиля Эшли Ваксман Баки в прямом эфире 1 августа 2024 года рассказала о 300-м дне войны 7 октября и кризисе с заложниками ХАМАС. Она обсудила угрозы Ирана, самооборону Израиля и важность глобальной поддержки. Также рассматривались вопросы о влиянии войны и предвзятости СМИ.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6986,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 442,
        "footnotes": ""
    },
    "categories": [
        442
    ],
    "tags": [
        504
    ],
    "class_list": [
        "post-6987",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-504"
    ],
    "lang": "ru",
    "translations": {
        "ru": 6987,
        "en": 6983,
        "he": 6998
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6987",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6987"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6987/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6997,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6987/revisions/6997"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6986"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6987"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6987"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6987"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}