{
    "id": 16506,
    "date": "2024-08-30T16:40:40",
    "date_gmt": "2024-08-30T13:40:40",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=16506"
    },
    "modified": "2024-08-30T16:40:45",
    "modified_gmt": "2024-08-30T13:40:45",
    "slug": "do-the-rothschilds-control-the-world",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/do-the-rothschilds-control-the-world/",
    "title": {
        "rendered": "Do the Rothschilds Control the World?"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Do the Rothschilds Control the World? | Unpacked\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/dCD9Eemz6Zs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Depending on where you spend your time on the internet, the name Rothschild might conjure up images of investment bankers, winemakers, or philanthropists. But in some circles, the name Rothschild is shorthand for a shadowy Jewish cabal that controls everything from world governments to the weather. This is because the Rothschild family has been at the center of a conspiracy theory for over 150 years. Though many Jews make fun of these kinds of conspiracy theories—&#8221;For the last time, guys, we don&#8217;t have space lasers&#8221;—the violence they provoke is anything but funny. So, why are so many people convinced that a single Jewish family controls the world?</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Origins of the Rothschild Banking Dynasty</h3>\n\n\n\n<p>Our story begins in the 1760s when a German Jew named Mayer Amschel Rothschild founded what would become known as the Rothschild banking dynasty. His profession wasn&#8217;t a coincidence. Long before Mayer was born, European authorities had decided they really didn&#8217;t like their Jewish minority populations. Jews were forced to live in ghettos, prohibited from owning land, and shut out of most industries, with one notable exception: money lending.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Money Lending Dilemma</h3>\n\n\n\n<p>All three of the primary Abrahamic religions have complicated financial laws. Jews, Christians, and Muslims alike are prohibited from lending money with interest, but these rules only apply to dealings with people in your religion. Jews could charge interest to Christians, and Christians could theoretically charge interest to Jews. So, if a Christian needed a loan, he turned to a Jewish lender. The Christian borrower got the money he needed, and the Jewish lender was able to make a living. Sounds like a win-win, right? Not exactly. This whole system put Jewish people in the very unpleasant position of loaning money to their Christian neighbors, which meant collecting debts—an interaction that led to the birth of an anti-Semitic trope.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Mayer Amschel Rothschild&#8217;s Rise to Power</h3>\n\n\n\n<p>Mayer Amschel Rothschild was born in the Frankfurt ghetto to a religious family. He trained to be a rabbi, but his studies were cut short when his parents died, leaving him in need of a source of income. He found work as an apprentice in a banking house. Mayer rose through the ranks, eventually working his way into the position of Court Jew to a Hessian nobleman—a title that essentially made him the personal accountant and banker to very wealthy and influential folks.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Rothschild Family&#8217;s Global Influence</h3>\n\n\n\n<p>Mayer did so well for himself that he decided to open his own banking house. He sent his sons to establish branches in England, France, Austria, and Italy. By the mid-1800s, the Rothschilds were one of the most wealthy and famous families in Europe. They were very well connected, doing business and rubbing shoulders with Europe&#8217;s political elite. They helped finance their nation&#8217;s armies, provided a loan that helped Great Britain acquire the Suez Canal, and were bankers for the Tsars. This success made them the perfect targets for anti-Semitic nonsense.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Birth of the Rothschild Conspiracy Theory</h3>\n\n\n\n<p>For centuries, Europeans had seen Jews as greedy, manipulative money hoarders. A Jew couldn&#8217;t just be wealthy and successful through hard work and making the best of his exclusion from most industries—there always had to be some dark reason for Jewish success. A man named Matthew George Darnel wrote a French-language pamphlet titled &#8220;The Edifying and Curious History of Rothschild, the King of the Jews.&#8221; Under the bizarre pen name &#8220;Satan,&#8221; he filled the pamphlet with spicy accusations against the Rothschild family, including a claim that Nathan Mayer Rothschild manipulated the stock market after the Battle of Waterloo to make a killing.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Evolution of the Conspiracy</h3>\n\n\n\n<p>Historians have confirmed that Nathan Rothschild was nowhere near Waterloo that day, and he didn&#8217;t make a killing on the stock market because of it. The entire story was fabricated by &#8220;Satan,&#8221; who didn&#8217;t write it down until 1846, a full 30 years after the Battle of Waterloo and a decade after Nathan&#8217;s death. Despite the truth coming out, the conspiracy evolved to fit new details, with the story growing more outrageous over time.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Persistence of Anti-Semitic Tropes</h3>\n\n\n\n<p>The Rothschild conspiracy is one of the most viral, trendy, and searched-for anti-Semitic conspiracies on social media. People continue to embellish the legend with new fantastical details, such as the claim that the Rothschilds own world banks, including the US Federal Reserve, or that they control the weather and use space lasers to start wildfires. These baseless theories persist, despite being debunked repeatedly.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Who Are the Rothschilds Today?</h3>\n\n\n\n<p>If the Rothschilds aren&#8217;t the world&#8217;s puppet masters, who are they? Today, they are still primarily a banking family, though many family members have branched out into other activities like art collecting, winemaking, and environmental activism. They are still wealthy, though not as wealthy as they used to be, partly because many of their assets were seized during the Holocaust. They support charitable causes, including Jewish ones, yet conspiracists believe they are sitting on a secret fortune of $500 trillion—more than the estimated total private wealth in the world.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Combating Conspiracy Theories</h3>\n\n\n\n<p>Sadly, conspiracists don&#8217;t care about facts. If you&#8217;re far enough down the rabbit hole, a fact-based article from a reliable news source looks like another piece in the puzzle—a puzzle the Rothschilds or the Jewish media must have paid for. According to a poll from the Anti-Defamation League, roughly 70% of people who harbor anti-Semitic attitudes have never even met a Jew. People who actually know Jews are far less likely to hold anti-Semitic beliefs. While facts and figures may not always change minds, being ourselves and showing people who we really are might be the most powerful tool we have in the fight against conspiracy theories.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The Rothschild family has long been the target of conspiracy theories, falsely accused of controlling global events. This blog explores the origins of these myths, debunks common claims, and discusses the persistence of anti-Semitic beliefs, highlighting the importance of personal connections in countering harmful stereotypes.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 16507,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        54
    ],
    "class_list": [
        "post-16506",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-education"
    ],
    "lang": "en",
    "translations": {
        "en": 16506
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16506",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=16506"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16506/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16508,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16506/revisions/16508"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/16507"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=16506"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=16506"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=16506"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}