{
    "id": 16503,
    "date": "2024-08-30T11:18:28",
    "date_gmt": "2024-08-30T08:18:28",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=16503"
    },
    "modified": "2024-08-30T11:18:33",
    "modified_gmt": "2024-08-30T08:18:33",
    "slug": "does-israel-target-civilians-in-gaza",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/does-israel-target-civilians-in-gaza/",
    "title": {
        "rendered": "Does Israel Target Civilians in Gaza?"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Does Israel Target Civilians in Gaza? | Unpacked\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/WQ1yIvcg13Q?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>The accusation that Israel commits war crimes is nothing new. In the 21st century, wars are fought on multiple fronts, including the internet. Each side is determined to prove its legitimacy, and accusations fly hard and fast with little regard for accuracy.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Battlefield of Misinformation</h4>\n\n\n\n<p>The fun of war usually refers to people on the battlefield. However, this now also applies to some of the combatants on social media, who spread misinformation and outright lies. Each accusation is more damning than the next: daily war crimes, crimes against humanity. It&#8217;s tempting to use increasingly dramatic language—both sides do it—to build sympathy. But we should be careful: words like &#8220;war crime&#8221; have actual, agreed-upon legal definitions.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Legal Definition of War Crimes</h4>\n\n\n\n<p>So, is it true? Does Israel commit war crimes as defined by international law? The situation is complex, but it was the biggest massacre of Jewish people since the Holocaust. Israeli civilians were massacred in their homes, and the situation with the hostages, who are estimated to be around 200 in total, including about 10% children, is dire. Hamas burst into Israeli communities with machine guns, grenades, rocket launchers, and GoPro cameras to document their atrocities on social media. Israelis were shocked and determined to stamp out the threat of Hamas once and for all. The IDF began striking Gaza the next day, and almost immediately, critics began accusing Israel of war crimes.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Misuse of War Crime Language</h4>\n\n\n\n<p>But the more we misuse or inflate this kind of language, the less these concepts actually mean. It’s important to clarify that we are talking about legal definitions and what is permissible under international law. This doesn&#8217;t mean it&#8217;s pleasant or comfortable, nor does it deny the suffering of civilians in Gaza. The question is whether what is happening meets the legal definition of a war crime.</p>\n\n\n\n<h4 class=\"wp-block-heading\">International Law and War Crimes</h4>\n\n\n\n<p>A war crime is a violation of the international laws of war, which are principally found in the Geneva Conventions. For example, the intentional targeting of civilians, the use of human shields, the taking of non-combatants as hostages, and the torture of prisoners are all considered war crimes. The essence of the law of war is distinguishing civilians from combatants. So far, it sounds like Hamas has used all the examples outlined in the Geneva Conventions as a how-to manual.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Actions of Hamas</h4>\n\n\n\n<p>Hamas tortured 80% of its victims, including children, adults, and militants, and kidnapped more than 100 people. Hamas is willing to use innocent civilians as human shields. However, we are not asking whether Hamas commits war crimes; we are trying to figure out if Israel does.</p>\n\n\n\n<h4 class=\"wp-block-heading\">IDF&#8217;s Intentions and Civilian Casualties</h4>\n\n\n\n<p>The IDF has repeatedly stated that their air strikes do not target civilians. The civilians are in a very difficult situation, but they are not the target. It&#8217;s impossible to deny that IDF air strikes do hurt Palestinian civilians in Gaza, nearly 50% of whom are under the age of 18. The air strikes destroy homes and livelihoods, kill and wound innocent people, and leave an entire population traumatized. But does all that suffering constitute a war crime?</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Rome Statute and War Crimes</h4>\n\n\n\n<p>The International Criminal Court (ICC) has only been around for a couple of decades. Its purpose is to prosecute war criminals using the Rome Statute, which defines war crimes deserving punishment, such as targeting civilians. Despite Hamas openly slaughtering innocent civilians, there are no reliable reports that the IDF has intentionally targeted civilians. The legal definition of a war crime hinges on intention. Is an attack intended to kill civilians or not? If the answer is no, then the Israeli air strikes cannot be considered a war crime.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Proportionality in Warfare</h4>\n\n\n\n<p>The biggest criticism that Israel faces is that its attacks on Gaza are disproportionate. The stark contrast in casualties on both sides suggests a wholly disproportionate response, which seems like a war crime. Even if Israel doesn&#8217;t target civilians on purpose, the death toll and destruction in Gaza are hard to ignore. However, proportionality in warfare isn&#8217;t about revenge or matching the enemy&#8217;s actions. It&#8217;s about whether the anticipated civilian damage is proportionate to the military advantage.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hamas&#8217; Tactics and Proportionality</h4>\n\n\n\n<p>Hamas is skilled at public relations. They know that more civilian deaths make them look justified in attacking Israel. That&#8217;s why they use human shields—the more dead civilians, the more legitimate Hamas looks. Proportionality in warfare means that when picking a military target, the anticipated civilian damage should be somewhat proportionate to the military advantage. There&#8217;s no mathematical formula for this, which leaves room for interpretation and moral uncertainty.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Ethics of Military Decisions</h4>\n\n\n\n<p>Deciding whether to level a building or not, knowing that it may harm innocent neighbors while targeting a key terrorist figure, is a heavy burden. These decisions weigh heavily on those who make them and on all moral people who watch the violence with heavy hearts. The only comfort is knowing that these strikes might prevent further unnecessary deaths in the future.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Siege on Gaza: Legal or War Crime?</h4>\n\n\n\n<p>Within a week of Hamas&#8217; attack, Israel announced it would cut Gaza&#8217;s electricity, water, and internet. While this move may be intended to hinder Hamas, it also hurts civilians. Gaza has suffered from inadequate infrastructure and food insecurity for years, partly due to Hamas&#8217; mismanagement and theft of humanitarian supplies. So, does this siege count as a war crime? Blockades or sieges like the one in Gaza are not prohibited under international law. However, Siege law has humanitarian aspects, including facilitating food and medicine over the border by third parties, but only if they can be reliably delivered without diversion to the enemy.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Gaza Under Blockade</h4>\n\n\n\n<p>Gaza has been under blockade since Hamas came to power in 2006. Israel and Egypt control what enters and exits Gaza. These blockades are legal under international law and are maintained to prevent Hamas from acquiring materials that could be used for attacks. Hamas has a history of using aid for military purposes, such as turning water pipes into rockets. Many Gazans are frustrated with Hamas&#8217; rule, but speaking out is dangerous.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Role of Hamas in Gaza&#8217;s Suffering</h4>\n\n\n\n<p>Hamas&#8217; actions contribute significantly to the suffering of Gazan civilians. They steal humanitarian supplies, use civilians as shields, and prioritize their military objectives over the welfare of the people. Despite this, there are always those who demonize Israel simply for existing.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Israel&#8217;s Intentions and the Moral Dilemma</h4>\n\n\n\n<p>Many good-hearted people believe that Israel commits war crimes based on civilian suffering. However, having spoken to experts and seen Israel&#8217;s tactics firsthand as a soldier, I can confidently say that Israel&#8217;s intentions are not to harm civilians, and intention matters in international military law. Israel has nothing to gain by purposely targeting civilians and everything to lose—its reputation, security, and morality.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Israel&#8217;s Conduct in War</h4>\n\n\n\n<p>So no, Israel doesn&#8217;t commit war crimes. It wages war lawfully and according to international law. War may be ugly, hellish, and oppressive, but that&#8217;s not a war crime—that&#8217;s just war. I hope that one day, in my lifetime, there won&#8217;t be any more war. But until that day comes, I&#8217;m proud to live in a country that tries to respect the rules of war and does its best to protect civilians in a complex and painful conflict.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>This piece examines accusations against <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> for committing war crimes, emphasizing the importance of legal definitions and intentions in warfare. It highlights <a  href=\"/hamas\">Hamas</a>&#8216; tactics, including using civilians as shields, and argues that while war is tragic and complex, Israel conducts its military operations within the boundaries of international law.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 16504,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        54
    ],
    "class_list": [
        "post-16503",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-education"
    ],
    "lang": "en",
    "translations": {
        "en": 16503
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16503",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=16503"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16503/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16505,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16503/revisions/16505"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/16504"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=16503"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=16503"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=16503"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}