{
    "id": 10853,
    "date": "2024-08-07T15:00:00",
    "date_gmt": "2024-08-07T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=10853"
    },
    "modified": "2024-08-16T12:40:56",
    "modified_gmt": "2024-08-16T09:40:56",
    "slug": "fbi-stops-iran-plot-to-assassinate-us-leaders-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/fbi-stops-iran-plot-to-assassinate-us-leaders-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "FBI Stops Iran Plot to Assassinate US Leaders | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"FBI Stops Iran Plot to Assassinate US Leaders | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/LKpxnGHjtak?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a>Today marks the 306th day of the October 7th War and the ongoing Hamas hostage crisis. Iran was again found targeting its real enemy, America. Two weeks ago, the FBI arrested an Iran-linked agent in New York for plotting to assassinate U.S. officials. While Iran wages war on Israel on seven fronts, make no mistake—its real war is with America and the West. Iran is not hiding this; they are vocal about their intentions. Hezbollah, Iran&#8217;s proxy army in Lebanon, explicitly stated that this is not a war with Israel; Israel is merely a tool, and their real war is with America. Just yesterday, a U.S. base in Iraq was struck by what the U.S. Department of Defense identified as an Iranian proxy, seriously injuring American personnel. Another Iran-backed proxy murdered U.S. troops in a drone attack in Jordan a few months ago. In the U.S., an Iranian agent was arrested only two years ago for plotting to assassinate a U.S. official in Washington, D.C., and U.S. officials have warned that presidential candidates are at risk of Iranian attacks. Iran&#8217;s goals are clear: they aim to assassinate, organize protests, and undermine American democracy, as the U.S. Director of National Intelligence warned last month. Iran seeks to stoke discord and destroy America, whom they call the &#8220;Great Satan.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran&#8217;s Real Target: The West</h3>\n\n\n\n<p>Iran is the tyrannical head of the octopus behind the deadliest day for Jewish people since the Nazi Holocaust—October 7th—and attacks on Jewish people around the world. But make no mistake about who Iran&#8217;s real target is. Iran is trying to tear America and the West apart. When Iran tries to destroy the Jewish state, remember: Israel&#8217;s safety is your safety, and Israel&#8217;s security is your security. Iran wants to hurt Israel to hurt America. Standing with Israel means standing up for yourselves and against Iran&#8217;s dominance in the Middle East and across the world. The world must stand with Israel and against Iran&#8217;s war because, for Iran, the entire West is the target.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217;s New Leadership and Continued Extremism</h3>\n\n\n\n<p>As for Hamas, or what&#8217;s left of it, Yahya Sinwar is now the target. He was announced as the new head of Iran&#8217;s murder proxy in the Gaza Strip, though no one has seen him recently from his dark underground hiding place. Sinwar will now officially be in charge, following the demise of Hamas&#8217;s previous leader in an explosion in the Iranian capital. To those in the West who pretend Hamas is anything less than a bloodthirsty, genocide-seeking movement, your fig leaf is gone. There was never a difference between Hamas&#8217;s military branch, which rapes and murders thousands of innocents, and Hamas&#8217;s political branch, the men in suits who order and finance these atrocities. Just as no one claimed Osama bin Laden was only the political leader of al-Qaeda because he wasn&#8217;t on the planes himself, no one should engage with Hamas. All of Hamas commits murder, and all of Hamas must be designated as a terrorist group. None of Hamas should receive your money. It&#8217;s simple: don&#8217;t legitimize murder, and don&#8217;t try to save the murderers. Instead, embrace the 3D plan: destroy Hamas, demilitarize Gaza, and deradicalize Gazan society. Any other option means promoting Hamas&#8217;s stated plan for more October 7th massacres.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Ongoing Defense Efforts</h3>\n\n\n\n<p>Israel&#8217;s soldiers continue to hunt down Sinwar and his henchmen. Yesterday, Hamas fired rockets at civilians in Israel, using aid warehouses as cover, which surprised no one. Hamas continues to abuse protected spaces and endanger civilians in Gaza, for whom humanitarian aid is intended, to kill people in Israel. Given the chance, Hamas will always try to murder Israel&#8217;s children from behind Gaza&#8217;s children. Israel warned civilians in the northern Gaza Strip to evacuate to safety ahead of action against the rocket launchers. Israel will continue to dismantle Hamas and remove its ability to harm people in Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How You Can Help</h3>\n\n\n\n<p>For those asking what you can do to help, you&#8217;ll find links to our JGiv campaign across our social media. These donations help us keep getting the word out about what&#8217;s really happening in Israel and across the region. Please like and subscribe; it makes a significant difference in combating the lies and misinformation about Israel that are being spread worldwide.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions from Social Media</h3>\n\n\n\n<p><strong>Question from Edbar on YouTube:</strong><br><em>Can you comment on the CNN report claiming that Hamas is recruiting more terrorists and becoming more extreme as a result of Israel&#8217;s war?</em></p>\n\n\n\n<p><strong>Response:</strong><br>I must take issue with the framing of that question. Hamas has always been extreme. The likes of Yahya Sinwar and others in charge of Hamas have long orchestrated brutal attacks like the one on October 7th. Hamas&#8217;s extremity is nothing new; it has been inherent in their actions from the start. The only difference now is that the fig leaf of moderation is gone, and Sinwar is clearly identified as the head of Hamas. Any talk of Hamas becoming more extreme due to Israel&#8217;s actions misunderstands that Hamas has always been deeply radical and committed to its genocidal goals.</p>\n\n\n\n<p><strong>Question from Ohad on Instagram:</strong><br><em>What is the state of the hostage negotiations?</em></p>\n\n\n\n<p><strong>Response:</strong><br>There doesn&#8217;t seem to be significant movement in the hostage negotiations right now, but the goal remains clear: Israel will push to bring all the hostages home. This is non-negotiable. The return of the 115 hostages held by Hamas and their allies is critical, and Israel will not stop until this is achieved. We urge everyone around the world to push their leaders to support this action. There can be no ceasefire without the return of the hostages, and any delay only fuels Hamas&#8217;s aggression.</p>\n\n\n\n<p><strong>Question from Sammy on YouTube:</strong><br><em>What is Palestinian Islamic Jihad (PIJ), and why don&#8217;t we speak about them, only Hamas?</em></p>\n\n\n\n<p><strong>Response:</strong><br>Palestinian Islamic Jihad (PIJ) is another militant group primarily operating within the Gaza Strip. While PIJ is significant, Hamas holds the most power and responsibility in Gaza. Hamas is the de facto government and the main force behind the ongoing conflict. While PIJ plays a role, Hamas is accountable for the actions in Gaza, and that is why we focus on them.</p>\n\n\n\n<p><strong>Question from Kim on Instagram:</strong><br><em>Do you believe this is a religious war?</em></p>\n\n\n\n<p><strong>Response:</strong><br>This conflict goes beyond religion. The 251 hostages taken on October 7th were not targeted because of their religion. They were targeted because they lived in Israel. Hamas&#8217;s ideology is not just anti-religion but anti-Israel, aiming to destroy the state and its people, regardless of their faith. This is a war involving civilians, not a religious war, and it&#8217;s about Hamas&#8217;s criminal notion that being Israeli is worthy of death.</p>\n\n\n\n<p><strong>Question from Joan on X:</strong><br><em>What do you think of the Olympics investigating Israel&#8217;s medal-winning judoka for supposedly supporting the war with Hamas?</em></p>\n\n\n\n<p><strong>Response:</strong><br>The Olympics should be a platform beyond politics, where athletes can compete freely and be celebrated for their achievements. It’s disappointing to see the Olympic ideal being overshadowed by political disputes. Israel’s athletes have shown incredible strength and should be recognized for their accomplishments, not scrutinized for their personal views.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>That&#8217;s all for today&#8217;s daily briefing. Please continue to watch us every weekday at 3:00 p.m. Israel time (8:00 a.m. Eastern Standard Time). Like, subscribe, and share this briefing with whomever you can. Your support is vital in growing our community and spreading the truth about Israel and the ongoing conflict. Thank you for watching.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> is escalating its threats against America and the West while waging war on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>. <a  href=\"/hamas\">Hamas</a>, under new leadership, remains committed to violence. Israel continues its defense efforts, urging global pressure on Iran and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>. Support for Israel is crucial, as Iran&#8217;s ultimate goal is to destabilize the West.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 10862,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306
    ],
    "class_list": [
        "post-10853",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans"
    ],
    "lang": "en",
    "translations": {
        "en": 10853
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10853",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=10853"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10853/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15023,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10853/revisions/15023"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/10862"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=10853"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=10853"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=10853"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}