{
    "id": 14974,
    "date": "2024-08-13T15:00:00",
    "date_gmt": "2024-08-13T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=14974"
    },
    "modified": "2024-08-16T12:32:11",
    "modified_gmt": "2024-08-16T09:32:11",
    "slug": "free-world-stands-with-israel-against-irans-war-daily-briefing-with-rachel-lester",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/free-world-stands-with-israel-against-irans-war-daily-briefing-with-rachel-lester/",
    "title": {
        "rendered": "Free World Stands with Israel Against Iran’s War | Daily Briefing with Rachel Lester"
    },
    "content": {
        "rendered": "\n<p>Today is day 312 of the October 7th War and the Hamas hostage crisis. It is also the Jewish fast day of Tisha B&#8217;Av, and I wish all those fasting an easy and meaningful fast. The Free World stands with Israel against Iran&#8217;s aggression.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Support from World Leaders</h3>\n\n\n\n<p>Yesterday, leaders of the US, UK, France, Germany, and Italy declared their support for Israel&#8217;s defense against Iranian aggression and against attacks by Iran&#8217;s proxy armies, including Hamas and Hezbollah. They demanded that Iran stand down its ongoing threats of a military attack as the US sends forces to the region to send a message. Israel is on high alert for a massive Iranian attack, which the US says could come this week. If Iran attacks, it would be an unprovoked act of aggression. Iran says it&#8217;s retaliating to the elimination of arch-terrorist Ismail Haniyeh in Tehran, but that&#8217;s as crazy as saying Pakistan had a right to retaliate against the United States for killing Bin Laden. Iran harbors terrorists and is already waging a regional war against Israel on seven fronts through its proxy armies. It doesn&#8217;t want to avoid a regional war; it just wants to shield itself as it wages one through proxies.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran’s Threat Beyond the Middle East</h3>\n\n\n\n<p>The free world knows Iran is not only a threat to the Middle East; it&#8217;s a threat to Europe and America. Iran is already at war with Israel on seven fronts, and now it&#8217;s arming Russia&#8217;s war on Europe. Yesterday, the US State Department said that the US and Europe recognize how Iran&#8217;s destabilizing influence reaches beyond the Middle East and around the world. The US State Department just called out Iran for sending ballistic missiles to Russia to help them in their war against the people of Ukraine. Iran has already sent drones used to kill in Europe, just like the Iranian drones used to murder people in Israel. Allies like the US have moved their militaries—ships, jets, and more—into the region to help deter Iranian aggression against Israel, like they did for Iran&#8217;s massive aerial attack in April. Israel&#8217;s Arab allies have also quietly signaled that they will stand against Iran&#8217;s attack and have warned Iran not to violate their airspace to murder Israelis. Israel is fighting for the world, and the world must stand with Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran’s Proxy Wars Against Israel</h3>\n\n\n\n<p>Whatever happens next, remember Iran has been waging war on Israel for 10 months on seven fronts. Iran&#8217;s attempts to justify escalating its war on Israel are nonsense. Iran&#8217;s threat to attack is a direct continuation of Iran-backed proxy attacks since the October 7th massacre. Iran is behind every major attack on the Jewish State this year. Iran is behind the Houthi terror pirates in Yemen, their attacks on global shipping, and their missile and drone attacks on Israel. Iran is behind Hezbollah, its terror army in Lebanon, and the 7,000 rockets, missiles, and drones launched into Israel since October 8th and the 60,000 people displaced from their homes in Israel&#8217;s north. Iran is behind Hamas&#8217;s murders and the war they began on October 7th. Iran is behind the 1,500 raped, murdered, and kidnapped in the bloodiest day for the Jewish people since the Nazi Holocaust. Iran is already waging a regional war, one in which it thinks its proxy armies will shield it from paying a price for aggression.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel’s Stance on War with Iran</h3>\n\n\n\n<p>Actions have consequences. Israel doesn&#8217;t want war with Iran, but Israel will defend itself against Iranian aggression. The experts on war and peace at the United Nations tweeted they said even wars have rules: civilians are #notatarget, schools are not a target, hospitals are not a target. By total coincidence, they posted just after Israel&#8217;s strike this weekend on a Hamas command center in a former school building, the one with hysterical headlines about over 100 dead when, in Arabic, Hamas was saying 40 across the whole day, the one where Israel released IDs of 31 Hamas and Palestinian Islamic Jihad murderers killed. Israel agrees wars do have rules. Too bad the UN didn&#8217;t tag Hamas, who fight out of schools and hospitals. Too bad the UN didn&#8217;t tag Hezbollah, which its Iranian patrons say will target civilians just like the 12 kids they murdered playing soccer. Too bad the UN didn&#8217;t tag the Houthis, who killed a man in his bed in Tel Aviv with a suicide drone.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Responding to the UN’s Criticism</h3>\n\n\n\n<p>Maybe you&#8217;d like to remind the UN if you&#8217;re following on Instagram. We&#8217;ll link the tweet in our story for those asking what they can do to help. You&#8217;ll find links to our JG campaign across our social media. Those donations honestly help us keep getting out the word, and as always, please like and subscribe to help us reach a wider audience.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Addressing Audience Questions &#8211; Hostage Situation</h3>\n\n\n\n<p>Now let&#8217;s take some questions from our audience watching live on social media. Our first question today comes from John on Instagram, who asks, &#8220;Is there any information about Hamas&#8217;s claims that it murdered another hostage in captivity?&#8221; First of all, we know that Hamas has executed hostages in their terror dungeons. We know it&#8217;s starving, torturing, and raping them. Yesterday&#8217;s briefing focused on the horrific abuse, and you can catch it on YouTube or wherever you get your podcasts. Yesterday, Hamas admitted or declared for the first time that a guard executed a hostage; it said two female hostages were injured. The IDF said last night that it doesn&#8217;t have intelligence to confirm or refute that claim. We&#8217;ll have to wait for official answers, but note that Hamas is waging psychological warfare on Israel. It&#8217;s using their suffering to pressure the Israeli public. That&#8217;s why they released a video telling Yarden Baas that his wife Shiri and two children were killed in captivity months ago just to share footage of him breaking down. Hamas is a death cult. We all want a deal to bring the hostages home, but everyone in Israel knows that after October 7th, the Hamas terror regime can no longer be trusted, can no longer be our neighbors.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Addressing Audience Questions &#8211; Houthi Attacks</h3>\n\n\n\n<p>A next question comes from Avram on YouTube, who asks, &#8220;What do you know about the Houthis&#8217; attack on the UN office?&#8221; Okay, so far we know that the Houthi terror pirates have stormed the headquarters of a UN human rights office in Yemen&#8217;s capital, stealing documents, furniture, and vehicles. By the way, the UN has never admitted that Hamas has hid at its offices in Gaza and is using them as military bases. It&#8217;s never once informed the IDF that Hamas has violated the neutrality of its facilities. But in Houthi Yemen, at least, it admitted that Iran-backed terrorists took over UN facilities. It&#8217;s apparently the latest move by this Iranian-backed terror group to crack down on people working with the UN and aid agencies. Maybe the United Nations will respond more forcefully to terrorist attacks that happen to its own people than they do to terrorist attacks that happen to the Jewish people.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A Session</h2>\n\n\n\n<p><strong>Q: John (Instagram): Is there any information about Hamas&#8217;s claims that it murdered another hostage in captivity?</strong></p>\n\n\n\n<p>First of all, we know that Hamas has executed hostages in their terror dungeons. We know it&#8217;s starving, torturing, and raping them. Yesterday&#8217;s briefing focused on the horrific abuse, and you can catch it on YouTube or wherever you get your podcasts. Yesterday, Hamas admitted or declared for the first time that a guard executed a hostage; it said two female hostages were injured. The IDF said last night that it doesn&#8217;t have intelligence to confirm or refute that claim. We&#8217;ll have to wait for official answers, but note that Hamas is waging psychological warfare on Israel. It&#8217;s using their suffering to pressure the Israeli public. That&#8217;s why they released a video telling Yarden Baas that his wife Shiri and two children were killed in captivity months ago just to share footage of him breaking down. Hamas is a death cult. We all want a deal to bring the hostages home, but everyone in Israel knows that after October 7th, the Hamas terror regime can no longer be trusted, can no longer be our neighbors.</p>\n\n\n\n<p><strong>Q: Avram (YouTube): What do you know about the Houthis&#8217; attack on the UN office?</strong></p>\n\n\n\n<p>So far, we know that the Houthi terror pirates have stormed the headquarters of a UN human rights office in Yemen&#8217;s capital, stealing documents, furniture, and vehicles. By the way, the UN has never admitted that Hamas has hid at its offices in Gaza and is using them as military bases. It&#8217;s never once informed the IDF that Hamas has violated the neutrality of its facilities. But in Houthi Yemen, at least, it admitted that Iran-backed terrorists took over UN facilities. It&#8217;s apparently the latest move by this Iranian-backed terror group to crack down on people working with the UN and aid agencies. Maybe the United Nations will respond more forcefully to terrorist attacks that happen to its own people than they do to terrorist attacks that happen to the Jewish people.</p>\n\n\n\n<p><strong>Q: Carla (Twitter): Hamas&#8217;s numbers and the IDF&#8217;s numbers have both changed since the strike on the school. How do we know when to believe what?</strong></p>\n\n\n\n<p>Let&#8217;s look at the full picture. It took a few days to get here, and we&#8217;re still in the process of learning more. When the IDF struck the Hamas and Islamic Jihad terrorists hiding inside a specific compound within a school, Hamas immediately made up the number 100 people killed. Its supporters around the world then inflated that number and claimed it was 100 civilians, which was clearly ridiculous. Then, as it was an obvious lie, they lowered the number to 40 people killed across three separate events in 24 hours. The way you know not to believe Hamas&#8217;s numbers is because they always start out with a nice big round number like 100, and then they change the numbers still before it makes sense to have a proper estimate. How could they have possibly known that there were 100 people dead and that they were civilians within minutes of the strike? They couldn&#8217;t, they never can, no one can, and no media outlet would ever quote ISIS or Al-Qaeda or any other terrorist group without checking the facts. At least they admitted they couldn&#8217;t verify the numbers.</p>\n\n\n\n<p>On the other hand, the IDF first stated that Hamas&#8217;s numbers didn&#8217;t match up with their estimates, but they didn&#8217;t give an exact number. Then they announced that 19 Hamas and Islamic Jihad terrorists were killed in the strike and identified them by name, face, and job. Then another day or so passed, and they announced additional terrorists killed in the strike, bringing the total to 31, again by name, face, and job, because it takes time and intelligence to get this kind of information. The IDF didn&#8217;t put out numbers immediately after the strike; they took their time to be precise and be sure of themselves. Notice that the IDF still hasn&#8217;t put out a total number of people killed in the strike because, again, it&#8217;s impossible to know for sure so quickly. That&#8217;s the difference between Hamas&#8217;s fake numbers and the IDF&#8217;s real ones. What you always have to do is give these things time and don&#8217;t jump to believe the very first number that you hear; otherwise, it&#8217;s Al Al hospital all over again.</p>\n\n\n\n<p><strong>Q: Alma (Instagram): I heard the Hamas terrorist who shot a 60-year-old Israeli yesterday in an attack near Silia was freed at 17 years of age in the November hostage deal. What do you think Israel should do to free hostages without endangering more victims or hostages?</strong></p>\n\n\n\n<p>Israel is constantly in an impossible situation. There are two choices in this dilemma: either release cold-blooded murderers in exchange for our kidnapped family and friends, or keep the cold-blooded murderers in prison and let our family and friends continue to rot in captivity. Obviously, the best-case scenario is for the IDF to pull off as many rescue missions as possible, like Operation Aaron, in which Noah Aramani and three other hostages were rescued directly from captivity. But that isn&#8217;t always possible—actually, it rarely is. So I would say that the best way to go about endangering as few people as possible is for the IDF to continue placing maximum military strength on Hamas, destroying as much of their terrorist infrastructure and eliminating as many of their commanders as possible, in order to keep pressure on Hamas to keep the number of criminals that they&#8217;re demanding be released as low as possible.</p>\n\n\n\n<p>In the meantime, Israel will continue to be in this impossible situation because we value life so much that we&#8217;re willing to do anything to get our people back. We have to be, because we are better than our enemies. The dilemma will continue to be impossible, but the way that Israel goes to the ends of the Earth to save its people is one of the many reasons I&#8217;m so proud to be Israeli.</p>\n\n\n\n<p>That&#8217;s all we have time for today. Thank you so much for tuning in and watching us. Join us again tomorrow at 3 PM Israel time, 8 AM Eastern time, and until then, stay safe</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>World leaders reaffirm support for <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> amid the ongoing conflict with <a  href=\"/hamas\">Hamas</a> and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s aggression. With tensions high, Israel prepares for potential Iranian attacks, underscoring Iran&#8217;s regional and global threats. The Free World unites against Iran&#8217;s destabilizing actions, emphasizing the importance of standing with Israel in defending against terrorism and regional conflict.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        498
    ],
    "class_list": [
        "post-14974",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-rachel-lester"
    ],
    "lang": "en",
    "translations": {
        "en": 14974
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14974",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=14974"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14974/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 14989,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14974/revisions/14989"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=14974"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=14974"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=14974"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}