{
    "id": 14937,
    "date": "2024-08-11T15:00:00",
    "date_gmt": "2024-08-11T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=14937"
    },
    "modified": "2024-08-16T12:31:24",
    "modified_gmt": "2024-08-16T09:31:24",
    "slug": "hamas-are-murderers-dont-believe-their-lies-daily-briefing-with-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-are-murderers-dont-believe-their-lies-daily-briefing-with-doron-spielman/",
    "title": {
        "rendered": "Hamas Are Murderers. Don’t Believe Their Lies | Daily Briefing with Doron Spielman"
    },
    "content": {
        "rendered": "\n<p>Today marks day 310 of the October 7th War and the ongoing Hamas hostage crisis. Hamas are murderers, rapists, and liars. Anyone repeating Hamas&#8217;s claims—whether on campus, in the news, or as a government leader—and pretending that Hamas is equally or more credible than Israel, is promoting terrorist propaganda.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Precision Strike on Hamas</h3>\n\n\n\n<p>Yesterday, based on solid intelligence, Israel targeted a group of Hamas murderers who, against international law, were hiding near civilians in a mosque located within a formal school complex. Both locations are protected under international law, yet Hamas used them for illegal purposes. Israel, however, went beyond the demands of international law to minimize casualties by using three precise munitions and timing the strike for the most opportune moment when civilians were as far away as possible from the terrorists.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Deceptive Media Reporting</h3>\n\n\n\n<p>Following the strike, Israel provided precise information, pictures, and maps of the 19 Hamas terrorists who were eliminated. Despite this, international media are once again deceiving the public by promoting Hamas propaganda, claiming that over 100 people were killed. This contradicts Hamas&#8217;s own admission in Arabic that 40 people were killed in three incidents throughout the day. The room that was struck by Israel couldn&#8217;t even fit 100 people. The media&#8217;s uncritical repetition of Hamas&#8217;s inflated casualty claims is irresponsible and promotes terrorist propaganda.</p>\n\n\n\n<h3 class=\"wp-block-heading\">International Media and Hamas Propaganda</h3>\n\n\n\n<p>CNN and BBC do not report Al-Qaeda&#8217;s claims as fact, nor should they give more credence to Hamas than to Western security forces. No one would accept such reporting about England, France, Germany, or the United States, and we should not accept it about Israel. Israel has done more to move civilians out of harm&#8217;s way in this war than any other army in history, despite Hamas&#8217;s deliberate use of civilians as human shields. Journalists who promote Hamas&#8217;s propaganda incentivize Hamas to continue fighting from around civilians, endangering both Israelis and Gazans.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217;s Violation of International Law</h3>\n\n\n\n<p>International law states that combatants cannot use protected spaces like hospitals, mosques, and schools. When Hamas uses them, these locations become legitimate targets. Hamas is responsible for any deaths that occur as a result of this illegal behavior. The war could end immediately if Hamas surrendered and released the hostages it holds in its terror dungeons. Journalists and politicians who ignore Hamas&#8217;s violations of international law and instead criticize Israel are part of the problem.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Impact of Media and Government Responses</h3>\n\n\n\n<p>The media&#8217;s uncritical acceptance of Hamas&#8217;s claims is dangerous. Terrorists around the world are watching and learning that they can hide behind civilians and blame their opponents for any resulting casualties. Irresponsible media and politicians are, therefore, encouraging more such tactics by terrorists globally.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from the Audience: Iran&#8217;s Psychological Warfare</h3>\n\n\n\n<p><strong>Question:</strong> Iran and its allies say they are winning the psychological war against Israel by delaying their inevitable revenge. What do the people of Israel feel at the moment?</p>\n\n\n\n<p><strong>Answer:</strong> The people of Israel are going about their daily lives—children are in camps, parents are at work, and the beaches and marketplaces are full. Iran is not winning any psychological warfare. Iran&#8217;s partners are some of the worst terrorist regimes in the world, and the Iranian people themselves are rioting against their own government. Israel does not want war with Iran, but we will protect our people if necessary.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from the Audience: False Media Reporting</h3>\n\n\n\n<p><strong>Question:</strong> What can be done about false media reporting? Why doesn&#8217;t Israel let more journalists into Gaza to help correct the record?</p>\n\n\n\n<p><strong>Answer:</strong> Israel does allow journalists into Gaza, and many have seen the situation firsthand. The challenge is whether journalists choose to report the truth or repeat terrorist propaganda. The solution is for more people to spread the truth and ensure it is heard over the lies.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from the Audience: Kamala Harris&#8217;s Deal</h3>\n\n\n\n<p><strong>Question:</strong> Is the deal Kamala Harris keeps talking about a real deal, and have all sides agreed? What will this mean for the hostages?</p>\n\n\n\n<p><strong>Answer:</strong> Without going into specific details, any deal must meet two conditions: Hamas must lay down their weapons and return the hostages. Israel is serious about reaching a resolution, but Hamas has consistently backed down from proposals that do not allow them to stay in power. The ball is in Hamas&#8217;s court.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from the Audience: Hamas Leader Yahya Sinwar</h3>\n\n\n\n<p><strong>Question:</strong> Where is Yahya Sinwar, and how does he communicate without Israel finding him?</p>\n\n\n\n<p><strong>Answer:</strong> Yahya Sinwar is hiding deep underground, away from the civilians and fighters he has endangered. Israel has already eliminated four out of five top Hamas leaders, and Sinwar&#8217;s days are numbered.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from the Audience: Marwan Barghouti&#8217;s Release</h3>\n\n\n\n<p><strong>Question:</strong> Is the release of Marwan Barghouti really on the table?</p>\n\n\n\n<p><strong>Answer:</strong> Releasing Barghouti, who has orchestrated attacks on Israeli civilians, would be like releasing Osama Bin Laden. Israel wants to bring the hostages home, but releasing such a dangerous figure is not a decision taken lightly.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from the Audience: Message to the Israeli Rhythmic Gymnastics Team</h3>\n\n\n\n<p><strong>Question:</strong> What is your message to the Israeli rhythmic gymnastics team who won silver at the Olympics yesterday?</p>\n\n\n\n<p><strong>Answer:</strong> The Israeli gymnastics team&#8217;s success is a testament to the resilience of the Israeli people. Despite the constant threats, Israelis continue to live their lives and achieve great things. Israel is a democracy that will continue to defend itself with determination and optimism.</p>\n\n\n\n<p>Thank you for your questions and for joining us. We are here every day at 3 PM Israel time (8:00 AM EST). Please follow us on social media, podcasts, LinkedIn, Twitter, Facebook, and Instagram. We are here for you, and we appreciate your support. See you tomorrow.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The IDF continues operations against <a  href=\"/hamas\">Hamas</a>, targeting terrorists while minimizing civilian harm. Media distortions amplify <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> propaganda. <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> remains vigilant, addressing public concerns and upholding international law. Despite threats, Israeli society remains resilient, living daily life, and supporting efforts to bring <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a> home and ensure national security.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1304
    ],
    "class_list": [
        "post-14937",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-doron-spielman"
    ],
    "lang": "en",
    "translations": {
        "en": 14937
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14937",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=14937"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14937/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 14951,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14937/revisions/14951"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=14937"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=14937"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=14937"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}