{
    "id": 14952,
    "date": "2024-08-12T15:00:00",
    "date_gmt": "2024-08-12T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=14952"
    },
    "modified": "2024-08-16T12:31:28",
    "modified_gmt": "2024-08-16T09:31:28",
    "slug": "hamas-abuses-children-letthemgonow-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-abuses-children-letthemgonow-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "Hamas Abuses Children. #LetThemGoNow | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas Abuses Children. #LetThemGoNow | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/xuMRt80CSno?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today marks day 311 of the ongoing conflict that began on October 7th and the associated Hamas hostage crisis. The atrocities committed by Hamas against innocent children held in captivity are nothing short of horrific. Reports indicate that children have endured shrapnel injuries untreated for so long that they can no longer be surgically removed, diseases like typhus and spotted fever, severe skin infections, and extreme infestations of head lice. These children, who have been held in Hamas&#8217; terror dungeons since October 7th, are suffering from severe weight loss, muscle damage, and psychological trauma.</p>\n\n\n\n<p><strong>Hamas&#8217; Continued Abuses:</strong> 26 women and children taken from Israel on October 7th have experienced these horrors. The findings, published in the pediatric medical journal &#8220;Actor Pediatria,&#8221; highlight the severity of the abuse. Hamas has been abusing the remaining hostages for over 10 months, with no end in sight. Ariel Berber recently marked his fifth birthday in Hamas captivity, and his younger brother Kir spent his first birthday as a hostage. Kibas has spent more of his short life as a hostage than he has ever been free.</p>\n\n\n\n<p><strong>The Need for Global Action:</strong> The war initiated by Hamas on October 7th cannot end with these child abusers still in power. The ongoing suffering of innocent children, their parents, and grandparents held hostage by Hamas demands a resolute global response. We must collectively call for the three Ds: Destroy Hamas, Demilitarize the Gaza Strip, and Deradicalize Gazan society. The war cannot end with Hamas capable of repeating their atrocities, as they have repeatedly vowed to do. The hostages must be freed immediately, and the world must demand their release without hesitation.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Role of International Leaders</h3>\n\n\n\n<p><strong>Global Leaders and the Hostage Crisis:</strong> Today’s joint statement from the leaders of the UK, France, and Germany endorsing the US call for negotiations to secure the release of hostages is a positive step. However, Hamas continues to refuse to negotiate in good faith, and the world must demand the immediate and unconditional release of all hostages. Hamas leader Yayah Sinwar, hiding in his bunker, is content to sacrifice Gazan lives for his ideological cause while using innocent hostages as human shields.</p>\n\n\n\n<p><strong>Message to Iran and Its Proxies:</strong> The leaders of the UK, France, and Germany have sent a clear message to Iran: Do not attack Israel or use proxy armies to do so. The diplomatic effort to contain Iran’s ambitions is crucial, and military preparations are underway to defend Israel from any imminent threats posed by the Iranian regime.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel’s Position on the Conflict</h3>\n\n\n\n<p><strong>Israel’s Stand on the Conflict with Iran:</strong> Israel does not seek war with Iran, but if Iran does not stand down, Israel and its allies will take necessary actions to protect themselves. Israeli intelligence indicates that Iran is planning an imminent attack, and Israel, with the support of its allies, is prepared to respond.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Audience Engagement and Call to Action</h3>\n\n\n\n<p><strong>Community Support and Advocacy:</strong> Before taking questions, I urge you to like, subscribe, and share this briefing. Your support is crucial in spreading our message and raising awareness about the ongoing crisis.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Audience Questions</h3>\n\n\n\n<p><strong>Question 1: How Does Hamas Justify Holding Hostages?</strong> </p>\n\n\n\n<p>There is no justification under international law for taking and holding hostages, especially innocent children. Hamas continues to use hostages as human shields and leverage in their war against Israel, which is a gross violation of all moral and legal standards.</p>\n\n\n\n<p><strong>Question 2: How Can Gaza Be Deradicalized?</strong> </p>\n\n\n\n<p>Deradicalizing Gaza requires a comprehensive approach, including removing Hamas from power, ensuring proper education free from radicalization, and establishing a civilian-run government. The international community must support these efforts to bring peace and stability to the region.</p>\n\n\n\n<p><strong>Question 3: Is There Any Intelligence Confirming the Hostages Are Alive?</strong> </p>\n\n\n\n<p>Currently, there is no publicly known information about the status of the hostages. The Red Cross has not been able to access them, and only Hamas knows their condition. The responsibility lies with Hamas to ensure their immediate release.</p>\n\n\n\n<p><strong>Question 4: How Can We Get Governments to Recognize the Threat of Radicalization?</strong></p>\n\n\n\n<p> The key is grassroots advocacy. Write to your elected leaders, attend public meetings, and speak out against Hamas’ actions. The international community must stand united against terrorism and support Israel’s right to defend itself.</p>\n\n\n\n<p><strong>Question 5: Is It Possible to Overwhelm the Iron Dome?</strong> </p>\n\n\n\n<p>Yes, it is possible to some degree. While the Iron Dome is highly effective, it is not infallible. The threat from indiscriminate rocket fire remains significant, and vigilance is necessary to protect civilian lives.</p>\n\n\n\n<p><strong>Question 6: Why Does Israel Get Blamed When Hamas Refuses to Negotiate?</strong> </p>\n\n\n\n<p>Much of the criticism towards Israel stems from ignorance rather than malice. It is essential to educate the public about the reality on the ground and the true nature of Hamas’ refusal to engage in good faith negotiations.</p>\n\n\n\n<p><strong>Question 7: Who Is Simka, the Israeli Citizen Spokesdog?</strong> </p>\n\n\n\n<p>Simka, the Israeli Citizen Spokesdog, is a symbol of our community’s fight for truth and justice. He belongs to all of us, representing our collective efforts to stand up for Israel and spread accurate information.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you for joining today’s briefing. Your engagement is vital in our fight for truth and justice. Please like, subscribe, and share this content to help spread our message. We will be back tomorrow with more updates.<a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On day 311 of the October 7th War, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> continues to demand the release of <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a> held by <a  href=\"/hamas\">Hamas</a>. The international community, including the UK, France, and Germany, supports US-led negotiations. Israel remains vigilant against Iranian threats, while emphasizing the need to destroy <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>, demilitarize <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, and deradicalize Gazan society.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306
    ],
    "class_list": [
        "post-14952",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans"
    ],
    "lang": "en",
    "translations": {
        "en": 14952
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14952",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=14952"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14952/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 14973,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14952/revisions/14973"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=14952"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=14952"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=14952"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}