{
    "id": 14994,
    "date": "2024-08-14T15:00:00",
    "date_gmt": "2024-08-14T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=14994"
    },
    "modified": "2024-08-16T12:32:30",
    "modified_gmt": "2024-08-16T09:32:30",
    "slug": "hamas-fires-from-safe-zones-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-fires-from-safe-zones-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "Hamas Fires From Safe Zones | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas Fires From Safe Zones | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/cs-s522ntnc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is day 313 of the October 7th War and the Hamas hostage crisis. Hamas continues to fire rockets at civilians in Israel, even from within humanitarian safe zones. This tactic is part of Hamas’s strategy, as they know that when Israel responds to these attacks, some will accuse Israel of violating humanitarian protections.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas’s Use of Human Shields</h3>\n\n\n\n<p>Let&#8217;s be clear: Israel claims that Hamas fired from a humanitarian zone, and Hamas even posted a video showing them setting up and firing rockets at Tel Aviv from inside a tent within such a zone. These Hamas operatives are dressed as civilians in t-shirts and jeans, not in military fatigues, which they reserve for propaganda videos. It&#8217;s important to understand that it is a war crime to fire at civilian targets, to fire from among civilians, and to attack while dressed as civilians.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Threat of Hamas’s Rockets</h3>\n\n\n\n<p>These rockets are a reminder that Hamas is a ticking time bomb. Whenever they can, Hamas will target people in Israel and Gaza, often fighting from behind civilians, including children. They have a history of filming and posting their atrocities, as seen on October 7th, when they recorded and shared their massacre and abduction. Some still uncritically repeat Hamas’s propaganda while casting doubt on Israel’s actions.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Role of International Perception</h3>\n\n\n\n<p>Why wouldn’t Hamas fire from inside safe zones when the UN is essentially encouraging it by its silence? When Israel is forced to strike in a humanitarian zone, remember that Hamas operatives are firing at Israeli civilians from within these shelters. One of Hamas’s rockets, intended to kill innocents in Israel, fell short and impacted Gaza. Hamas relies on their international supporters to grant them immunity, allowing them to violate humanitarian protections while endangering innocent lives in both Israel and Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel’s Fight for Survival</h3>\n\n\n\n<p>Israel is not fighting to avenge the last October 7th; it&#8217;s fighting to prevent the next one. Some things are worth fighting for, such as stopping a terrorist army an hour’s drive from Tel Aviv from being able to fire rockets at our cities at will. Hamas is still trying to murder innocent people in Israel and is still holding 115 hostages in its terror dungeons.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran’s Influence and Blackmail</h3>\n\n\n\n<p>Iran is blackmailing Israel to try to save Hamas. Hamas refuses to negotiate to free the hostages or agree to a ceasefire and won’t attend a US-led ceasefire summit in Cairo tomorrow. Meanwhile, Iran is threatening to attack Israel if there is no ceasefire, attempting to force Israel into a position that would leave Hamas free to commit more massacres. The Iranian regime has been attacking Israelis on seven fronts since October 7th and now seeks to pressure Israel into self-destruction.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Endgame: Destroying Hamas</h3>\n\n\n\n<p>Israel cannot return to the world of October 6th, where Hamas can invade and take hostages at will. Hamas must release the hostages, and there needs to be international pressure on Hamas and its backers—Qatar, Turkey, and Iran—to ensure their release. The war that Hamas started on October 7th must end with three critical outcomes: the destruction of Hamas, the demilitarization of Gaza, and the deradicalization of Palestinian society. Without these, there will be a next time, and it will be worse.</p>\n\n\n\n<h3 class=\"wp-block-heading\">International Response and Support</h3>\n\n\n\n<p>Iran has rejected calls from the US, UK, France, Germany, and Italy not to attack Israel. Meanwhile, the US has agreed to a $20 billion arms deal with Israel, including fighter jets, and Israel’s allies have positioned significant military assets in the region. Israel does not want war with Iran, but Iran is already fighting a regional war against Israel on seven fronts. Israel will not allow Iran to continue its aggression unchecked, knowing that the Free World stands behind its right to defend itself.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How You Can Help</h3>\n\n\n\n<p>For those asking what they can do to help, you’ll find links to our JG campaign across social media. Your donations help us get the word out, and as always, please like and subscribe to help us reach a wider audience. We’re close to hitting 20,000 followers on Instagram, and we appreciate your support in helping us grow our platforms.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A Session</h2>\n\n\n\n<p><strong>Q: Chucky K. (Instagram): How can Hamas still fire rockets? Why aren’t they destroyed yet?</strong></p>\n\n\n\n<p>Hamas’s ability to fire rockets at Israeli cities has been massively downgraded. In the early hours of the war, they fired thousands of rockets while conducting the October 7th massacre, but they don’t have that capability anymore. Israel allegedly eliminated arch-terrorist Ismail Haniyeh in Tehran, and Hamas did not respond with a rocket barrage at Israeli cities—not because they didn’t want to, but because they can’t. Israel has degraded Hamas’s military capabilities by destroying weapon silos, confiscating their weapons, destroying weapon production facilities, and cutting off smuggling routes from Egypt.</p>\n\n\n\n<p>This war must end with Hamas no longer able to fire rockets at Israeli cities. No country in the world would tolerate this, and Israel is done tolerating it as well.</p>\n\n\n\n<p><strong>Q: Lolly Schwarz (Instagram): Did Israel move the goalposts on the ceasefire deal? How close are we really?</strong></p>\n\n\n\n<p>Israel&#8217;s official position is that it has not made any changes to the original ceasefire proposal but has made certain clarifications. For example, the original ceasefire proposal states that armed militants cannot move back into Gaza City. Israel wants to ensure that terrorists do not regroup and rearm just meters away from Sderot. Meanwhile, Hamas has made dozens of changes to the text because it is not interested in a ceasefire at all. Hamas does not want to let the hostages go, and every day this war drags on benefits Hamas.</p>\n\n\n\n<p>We need international pressure on Hamas and its backers—Qatar, Turkey, and Iran—to release the hostages and prevent another October 7th.</p>\n\n\n\n<p><strong>Q: Malcolm F. (Instagram): The Australian government wants to issue visas to Gazans. How could Australia let in people who participated in October 7th and who worked for UNRWA, which is linked to Hamas and is anti-Western?</strong></p>\n\n\n\n<p>You&#8217;d have to ask the Australian government or their spokesperson’s office for an explanation. It’s understandable that some countries want to protect people fleeing a war zone, but it’s essential to be aware of the extremism problem inside Gaza. Gaza has a severe extremism problem, fueled by Western countries through UN schools. If countries want to take in refugees, they need to be fully aware of this and not be naive.</p>\n\n\n\n<p><strong>Q: Itai (Instagram): What do you feel after watching the October 7th massacre video?</strong></p>\n\n\n\n<p>Last week, I watched a 10-minute clip of atrocities from October 7th that was shown to the judges at the ICJ. The footage is not being publicly released out of respect for the victims&#8217; families, but I describe what I saw in a video on my YouTube channel. The footage shows the worst things I have ever seen: corpses burned to a cinder, horrific mutilations, widespread sexual abuse, and people burned alive.</p>\n\n\n\n<p>This was not only a brutal massacre; it was a sadistic one, and it’s a reminder of why Israel is fighting and what it is trying to prevent.</p>\n\n\n\n<p><strong>Q: Bamboo Sarah (Instagram): Does the Citizen Spokesperson&#8217;s Office distribute these briefings to Western mass media outlets? If not, why not?</strong></p>\n\n\n\n<p>We are doing our best to speak directly to the international media. I was on Talk TV in Britain just this morning and will be on Fox News at 4:00 Israel time. We are working to get other citizen spokespeople on international media as well. We need you to take this information and lead the fight in your own communities. If you hear someone spreading misinformation about Israel, use the facts we provide to correct them.</p>\n\n\n\n<p>We want you to become citizen spokespeople yourself, armed with the information to fight for Israel in media outlets you can access.</p>\n\n\n\n<p><strong>Q: Joanne (YouTube): Do you have any information about the tragic reports of twins killed in Gaza?</strong></p>\n\n\n\n<p>I’ve seen the reports about the twins reportedly killed in Gaza, and it’s heartbreaking. The details are still unclear. The IDF is investigating, but we know that Hamas fights from within civilian buildings, homes, schools, and hospitals. It&#8217;s important not to speculate until all the facts are known.</p>\n\n\n\n<p><strong>Q: Myriad OMG (Instagram): How’s the Israeli Spokesperson Office team doing? Are you finding time to heal and talk to a professional for help?</strong></p>\n\n\n\n<p>We’re full of fighting spirit, even after 10 months of this horrible war. The mood in Israel is resilient; despite warnings of an imminent Iranian missile attack, no one here is panicking. We’re getting on with our lives, finding ways to keep up our spirits, and using humor as a coping mechanism. This is a marathon, not a sprint, and we need to conserve our energy.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>That&#8217;s all we have time for today. We’ll be back tomorrow at 3:00 PM Israel time, 8:00 AM Eastern, on all social media platforms with Citizen Spokesperson Asha Westrop Evans. As always, follow us on all platforms, and please share the link with a friend to help us get the message out to the world. Thank you, and stay safe.<br><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"/hamas\">Hamas</a> continues to fire rockets from humanitarian safe zones in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, provoking Israeli responses while exploiting international criticism. <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> supports <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> and threatens <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>, seeking to prevent a ceasefire that could end the conflict. Israel remains committed to dismantling Hamas, demilitarizing Gaza, and ensuring regional security despite ongoing challenges.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-14994",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 14994
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14994",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=14994"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14994/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15001,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14994/revisions/15001"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=14994"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=14994"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=14994"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}