{
    "id": 15480,
    "date": "2024-08-18T15:00:00",
    "date_gmt": "2024-08-18T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=15480"
    },
    "modified": "2024-08-19T23:59:28",
    "modified_gmt": "2024-08-19T20:59:28",
    "slug": "hamas-doesnt-want-to-end-the-war-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-doesnt-want-to-end-the-war-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "Hamas Doesn’t Want to End the War | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas Doesn’t Want to End the War | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/pqaIwoy2VRU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a>Today marks day 317 of the October 7th War and the Hamas hostage crisis. The latest round of hostage negotiations is well underway. While reports of progress exist, several key points must be made clear to all involved. Hamas is under pressure to release the hostages, but according to media reports, there has been no response from Hamas. Hamas began this war on October 7th and does not want to end it. Israel and its allies must apply all possible leverage to force Hamas into actions they fundamentally do not want to take. This is why maximum pressure must be applied to Hamas from all sides.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217; Military Strategy and Israel&#8217;s Defense</h3>\n\n\n\n<p>Hamas seeks to smuggle weapons again from Egypt through the Philadelphia Corridor, and Israel is working to block this rearmament. Hamas wants to reestablish its terrorist army in Northern Gaza, near Israeli towns and cities, and Israel is trying to protect its borders. Hamas seeks to continue its violence against innocent civilians in Israel, as they have openly promised, and Israel is working to keep its people safe from Hamas&#8217; atrocities.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Urgency of Releasing Hostages</h3>\n\n\n\n<p>There are tangible security threats to Israel&#8217;s future stemming from Hamas&#8217; demands, and the hostages must be released immediately. However, giving in to Hamas&#8217; desperate ploy for survival does not lead to peace. Conceding to Hamas guarantees that they will attempt another massacre like that of October 7th, just as they have repeatedly promised. There can be no sustainable peace if Hamas survives to retake control of the Gaza Strip, as this would only lay the groundwork for the next October 7th. The 115 hostages held by Hamas must be freed today, and Hamas must not have the ability to take more hostages in the future.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Three D&#8217;s to End the War</h3>\n\n\n\n<p>To end the war, three critical steps must be taken: destroy Hamas, demilitarize Gaza, and deradicalize Palestinian society. Israel needs a deal that ensures the hostages are returned home and prevents Hamas from regrouping and plotting further attacks like October 7th. It is crucial to pressure Hamas&#8217; backers—Qatar, Turkey, and Iran—to release the hostages now.</p>\n\n\n\n<h3 class=\"wp-block-heading\">International Involvement and Diplomatic Responses</h3>\n\n\n\n<p>Meanwhile, UK Foreign Minister David Lamy and French Foreign Minister Stefan Sa met with the Israeli government in Jerusalem and with the Palestinian Fatah government in Ramallah. During their visit, the foreign ministers wore yellow hostage ribbons when meeting with the Israeli government, but they removed these ribbons when meeting with the Palestinian Fatah government. This action sends a clear message: while Israel is fully aware of the need to free its hostages, it is the Fatah government that needs to hear the demand for their release.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Fatah&#8217;s Complicity in Hamas&#8217; Actions</h3>\n\n\n\n<p>The so-called moderate Fatah government has shown support for Hamas. In December, Fatah&#8217;s then-Prime Minister described Hamas as an integral part of the Palestinian mosaic. Fatah&#8217;s Secretary General praised Hamas leaders as pragmatic patriots and justified the October 7th massacre. Even Palestinian President Mahmoud Abbas recently led a prayer for Hamas leader Ismail Haniyeh. These actions by Fatah officials, who are funded by European governments, show their complicity in supporting violence against Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Broader Implications of the War</h3>\n\n\n\n<p>This war is not just about Israel; it is about defending the West against a shared enemy. Hamas, its Iranian backers, and others in the region seek to expand their vision of destruction across the Western world. If Israel loses, the West loses as well. The Western world must continue to stand with Israel against terror to ensure the safety of all.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Audience Engagement and Q&amp;A Session</h3>\n\n\n\n<p>Thank you for watching and listening. Please like and subscribe to help spread the message and support Israel in this critical time. Now, I&#8217;ll take some questions from our live audience.</p>\n\n\n\n<p><strong>Question from Ella: Do you believe Hezbollah when they say they will stop striking Israel as part of the hostage negotiations?</strong></p>\n\n\n\n<p>Hezbollah joined the war with Hamas on October 8th by striking Israel in solidarity with Hamas. Since then, they have launched approximately 7,000 missiles, drones, and rockets at Israel. Hezbollah is very much a part of this war, and despite claims of moderation, their actions speak otherwise. It is unwise to trust Hezbollah or its leader Hassan Nasrallah as good-faith actors.</p>\n\n\n\n<p><strong>Question from Instagram Live: Is it possible that the hostages are being kept in Egypt?</strong></p>\n\n\n\n<p>This is a constant fear and concern for all involved. While Israel and the IDF have control over the Philadelphia Corridor, the situation remains uncertain. The Red Cross has not been allowed to confirm the condition of any hostages since the war began, and the fate of 115 hostages remains unknown.</p>\n\n\n\n<p><strong>Question from Sharon: Why does Israel help treat wounded Palestinians when the world hates us anyway?</strong></p>\n\n\n\n<p>Israel&#8217;s inherent sense of humanity drives it to help those in need, regardless of their origin. Israel remains committed to humanitarian values, even in the face of conflict, and continues to provide extensive aid to Gaza.</p>\n\n\n\n<p><strong>Question from Edbar on YouTube: The first two D&#8217;s—destroying Hamas and demilitarizing Hamas—seem tangible, but how can we deradicalize a society that has hatred so entrenched in their culture?</strong></p>\n\n\n\n<p>Deradicalizing Palestinian society must begin with education, accountability, and the removal of radical influences. This effort is interconnected with destroying and demilitarizing Hamas, and it requires checks on the funding and educational content in Palestinian institutions.</p>\n\n\n\n<p><strong>Question from Instagram Live: Is the ceasefire really a solution, and if it is, what guarantee do we have that we won&#8217;t see another October 7th?</strong></p>\n\n\n\n<p>The ceasefire is not a final solution but a necessary step to bring hostages home. However, it must be done in a way that prevents future atrocities like October 7th. Israel must ensure that Hamas cannot regroup and continue its violent agenda.</p>\n\n\n\n<p><strong>Question from Michelle in Canada: What can we do as Western Jews when the world feels against us?</strong></p>\n\n\n\n<p>Despite challenges, Israel&#8217;s allies in the Western world remain strong. It is crucial for supporters of Israel to continue advocating for the nation&#8217;s democratic values and the safety of its people.</p>\n\n\n\n<p><strong>Conclusion</strong></p>\n\n\n\n<p>Thank you for your questions. Please continue to support Israel and spread the truth about the situation on the ground. I&#8217;ve been Ash Westrop Evans, and thank you for watching.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The October 7th War and <a  href=\"/hamas\">Hamas</a> hostage crisis continue, with <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and its allies pushing for maximum pressure on <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>. Key objectives include freeing 115 <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>, destroying Hamas, demilitarizing <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, and deradicalizing Palestinian society. International support is crucial to prevent further violence and ensure regional and global security.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306
    ],
    "class_list": [
        "post-15480",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans"
    ],
    "lang": "en",
    "translations": {
        "en": 15480
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15480",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=15480"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15480/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15483,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15480/revisions/15483"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=15480"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=15480"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=15480"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}