{
    "id": 16532,
    "date": "2024-08-29T15:00:00",
    "date_gmt": "2024-08-29T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=16532"
    },
    "modified": "2024-09-03T00:53:41",
    "modified_gmt": "2024-09-02T21:53:41",
    "slug": "hamas-holds-muslim-hostages-israel-rescues-them-with-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-holds-muslim-hostages-israel-rescues-them-with-ruth-wasserman-lande/",
    "title": {
        "rendered": "Hamas Holds Muslim Hostages, Israel Rescues Them | with Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas Holds Muslim Hostages, Israel Rescues Them | with Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/WejXW8QP_C0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is day 327 of the October 7th War. You&#8217;ve all heard the good news: Israel brought another of our hostages home from Hamas&#8217; terror dungeons. Kfaran Ali, a Muslim Israeli, was cruelly held for 326 days by Hamas. Some were surprised to hear Muslims in Gaza hold Muslim hostages. The Jewish state risks soldiers to rescue them. Hamas claims that it is the Islamic Resistance Movement and that it&#8217;s fighting against the Jews for the Muslims. Embarrassed by the rescue, Hamas now claims that Kfaran was unintentionally held hostage for 11 months. Yes, Hamas are cynical liars. Everyone knows that Hamas are savage killers who simply do not value human life. The idea that Hamas wouldn&#8217;t kidnap Muslims from Israel is absolutely ridiculous, especially when the same Hamas regularly endangers the lives of Palestinian Muslims in Gaza by hiding amongst them and using them as human shields. Kfaran is one of many Muslims kidnapped, wounded, and murdered by Hamas on October 7th. At least three Muslim Israelis are still held hostage by Hamas. Hamas has held a mentally handicapped young man hostage for almost an entire decade. At least seven Muslims were murdered by Hamas rockets on October 7th, including four teenage brothers whose home was directly hit. At least 19 Muslims were murdered by Hamas terrorists, executed by Hamas death squads in kibbutzim, driving on the roads, and at the beach. Fatma Alakat, a mother of nine, was on her way to work. Despite her religious head covering, the hijab, clearly identifying her as a Muslim woman, she was shot 43 times by Hamas terrorists.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Muslim Israelis&#8217; Heroism</h3>\n\n\n\n<p>Many Muslim Israelis risked their own lives to save innocent people from Hamas on October 7th. Osama Abu Assa, a security guard at the Nova Music Festival, was murdered while protecting young festivalgoers hiding in a bomb shelter. He thought Hamas wouldn&#8217;t kill him because he was a Muslim. Minivan driver Yussef El Zadna risked his life to rescue Nova Festival goers, saving 30 people by driving through Hamas gunfire. His cousin was sadly murdered while doing the same thing. Many Muslim Israelis risked their own lives to save the lives of innocent Israelis. After his rescue and reunification with his family, Kfaran received a call from Israel&#8217;s Prime Minister, sharing how happy all of Israel is to have him safely back home.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Fight for Survival</h3>\n\n\n\n<p>While Israel fights to preserve life, Hamas sanctifies death. While Israel is literally breaking Hamas in the Gaza Strip, there is still a long way to go to eliminate it completely as a threat. At the same time, there are six more fronts in which Israel is fighting: Hamas and Islamic Jihad in the West Bank, Hezbollah in Lebanon, Shiite militias in Syria, Shiite militias in Iraq, the Houthis in Yemen, and Iran itself. Israel is fighting for its survival against enemies that want to eliminate and destroy it. The Islamic Republic of Iran wants to light the Middle East on fire and simply watch it burn.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The West Bank and Ongoing Threats</h3>\n\n\n\n<p>The West Bank, the Judea and Samaria hill surrounding Jerusalem and overlooking Tel Aviv, serve as a launchpad for multiple attacks against innocent people in Israel. Last week, a Hamas suicide bombing was narrowly averted in Tel Aviv. Countless lives could have been destroyed. Last night, Israel&#8217;s security forces carried out counterterror raids to prevent the next murderous attack. One of the terrorists killed in the fighting was actually in prison until November when Hamas demanded Israel release him in exchange for releasing hostages. Think about it: Israel is doing all it can to release those held by Hamas, as well as the remains of those who were murdered by the terrorist organization, so they can be brought to respectful burial in Israel with their families. In fact, Israel is trying to prevent the next October 7th from whichever front, while Hamas is trying to guarantee yet another October 7th. Israel fights for &#8220;never again.&#8221; Hamas fights for &#8220;again and again and again.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section</h3>\n\n\n\n<p><strong>Ali asks:</strong> <em>The Iranian ambassador to Lebanon, Dr. Montazeri, was rumored to have fled to Israel. Why would he do that?</em></p>\n\n\n\n<p><strong>Answer:</strong> First of all, we do not have confirmation that he fled, let alone to Israel. Had we had that confirmation, it would be better for his own health and survival not to mention it at all. However, there is a recurring pattern among the elite of the Islamic Republic of Iran turning against their own leadership due to dissatisfaction with the regime. This could be seen as an expression of discontent and disengagement by the elite from their leadership.</p>\n\n\n\n<p><strong>Max on X asks:</strong> <em>Egypt has reportedly refused a compromise that keeps Israel on the Philadelphia Corridor. What is their interest? Why do they want to enable Hamas to resume smuggling weapons?</em></p>\n\n\n\n<p><strong>Answer:</strong> Egypt has been following a dual policy. On one hand, it is a strong strategic partner with Israel, maintaining peace for over 40 years. However, when the IDF entered the Rafah region, it became clear that numerous tunnels were going from Gaza into Egypt, which couldn&#8217;t have happened without the Egyptian regime&#8217;s knowledge. This suggests some level of cooperation or understanding between the Egyptian regime and Hamas. While Egypt sees Hamas as a threat due to their ties to the Muslim Brotherhood, there seems to be an arrangement where Egypt turns a blind eye to the smuggling in exchange for Hamas not cooperating with ISIS in the Sinai Peninsula.</p>\n\n\n\n<p><strong>Anonymous on Instagram asks:</strong> <em>What do the Arab leaders have to say about the rescue of Kfaran? Do they share support?</em></p>\n\n\n\n<p><strong>Answer:</strong> The Muslim Brotherhood and Hamas were relatively silent, likely embarrassed by the situation. They later claimed that Kfaran was held by mistake and released after 11 months, which is a blatant lie. The Arab world, particularly on social media, recognized something suspicious in the situation. Some Arab leaders have acknowledged that Hamas is a threat to Muslims within Gaza, noting that Hamas&#8217; actions endanger Palestinian lives by using them as human shields.</p>\n\n\n\n<p><strong>Question on Citizen Spokesman Alon Levi&#8217;s Appearance on Al Arabiya:</strong> <em>Are the Saudis really cracking down on radical Islam and working towards normalization?</em></p>\n\n\n\n<p><strong>Answer:</strong> The Saudis have a vested interest in moving towards normalization with Israel, not necessarily out of love for the Jewish state but out of strategic interest. They understand the threat of radical Islam, having experienced it firsthand. Countries like Saudi Arabia, Egypt, Bahrain, and the UAE recognize the need to combat extremism and have taken steps to curb radical influences, even going as far as suppressing demonstrations for the Palestinian cause to prevent the rise of extremism within their own borders.</p>\n\n\n\n<p><strong>YouTube question:</strong> <em>What should people in the diaspora do when they see flight attendants wearing Palestinian flags?</em></p>\n\n\n\n<p><strong>Answer:</strong> It&#8217;s concerning when public servants who need to remain neutral wear signs that align them with one side of a conflict. This should be reported immediately. Relevant authorities, including Congress members and company owners, should be informed. Past actions have been successful, and taking action can have a significant impact. Don&#8217;t hesitate to report such incidents.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you so much for your questions and engagement. We’ll be back tomorrow with more updates. Stay safe and vigilant.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On day 327 of the October 7th War, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> rescued Muslim Israeli Kfaran Ali, held hostage by <a  href=\"/hamas\">Hamas</a> for 326 days. Despite <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>&#8216; claims, the incident highlights the group&#8217;s disregard for human life, even among fellow Muslims. Israel continues to fight on multiple fronts, defending against threats from Hamas, <a  href=\"/hezbollah\">Hezbollah</a>, and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-16532",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 16532
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16532",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=16532"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16532/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16533,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16532/revisions/16533"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=16532"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=16532"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=16532"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}