{
    "id": 10865,
    "date": "2024-08-08T15:00:00",
    "date_gmt": "2024-08-08T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=10865"
    },
    "modified": "2024-08-09T22:10:58",
    "modified_gmt": "2024-08-09T19:10:58",
    "slug": "hezbollah-say-it-will-escalate-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-say-it-will-escalate-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "Hezbollah Say it Will Escalate | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Say it Will Escalate | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Yw04Zyr93i0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today marks the 307th day of the October 7th War and the ongoing Hamas hostage crisis. Iran&#8217;s proxy army in Lebanon, Hezbollah, is on the brink of igniting a major escalation in the Middle East, planning a massive attack targeting Israeli civilians. This escalation is in response to the elimination of Hamas warlord Ismail Haniyeh, with Hezbollah reportedly preparing to expand its rocket fire against Israeli towns. Hezbollah, which joined the war on October 8th in solidarity with Hamas&#8217;s October 7th Massacre, has been launching attacks from Lebanon ever since. Two days ago, Hezbollah&#8217;s top warlord, Hassan Nasrallah, gave a speech from a bunker, declaring that Israel is no longer as strong as it once was. However, his words were interrupted by the sonic booms of Israeli fighter jets, a reminder of Israel&#8217;s continued strength and capabilities.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Ongoing Threat and Israel&#8217;s Response</h3>\n\n\n\n<p>Nasrallah&#8217;s speech was meant to mark one week since Israel eliminated Hezbollah&#8217;s number two, but it should have reminded him of the hundreds of other Hezbollah terrorists Israel has taken out in recent months and the significant damage caused to his Iranian-funded terror army. Nasrallah was wrong when he declared Israel as weak before, and he is wrong now. When Nasrallah declared war on Israel in 2006 during the Second Lebanon War, Hezbollah and their Iranian backers brought ruin to the people of Lebanon. Since Hezbollah declared war on Israel on October 8th, they have launched 7,000 rockets, missiles, and drones from Lebanon, all aimed at murdering Israelis. If Hezbollah expands its war and Israel retaliates, people may ask why Israel is escalating. It&#8217;s important to understand that Hezbollah started this war in the North on October 8th in solidarity with Hamas and has been escalating daily ever since, serving its patrons in the Islamic Republic. Israel wants peace with Lebanon; there is no reason for a conflict between Israel and Lebanon. Israel&#8217;s only demand is for Iran&#8217;s proxy army to stop bombing northern Israel and to back off in accordance with UN Security Council Resolution 1701, so people can return to their homes without fear of a Lebanese October 7th.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Danger of Global Terrorism and Iran&#8217;s Influence</h3>\n\n\n\n<p>Nasrallah claimed that the bloodshed and suffering have created achievements and victories for his people, but the truth is there are no achievements—only destruction. Israel has warned the people of Lebanon that their country has been taken hostage by Hezbollah, a terrorist army that has spread terror and instability across Lebanon. Hezbollah is not only a threat to Israel but also to the safety and security of the people of Lebanon. Now is the time to speak up before it&#8217;s too late, before Iran&#8217;s proxy army drags us into a war that no one but the Islamic Republic wants. Either Nasrallah ends his war, or Israel will be forced to make him back off. The global community recently saw the implications of this conflict when a Jihadi terror plot led to the cancellation of three Taylor Swift concerts in Austria. ISIS terrorists reportedly planned to plant bombs and murder some of the 65,000 fans, reminiscent of the wave of suicide bombings against Israelis in the early 2000s. The October 7th Massacre has inspired Islamic terrorists worldwide, providing them with a model to copy. If terrorists think they can get away with such atrocities, they will do it again, everywhere, to everyone. Islamic terrorists like Hamas and ISIS are enemies of the West, enemies of freedom, and enemies of humanity. Terrorism often starts with the Jewish people, but it never ends there.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Supporting Israel and Global Security</h3>\n\n\n\n<p>For months, Israel has been warning that the West is next, and with the recent terror plots, it seems the warnings were justified. This war must end with the defeat of Hamas and the freeing of the hostages, or there will be a next time, and it could be worse, targeting people abroad. If Israel loses, everyone loses. Israel&#8217;s security is global security. Standing with Israel against terror will keep us all safe. For those asking how you can help, please find links to our JGiv campaign across social media. Donations help us get the word out, and liking and subscribing to our content makes a difference in combating the lies and misinformation about Israel that are spread worldwide.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions from Social Media</h3>\n\n\n\n<p><strong>Question from Ed Bar on YouTube:</strong><br><em>After admonishing Israel for reportedly eliminating Ismail Haniyeh and delaying the deal, the White House said we are closer than ever to a deal. What changed so fast?</em></p>\n\n\n\n<p><strong>Response:</strong><br>I don&#8217;t know whether Israel killed Hamas warlord Ismail Haniyeh in Iran, but if it did, it was doing exactly what the West told it to do for months: go after those responsible for October 7th. If Israel took out Haniyeh just like it took out Muhammad Deif and Maan Isa, it is following the global call for precision strikes against terrorist masterminds. A deal to get the hostages out is crucial, and Israel is creating conditions to pressure Hamas&#8217;s remaining leaders into releasing the hostages.</p>\n\n\n\n<p><strong>Question from Anah He on Instagram:</strong><br><em>What could an attack from Hezbollah look like if they act on their own?</em></p>\n\n\n\n<p><strong>Response:</strong><br>We need to stop talking about what could happen if a war erupts—Hezbollah declared war on October 8th. They have already fired 7,000 rockets and drones at Israel, displacing 60,000 Israelis. Hezbollah, with its vast arsenal of over 200,000 rockets, can cause immense damage to Israel, even without direct Iranian involvement. The U.S. has sent a strike carrier group to the Middle East to deter any further escalation from Hezbollah.</p>\n\n\n\n<p><strong>Question from Sammy Tissa on YouTube:</strong><br><em>Many people in the diaspora are scared about a possible attack from Iran on Israel. Are there any positive messages you can give to uplift them?</em></p>\n\n\n\n<p><strong>Response:</strong><br>The situation is indeed scary, and Jews in the diaspora must be vigilant. But the resilience of the Israeli people is remarkable. Despite the threats, life in Israel continues as normally as possible. Israelis are tough and determined to get through this. The strength and courage of the Israeli people should be a source of confidence.</p>\n\n\n\n<p><strong>Question from Barta Zuza on Instagram:</strong><br><em>Can you really envisage that the USA would withhold important weapons to Israel?</em></p>\n\n\n\n<p><strong>Response:</strong><br>The U.S. has already withheld certain weapons from Israel, but all presidential candidates have affirmed their commitment to Israel&#8217;s security. However, the information war matters, and your voice is crucial. There&#8217;s pressure on world leaders to weaken Israel, but standing up for Israel means standing up for your own countries as well.</p>\n\n\n\n<p><strong>Question from Shane Spring on Instagram:</strong><br><em>Why do all of you hosts refer to Iran as Iran, as opposed to the Iranian regime or the IRGC?</em></p>\n\n\n\n<p><strong>Response:</strong><br>You&#8217;re right—we should refer to the regime as the Islamic Republic of Iran or the Iranian regime. The people of Iran are not our enemies; they have been taken hostage by a brutal theocratic regime. We will make an effort to use more accurate language out of respect for the many Iranians who seek peace.</p>\n\n\n\n<p><strong>Question from Anaka Tyson:</strong><br><em>Alon, do you feel exhausted after 10 months of Israel advocacy?</em></p>\n\n\n\n<p><strong>Response:</strong><br>Everyone in Israel is feeling burnout, but we don&#8217;t have the luxury of giving up. We are under attack, and the stakes are life or death. Despite the exhaustion, we are committed to winning this war and ensuring that the terrorists who perpetrated the October 7th Massacre do not emerge emboldened to do it again.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you for joining us today. We will be back on Sunday with our daily briefings at 3:00 p.m. Israel time (8:00 a.m. Eastern time). Please remember to follow us on all social media platforms and the podcast. Let&#8217;s hope for a quiet and peaceful weekend. Stay safe.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On day 307 of the October 7th War, <a  href=\"/hezbollah\">Hezbollah</a> escalates its attacks, threatening <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and Lebanon&#8217;s stability. Israel remains resolute, countering the threat while emphasizing global security. The resilience of Israelis continues despite ongoing challenges. Support for Israel is vital to defeating terrorism and ensuring peace in the region.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 10868,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-10865",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 10865
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10865",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=10865"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10865/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 10870,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10865/revisions/10870"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/10868"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=10865"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=10865"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=10865"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}