{
    "id": 16530,
    "date": "2024-08-28T15:00:00",
    "date_gmt": "2024-08-28T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=16530"
    },
    "modified": "2024-09-03T00:53:35",
    "modified_gmt": "2024-09-02T21:53:35",
    "slug": "hezbollah-copies-hamass-tactics-with-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-copies-hamass-tactics-with-daniel-rubenstein/",
    "title": {
        "rendered": "Hezbollah Copies Hamas’s Tactics | with Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Copies Hamas’s Tactics | with Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Uxz5U3etvFk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is day 326 of the October 7th War, a war that Hezbollah and Lebanon joined on October 8th. Since that time, Hezbollah has fired thousands of rockets, anti-tank missiles, and suicide drones into Israel. More than 60,000 Israelis have left their homes in Northern Israel because their homes are near the Lebanese border and are under attack. It&#8217;s been two days since Hezbollah mobilized its forces in Lebanon to fire hundreds of missiles at once into Israel&#8217;s cities. The launchers were aimed at their targets in Israel, but Israel&#8217;s Air Force stopped the massive attack at the last minute before Hezbollah could burn Israeli cities. The threat was imminent, the danger immediate. Iran&#8217;s proxy army in Lebanon wanted to carry out a massacre. Hezbollah did manage to fire around 230 rockets and 20 suicide drones into Israel, but the damage caused by these attacks was less than Hezbollah hoped for.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Strategy and International Response</h3>\n\n\n\n<p>The Israeli military shared an important fact about Hezbollah&#8217;s rocket attacks: 90% of them—90% of the 230 rockets that Hezbollah fired—were fired from areas next to civilian buildings, such as mosques, schools, and UN buildings. What does this tell us? It tells us that Hezbollah saw what Hamas did in Gaza and said to itself, &#8220;This strategy will work for us too.&#8221; Hezbollah saw that when Hamas turned residential areas into rocket launching sites, it wasn&#8217;t Hamas that was condemned; it was Israel. Hezbollah saw that when Hamas invaded Israel on October 7th, some countries, like South Africa, did not condemn Hamas—they condemned Israel. Hezbollah saw that when it joined Hamas&#8217;s war on October 8th and fired thousands of rockets, anti-tank missiles, and suicide drones at Israel, many world leaders refused to mention Hezbollah by name, let alone condemn it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Lack of Condemnation from World Leaders</h3>\n\n\n\n<p>I went through statements by world leaders over the past couple of days. Which world leaders condemned Hezbollah for planning a massive missile attack on Israeli cities? Which world leaders condemned Hezbollah for firing over 200 rockets? Which world leaders said that unless Hezbollah backs off, Israel has the right and the responsibility to push Hezbollah away? I only saw calls for de-escalation. If you saw something else, if you saw condemnations of Hezbollah, let me know in the comments.</p>\n\n\n\n<p>Here&#8217;s what British Foreign Secretary David Lamy tweeted two days ago after Hezbollah&#8217;s imminent attack was stopped. It was typical of the statements I saw from others. Secretary Lamy said, &#8220;Further escalation in the Middle East must be avoided at all costs. In my call with Israeli Minister Dermer, I reiterated the UK&#8217;s support for Israel&#8217;s security, the importance of restraint, the need for an immediate ceasefire in Gaza, and the release of all hostages.&#8221; Later, Secretary Lamy tweeted again, &#8220;All parties must work to prevent an escalation in conflict across the Middle East. I expressed my deep concerns over today&#8217;s events in a call with Lebanese Prime Minister Najib Mikati and stressed the need for restraint from all sides.&#8221; You&#8217;ll notice there&#8217;s a word he did not use—the word &#8220;Hezbollah.&#8221; I know that he is capable of speaking clearly when he wants to. Here&#8217;s what Secretary Lamy said yesterday about Russia&#8217;s massive attack on Ukraine: &#8220;The UK utterly condemns Russia&#8217;s cowardly missile and drone attacks on civilian infrastructure across Ukraine today. These assaults are in flagrant violation of international law, and those responsible must be brought to justice.&#8221; Cowardly, flagrant violation of international law, those responsible must be brought to justice. It&#8217;s possible to use these words about Hezbollah too, but for some reason, Hezbollah gets a pass.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The War Continues</h3>\n\n\n\n<p>So, what now? The October 7th War is continuing. It is continuing because Hamas continues to fight, continues to hold hostages, and continues to promise more October 7th massacres until Israel is destroyed. The war is continuing because Hezbollah continues to fire rockets, anti-tank missiles, and suicide drones into Israel. The war is continuing because Iran&#8217;s proxy armies have been ordered to continue it. The Iranian Foreign Minister said that Iran does not seek to expand the conflict, but he also said that another attack on Israel is inevitable. It&#8217;s not inevitable; it&#8217;s a choice. Iran is choosing war. Iran has established a ring of fire around Israel. Israel is defending itself in a seven-front war against Iran and its proxies. The fronts are Hamas in Gaza, Hamas in the West Bank, Hezbollah in Lebanon, Iranians in Syria, Iranian-backed militias in Iraq, the Houthis in Yemen, and Iran itself. Israel is fighting for its survival against enemies that want to destroy it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Global Stakes</h3>\n\n\n\n<p>Iran wants to light the Middle East on fire and watch it burn. Everyone needs to do their part to put out the fires. Tell the truth about the Iranian regime. Tell your leaders to tell the truth about the Iranian regime. Stand up to anyone who can&#8217;t tell simple truths about the barbaric enemies that Israel faces. The future of humanity is at stake.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section</h3>\n\n\n\n<p><strong>Ariella on Instagram:</strong> <em>Hamas really thinks IDF will just leave the Philadelphia Corridor and just let Hamas regroup?</em></p>\n\n\n\n<p><strong>Answer:</strong> This is an important question. You&#8217;ll see very often in the news the term &#8220;Philadelphia Corridor.&#8221; I want to first emphasize it has nothing to do with the city of Philadelphia in the United States. This is a name that the Israel Defense Forces gave to a very critical strip of territory between Gaza and Egypt. Since Israel withdrew from Gaza in 2005, that important corridor has been completely in the hands of Hamas. Hamas has used the time, money, and power that it has to militarize the entire Gaza Strip. One of the ways it was able to do that is by smuggling parts and weapons above ground via the Egypt-Gaza border and below ground through tunnels under the Egypt-Gaza border. Today, the Israel Defense Force is currently on the Gaza-Egypt border, on the Gaza side of the border, and one of the sensitive and important issues in the hostage negotiations is the fate of this corridor. Israel insists that Israeli forces remain on the border between Gaza and Egypt so that Hamas cannot rearm and reacquire the supplies it used to carry out the October 7th Massacre. Hamas, of course, insists that Israel leave this corridor if there’s going to be any deal. It’s very easy to understand why Hamas wants Israel to leave this corridor—it’s how Hamas acquired all the weapons it used on October 7th. In order to prevent another October 7th massacre, the Israeli Prime Minister is saying, &#8220;We want Israeli forces on that border so that we can see what&#8217;s coming from Gaza to Egypt or from Egypt to Gaza.&#8221; This is one of the issues being discussed. A lot of people think that Israel can just walk away. It&#8217;s an intense discussion within Israel and about Israel right now. All I can say is stay tuned.</p>\n\n\n\n<p><strong>Question across channels:</strong> <em>What is UN Security Council Resolution 1701?</em></p>\n\n\n\n<p><strong>Answer:</strong> UN Security Council Resolution 1701, that&#8217;s 1701, is a very important Security Council resolution that people who were not alive 18 years ago may not remember. So, let&#8217;s get people up to speed. There was a war in the summer of 2006, that&#8217;s 18 years ago, when Hezbollah carried out a cross-border raid from Lebanon into Israel, fired anti-tank missiles at Israeli military vehicles, killed two Israeli soldiers, and took their bodies into Lebanon. In the ensuing days and weeks, Hezbollah fired 4,000 rockets from Lebanon into Israel. That war lasted 34 days, and it ended with a UN Security Council Resolution 1701, which called on Hezbollah to disarm and leave southern Lebanon, so that the only sovereign power in Lebanon, the only armed power in Lebanon, would be the government of Lebanon. This was the reality that was supposed to exist since 2006. It was never implemented. Hezbollah did not disarm, and Hezbollah remains part of the Lebanese government today, where it effectively has the power to veto any decision that would disarm Hezbollah. So, you will see references today in diplomatic conversations about the need to implement or enforce UN Security Council Resolution 1701. What that means in plain language is that Hezbollah needs to disarm and Hezbollah needs to withdraw from southern Lebanon and move away from the border with Israel.</p>\n\n\n\n<p><strong>Question on X:</strong> <em>What is going on with Iran&#8217;s nuclear program?</em></p>\n\n\n\n<p><strong>Answer:</strong> This is a question that everyone is ignoring because of the seven-front war, because of the ring of fire that Iran has established around Israel with all of its proxy armies. Much of the world&#8217;s attention, and Israel&#8217;s attention, is focused on fighting Iran and its proxy armies. But while Iran is carrying out this war and ordering its proxies to continue the war, it is also developing the capability to have a nuclear bomb. This is something that deeply worries Israel. There was a former Iranian president who referred to Israel as a &#8220;one bomb country.&#8221; What does that mean, a &#8220;one bomb country&#8221;? It means that if Iran were to acquire a nuclear weapon and it would detonate this nuclear weapon above the center of Israel, that would be the end of Israel. Israel is a very small country. Most of the population is in a certain area. One nuclear blast could not be survived. So, Israel has a very clear policy that it will not allow Iran to develop nuclear weapons. This is a long-standing policy, and Iran seems to be marching in the direction of having the capability of assembling a nuclear weapon and having the ability to deliver it. There are three things that Iran needs to be able to do: One is to have a missile program—missiles that can reach Israel. Iran does have ballistic missiles that can reach Israel. We saw this a few months ago when Iran fired these missiles at Israel. Most of them were intercepted outside of Israel&#8217;s borders. One of them did make it into Israel, so we know that Iran has ballistic missiles that can reach Israel and even into Europe. So, Iran has the capability of delivering a nuclear weapon. Iran also needs to know how to put a nuclear bomb on the missile, to experiment with a warhead. We know that Iran has done that. And the last thing Iran needs, of course, is the fuel for this nuclear weapon, and that is enriched uranium. We know that Iran is enriching uranium and stockpiling uranium. Even if it&#8217;s low-enriched uranium and not the highly enriched uranium that it needs for a nuclear bomb, if Iran stockpiles enough low-enriched uranium, it will take a very short amount of time to make the decision to enrich it to highly enriched uranium. This is what&#8217;s known as the breakout time—the amount of time it would take Iran, once it decides to build a nuclear bomb, to actually build it and be able to deliver it. The margin of error in Israel for an Iranian nuclear weapon is very low. We cannot live with an Iranian nuclear weapon. That is why when the Israeli Prime Minister has been asked for years what are the biggest threats that Israel is dealing with, he answers, &#8220;Iran, Iran, and Iran.&#8221; We cannot allow a situation where a country that says that Israel needs to be destroyed and is supporting the proxy armies that are fighting Israel will also have a nuclear weapon. It&#8217;s an untenable reality, and I hope the whole world wakes up to the threat of Iran before it is too late.</p>\n\n\n\n<p><strong>Jessica on Instagram:</strong> <em>What is the status quo on the Temple Mount, and who made it?</em></p>\n\n\n\n<p><strong>Answer:</strong> The status quo on the Temple Mount—I&#8217;ve seen a lot of politicians in recent days emphasize their commitment to the status quo on the Temple Mount, and I&#8217;ve also seen foreign world leaders insist that the status quo be maintained. But if you look at all of the statements, whether it&#8217;s Israeli leaders or world leaders mentioning the status quo, they don&#8217;t mention what the status quo is. So, I think it&#8217;s important before anyone has an opinion about the status quo to at least have some understanding of what the status quo means. So, what are we talking about? We&#8217;re talking about a place called the Temple Mount. It is the most sensitive issue of all the sensitive issues in the Israeli-Palestinian conflict. The Temple Mount is the holiest site in the world for Jews. It&#8217;s called the Temple Mount because it was the mount on which the Jewish temples existed. It is today the direction of Jewish prayer. It is the holiest site in the world for Jews. That same site is also a holy site for Muslims. For the past 1,300 years in Islam, it is not known as the Temple Mount. In Islam, the area is called the Noble Sanctuary, Haram al-Sharif in Arabic. The Dome of the Rock, that golden dome that you see in all of the postcards of Jerusalem, marks this spot in Islam where the Prophet Muhammad visited on the Night Journey and ascended to heaven. It is the oldest structure in Islam. It is on the exact spot where the temples stood. So, it&#8217;s the holiest site in Judaism, and in Islam, it&#8217;s the third holiest site after Mecca and Medina in modern-day Saudi Arabia. Since 1967, since the Six-Day War, Israel has controlled the Temple Mount. Shortly after coming into control of this holy site, both for Jews and Muslims, Israel implemented what became known as the status quo. A status quo is just a situation that exists until there&#8217;s a change. But what is the status quo that everyone is referring to? The status quo means that only Muslims may pray on what Jews call the Temple Mount and what Muslims call the Noble Sanctuary, Haram al-Sharif in Arabic. The Dome of the Rock, Al-Aqsa Mosque—only Muslims may pray in these areas. Non-Muslims can access the site during certain hours of the day and certain hours of the week, but they may not pray at the site. The status quo, I must say, is highly offensive to both sides. If you listen to people talk, the status quo is highly offensive. There are Jews who wish to pray at the Temple Mount, and they say, &#8220;We are living in a democratic country with freedom of religion. We should have the right to pray at our holy site.&#8221; And the Muslims, the Palestinians, are saying, &#8220;It&#8217;s not just that the status quo is acceptable, but we consider Jerusalem to be occupied, and Israel must leave it entirely. We should be in charge of the site.&#8221; So, in the meantime, there&#8217;s a status quo somewhere in the middle, where the Israeli police control the site. Only Muslims may pray; non-Muslims may visit. The Prime Minister of Israel and other Israeli leaders have emphasized that they are committed to maintaining this status quo.</p>\n\n\n\n<p><strong>Lindsay on Instagram:</strong> <em>What news is there on a possible escape of a hostage in Gaza?</em></p>\n\n\n\n<p><strong>Answer:</strong> About a minute and a half before I began this live broadcast, people entered my studio and started showing me their phones that there&#8217;s some possible news about an Israeli hostage who escaped. The news that I saw indicated it was possibly an Israeli Arab, one of the hostages in Gaza who was able to get away from his captors. If this is true—I have not been able to confirm this as I don&#8217;t see what&#8217;s being reported in Israel—but if it is confirmed that this is true, that a hostage was able to escape, it would be incredible news. We want to bring every hostage home safely and in good health. The hostages in Gaza have been there for over 300 days. It is time to bring every single one of them home. Hamas is effectively holding these people not just as hostages; they&#8217;re in many cases slaves. If these Israelis are being held in private homes and they&#8217;re being ordered to do work for whichever family is holding them, that is a form of slavery. These people are being held as slaves. They should be released immediately. I hope that the news is true about this one hostage, and I hope it&#8217;s true about every single hostage—that they return home quickly to their families.</p>\n\n\n\n<p><strong>Conclusion</strong> That&#8217;s all the time we have now for this live daily briefing of the Israeli citizen spokesperson&#8217;s office. As always, I&#8217;m available for follow-up questions. If you want to follow me on my own personal social media, you can find me on Instagram at @ruby_guides_israel. I&#8217;m also on Twitter/X; my name there is @paul_rubns. If you want to ask me anything about something I said or didn&#8217;t say, please tag me, write in the comments later when the video goes up—I&#8217;m always happy to engage with people watching. I&#8217;ve enjoyed addressing you, and as always, Sunday to Thursday, live right here, 3 PM Israel time from the Israeli citizen spokesperson&#8217;s office—that&#8217;s 8 AM on the East Coast. Thank you for watching. We&#8217;ll see you back again tomorrow.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The October 7th War continues as <a  href=\"/hezbollah\">Hezbollah</a> and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s proxies intensify attacks on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>. Despite global calls for de-escalation, Israel defends against a seven-front war, including <a  href=\"/hamas\">Hamas</a> and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>. International leaders&#8217; reluctance to condemn Hezbollah highlights the ongoing threat, with the future of regional and global security at stake.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312
    ],
    "class_list": [
        "post-16530",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "en",
    "translations": {
        "en": 16530
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16530",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=16530"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16530/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16531,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16530/revisions/16531"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=16530"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=16530"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=16530"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}