{
    "id": 14911,
    "date": "2024-08-15T20:00:00",
    "date_gmt": "2024-08-15T17:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=14911"
    },
    "modified": "2024-08-16T11:37:05",
    "modified_gmt": "2024-08-16T08:37:05",
    "slug": "idf-spokesman-update-08-15-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-08-15-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 08/15, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 15.08, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/O8NDS1IH3o0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good evening. As I mentioned earlier this week, we will continue to update you here every few days about the situation, even when there are no changes in the Home Front Command&#8217;s guidelines. Over the past week, we have improved and elevated our readiness and preparations. We continue our efforts in intelligence gathering and strikes in the skies of Lebanon and across all arenas, continuously maintaining a state of high readiness in both offense and defense, acting in accordance with the directives of the political echelon.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Continuous Operations Across All Arenas</h3>\n\n\n\n<p>The Air Force, Northern Command, Intelligence Directorate, Operations Directorate, and Home Front Command are all working around the clock in defense and offense. As we approach the weekend, we are conducting a situation assessment. At this stage, there is no change in the Home Front Command&#8217;s defense policy. If there is any change, we will update immediately. We remain vigilant at all times. The public’s alertness is important, and we urge you to continue following the guidelines on the official platforms of the IDF Spokesperson and Home Front Command.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Arrests and Counterterrorism Efforts</h3>\n\n\n\n<p>In the Central Command, IDF forces have arrested about 50 wanted individuals across Judea and Samaria over the past week. We have increased counterterrorism activities in the area, with a focus on the threat of explosives. In a joint operation by the IDF and Shin Bet in the Jordan Valley, the forces eliminated a key terrorist in an exchange of fire and four others in an airstrike. Additionally, the forces found explosives and seized many weapons.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ongoing Combat in Gaza</h3>\n\n\n\n<p>IDF forces continue to fight in Gaza, maneuvering in Rafah, Khan Younis, and central Gaza, striking everywhere. So far, we have eliminated over 170 terrorists as part of the significant achievements on the ground. In the past week, we have destroyed around 50 underground shafts in the Philadelphi Route area. We are focused on locating and destroying underground infrastructure in the area. Not all tunnels are active; some are very old and were dealt with by the IDF in the past, but we are neutralizing them all with determination.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF Chief of Staff&#8217;s Visit and Future Operations</h3>\n\n\n\n<p>The Chief of Staff visited Rafah yesterday to approve the plans on the ground and prepare all options for action in the area, in accordance with the directives of the political echelon. The significant combat and its high achievements are hindering Hamas&#8217; ability to recover and regroup, and we are determined to continue this.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas Psychological Warfare and Hostage Situation</h3>\n\n\n\n<p>In recent days, the Hamas terrorist organization has spread manipulative messages about the hostages as part of its attempts to conduct psychological warfare, aiming to sow fear and anxiety among the public. The goal of the war to bring back the 155 hostages is always before us. We are working with all security agencies, even at this moment, to create the conditions for their return as soon as possible.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Media Q&amp;A</h3>\n\n\n\n<p><strong>Meir Turgeman, Yedioth Ahronoth and Walla:</strong> &#8220;This morning, American officials told The New York Times that they believe the IDF has reached its capacity. John Kirby, the spokesperson for the National Security Council, echoed these statements. What does the IDF say about these claims? Have you reached your limit in the fight in Gaza?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;Our achievements against Hamas are very significant. We will continue to dismantle Hamas; that is our mission. We will continue doing everything we can to create the conditions to bring the hostages home. These are the war goals set by the political echelon, and we will fully achieve them.&#8221;</p>\n\n\n\n<p><strong>Kan 11:</strong> &#8220;There is a planned concert this evening in Yarkon Park. Is it safe to be there with tens of thousands of people, in case of an attack by Hezbollah or Iran?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;As I said, there is no change in the Home Front Command&#8217;s guidelines, and this applies to tonight&#8217;s events as well. We are working and coordinating with the Home Front Command and local authorities, and we will update both the authorities and the public immediately if there is any change. Vigilance is needed tonight, as I mentioned, and the guidelines remain as they are—no change in policy.&#8221;</p>\n\n\n\n<p><strong>Channel 12 News:</strong> &#8220;Hamas reported that two hostages were seriously injured. What do you know about their condition?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;Regarding this matter, any information we have, we first update the families and then the public. Regarding this report, we cannot confirm or deny it. This report continues to be part of Hamas&#8217; psychological terror against the families and the public.&#8221;</p>\n\n\n\n<p><strong>Amir Buchbut, Walla:</strong> &#8220;The Chief of Staff said that the Philadelphi Route can be closed and reopened if necessary. Is there any doubt that this is Hamas&#8217; lifeline, and how will the IDF prevent Hamas from rebuilding?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;Our primary objective now is to destroy the infrastructure in the area. We are continuing to dismantle Hamas. That is part of this. Regarding the question, the Chief of Staff visited the area yesterday to review all the plans and approve all alternatives. Our role is to prepare all the alternatives, receive the directive from the political echelon, and implement it.&#8221;</p>\n\n\n\n<p><strong>Liran Weinstein, Srugim:</strong> &#8220;Why aren&#8217;t specific times for reaching protected areas in the event of threats from Lebanon and Iran communicated to the public in advance?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;The times to reach protected areas are accurate for all regions, according to the zones. They are available on the Home Front Command website, and everything is written there. I would also add that we were here a week ago to explain and present the &#8216;Personal Message&#8217; system that, in addition to the public warning efforts, will appear on phone screens as a silent alert, an additional early warning as much as possible.&#8221;</p>\n\n\n\n<p><strong>Itzik, News Push:</strong> &#8220;Is the IDF and the security system identifying an escalation and increase in attacks in the Jordan Valley and Judea and Samaria, and how are you preparing for it?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;We have been engaged in extensive efforts against terrorism in Judea and Samaria for a long time. We operate every night, thwarting and arresting, and we will continue this effort. Our role is to thwart terrorism in Judea and Samaria. Thank you very much.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The IDF is maintaining high readiness, conducting strikes, dismantling <a  href=\"/hamas\">Hamas</a> infrastructure, monitoring threats, and addressing public concerns.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-14911",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 14911
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14911",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=14911"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14911/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 14923,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14911/revisions/14923"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=14911"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=14911"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=14911"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}