{
    "id": 15592,
    "date": "2024-08-25T21:00:00",
    "date_gmt": "2024-08-25T18:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=15592"
    },
    "modified": "2024-09-22T22:40:12",
    "modified_gmt": "2024-09-22T19:40:12",
    "slug": "idf-spokesman-update-25-08-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-25-08-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 25.08, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 25.08, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/BZW5Q8HCSOk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good evening. This morning, we successfully thwarted an extensive shooting attack by the terrorist organization Hizbullah towards settlements in the north and sites in the center of the country.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Monitoring Hizbullah&#8217;s Activities</h3>\n\n\n\n<p>We monitored Hizbullah for weeks using technological means and air patrols by Air Force planes. The organization aimed to attack both the north and the center of the country but was met with a strong response. About 100 Air Force planes attacked more than 27 targets simultaneously in southern Lebanon, disrupting Hizbullah&#8217;s attack plan. So far, six terrorists are confirmed killed in these strikes, with the possibility of more being discovered in the coming days.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Details of the Attack</h3>\n\n\n\n<p>Hizbullah commanders were among the targets that were attacked. Approximately 90 of the targets were short-range rockets aimed at the northern part of the country, intended to harm Israeli citizens. Hizbullah managed to launch about 230 rockets and over 20 unmanned rockets, most of which were intercepted, fell in open areas, or were intercepted by the Air Force and Navy ships&#8217; defense systems. Contrary to Hizbullah&#8217;s claims, there were no hits on IDF bases in either the north or the center.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Casualties and Injuries</h3>\n\n\n\n<p>Unfortunately, Rishon David Moshe ben Shatrit, who was evacuated to the hospital in a naval rescue, later succumbed to his wounds. May his memory be blessed. Additionally, two soldiers were lightly wounded, and we wish them a speedy recovery. The situation remains tense, and we share in the grief of the family while extending our wishes for a swift recovery to the wounded.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ongoing Operations</h3>\n\n\n\n<p>The operations wing has protected the State of Israel from an attack that Hizbullah planned for many days following the assassination of the senior commander in Hizbullah, Fuad Shoko, along with other commanders who were eliminated in recent months. Hizbullah still has capabilities, and the road ahead is challenging. Our mission remains clear: to safely return the residents of the north to their homes, and we are preparing all necessary plans to achieve this goal.</p>\n\n\n\n<h3 class=\"wp-block-heading\">High-Level Military Coordination</h3>\n\n\n\n<p>Tonight, the Chairman of the Joint Chiefs of Staff of the United States Army, General Brown, landed in Israel. He will meet with the IDF Chief of Staff, the Minister of Defense, and other commanders. The IDF maintains a very high level of preparedness in both attack and defense across all arenas. At this time, there is no change in the Home Front Command&#8217;s directives. The public is required to continue showing responsibility and vigilance, as they have done so far.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Acknowledgment of Public Cooperation</h3>\n\n\n\n<p>I want to commend the exemplary behavior of the residents of the north, who prevented injury to life through their responsible actions. We will continue to update you on any changes as they arise.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Focus on the War&#8217;s Objectives</h3>\n\n\n\n<p>Our efforts are directed responsibly towards the goals of the war. Our primary task is to protect the citizens of the State of Israel. Today, the Middle East was spared from escalating tensions, and we will continue to exert heavy pressure on Hizbullah to eliminate its leadership and dismantle its terrorist infrastructure throughout the Gaza Strip.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Fallen Soldier Tribute</h3>\n\n\n\n<p>Today, we honored First Sergeant Amit Tsadikov, a Parachute Brigade fighter who fell in battle in southern Gaza as a result of a bomb explosion. We share in his family&#8217;s grief and stand by them during this difficult time.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Current Security and Negotiations</h3>\n\n\n\n<p>Alongside all these efforts, we are entering significant days with a very high level of preparedness across all arenas, including ongoing negotiations in Cairo. I am aware of rumors circulating even before this briefing regarding these negotiations. We remain committed to the war&#8217;s objectives, one of which is the return of the 109 abductees. We will continue to do everything in our power to achieve this goal.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Media Q&amp;A</h2>\n\n\n\n<p><strong>Yoav Borovitch (Channel 11):</strong><br>Is there information that the attack by Hizbullah targeted a Mossad base and another facility in Tel Aviv, as reported by the American media?</p>\n\n\n\n<p><strong>Response:</strong><br>Hizbullah mainly tried to launch attacks on military sites in the north and center. There were no hits on IDF bases in either the north or the center. Ensuring the security of the residents in the north is a central task, and we are working around the clock to restore their safety.</p>\n\n\n\n<p><strong>Yoav Borovitch (Channel 11):</strong><br>The residents of the north are angry that the IDF only launches a counterattack when there is an attack on the center, while they have been under fire for 11 months. Will this policy change?</p>\n\n\n\n<p><strong>Response:</strong><br>Our focus has been on neutralizing threats and planning extensive operations to ensure the security of all regions. We have full plans to restore security to the north, which will be implemented as needed.</p>\n\n\n\n<p><strong>Regarding the accuracy of Hizbullah&#8217;s statements:</strong><br>My role is to present the facts as they are. No IDF bases were hit in the north or center. Hizbullah&#8217;s claims about the undamaged state of their launchers are still under investigation, but there is no doubt that many were destroyed in our attacks.</p>\n\n\n\n<p><strong>On the operational strategy against Hizbullah:</strong><br>Our mission is to bring Hizbullah to its lowest point of disintegration. We are committed to this goal and will continue to present all options to the political echelon for decision-making.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing RemarksThank you for your attention. We will continue to act decisively to protect the State of Israel and its citizens.</h3>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>This morning, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> thwarted <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s planned attack and launched a counterstrike, destroying multiple targets in southern Lebanon. Six terrorists killed.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-15592",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 15592
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15592",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=15592"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15592/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17743,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15592/revisions/17743"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=15592"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=15592"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=15592"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}