{
    "id": 7036,
    "date": "2024-08-01T20:00:00",
    "date_gmt": "2024-08-01T17:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=7036"
    },
    "modified": "2024-08-02T14:52:00",
    "modified_gmt": "2024-08-02T11:52:00",
    "slug": "idf-spokesman-update-01-08-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-01-08-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 01.08, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 01.08, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/muT86S301V0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Since the beginning of the war, we have faced various threats, both from afar and nearby. The resilience and patience you, the public, have demonstrated over the past months enable the IDF forces to continue focusing on operational objectives on different fronts. Recently, we have proven that the State of Israel can handle defensive threats and respond powerfully in attacks.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Current Situation and Defense Policy</h2>\n\n\n\n<p>Today, we heard statements from terror elements in the region. Throughout the war, we have demonstrated our determination and resilience. We are conducting an ongoing assessment of the situation, considering various scenarios and responses on the home front. At this time, there are no new guidelines and no change in the Home Front Command&#8217;s defense policy. We are constantly monitoring the situation. If an immediate warning is issued, you must follow the Home Front Command&#8217;s instructions. We have very good defense systems and international partners who have reinforced their forces in the region to help us against the threats. However, the defense is not impenetrable, so I ask you to remain vigilant and continue to adhere to the Home Front Command&#8217;s instructions as you have throughout the war. We are taking all steps to ensure your safety, and if there are any changes, we will update you immediately through all IDF and Home Front Command platforms and channels to allow appropriate preparation. I will be here to update you immediately.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Military Readiness</h2>\n\n\n\n<p>The IDF is on high alert, both in defense and offense. IDF forces are deployed in the air, sea, and land, ready for any scenario, especially for immediate attack plans. Today marks 300 days since the beginning of a long, multi-front war during which IDF fighters and commanders have been working around the clock in all sectors and efforts to achieve the war objectives and bring about a better security reality. One of the war&#8217;s goals is to dismantle Hamas and eliminate its leadership. Following intelligence received earlier today, we can confirm with certainty that in a precise attack carried out by the IDF and the Shin Bet three weeks ago, Mohammad Deif, the commander of Hamas&#8217; military wing, was eliminated. Deif was the architect of the October 7th attack, planned and led the massacre in Israel, and is responsible for the deaths of thousands of innocent Israeli and foreign civilians. Mohammad Deif&#8217;s hands are stained with blood.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hostage Situation</h2>\n\n\n\n<p>This evening, we still have in mind the 115 hostages held by Hamas in Gaza. I want to address the families of the hostages. 300 days are an endless day since October 7th, full of suffering, difficulty, and uncertainty that no one can understand. Our top mission is to bring your loved ones back, and this guides us in every decision. The IDF, Shin Bet, Mossad, and the entire defense system are working tirelessly to return the hostages as quickly as possible.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Addressing the Media</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Questions from Bar</h3>\n\n\n\n<p>Bar: Is it true that the publication indicating Anya was killed by a charge and not by a missile is correct? What was the intelligence that led to Mohammad Deif&#8217;s elimination, and why did it take so long? When do you expect a reaction from Hezbollah to the recent eliminations?</p>\n\n\n\n<p>IDF Spokesperson: We attacked in Lebanon on Tuesday night and eliminated Fuad Shukr in a precise airstrike. I want to emphasize that there was no additional airstrike, no missile, and no Israeli UAV in the Middle East that night. Moreover, I do not want to elaborate on our intelligence. I want to add that Iran has been managing a terror infrastructure in recent years to transfer explosive devices to Israel for attacks. We will continue to act decisively against Iranian terrorism. Regarding the intelligence about Mohammad Deif, this morning we received proof that Deif was indeed killed in the attack three weeks ago, hence the announcement.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions from Liran Hov and Yonoff</h3>\n\n\n\n<p>Liran Hov, Kan 11: What are your assessments regarding the possibility of attacks on IDF bases, including in central Israel?</p>\n\n\n\n<p>IDF Spokesperson: We have been fighting Hezbollah since October 7th when they opened fire on Israel. Hezbollah attacks us daily, and we respond with force and determination. We will continue to operate this way. The elimination of Fuad Shukr, responsible for the massacre of children in Majdal Shams and attacks on Israelis and foreigners, is part of our war efforts. Hezbollah&#8217;s next moves are their decision, and I will not detail our intelligence here. We are well-prepared for defense and offense and will protect Israel accordingly.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions from Nir Weinste</h3>\n\n\n\n<p>Nir Weinstein, Srugim: Why is Nasrallah lying about his responsibility for the rocket fire on Majdal Shams?</p>\n\n\n\n<p>IDF Spokesperson: Nasrallah boasts about always speaking the truth, but he is lying. The rocket that hit Majdal Shams is an Iranian-made rocket. We have all its fragments, with full forensic evidence that will be shared with any community wishing to verify it. We have radar identification from the Shuba area and intelligence on the commander responsible for the fire. The evidence is clear. Nasrallah lies because he fears the blood of the children on his hands, fears the Druze in Lebanon, and the Arab world. Nasrallah is escalating the Middle East, and this will be his personal responsibility.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions from Shahen</h3>\n\n\n\n<p>Shahen, Yedioth Ahronoth: How does the fact that there are no changes in guidelines align with the shutdown of the Strauss factory in Acre or instructions to other factories to reduce or evacuate explosive gas reserves to prevent public risk?</p>\n\n\n\n<p>IDF Spokesperson: We operate through the Home Front Command and the defense system, constantly assessing threats. For the public watching at home, there are no changes in Home Front Command guidelines. I stand by this statement, but I also ask you to remain vigilant and alert to any changes. The Home Front Command has published a video today on how to act if necessary, and we have dealt with many threats from Iran, Yemen, and Lebanon. Our job is to give the public the right warning, and we will continue to act responsibly and accurately without causing undue alarm. Our duty is to provide the public with accurate information, and I commit to updating immediately if anything changes through all platforms. There are currently no changes in guidelines. </p>\n\n\n\n<p>Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The IDF <a  href=\"https://iron-swords.co.il/c/updates/\">updates</a> on ongoing war efforts, confirms eliminating <a  href=\"/hamas\">Hamas</a> commander Mohammad Deif, and stresses vigilance and adherence to Home Front Command guidelines.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-7036",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 7036,
        "ru": 7044
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7036",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=7036"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7036/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 7042,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7036/revisions/7042"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=7036"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=7036"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=7036"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}