{
    "id": 15497,
    "date": "2024-08-20T20:00:00",
    "date_gmt": "2024-08-20T17:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=15497"
    },
    "modified": "2024-08-20T22:31:11",
    "modified_gmt": "2024-08-20T19:31:11",
    "slug": "idf-spokesman-update-20-08-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-20-08-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 20.08, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 20.08, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/lF_OUfX4TBA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Evening Statement on the Rescue Operation</h3>\n\n\n\n<p>This evening, our hearts are with the communities of Nir Oz and Nirim. During the night, in a complex and brave operation, IDF and Shin Bet forces rescued the bodies of the abductees: Avraham Mondar, Haim Peri, Yoram Metzger, Alex Danzig, Nadav Poplowell, and Yagav Buchshtav, of blessed memory. On the morning of October 7th, they were abducted alive by the Hamas terrorist organization from their homes in Kibbutz Nir Oz and Nirim and were killed while being cruelly held captive by Hamas. The circumstances of their deaths in captivity are still being investigated. The findings will be presented to the families, the communities, and later to the public.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Hostages&#8217; Backgrounds</h3>\n\n\n\n<p>Avraham, aged 79, fought bravely in Israel&#8217;s wars and established his home in the western Negev at Kibbutz Nir Oz. Avraham was abducted to Gaza alongside his family—his wife Ruti, daughter Keren, and only grandson Ohad, aged nine, who were released from captivity in November as part of the hostage release framework. His son, Roy, of blessed memory, was murdered in the massacre on October 7th.</p>\n\n\n\n<p>Haim, aged 79, was a sculptor and artist from Kibbutz Nir Oz. His wife, Osnat, the kibbutz chairperson, was saved on the morning of October 7th thanks to Haim’s quick thinking, which saved her life.</p>\n\n\n\n<p>Yoram, aged 80, a former security force member and a member of Kibbutz Nir Oz, was abducted on the morning of October 7th along with his wife Tamar, who was released in the hostage release framework. They have three children.</p>\n\n\n\n<p>Alex, aged 75, a historian born in Poland to Holocaust survivor parents, joined Kibbutz Nir Oz after his military service and established his family there. Avraham, Haim, Yoram, and Alex were founders and builders of Kibbutz Nir Oz, the salt of the earth, who were abducted from their homes and community.</p>\n\n\n\n<p>Nadav, aged 51, a member of Kibbutz Nirim, was abducted from his safe room at home along with his mother, Chana Peri, who was released after 49 days in captivity. His older brother Roy, of blessed memory, was murdered on October 7th.</p>\n\n\n\n<p>Yagav, aged 34, a member of Kibbutz Nirim, was abducted along with his wife, Rimon, who was released in the hostage release framework after 53 days in captivity. We share in the immense sorrow of their families and strengthen the entire Nirim community during this difficult time.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Rescue Operation</h3>\n\n\n\n<p>Last night, IDF forces from the division, guided precisely by the Shin Bet, the Intelligence Directorate, and the Hostages&#8217; Command, raided an underground tunnel in Khan Yunis, where they found the six abductees&#8217; bodies and retrieved them. The forces arrived at the exact location thanks to intelligence gathered by the Shin Bet and the Intelligence Directorate over weeks, using various means.</p>\n\n\n\n<p>The operation was commanded by Division 98, which returned to operate in the Khan Yunis area for the third time in recent weeks, this time with new intelligence and targets. The forces&#8217; operations on the ground are ongoing, with extensive searches continuing in the area. So far, the forces have eliminated dozens of terrorists and destroyed numerous terrorist infrastructures.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Losses and Continuing Operations</h3>\n\n\n\n<p>During the intensified fighting, Lt. Shahar Bannon, of blessed memory, fell yesterday in the early morning hours in a difficult incident where the force was hit due to faulty ammunition. We are thoroughly investigating this tragic event.</p>\n\n\n\n<p>On the northern border, Warrant Officer Mahmoud Hamariya, of blessed memory, was killed yesterday by an unmanned aerial vehicle strike. We share in his family&#8217;s grief and support them. A few hours later, we struck deep into Lebanon, targeting warehouses where Hezbollah stored numerous weapons. During the strike, multiple secondary explosions were observed, indicating the quantity of weapons Hezbollah had hidden in the warehouses.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Mission Continues</h3>\n\n\n\n<p>We are fully aware of the harsh daily reality faced by northern residents living under constant threat of fire. We continue to fight against the Hezbollah terrorist organization, targeting objectives, eliminating more leaders, and removing threats. We are operating systematically and over time, with our mission being clear: to ensure the security of the residents and return them to their homes safely.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Commitment to the Hostages</h3>\n\n\n\n<p>The community of Nir Oz has coined the phrase, &#8220;The living for rehabilitation, and the dead for burial.&#8221; We are determined to bring all the hostages home, to rehabilitate the living and bury the dead. We are working around the clock to create the conditions for this. Last night, we succeeded in rescuing the six hostages, but it was too late for them—they were killed in Hamas captivity and were brought to burial in Israel today. Currently, 109 hostages are held by Hamas, and we will not give up on anyone. It is our moral duty to bring them back, and it is the objective of this war. We understand the urgency well, given the growing concern for their health and mental state as time passes.</p>\n\n\n\n<p>The IDF operates day and night to gather more intelligence and create more operational opportunities for hostage rescue, but we cannot bring everyone back through rescue operations alone. Therefore, we are making every effort, even at this moment, as IDF forces continue to fight across the Gaza Strip, attacking from the air, sea, and land, dismantling Hamas&#8217; terrorist capabilities, and working to bring the hostages home.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions from the Press</h3>\n\n\n\n<p><strong>Hadas German, Channel 11:</strong></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Question:</strong> Did the hostages die as a result of an IDF strike? And secondly, does the IDF have information on the status of the remaining hostages, whether alive or dead?</li>\n\n\n\n<li><strong>Response:</strong> We&#8217;ll start with the second question. We have information from the Intelligence Directorate, Shin Bet, and the Hostages&#8217; and Missing Persons Command. The role of this information is to build us a picture so that we can know as much as possible who is still alive, who has died, and where they are across the Gaza Strip. The intelligence-gathering operation requires both intelligence collection operations and military operations. Alongside this, we continue to create opportunities to rescue live hostages and retrieve the bodies of fallen hostages, as we did last night. I won&#8217;t go into details here about what we know and where we know they are. Our task is to update the families first and foremost, and then create operational opportunities.</li>\n</ul>\n\n\n\n<p><strong>Hadas German, Channel 11 (follow-up):</strong></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Question:</strong> Were the hostages returned today? Am I correct?</li>\n\n\n\n<li><strong>Response:</strong> I will address this. By the way, I mentioned this on June 3rd when the forces operated in Khan Yunis. It should be noted that there are six hostages, and we need to clarify all the details. These abductees are in Israel, they have been brought for burial, but they were also examined at the Forensic Institute. We will conduct a quick investigation and provide answers first to the families and communities, and then to the public.</li>\n</ul>\n\n\n\n<p><strong>Yedioth Ahronoth:</strong></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Question:</strong> Is there an estimate of the number of hostages still alive in the Gaza Strip, and have the families received signs of life recently? And secondly, what is the IDF&#8217;s stance on the issue of the Philadelphi Route presence, which, according to reports, is disputed with both Egypt and Hamas?</li>\n\n\n\n<li><strong>Response:</strong> I will start with the second question, which relates to negotiations. I will not address the details of the negotiations. The IDF&#8217;s task is to provide the political echelon with all security alternatives and to be creative and determined in this regard. Alongside this, we must allow the political echelon the space to make decisions. We will be able to implement any decision the political echelon makes. Regarding our assessment of the number of living hostages, we deal with this matter constantly, around the clock. I won&#8217;t provide numbers here; we need to update the families first and then the public.</li>\n</ul>\n\n\n\n<p><strong>Nir Weinstein, Arutz 7:</strong></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Question:</strong> It was reported today that 40 detainees were released. The IDF claims they were Palestinians not involved in terrorism. Who gave the order, and why, when there are still six hostages in the Gaza Strip? Shouldn&#8217;t this be humanitarian under humanitarian grounds?</li>\n\n\n\n<li><strong>Response:</strong> First of all, I am not fully aware of the details regarding the 40 detainees you mentioned. When such a decision is made, it is after a very thorough investigation by Shin Bet and the IDF, determining there is no involvement in terrorism, and action is taken accordingly. This is the only indicator and reason for us to do something like this. I will investigate this matter deeply and provide an answer. I also want to apologize for the technical issue we had. It is very important to us that these matters are handled professionally, especially in a case of this nature, and especially when addressing the public, the families, and the communities. I apologize for this. Sensitivity is very important to us. Thank you.</li>\n</ul>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF and Shin Bet forces rescued six <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>&#8216; bodies from <a  href=\"/hamas\">Hamas</a> captivity in a complex operation; 109 remain hostage.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-15497",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 15497
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15497",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=15497"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15497/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15498,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15497/revisions/15498"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=15497"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=15497"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=15497"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}