{
    "id": 15562,
    "date": "2024-08-24T21:00:00",
    "date_gmt": "2024-08-24T18:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=15562"
    },
    "modified": "2024-08-25T13:55:19",
    "modified_gmt": "2024-08-25T10:55:19",
    "slug": "idf-spokesman-update-24-08-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-24-08-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 24.08, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 24.08, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/OYpUqXXRYp4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>This evening, we are updating that four IDF soldiers in the reserve were killed while fighting in Netzer during the weekend. Yesterday, in the early hours of the morning, three IDF soldiers, Rabbi Sergeant Daniel Pechanik and Rabbi Nitai (may their memories be blessed), fell during a raid on Merhav Zeyton as a result of an explosive device explosion. In another incident yesterday, in the early evening, four terrorists opened fire towards the Magnan, where the shadow forces were located. The forces returned fire, killing three terrorists, while another terrorist who fled was attacked by a fighter jet. These soldiers gave their lives to protect the citizens of the State of Israel. We embrace their families in these difficult times and will continue to support them.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Operations in Gaza and Judea and Samaria</h3>\n\n\n\n<p>In Judea, Samaria, and Gaza, 162 Hokadem forces continue their activities in the Rafah area. So far, many terrorists have been eliminated, and dozens of underground terrorist tunnels have been destroyed. Meanwhile, 98 West Bank forces are operating in the Hanionim and Fati Dirrell Black areas. We do not forget the 109 abductees who are still brutally held by Hamas in Gaza. We are making all efforts to bring everyone home as quickly as possible.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF Operations Against Hezbollah</h3>\n\n\n\n<p>In the north, the IDF continues to act with determination and strength against the Hezbollah terrorist organization. In recent days, we have attacked about 70 terrorist targets, including many warehouses of weapons aimed at the State of Israel, and eliminated over 20 terrorists, including key figures in Hezbollah&#8217;s rocket array. Our modus operandi involves systematic and orderly attacks to harm Hezbollah&#8217;s capabilities and fighters. We are closing circles on terrorists who have fired or left criminal areas, among them selected commanders. We attack bases and terrorist sites, and we have a wide range of offensive action plans, which we will execute in accordance with political decisions.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Message to Northern Residents</h3>\n\n\n\n<p>To the residents of the north, I understand that you are experiencing ten very difficult months under the reality of launches and fires. We will not rest until you can safely return to your homes. We are highly prepared for both attack and defense and will continue to act to neutralize threats and fight the enemy. The public must continue to maintain vigilance as you have done so far. We will update you on any development immediately.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Situation Assessment and Investigations</h3>\n\n\n\n<p>We are aware of Iran&#8217;s intention to sabotage and seek revenge for the assassinations of their senior officials. We take these threats seriously and are prepared to act against any threat we see or identify towards the citizens of the State of Israel.</p>\n\n\n\n<p>Regarding the investigation into the death of Ron Sherman, an investigation is in the final stages with the Chief of Staff. Once concluded, it will be released first to the families and then to the public.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Update on Hezbollah and Situation Assessments</h3>\n\n\n\n<p>At the beginning of the edition, we reported on situation assessments in Israel regarding Hezbollah&#8217;s reaction to the assassination of their Chief of Staff. We are at a very high level of readiness for both attack and defense, and we will continue to update the public on any changes or developments.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Warnings of Potential Escalation</h3>\n\n\n\n<p>This evening, we revealed a warning from a senior official in the security system about a potential explosion in Judea and Samaria, following statements by politicians that could result in the transfer of territory. The IDF continues to act with high intensity in response to these threats and will continue to protect the citizens of the State of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Operational Incident and Ultra-Orthodox Recruitment</h3>\n\n\n\n<p>We are in a difficult evening, where two fighters were killed due to a bomb outside a building. Our forces learn from every operational incident, apply the lessons, and operate in a variety of methods, including air attacks and using unreachable means.</p>\n\n\n\n<p>Regarding the recruitment of ultra-Orthodox individuals, we have a systematic plan to meet this task. Despite only issuing 70 recruitment orders out of over 1000, we are preparing to meet the goals with the support of the political leadership. We are on a mission to expand the recruitment sources of the IDF, which is a national security interest.</p>\n\n\n\n<p>Thank you very much.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF <a  href=\"https://iron-swords.co.il/c/updates/\">updates</a> on fallen soldiers, ongoing operations against terrorists in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> and Lebanon, and preparations for future threats.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-15562",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 15562
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15562",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=15562"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15562/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15563,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15562/revisions/15563"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=15562"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=15562"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=15562"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}