{
    "id": 14879,
    "date": "2024-08-04T20:00:00",
    "date_gmt": "2024-08-04T17:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=14879"
    },
    "modified": "2024-08-16T11:39:59",
    "modified_gmt": "2024-08-16T08:39:59",
    "slug": "idf-spokesman-update-04-08-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-04-08-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 04.08, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 04.08, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/dyJfR9ui0P4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good evening. Throughout the week, and even today, the IDF forces are operating in Gaza, Lebanon, Judea and Samaria, and other arenas to thwart threats against the State of Israel. Alongside the ongoing operational activities, I want to address the various reports and rumors about readiness for an enemy response against Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Current Defense Policy</h3>\n\n\n\n<p>I emphasize that, as of now, there is no change in the defense policy of the Home Front Command. We are working to provide you with the necessary warnings for every threat, and until further notice, there is no change in the defense policy of the Home Front Command. We will adjust it only if required.</p>\n\n\n\n<h3 class=\"wp-block-heading\">National Preparedness</h3>\n\n\n\n<p>In addition, we are in a very strong state of readiness in air, sea, and land defense. We are prepared for any emerging threat. We will update any changes in the defense policy through the Home Front Command platforms, and I will be here to update you. The defense is not airtight, and therefore every citizen needs to know the guidelines in every place they are located and to remain vigilant.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Public Inquiries and New Systems</h3>\n\n\n\n<p>In recent days, we have seen an increase in public visits to the Home Front Command&#8217;s website and the questions that arise from this. All the answers are available on the Home Front Command&#8217;s website, and we are also updating it in light of the new questions that are coming up.</p>\n\n\n\n<p>Additionally, today, the Home Front Command launched a new system called &#8220;Personal Message.&#8221; This is a global standard system that sends defense alerts in case of widespread emergency events. The alert is sent to mobile phones in the threatened area without the need for an application or any action on the part of the citizen. This system is used worldwide to warn of broad threats such as earthquakes. We have adapted it to also alert against rocket fire.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Operational Updates in Gaza</h3>\n\n\n\n<p>In Gaza, I want to update on our operational effort. We are focusing on locating and neutralizing underground infrastructure in the Rafah area and the Philadelphi route. So far, dozens of tunnels have been uncovered, investigated, and neutralized by the forces. Not all of them are active tunnels; some are very old and have already been dealt with by the IDF in the past. Nevertheless, we are neutralizing all of them.</p>\n\n\n\n<p>Last week, the forces identified a large-scale terror tunnel on the Philadelphi route, which is about three meters high and can allow a vehicle to pass through. At this stage, the forces are investigating the tunnel and neutralizing it. The IDF is systematically destroying the underground infrastructure on the Philadelphi route and will act decisively to prevent their formation in the future. This is a continuous and complex effort, combining very advanced operational, engineering, and technological capabilities.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Recent Terror Attack in Israel</h3>\n\n\n\n<p>This morning, two Israeli citizens were murdered, and two others were injured in a stabbing attack in the city of Holon. We share in the grief of the families and wish a speedy recovery to the injured. The terrorist, a resident of the village of Salfit, was neutralized at the scene by a police officer. Immediately after the event, IDF and Border Police forces began mapping the terrorist&#8217;s house in preparation for its demolition and interrogating his family members.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Counter-Terrorism Efforts in Judea and Samaria</h3>\n\n\n\n<p>During the Sabbath, IDF and Shin Bet forces responded to an alert about a terrorist cell in the Tulkarm area that was on its way to carry out an attack on a route or settlement. In a swift operation, an aircraft eliminated the cell of five terrorists who were in a vehicle on their way to the attack. A few hours later, in a thwarting operation in Tulkarm, IDF and Shin Bet forces guided an aircraft that eliminated four terrorists who opened fire at our forces. The Duvdevan Unit also stormed the force. At the end of the operation, a large amount of weapons, magazines, and vests were seized. Much of this equipment comes to Judea and Samaria from Iran. For years, Iran has been arming and funding terrorist organizations across the Middle East, including smuggling explosives into Israel for terror attacks against civilians.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Commitment to Hostage Return</h3>\n\n\n\n<p>We are determined to continue acting against Iranian terrorism everywhere. This evening, we also remember the 115 hostages held by Hamas in the Gaza Strip. We are committed to bringing them all home as soon as possible—to return those who are alive to their families and those who are no longer to be buried in Israel. This is our goal, and we will continue to act with great determination to achieve it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Media Questions and Responses</h3>\n\n\n\n<p><strong>Uri Yizak, Channel 12 News:</strong> &#8220;You mentioned that the defense is not airtight. Why doesn’t Israel launch a preemptive strike instead of waiting for Hezbollah or Iran to attack first?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;We are closely monitoring our enemies in all arenas, including Hezbollah in Lebanon. We have very broad plans and are highly prepared to carry out any directive we receive from the political echelon. We will act immediately.&#8221;</p>\n\n\n\n<p><strong>Eldad Shachnov, Yedioth Ahronoth:</strong> &#8220;In recent days, we have heard about several countries calling on their citizens to leave Lebanon. Can you assess why a similar directive hasn&#8217;t been issued by those countries regarding leaving Israel? There is a feeling among the public that they are being kept in the dark on this matter.&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;As I said, our duty is to the public, which is why I addressed the Home Front Command’s policy here—there is no change, and we are committed to updating it if necessary. Regarding the decisions of those countries you mentioned about Lebanon and their citizens, I think that over the past months, we have been operating in Lebanon in every area. Our assassination of Mohsen Fakhrizadeh in Beirut, who was effectively the most senior military commander in Hezbollah, responsible for the murder of many Israeli civilians, is proof of our determination. We will be prepared to act anywhere we are required, against Hezbollah and other enemies.&#8221;</p>\n\n\n\n<p><strong>Question from Kan 11:</strong> &#8220;Regarding the wide-scale tunnels published today—do they cross into Egyptian territory, and is the IDF&#8217;s working assumption that the Egyptians knew about their existence?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;Our focus on the Philadelphi route is on locating all tunnels, whether old or new, and neutralizing and destroying them. That’s our mission. We have very good relations with the Egyptians; it’s a shared interest to keep this area clean of terrorism. We will update the public as necessary. We won’t leave any detail unsaid by the end of our activity.&#8221;</p>\n\n\n\n<p><strong>Kan 11 follow-up question:</strong> &#8220;How can the route be left if there is an agreement in place and not know if weapons are being smuggled into the Gaza Strip through the route?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;We have prepared several alternatives regarding the Philadelphi route that we presented to the political echelon. They consist of the steps we are currently taking, technology, supervision, and forces. All these alternatives are before the political echelon, and they will decide how to execute the mission.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The IDF continues operations in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, Lebanon, and other areas, maintaining high readiness, targeting threats, and addressing public concerns.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-14879",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 14879
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14879",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=14879"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14879/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 14930,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14879/revisions/14930"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=14879"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=14879"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=14879"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}