{
    "id": 14902,
    "date": "2024-08-12T20:00:00",
    "date_gmt": "2024-08-12T17:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=14902"
    },
    "modified": "2024-08-16T11:25:57",
    "modified_gmt": "2024-08-16T08:25:57",
    "slug": "idf-spokesman-update-12-08-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-12-08-evening/",
    "title": {
        "rendered": "IDF spokesman update 12.08, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל 12.08, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/w_cILZo8d9c?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good evening. Over the past few days, we have been monitoring our enemies and developments in the Middle East, with a focus on Hezbollah and Iran. At the same time, we are carrying out daily strikes in Lebanon. Today, we have increased patrols and reconnaissance to detect and eliminate threats. We attack any threat we identify and are prepared to respond to threats in real-time. We take our enemies&#8217; declarations and statements seriously, and therefore, we are prepared with high readiness in both offense and defense. We will act according to the directives of the political echelon.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Public Concerns and Readiness</h3>\n\n\n\n<p>Regarding the public&#8217;s questions about the situation, your vigilance and alertness are important to us. However, at this stage, there is no change in the Home Front Command&#8217;s defense policy. If there is a change, we will update immediately. We are aware of and responsive to the reality in which the residents of the north have been living for a long time. They have been experiencing ongoing fire and infiltration attempts by unmanned aerial vehicles. Our mission is to ensure your safety and bring you home safely. We are determined to do everything to protect the security of the residents and prevent harm to civilians.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ongoing Attacks by Hezbollah</h3>\n\n\n\n<p>Hezbollah is conducting indiscriminate fire, as we saw on Saturday night when 12 children were murdered in Majdal Shams. We have extensive attack plans and are highly prepared to execute them. Hezbollah plans to act, but we do not wait passively; we attack constantly and eliminate threats as soon as we discover them. We have been in a state of high readiness for this mission for several months. We are in the midst of a war, and we are aware of the growing difficulties and uncertainty among the public, especially during the summer, with camps, family plans, preparations for the school year, and more.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Operational Updates and Public Guidance</h3>\n\n\n\n<p>Currently, we are closely monitoring the operational situation, and we will update you on the situation when we know more and will provide early updates as much as possible to adjust the guidelines for the public. This will be done without giving our enemies any intelligence or operational advantage. We are making every effort to prepare you in advance and to allow the continuation of routine as much as possible while maintaining alertness and readiness. We will update any changes in the defense policy through the platforms of the Home Front Command and the IDF.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Commitment to Public Communication</h3>\n\n\n\n<p>I will be here starting this evening and during the coming days to update you, answer questions, and reflect the situation as it is, even when there are no changes in the guidelines. Yesterday, during the afternoon, a terrorist cell murdered an Israeli citizen and injured another in a shooting attack from a passing vehicle near the Mahula junction. We share in the grief of the family and wish a speedy recovery to the injured. IDF forces are pursuing the terrorists. The Chief of Staff arrived at the scene in the evening to brief the commanders on the efforts and actions to defend the eastern Samaria and Jordan Valley regions and to thwart terrorism and locate the shooting cell.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Operations in Gaza</h3>\n\n\n\n<p>In Gaza, the 98th Division forces are fighting in the parking area. They are conducting targeted raids based on new intelligence about terrorist activity in the area, both above and underground. Last night, during the fighting led by the division in the area, IDF soldier Sergeant Omer Ginsburg, of blessed memory, fell in battle. Our hearts are with his family, and we accompany them during this difficult time. For 10 months now, we have been fighting in Gaza and have not for a moment forgotten the hostages held cruelly by Hamas in Gaza. We are deeply concerned about their physical and mental health, given the prolonged time that has passed and the harsh conditions of their captivity. The IDF and all security agencies are making every effort to create the conditions for their return as quickly as possible. This is our moral and ethical duty, and above all, it is our war goal.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Observing Tisha B&#8217;Av During War</h3>\n\n\n\n<p>Even during the relentless fighting, we remember and mark Tisha B&#8217;Av, which this year meets us as we are determinedly fighting against the destruction sown by Hamas on October 7th. The memory of the destruction of the Temples on Tisha B&#8217;Av this year meets the IDF in a multi-front, determined battle to ensure security for every citizen of the state.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions and Answers</h3>\n\n\n\n<p><strong>Dana Yarkzi, Kan 11:</strong> &#8220;If rockets are ready for immediate launch towards Israel, will you attack them before they are fired? And secondly, in light of reports of a change in the IDF&#8217;s readiness due to detected movements by Hezbollah and Iran, does this indicate that we are indeed closer to an attack?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;We are doing everything necessary to protect the citizens of the State of Israel—everything necessary. As for the movements and reports, we are monitoring around the clock. We are not monitoring alone; we are also monitoring with our partners, primarily the United States, which backs this region with an aircraft carrier, ships, and other operational forces. We will continue to monitor and make our decisions accordingly.&#8221;</p>\n\n\n\n<p><strong>Yoav, Channel 12 News:</strong> &#8220;Do you think there will be any advance warning to the Israeli public of several hours, as there was in April, or should we prepare for the possibility of a surprise alert with just two minutes&#8217; notice?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;I am here this evening specifically to address these issues and the need to communicate with the public and explain the complex situation. Our role is to give the public time to organize—that is our role. We are monitoring this around the clock with our finger on the pulse in the situation assessment. Alongside this, there are situations where we will need to handle a sudden event and inform the public, as we have done in the north, where the public experiences daily alerts, for example. As much as possible, we will strive to give advance warning to the public—that is why we are monitoring the situation. That is why, despite various things that have been said in the past weeks, we have not yet changed the Home Front Command&#8217;s guidelines, and we will change them at the right time in the appropriate manner to face the challenges we have, both in intelligence and operations, against our enemies.&#8221;</p>\n\n\n\n<p><strong>Sapir Levi, i24 News:</strong> &#8220;Is there an assessment that Iran will attack within the next 24 hours?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;I say again, we are monitoring what is happening specifically with Iran with all our capabilities. We are not monitoring alone; we are monitoring with the United States and other partners. I do not know of this assessment and cannot specifically address it. I stand firm in what I said—we will update the public immediately, and we will strive to give advance warning as much as possible. That is our role, and as much as we can do it beforehand, we will do it. Regarding these reports, I suggest sticking to the facts—there have been many reports in the past week. We commit, in this sense, to make immediate changes in the guidelines if required.&#8221;</p>\n\n\n\n<p><strong>Second Question:</strong> &#8220;No attack has been carried out so far; if there is an attack, will we see an immediate response from the IDF?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;We will do everything necessary to protect the citizens of the State of Israel.&#8221;</p>\n\n\n\n<p><strong>Itzik, News Push:</strong> &#8220;If Iran attacks Israel, will we react like in April, or will we act against Iran&#8217;s nuclear facilities?&#8221;</p>\n\n\n\n<p><strong>IDF Spokesperson:</strong> &#8220;We do not share our operational plans. I repeat, we will do everything necessary to protect the citizens of the State of Israel. Thank you very much.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The IDF is actively monitoring threats from <a  href=\"/hezbollah\">Hezbollah</a> and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>, maintaining readiness, conducting strikes, and addressing public concerns.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-14902",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 14902
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14902",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=14902"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14902/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 14909,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/14902/revisions/14909"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=14902"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=14902"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=14902"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}