{
    "id": 15564,
    "date": "2024-08-25T06:00:00",
    "date_gmt": "2024-08-25T03:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=15564"
    },
    "modified": "2024-08-25T13:59:28",
    "modified_gmt": "2024-08-25T10:59:28",
    "slug": "idf-spokesman-update-08-25-morning",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-08-25-morning/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 08/25, morning"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 25.08, בוקר\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/nzZvzuNeRp4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good morning. In the last hour, we have detected extensive Hezbollah activity aimed towards the rear of the State of Israel. Following this detection, the Air Force and the Northern Command have begun proactive and widespread attacks on Hezbollah targets, continuing the operations that have been ongoing for ten days to protect the citizens of Israel. We are actively patrolling and addressing threats to the Israeli rear, particularly in southern Lebanon, and vigorously countering the terrorist organization Hezbollah.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Defense Against Hezbollah Attacks</h3>\n\n\n\n<p>Hezbollah has been launching rockets and unmanned aircraft into Israeli territory. Our air defense systems, navy ships, and air force planes are on a mission to protect Israel’s skies, detect threats, intercept them, and attack wherever necessary in Lebanon to eliminate these threats. When we stated that we would do everything necessary to protect Israel, this is precisely what the Chief of Staff meant, who is currently commanding the operation from the operations center, overseeing both offensive and defensive measures.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Home Front Command Instructions</h3>\n\n\n\n<p>Residents are urged to remain in areas where they can quickly reach a standard protected space upon receiving a warning. Restrictions on gatherings are also in place. The full instructions are available on the Home Front Command website. These are life-saving instructions. Continue to behave responsibly, as you have been doing, and enter the protected area for no less than 10 minutes when an alert is issued. Due to the diverse types of threats, we maintain a continuous status system, and additional instructions may be distributed in other areas. Your vigilance and cooperation are crucial to ensuring the best protection. We will update you on any changes in the instructions through official channels.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ongoing IDF Operations in Lebanon</h3>\n\n\n\n<p>Currently, IDF forces are actively intercepting and attacking wherever necessary to counter threats and target Hezbollah. We have detected several rockets and undetected aircraft approaching Israeli territory. Lebanese citizens in southern Lebanon are warned that they are in danger as we continue to attack and remove threats from Hezbollah. The IDF is committed to doing everything necessary to protect the citizens of Israel, and the operational event is still in progress.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Preparedness and Public Safety</h3>\n\n\n\n<p>For the sake of responsibility and caution, we have extended Home Front Command instructions from Gush Dan and northwards. As I mentioned, you can go to work and engage in activities as long as they are near a standard protected area that can be reached promptly upon receiving a warning. We will provide updates if there are any changes, such as the opening of Ben Gurion Airport at 7 AM for continued air traffic, which will be adjusted if necessary.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Coordination with International Partners</h3>\n\n\n\n<p>Extensive American forces and other partners are present in the Middle East. The Chairman of the Joint Chiefs of Staff, General Brown, was in Jordan yesterday. Their defense and operational capabilities in the region are significant for responding to developments in the Middle East.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Deepening IDF Operations in Lebanon</h3>\n\n\n\n<p>Our primary focus has been on southern Lebanon, but we are prepared to attack any location in Lebanon where there is a threat to Israel. The IDF is committed to addressing all threats wherever they may arise. This morning’s extensive detection of Hezbollah’s plans to target Israel has led to heightened activity. The event is ongoing, and we are responding in real-time to evolving threats.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion and Continued Updates</h3>\n\n\n\n<p>The IDF remains vigilant and is actively engaging in operations to neutralize threats. I will continue to provide updates as necessary in the coming hours. Please stay informed through official channels.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF detects <a  href=\"/hezbollah\">Hezbollah</a> threats, launches widespread attacks in Lebanon, urges public vigilance, and coordinates with international partners for security.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-15564",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 15564
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15564",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=15564"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15564/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15565,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15564/revisions/15565"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=15564"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=15564"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=15564"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}