{
    "id": 9403,
    "date": "2024-08-04T15:00:00",
    "date_gmt": "2024-08-04T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=9403"
    },
    "modified": "2024-08-04T16:58:22",
    "modified_gmt": "2024-08-04T13:58:22",
    "slug": "iran-at-un-well-target-civilians-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/iran-at-un-well-target-civilians-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "Iran at UN: We’ll Target Civilians | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Iran at UN: We’ll Target Civilians | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/kTqMq6219KM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Iran is openly warning that it will target Israeli civilians on purpose, not just hinting but saying it out loud. Iran&#8217;s UN diplomats told the US media, CBS News, that their proxy army in Lebanon, Hezbollah, will try to murder civilians in Israel. Iran is openly vowing to commit war crimes, stating that Hezbollah &#8220;will not restrict itself solely to military targets.&#8221; There is no ambiguity. Iran is the world&#8217;s top sponsor of terrorism, with its proxy armies spilling innocent blood around the world for decades. We just marked 30 years since Hezbollah&#8217;s bombing of the Jewish Community Center in Argentina. Just last week, Hezbollah murdered 12 children playing soccer in the Golan Heights, and Iran isn&#8217;t even hiding its intention to target civilians. It&#8217;s boasting about it. The UN has said nothing, the Red Cross has said nothing, and the International Court of Justice has said nothing. All the institutions that accuse Israel of war crimes when it fights to defend its people are silent when Iran openly says it will commit war crimes against Israel&#8217;s civilians. Who will stand up to Iran?</p>\n\n\n\n<p>Iran regularly vows death to Israel. After murdering 12 children last week in Israel, Hezbollah said Israel will come to an end. Hezbollah clarified last month that its real enemy in this war is the United States; Israel is just a tool. Iran regularly calls for death to America, the &#8220;Great Satan&#8221;; Israel is just a &#8220;Little Satan.&#8221; That&#8217;s why it&#8217;s so important that the US is sending a strike carrier group to the Middle East to warn Iran not to commit the war crimes it is threatening. The UN is mute, but the West must speak out and stand with Israel against our common enemy, the Iranian regime&#8217;s criminal caliphate, and their plan to destabilize and sow violence across the Middle East.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Direct Attacks and Proxy Armies</h2>\n\n\n\n<p>Iran is also openly vowing revenge against Israel directly. We remember Iran&#8217;s unprecedented aerial attack on us in April: 350 missiles and suicide drones. We remember the nearly 7,000 rockets, missiles, and drones launched by Hezbollah, its proxy army in Lebanon, at the people of Israel. We remember the attacks by its proxy army in Yemen, the Houthis, and attempts to murder us by their proxy armies in Syria and Iraq. And we remember the October 7th Massacre: 1,200 innocents, including children, brutally ripped from their families, and hundreds taken dead and alive into Hamas&#8217;s terror dungeons. Whatever murder Iran and its proxy armies have in mind, it&#8217;s nothing new. Iran has been trying to murder the people of Israel for months through its proxy armies in the regional war that they declared against us on seven fronts.</p>\n\n\n\n<h2 class=\"wp-block-heading\">News from Gaza: Isma Al-Gul</h2>\n\n\n\n<p>Now for news from Gaza: Isma Al-Gul was an actual terrorist. You might have heard people claiming that Israel is targeting journalists. Last week, there was global outrage over the killing of an Al Jazeera reporter, Isma Al-Gul. Now, working for Al Jazeera is bad, but it isn&#8217;t a war crime. Fighting for Hamas is. Al-Gul was a Hamas terrorist; he worked for its special forces, the Nukhba terrorists. He took part in the October 7th Massacre. The IDF has revealed evidence taken from Hamas computers showing that Al-Gul was a terrorist operative in its military wing. It says he trained other terrorists on how to record their atrocities because Hamas doesn&#8217;t only fight out of civilian buildings, it fights out of civilian clothes. Its terrorists don&#8217;t only attack schools and hospitals; they attack while dressed as doctors and reporters. Under international law, terrorists don&#8217;t get immunity or humanitarian protections just because they put on a press vest. But Hamas knows how useful idiots in the West will defend it if it only claims, with the thinnest evidence, that its murderers are actually innocents. That&#8217;s why someone took the trouble of scrubbing all of Al-Gul&#8217;s social media and creating new accounts for him just after October 7th, using his work with the Qatari mouthpiece Al Jazeera as a cover story to make Israel look bad by pitching him as a journalist.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hamas&#8217;s Use of Journalists</h2>\n\n\n\n<p>Al-Gul was not alone. The Hamas terror regime has relied on a whole battalion of terrorists moonlighting as Al Jazeera journalists. Isa Abu Omar was a deputy commander in Hamas&#8217;s East Khan Yunis Battalion. He also participated in the October 7th Massacre. Hamza Al-Dadu was a member of the Islamic Jihad&#8217;s electronic engineering unit, previously a deputy commander of a rocket force. While Al-Dadu, also an Islamic Jihad member, Muhammad Wisha, a commander in Hamas&#8217;s anti-tank missile unit. And how can anyone forget the Palestine Chronicle contributor who held three hostages in his home? Anyone who buys into Hamas&#8217;s press releases is encouraging terrorists to continue playing dress-up as teachers, doctors, and reporters, thus endangering all innocent people in Gaza and in Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Gaza Tunnels and Hamas Smuggling</h2>\n\n\n\n<p>Now, Israel is continuing to find tunnels connecting Gaza to Egypt across a strategic border strip, the Philadelphia Corridor. These tunnels between Gaza and Egypt are a lifeblood for Hamas&#8217;s smuggling of weapons from Iran. Just today, the IDF reported it found a tunnel on the border, 3 meters high, enough for a Jeep to ride through it and for someone to crouch on the roof. Hamas used these tunnels to smuggle weapons from Egypt that it used to perpetrate the October 7th Massacre. This war cannot end with Hamas being able to rearm, or else there will be a next time, and it will be worse. It will be worse because Hamas will think that the world will step in to save its smuggling routes. Hamas will attempt October 7th again. If we want peace between Israel and Gaza, and we do, three things must happen: Hamas must be destroyed, Gaza must be demilitarized, and its people must be deradicalized. That&#8217;s the 3D vision for peace: destroy Hamas, demilitarize Gaza, deradicalize Palestinian society. Israel needs a deal to get the hostages back, but that cannot be a deal that leaves Hamas free to smuggle weapons to take more hostages again and again, as it is threatening to do.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Daily Briefing: Questions from the Audience</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Question: How Does Hamas Still Have the Capacity to Fire Towards Tel Aviv?</h3>\n\n\n\n<p>Sammy from YouTube asks: How does Hamas still have the capacity to fire towards Tel Aviv? </p>\n\n\n\n<p>I&#8217;m not sure Hamas does have the capability to fire towards Tel Aviv. It&#8217;s really astonishing when you think about it. The leader of Hamas, the arch-terrorist Ismail Haniyeh, was killed in Tehran, allegedly by Israel. He wasn&#8217;t a negotiator or a moderate or a pragmatist or however the media are trying to spin him. He was an arch-terrorist. In response, you would expect to see Hamas unleashing a barrage of rockets all across Israel, but it didn&#8217;t do that. And it didn&#8217;t do that not because it doesn&#8217;t want to but because it can&#8217;t. Because in 10 months of war since Hamas declared this war on October 7th, Israel has been systematically destroying its terrorist army. It has dismantled its 24 terrorist battalions and reduced them to fighting an insurgency, not as an organized terrorist army anymore. It&#8217;s destroyed Hamas&#8217;s weapons manufacturing sites, its weapons factories, and its weapons silos, and it&#8217;s clamped down on the Philadelphia Corridor and its ability to import weapons from Egypt. And so Hamas is now in a position where even in response to something as dramatic as the reported elimination of its leader in Tehran, it cannot continue shooting rockets at Israel, certainly not at the range with which it used to be able to. And that&#8217;s a sign that Israel is winning this war. Israel has eliminated Hamas&#8217;s ability to rain hellfire on its cities. Now, Hezbollah still has the ability to rain hellfire on Israel&#8217;s cities in the north, and that remains a massive threat. And of course, none of us can forget that Hamas is still holding over 100 Israeli hostages, who we know it is starving and torturing and raping and executing. And I urge everyone, please keep fighting for the hostages. Please wear a hostage pin. Please wear a hostage dog tag. Keep speaking up for the voiceless because even if Hamas is not able to fire rockets at Israeli cities, it is still able to perpetrate unspeakable atrocities against the innocent hostages, including two children, two children for God&#8217;s sake, who are still trapped in its terror dungeons.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question: Is Iran Playing Psychological Games?</h3>\n\n\n\n<p>RL Fritz 67 on Instagram asks: Is Iran really ready to take the big step, or are they simply playing psychological games? </p>\n\n\n\n<p>Iran is not playing psychological games. Israel is expecting Iran to attack at any moment. And the reason we know that it&#8217;s capable of doing it is because it&#8217;s done it before. On the night of April 13th, Iran launched 350 ballistic missiles, cruise missiles, and suicide drones at Israel. Most of them were intercepted thanks to the support of allied air forces, not only Saudi Arabia and Jordan shooting down drones over their own airspace but also thanks to the British and the Americans. Iran has already directly attacked Israel from its soil, and this time we expect it will have to surpass that. And it is openly saying its proxy army, Hezbollah, in Lebanon will target civilians. I repeat, this is not a drill. Iran is saying it will commit war crimes through its proxy army, Hezbollah, in Lebanon. And it&#8217;s not enough for the world to call for a de-escalation because that keeps telling Iran that it can attack Israel again and again and Israel isn&#8217;t allowed to restore deterrence. Well, if the world doesn&#8217;t want Israel to take tough military action to restore deterrence, then the Western alliance must do that too. And it must make it clear to Iran&#8217;s fundamentalist leaders and their criminal caliphate that it will not be allowed to escalate this conflict any further. It started this war on October 7th with the October 7th Massacre. It escalated with Hezbollah&#8217;s attacks and 7,000 rockets. It escalated with the Houthi attacks. It escalated with attacks from Syria, from Iraq, from the West Bank, directly from its soil. This is a regional war that Iran is waging against us on seven fronts, and Iran must be contained.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question: Why is Israel Waiting for Iran to Attack?</h3>\n\n\n\n<p>Oshit Laer on Instagram Live asks: Why is Israel waiting for Iran to attack instead of engaging in preemptive strikes? </p>\n\n\n\n<p>That&#8217;s a very good question. Obviously, if Israel were to engage in a preemptive strike on Iran, that would immediately escalate and force Iran to retaliate, and we could find ourselves in the sort of all-out war with Iran that we do not want. We have Western countries moving forces into the region. The US is sending a new strike carrier group to the region to try to deter Iran. And I think that Israel is hoping that a strong show of force by the West, to echo President Biden&#8217;s message from the beginning of the war, &#8220;To anyone thinking of attacking Israel, don&#8217;t,&#8221; will prevent Iran from escalating this war, no matter how much it wants to, no matter how much it&#8217;s hungry for revenge, because it knows it will come up against a firm Western alliance. And here&#8217;s the point you need to tell your leaders: if they want to contain this conflict, if they want to stop it from escalating any further, the response is not to tell Israel that if it comes under attack, it should turn the other cheek. It&#8217;s to put on a strong united Western deterrence against Iran so that its fundamentalist leaders know that if they attack Israel, they will pay a price and they will not get away with it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question: Is it a Terrible Idea to Travel to Tel Aviv?</h3>\n\n\n\n<p>Mattye Harry K19 on Instagram asks: Is it a terrible idea to travel to Tel Aviv this week? </p>\n\n\n\n<p>Come to Tel Aviv. You know, I was on the beach yesterday, and it was extraordinary to see. The beach was full, the bars are full, the cafes are full. The Israeli people are incredibly resilient, and they will not allow terrorists or enemy regimes to disrupt our routine. We&#8217;ll continue living life to the fullest. And if there is a siren, we know that we will have a limited amount of time to run, and we will run for shelter. And if you make it to a shelter, if you make it into a safe room, then you should, in most cases, be fine. So I would never for a moment discourage anyone from coming to Israel. And I would say, on the contrary, if you think that things are going to get bad, come. We will need all the help we can get. If things really go bad, we will need help, even if it&#8217;s just babysitting children or helping to pack sandwiches for soldiers. If an all-out attack by Iran begins, we will need all the help that we can get in this country. And if it doesn&#8217;t, the water temperature is just perfect this time of year.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question: Combatting Anti-Semitism in the Diaspora</h3>\n\n\n\n<p>YouTube Live asks: There are many locations in the diaspora that have experienced very serious anti-Semitism, such as Australia. Can you discuss this, please, and how do we combat it? </p>\n\n\n\n<p>The rise of anti-Semitism around the world in response to the October 7th Massacre has been horrific. We&#8217;re seeing people on the streets of Western capitals openly calling for intifada, which is the polite way of saying &#8220;death to the Jews.&#8221; We&#8217;re hearing people chant &#8220;from the river to the sea,&#8221; which means &#8220;destroy Israel.&#8221; We&#8217;re seeing attacks on Jewish targets in Toronto; Jewish schools have been firebombed, synagogues have been spray-painted. There is a real threat to Jewish life around the world, a big upsurge in anti-Semitic attacks, and people have to be vigilant. The reason is that October 7th unleashed a wave of jubilation among anti-Semites around the world who took support from Hamas&#8217;s attack. It&#8217;s important to be aware of the new symbols of the new anti-Semitism. We all know how to identify a swastika and see that it is a Nazi hate symbol, but that&#8217;s exactly what the upside-down red triangle is now. The upside-down red triangle is a symbol from Hamas&#8217;s propaganda videos where it marks out its targets. We&#8217;ve seen that spray-painted on the Washington Monument, the Columbus monument in Washington, with the phrase &#8220;Hamas is coming.&#8221; I saw it spray-painted on another building saying &#8220;Hamas is here.&#8221; These are explicit death threats to Jews around the world. They&#8217;re explicit death threats to the West, and we need people to understand the magnitude of the insanity that has been unleashed on their streets from people who saw the October 7th Massacre and weren&#8217;t horrified by it but thought it was genuinely a good thing. That is the result of decades of the persistent dehumanization of Jews and Israelis and the demonization of the Jewish state. I think everyone understands now there&#8217;s no point having this theoretical argument about whether hatred of Israel and anti-Semitism are different things or the same thing. They&#8217;re two sides of the same coin. Hatred of Israel simply is hatred of most of the world&#8217;s Jews. It means hatred for any Jews around the world who will not explicitly turn their backs on Israel and abandon it to the hands of the Hamas terror regime. And as Jake Wallis Simons, the editor-in-chief of the Jewish Chronicle, said in the most recent episode of the State of a Nation show, which we released just last week, &#8220;The Jews used to be hated for their religion, then they were hated for their race, now they are hated for their state.&#8221; Anti-Semitism is a shape-shifting virus. It adapts itself in each generation, and the obsessive hatred and demonization of Israel is simply the modern incarnation of an ancient hatred that has shifted shape throughout history.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question: Israel&#8217;s Defense Against Multi-Front Attacks</h3>\n\n\n\n<p>Elena on X asks: If Israel truly is attacked all out on the seven fronts you speak of, will it be able to defend itself? </p>\n\n\n\n<p>Elena, Israel is already being attacked on seven fronts, not simultaneously all the time, but on any given day, there are rockets from Gaza, rockets from Hezbollah, drones from Yemen, and attacks from Iraq. On any given day, Israel is being attacked on these multiple fronts. Now, it&#8217;s possible that Iran&#8217;s revenge attack, and it&#8217;s explicitly vowing revenge, will come in the form of a simultaneous assault on multiple fronts. That is what the April 13th attack was: Hezbollah and the Houthis also fired at Israel at the same time that Iran was firing at Israel. Now, Israel has very strong missile defenses, but it still needs the support of the Western alliance. It still needs its allies to fight together with it, understanding that Iran is not just a threat to Israel. It is a threat to the Sunni Arab world, and it is a threat to the whole West, to Europe, and America as well. We don&#8217;t want to get to a situation where some rockets are able to slip through because the Iron Dome is only 95% effective. That&#8217;s why it&#8217;s so important for Israel to be able to fight together with its allies to make sure that none of Iran&#8217;s ballistic missiles are able to get through, as they are explicitly threatening to attack civilians. Not even threatening, warning. They&#8217;re saying they will attack civilians through their proxy army, Hezbollah, in Lebanon.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question: Simha the Israeli Citizen Spokesdog</h3>\n\n\n\n<p>PLJ on Instagram asks: Who owns Simha, the Israeli citizen spokesdog, and where&#8217;s the best place to get all his latest updates? Simha, the Israeli citizen spokesdog, is the charming dog belonging to Asha, the producer of the State of a Nation podcast, which if you&#8217;re not following on YouTube and on all podcast platforms, I strongly recommend you join. We take very seriously reaching out and doing public diplomacy to diverse audiences. That is why Simha, the citizen spokesdog, is part of our project to do &#8220;hasbara for hounds,&#8221; because we recognize that animals are a very important demographic. You can follow him on Instagram at @IsraeliSpokesdog to make sure that you get all of your barking points.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>That&#8217;s all we have time for. Thank you very much. We will be back tomorrow with more daily briefings, again at 3:00 PM Israel time, 8:00 AM on the East Coast. Thank you very much for joining us.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> openly threatens Israeli civilians, with <a  href=\"/hezbollah\">Hezbollah</a> planning attacks. Despite international silence, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> recalls past aggressions and vows to defend itself. <a  href=\"/hamas\">Hamas</a> terrorists pose as journalists to shield their crimes. Israel aims to destroy <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>, demilitarize <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, and deradicalize Palestinian society. Global support for Israel remains crucial amidst rising anti-Semitism.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 9404,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-9403",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 9403
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9403",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=9403"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9403/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 9405,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9403/revisions/9405"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/9404"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=9403"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=9403"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=9403"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}