{
    "id": 6983,
    "date": "2024-08-01T15:00:00",
    "date_gmt": "2024-08-01T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6983"
    },
    "modified": "2024-08-02T00:02:46",
    "modified_gmt": "2024-08-01T21:02:46",
    "slug": "irans-revenge-is-not-self-defense-daily-briefing-with-ashley-waxman-bakshi",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/irans-revenge-is-not-self-defense-daily-briefing-with-ashley-waxman-bakshi/",
    "title": {
        "rendered": "Iran’s Revenge is Not Self-Defense | Daily Briefing with Ashley Waxman Bakshi"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Iran’s Revenge is Not Self-Defense | Daily Briefing with Ashley Waxman Bakshi\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/EHPPbL2r6WM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone. I am Citizen Spokesperson Ashley Waxman Baki. Today is August 1st, 2024. This is the live Daily Briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on Instagram, X, YouTube, and LinkedIn, and available afterwards wherever you get your podcasts. Please start submitting questions in the chat, and as always, like and subscribe to help us reach a wider audience.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Day 300 of the October 7th War</h3>\n\n\n\n<p>Today is day 300 of the October 7th War and the Hamas hostage crisis. It has been 300 days that the hostages are being starved, tortured, raped, and executed in the Hamas Terror Dungeons. We need your voice to demand Hamas let them go now.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran&#8217;s Retaliation and Escalation</h3>\n\n\n\n<p>Israel is preparing for Iran&#8217;s retaliation. Iran is openly vowing revenge and is threatening to escalate its seven-front war against Israel. Iran is mad that Israel allegedly eliminated Hamas terrorist in Tehran because it wants to protect the leaders of its proxy armies so they can keep attacking Israel. Israel&#8217;s alleged elimination of October 7th monster Hania was not an escalation. Hamas&#8217;s October 7th Massacre was an escalation. Hezbollah&#8217;s entry into this war on October 8th, launching 6,500 rockets, missiles, and drones, was an escalation. Houthi Islamic pirate attacks were an escalation. Attacks from Iranian proxy armies in Iraq and Syria were an escalation. Flooding the West Bank with weapons for jihad on Jews was an escalation. Iran&#8217;s direct massive aerial attack in April, with 350 missiles and drones, was an escalation.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Self-Defense</h3>\n\n\n\n<p>Israel is fighting in self-defense. It is defending its people against the Iranian regime and its proxy armies in a brutal seven-front regional war. It wants to deescalate by pushing away the threats. Iran&#8217;s proxies declared war on Israel. Israel is defending itself. Iran&#8217;s threat of revenge is not self-defense; it&#8217;s a continuation of its aggression. The world must stop, not appease, Iran&#8217;s aggression because a Middle East dominated by the Ayatollah of Iran will not be safe for anyone, not for Israelis, not for Arabs, and not for the West.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Holding Iran Accountable</h3>\n\n\n\n<p>Israel understands the problem; it&#8217;s not Hamas or Hezbollah, it&#8217;s Iran. Iran chooses every day to continue fanning the flames of war. Iran must be held directly accountable for its direct and indirect acts of war against the people of Israel. Its criminal caliphate must be stopped. In the past, Iran understood that at worst, attacks by it and its proxy armies would be blunted, and occasionally Iran might succeed with the brutal murder of innocent people in Israel. Israel is telling Iran it&#8217;s wrong. The world must say the same. Iran must be made to understand the real price for funding rocket, missile, and drone attacks, and for the kind of barbaric rape and murder carried out on October 7th. The price must be so expensive that Iran prefers to end its seven-front war on the Jewish people. Tell your leaders to tell Iran&#8217;s pyromaniac Ayatollah to stop fueling the ring of fire around Israel before Israel has to fight that fire.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Confirmed Strike on Hamas Terrorist Mastermind</h3>\n\n\n\n<p>Today, Israel confirmed that the strike on Hamas terrorist mastermind Muhammad Deif was successful. Deif joins Ismail Hania, Marwan Issa, Saleh Al-Arouri, and a long list of Hamas commanders in hell, no longer attacking Israelis or oppressing Gazans. Hamas&#8217;s leadership is crumbling. Most of Hamas&#8217;s 24 battalions have been reported to be dismantled. Israel now controls many key points in the Gaza Strip, including the Philadelphia Corridor, the Gazan border with Egypt, and has mostly turned off the weapon smuggling pipeline used to massacre civilians on October 7th.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Success and Ongoing Challenges</h3>\n\n\n\n<p>It&#8217;s clear Israel is winning. It allegedly eliminated Hania in Tehran, and Hamas has not retaliated. Why not? Because it doesn&#8217;t want to, but because it can&#8217;t. Israel took out Hamas&#8217;s leader, and there were no rockets on Tel Aviv. Hamas isn&#8217;t any less murderous, and there is still intense fighting, but Israel&#8217;s forces have taken away much of Hamas&#8217;s ability to harm our people. We&#8217;re thankful that much of the goal set out at the war&#8217;s outset—destroying Hamas&#8217;s ability to threaten the people of Israel—has so far been achieved. We&#8217;re thankful that those arguing that Hamas is an ideology that can&#8217;t be beaten were absolutely wrong.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Return of Hostages</h3>\n\n\n\n<p>A goal that has only been partially achieved is the return of our hostages. 115 hostages are still held by what&#8217;s left of Hamas, including my cousin, 19-year-old Ayelet Greenberg, and two toddlers. Today is 300 days since Hamas cruelly tore these children, young people, and elderly, some Holocaust survivors, from their families. 15 women are still held in the hands of the Hamas rapist regime. It&#8217;s been almost 10 months; you can do the math for yourself. Every day that passes is an immediate threat to these women&#8217;s lives. Hamas and their Qatari hosts have strung us along for months. Israel will keep beating Hamas, and we ask that you amplify the call: unconditionally surrender and release our hostages.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Support and Participation</h3>\n\n\n\n<p>A few words to our viewers: for all those asking what you can do to help, there are links to a JGive campaign across our social media. Those donations provide the support we need to keep getting out the word. I&#8217;d also ask that you sign up for our email list. I promise we won&#8217;t bother you with junk; this will allow us to get you our message directly and occasionally share special content.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Audience Questions</h3>\n\n\n\n<p><strong>Question from Joan on Instagram Live:</strong> Why are you Israelis so angry about 12 dead children in Israel when Israel has killed thousands of children in Gaza?</p>\n\n\n\n<p><strong>Answer:</strong> We are angry for the death of every child, every child. But you cannot equate between a terrorist organization, Hezbollah, who decided to launch its war on us on October 8th and targeted Majdal Shams, which is a civilian community in the Golan Heights. There are no military targets within Majdal Shams. It specifically targeted a civilian town on purpose, whereas the IDF (Israel Defense Forces) is defending itself against a terrorist organization, Hamas, and Hamas is literally embedding itself under civilian populations in tunnels and under civilian infrastructure. Hamas is using its civilian population as human shields. Israel never targets children and never targets civilian populations; it always targets Hamas, Hamas&#8217;s weapons, and Hamas&#8217;s factories for weapons, which are embedded in civilian population. If you&#8217;re going to blame someone for the death of the Gazan civilian population, it is Hamas that is responsible.</p>\n\n\n\n<p><strong>Question from multiple viewers:</strong> Do you really think killing Hania will change anything?</p>\n\n\n\n<p><strong>Answer:</strong> That&#8217;s an excellent question, and I think firstly time will tell. But if I&#8217;d have to make an estimation, I think that this is a massive blow to Hamas, to their reputation, and to the way the surrounding Arab proxies and the terrorist proxies and Iran see their alleged capabilities. Not only was he taken out, but it was also done on Tehran soil. This sends a very loud message to Iran that nobody is safe on Iranian soil. Every terrorist must know that he is not safe. When you target innocent Israelis, you will be faced with what you should be faced with. This also, on an internal political level for Hamas, leaves Hamas in shambles. A power struggle will now arise, which will also confuse Hamas even more and hopefully allow Israel to more quickly and more efficiently end this war against Hamas and begin to look for a brighter future.</p>\n\n\n\n<p><strong>Question from As Told by a Jew Mom on Instagram Live:</strong> Is there a coalition prepared to help Israel fend off Iran&#8217;s attack like they did last time?</p>\n\n\n\n<p><strong>Answer:</strong> I certainly hope so, and I believe so. I believe that our Western allies, as we have seen previously, and not only our Western allies but also our allies in the region, understand the geopolitics in this war. The things that they might be saying at the United Nations or in the media are very different from when Israel is actually under a direct threat from Iran. I believe there is a coalition that is prepared to come and help defend Israel. But even if they&#8217;re not, don&#8217;t be worried because Israel has the capability and the power to defend itself, and we will always do so.</p>\n\n\n\n<p><strong>Question from Rivka Ruth Golan on Instagram:</strong> Do we know if the Iran attack will happen today?</p>\n\n\n\n<p><strong>Answer:</strong> Of course, we don&#8217;t know something like that, and I wouldn&#8217;t give the Iranians so much credit as to give us a warning ahead of time. But they did last time, so we are still yet to see. Last time they attacked us, there was an indirect warning given because Iran understands that it cannot actually eliminate Israel, and if it tries, Israel has the ability to defend itself in any way possible. So, I don&#8217;t believe they will be sending a direct warning this time about the time, but we&#8217;re still yet to see what will happen.</p>\n\n\n\n<p><strong>Question from Noah G on Instagram:</strong> Is Israel prepared to take on a multi-front war?</p>\n\n\n\n<p><strong>Answer:</strong> Israel is prepared to take on whoever threatens its existence, as we have seen in the past. In 1948, when Israel declared its independence, it was also attacked on seven fronts. It was a much different military back then; it was literally Holocaust survivors given a weapon and told to go fight without even knowing the language of their commanders. Miraculously, we survived because no matter what, Israel will always survive. There is too much at stake, too much to risk. Israel&#8217;s fight is not only to defend the people here in Israel but also to defend the Jewish people everywhere. Israel is prepared to fight, and it will fight, but it&#8217;s important to stress that Israel does not want to fight.</p>\n\n\n\n<p><strong>Question from Ariela Newberger on Instagram:</strong> How do we address Western media&#8217;s systemic manipulation of well-meaning citizens to think that Israel is the villain in this horrible ongoing story?</p>\n\n\n\n<p><strong>Answer:</strong> What we&#8217;re doing here is actually trying to counter that media bias. If you live abroad, the best thing you can do is use your voice and your platforms. Even if you believe that not many people are following you, you never know how far that post could reach. Share the information not only on social media but also in person with all the people you interact with, your friends at work. When you hear a conversation that is clearly anti-Israel or influenced by biased media, chime in. You being here means you are receiving the most up-to-date information, so make sure you&#8217;re using your voice. Don&#8217;t forget you live in democracies, so use your voice to protest, write letters, call for boycotts, and demand unbiased coverage of the Middle East.</p>\n\n\n\n<p><strong>Question from Matan Elamin on Instagram:</strong> Is there any progress on the hostage deal?</p>\n\n\n\n<p><strong>Answer:</strong> As far as I know, Israel made a few additions and accepted some of Hamas&#8217;s demands and tweaked others, giving a counteroffer. It is now in the hands of Hamas again to accept the deal to release our hostages. We just ask that you keep praying that it will happen very soon.</p>\n\n\n\n<p><strong>Question from Leah on Instagram:</strong> What will the IDF do to protect citizens and how will it prevent a repeat of Majdal Shams and the drone attack on Tel Aviv?</p>\n\n\n\n<p><strong>Answer:</strong> Israel is always prepared, and we do have very sophisticated technology. Unfortunately, as we have seen in Majdal Shams, sometimes when 6,500 rockets are sent from Hezbollah, occasionally one of those rockets gets through, and it&#8217;s a tragedy. Israel is prepared, and we have many reservists ready to defend every citizen here in Israel.</p>\n\n\n\n<p><strong>Question from Ed on YouTube:</strong> What is the toll that the war has been taking on Israeli families, individuals, and society at large?</p>\n\n\n\n<p><strong>Answer:</strong> That&#8217;s a great question and personal to me. Just this week, I realized my daughter is suffering from PTSD and anxiety due to the war and the sirens. You can imagine how many children are suffering. Over 100,000 Israelis are still displaced from their homes. Businesses have shut down. We have family members of hostages. This war is taking a huge emotional, mental, and economic toll. We want this war to end as soon as possible, but it will not end until every threat is eliminated, until our enemies are prepared to live side by side peacefully, and all our hostages return home.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>Thank you very much. That&#8217;s all we have time for today. I ask you again, please check out the JGive campaign on all our social media platforms. Follow us on Instagram, YouTube, Twitter, and X. We will see you Sunday, same time, 3 PM Israel time, 8 AM Eastern Standard Time. Let&#8217;s hope we have a great weekend. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Ashley Waxman Baki, Citizen Spokesperson, gave a live briefing on August 1st, 2024, covering day 300 of the October 7th War and the <a  href=\"/hamas\">Hamas</a> hostage crisis. She addressed <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s retaliation threats, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s self-defense actions, and the importance of global support. Questions on the war&#8217;s impact and media bias were also discussed.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6986,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        490
    ],
    "class_list": [
        "post-6983",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ashley-waxman-bakshi"
    ],
    "lang": "en",
    "translations": {
        "en": 6983,
        "ru": 6987,
        "he": 6998
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6983",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6983"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6983/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6985,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6983/revisions/6985"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6986"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6983"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6983"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6983"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}