{
    "id": 15493,
    "date": "2024-08-20T15:00:00",
    "date_gmt": "2024-08-20T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=15493"
    },
    "modified": "2024-08-20T22:23:38",
    "modified_gmt": "2024-08-20T19:23:38",
    "slug": "israel-agrees-to-deal-while-hamas-murders-hostages-daily-briefing-with-rachel-lester",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/israel-agrees-to-deal-while-hamas-murders-hostages-daily-briefing-with-rachel-lester/",
    "title": {
        "rendered": "Israel Agrees to Deal While Hamas Murders Hostages | Daily Briefing With Rachel Lester"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Israel Agrees to Deal While Hamas Murders Hostages | Daily Briefing With Rachel Lester\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/XvTqSMb414A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today marks day 319 of the October 7th War and the ongoing Hamas hostage crisis. Hamas&#8217;s savage murder of six hostages underlines the urgent need for Israel to secure the release of all remaining hostages. Hamas&#8217;s brutal treatment of innocent hostages, including starvation, torture, rape, and execution in its terror dungeons, must be stopped. Hamas is not only sabotaging negotiations but also continues its reign of terror. Yesterday, U.S. Secretary of State Anthony Blinken confirmed that Israel had agreed to a mediator&#8217;s proposal for a ceasefire and hostage release deal, while Hamas refused.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Reality of the Hostage Crisis</h3>\n\n\n\n<p>Overnight, Israel recovered the bodies of six hostages in Khan Younis who had been abducted alive. Hamas filmed some of them for propaganda, exploiting them for psychological warfare against their families. These hostages, like many innocents massacred on October 7th, were murdered by Hamas. Israel is striving to secure a deal for the release of all hostages, ensuring that no one is left behind. Israel is breaking Hamas on the battlefield, with even CNN acknowledging that Israel has reduced what was once a professional fighting force into a guerrilla group. However, Hamas seeks to hold on to hostages as insurance while planning further attacks, including potential repeats of October 7th.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217;s Perpetual War Against Israel</h3>\n\n\n\n<p>Hamas is waging a forever war against the Jewish people, refusing a permanent ceasefire because it would mean peace. Instead, Hamas desires a deal that allows it to continue its violent campaign. Israel, however, is fighting for a future where such atrocities never happen again. Israel is not just seeking any deal but one that ensures the safety of all hostages and protects its citizens from another October 7th.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Genocide Agenda of Hamas</h3>\n\n\n\n<p>Hamas lies about not taking civilians hostage, yet evidence shows they executed elderly hostages and kidnapped children, including infants. Three of the murdered hostages were kidnapped from Kibbutz Nir Oz, where Hamas either murdered or abducted one-quarter of the village. The term for attempting to wipe out a village is genocide, and that&#8217;s exactly what Hamas aims to achieve repeatedly. Hamas also kidnapped a baby, Kirbas, from the village; he has spent more of his life as a Hamas hostage than as a free child. Hamas&#8217;s evil intentions are clear as they demand to keep hostages while preparing for more attacks to kidnap and murder more innocents.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Global Implications and the Necessity of Hamas&#8217;s Removal</h3>\n\n\n\n<p>Hamas&#8217;s actions extend beyond Israel, as their supporters worldwide, including in the U.S., glorify their violence. Outside the U.S. Democratic Party National Convention in Chicago, Hamas fans marched in support of murder, rape, and child abuse. The Islamic Republic of Iran&#8217;s leader has called some of these supporters a branch of the resistance front, and U.S. intelligence has revealed Iranian funding behind these protests. The global community must recognize that Hamas&#8217;s evil is not just an issue for Israel but a threat to peace worldwide. A humanitarian ceasefire is impossible with Hamas still in power, as Hamas exists solely for war. For the sake of peace, Hamas must be removed from power.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Efforts in Gaza and the Lies of Hamas</h3>\n\n\n\n<p>Despite Hamas&#8217;s ongoing aggression, Israel continues to provide humanitarian aid to Gaza. Israel has brought in vaccines to protect Gazan children from polio, working with the World Health Organization and UNICEF, even though 95% of Gazans were already vaccinated before October 7th. Israel has also facilitated the entry of 11 field hospitals into Gaza to treat civilians, as Israel values all lives. In stark contrast, Hamas exploits and endangers civilians, using hospitals and safe zones as bases for their attacks. Hamas leader Ismail Haniyeh has made it clear that they desire the blood of women, children, and the elderly to continue their war.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Audience Questions</h3>\n\n\n\n<p><strong>Question from Ed Bar on YouTube: How are the hostage families holding up?</strong></p>\n\n\n\n<p>The hostage families are incredibly resilient, but every day for them is a living hell. They continue to protest and urge Israel to pressure Hamas into accepting ceasefire negotiations. Israel is doing everything possible to secure the hostages&#8217; release and bring them back to their families.</p>\n\n\n\n<p><strong>Question from Daniel on X: Why is Hezbollah continuing to fire into Israel? Didn&#8217;t they promise to stop?</strong></p>\n\n\n\n<p>Hezbollah&#8217;s promises are meaningless. They claimed they would stop if there was a ceasefire with Hamas, but since Hamas refuses the ceasefire, Hezbollah continues to fire rockets into Israel. They are a terror army that will continue their aggression until they are forced to stop.</p>\n\n\n\n<p><strong>Question from Marjerie on Instagram: Why is Israel responsible for helping anyone in Gaza anymore?</strong></p>\n\n\n\n<p>Israel is responsible because it values life and cannot stand by while civilians are at risk. Despite Hamas&#8217;s responsibility as Gaza&#8217;s government, Israel continues to ensure the safety of Gazan civilians, providing vaccines and medical supplies, even as Hamas hijacks and misuses these resources.</p>\n\n\n\n<p><strong>Question from La Da on Instagram: What is the situation with the remaining hostages? Do we have any proof of life?</strong></p>\n\n\n\n<p>Unfortunately, there is no current proof of life for the remaining hostages, and Hamas has not allowed the Red Cross to visit them. The situation remains uncertain, and we can only hope for their safety.</p>\n\n\n\n<p><strong>Question from Lum Legend 01 on YouTube: How will this conflict ever end unless there are two states living side by side?</strong></p>\n\n\n\n<p>For there to be peace, Hamas must be removed from power. While many people support a two-state solution, the reality is that peace cannot be achieved with a terrorist organization like Hamas in control of Gaza.</p>\n\n\n\n<p><strong>Question from Vegan Loris on Instagram: How can we get our truth out to Western media sources?</strong></p>\n\n\n\n<p>Engage actively on social media, comment on biased news posts, and support pro-Israel messages. An email campaign targeting news outlets that spread misinformation should also be started, ensuring that the truth is heard.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you for joining us today. Please tune in again tomorrow at 3 p.m. Israel time, 8 a.m. Eastern time. Until then, stay safe.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Day 319 of the October 7th War highlights <a  href=\"/hamas\">Hamas</a>&#8216;s continued atrocities, including the murder of <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>. <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> seeks to secure all hostages and prevent future attacks. Despite global challenges, Israel provides humanitarian aid to <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> while <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> and its supporters perpetuate violence. Peace is impossible with Hamas in power.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        498
    ],
    "class_list": [
        "post-15493",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-rachel-lester"
    ],
    "lang": "en",
    "translations": {
        "en": 15493
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15493",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=15493"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15493/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15496,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15493/revisions/15496"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=15493"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=15493"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=15493"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}