{
    "id": 10819,
    "date": "2024-08-05T15:00:00",
    "date_gmt": "2024-08-05T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=10819"
    },
    "modified": "2024-08-09T22:12:07",
    "modified_gmt": "2024-08-09T19:12:07",
    "slug": "israel-prepares-for-an-iranian-attack-daily-briefing-with-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/israel-prepares-for-an-iranian-attack-daily-briefing-with-doron-spielman/",
    "title": {
        "rendered": "Israel Prepares For An Iranian Attack | Daily Briefing with Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Israel Prepares For An Iranian Attack | Daily Briefing with Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/uFGInRzTlag?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today marks the 304th day of the October 7th War and the ongoing Hamas hostage crisis. This is also Ariel Bibas&#8217;s fifth birthday. While we wish Ariel a happy birthday, we cannot forget that Ariel, along with his baby brother Kir and their parents, remain hostages in Gaza. They were brutally abducted by Hamas death squads during the October 7th Massacre a few months ago. Not long ago, Ariel&#8217;s little brother Kir had his first birthday while in Hamas captivity. Tragically, this baby has been a hostage for longer than he was ever free. The family has now spent ten months in Hamas&#8217;s terror dungeons. Kir and Ariel&#8217;s grandfather and grandmother were murdered by Hamas, Iran&#8217;s Gazan proxy army, which declared war on the people of Israel on October 7th. Over 300 days later, Hamas is still holding 110 hostages, including young men, women, a young family, a young child, and even little Kir. This kidnapping of children is part of Iran&#8217;s seven-front war to destroy the Jewish state.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Broader Context of the Conflict</h3>\n\n\n\n<p>Hamas abducted little children, and then Iran&#8217;s other proxy armies, including Hezbollah, the Houthis, and more, joined Iran&#8217;s regional war in solidarity. This conflict is not about politics and power—Israel is fighting for its survival and for the lives of its children against Iran&#8217;s criminal caliphate and its proxy armies. Israel is preparing for an imminent multi-front attack from Iran, with military, firefighters, and medics all on high alert for conventional threats like missiles, while emergency response teams are ready to stop any terrorist infiltrations. Iran has threatened to &#8220;punish&#8221; Israel, with its foreign ministry using language as if Israel were a naughty child. This revenge attack could be bigger than the unprecedented attack in April, with over 300 missiles and drones targeting Israel. Iran reportedly plans to drag out its attack to wear out Israel and try to kill more people. Iran is furious because Israel is removing its and its proxy armies&#8217; ability to murder the people of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran&#8217;s Aggressive Stance</h3>\n\n\n\n<p>Iran&#8217;s intentions are clear—it wants people in Israel to die and for Israel to do nothing in response. Iran has even stated that innocent civilians in Israel are targets, a strategy they have employed in Iraq, Syria, Lebanon, and Yemen. Israel, like any other country, rejects Iran&#8217;s aggressive stance and is committed to protecting its people. Iran wants to surround Israel with a &#8220;ring of fire&#8221; and watch it burn, but Israel has been successful in extinguishing these flames, cutting its proxy armies down to size. This includes eliminating key terror leaders like Muhammad Deif in Gaza, Fuad Shaker, the chief of Hezbollah&#8217;s terror army in Lebanon, and according to foreign reports, Ismael Haniyeh, the diabolical leader of Hamas who planned and financed the murder of Jews in Israel and around the world.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Global Responses and Israel&#8217;s Determination</h3>\n\n\n\n<p>Iran&#8217;s actions have drawn condemnation from around the world. The G7 has urged de-escalation, and Jordan&#8217;s foreign minister made a rare visit to Tehran, asking Iran to stop its violent escalation in favor of peace, security, and stability. This is what Israel wants too, but if Iran continues its aggression, Israel will do whatever is necessary to protect its people, including all residents of Israel, regardless of their background or religion. The existence of Israel as a thriving democracy, similar to countries in the West, is one of the reasons Iran wants to destroy it. Iran, a cruel dictatorship, sees Israel&#8217;s values of freedom, liberty, and the right to live according to one&#8217;s beliefs as a threat. Just as cruel dictators have fought the West in the past, Iran is now targeting Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Broader Implications of Iran&#8217;s Actions</h3>\n\n\n\n<p>In April, when Iran launched 350 ballistic missiles, cruise missiles, and drones to murder Israeli families, many of Israel&#8217;s neighbors, including Jordan, Bahrain, the United Arab Emirates, and likely Saudi Arabia, joined the United States, UK, and France in blunting Iran&#8217;s aerial attack. They understand that Iran is a threat to the entire region, and they joined the alliance because they see Iran as a common enemy. The American military, including warships and fighter aircraft, are also moving into the region, as they did in April. Iran desperately wants war, while Israel desires something very simple—to live in peace within its borders. However, if Iran cannot contain its desire for blood, Israel and countries that share a vision of peace will contain and defend against Iran&#8217;s murderous threats.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How You Can Help</h3>\n\n\n\n<p>For those asking what they can do to help, there are links to a JAG campaign across social media. These donations provide the support needed to keep getting the word out. Additionally, you can sign up for our email list to receive direct messages and occasional special content.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions and Answers from Social Media</h3>\n\n\n\n<p><strong>Question from Laura on Instagram:</strong><br><em>We&#8217;ve heard talk of preemptive strikes by Israel on Iran. Is this likely to happen, and what would it mean?</em></p>\n\n\n\n<p><strong>Response:</strong><br>Laura, thank you for your question. This cannot be a preemptive strike for one simple reason: Iran preemptively struck Israel. Let&#8217;s not forget that just a month and a half ago, rockets, cruise missiles, and ballistic missiles were launched at Israel—a non-belligerent actor—while people were sitting in their homes sheltering. Iran started this conflict, and therefore any response from Israel can no longer be considered preemptive. However, given what I assume you&#8217;re asking, Israel will keep all options on the table to defend its people. Israel will take whatever military steps are necessary to protect its citizens while trying to avoid civilian casualties.</p>\n\n\n\n<p><strong>Question from Julia on YouTube:</strong><br><em>Iran said they don&#8217;t want a &#8220;regional escalation.&#8221; Didn&#8217;t Israel expect that an assassination in Tehran would force Iran to respond? Isn&#8217;t there a better way out of this cycle of violence?</em></p>\n\n\n\n<p><strong>Response:</strong><br>Let&#8217;s step back and see how clearly Iran is lying. You don&#8217;t need me to tell you—just look at what Iran has been doing in recent years in places like Syria and Lebanon. They have already engaged in regional escalation. Why are the Houthis fighting all the way from Yemen? Because Iran went into Yemeni territory and created terror cells. Iran has been working on regional escalation for the last 20 years. Their friends are not in the West—they are Russia, China, and North Korea. Iran is creating an Axis of Evil against Israel and any other democracy. Israel may be the first on the line, but Iran&#8217;s goals, as they have clearly stated, are to take over the Western world and destroy freedom wherever it exists.</p>\n\n\n\n<p><strong>Question from Instagram Live User Awa Wall:</strong><br><em>Are Jewish communities globally also preparing for some kind of attack targeting them?</em></p>\n\n\n\n<p><strong>Response:</strong><br>It&#8217;s an excellent question. Iran has no qualms about attacking innocent civilians, whether in Israel or overseas. Hezbollah, Iran&#8217;s proxy, blew up a Jewish center in Buenos Aires, killing over 40 innocent people. Governments worldwide are aware of this threat and are engaging their security agencies to protect Jewish communities. But everyone must be aware of what&#8217;s happening around them. This is a time to stand up for every Jewish member of society and say, &#8220;We stand together with the Jewish community and with Israel against the Iranian terror regime.&#8221;</p>\n\n\n\n<p><strong>Question from Rama Eon:</strong><br><em>Is there or are you expecting a rush on the airport?</em></p>\n\n\n\n<p><strong>Response:</strong><br>Rama, it&#8217;s a great question. On October 7th, there was a rush to the airport, but it was a rush of people flying into Israel from around the world to stand up and fight for our country. While some Israelis may leave, like in any other country, there has never been a country where more people returned during war than those who returned to Israel on October 7th. Israelis are committed to protecting our home, families, and the only Jewish state in the world. A thriving Israel brings benefits to the rest of the world, and everyone should be interested in Israel&#8217;s survival.</p>\n\n\n\n<p><strong>Question from Instagram Live User Arto:</strong><br><em>Which countries participate in the coalition to defend Israel?</em></p>\n\n\n\n<p><strong>Response:</strong><br>Thank you, Arto, for your question. Many of Israel&#8217;s neighbors, including Jordan, the United Arab Emirates, and Bahrain, along with the United States, England, and France, have participated in the coalition to defend Israel. They see Iran as an enemy that wants to take over the Middle East. Israel is not alone—many countries around the world stand by Israel in its time of need, and we believe they will continue to do so.</p>\n\n\n\n<p><strong>Question from Instagram Live User 85:</strong><br><em>Given the current situation, will there ever be a hostage deal?</em></p>\n\n\n\n<p><strong>Response:</strong><br>It&#8217;s an excellent question, and everyone in Israel is torn. Our hearts break for the hostages, like Ariel Biot, who is spending his fifth birthday in captivity. We all want to bring them home, but we know Hamas won&#8217;t make a deal out of the goodness of their hearts. Hamas will only come to a deal if they have no choice, and by applying military pressure, we may have the best chance of getting our hostages home. Israel will never stop negotiating for the hostages, and we will do everything we can until every one of them comes home.</p>\n\n\n\n<p><strong>Question from Talia on YouTube:</strong><br><em>There is an infographic circulating on social media explaining that Israelis should not post online about where attacks are happening because it can help the enemy. Is this true? Should we still post to show the international community what is happening, or could this put Israeli safety in jeopardy?</em></p>\n\n\n\n<p><strong>Response:</strong><br>We should always be active on social media, but there are ways to post without revealing the exact locations of attacks. It is essential to get the truth out and allow the world to see and hear what is happening in Israel. However, we must be careful not to give away logistics or locations that could aid the enemy. We need to use caution and wait until the army and media have cleared the information before sharing it online.</p>\n\n\n\n<p><strong>Conclusion:</strong><br>Thank you all for joining us today. We will be here every day at 3 p.m. Israel time and 8 a.m. Eastern Standard Time. You can follow us on Twitter, LinkedIn, Facebook, Instagram, and TikTok. We hope you will continue to join us, ask more questions tomorrow, and stand with us in praying for a safe and secure Israel.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The October 7th War continues as <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> defends against <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> and its proxies. Ariel Bibas, a child hostage in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, marks his fifth birthday in captivity. Israel remains vigilant, preparing for imminent multi-front attacks. Global allies stand with Israel, emphasizing the importance of security and democracy against Iran&#8217;s aggressive ambitions.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 10822,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1304
    ],
    "class_list": [
        "post-10819",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-doron-spielman"
    ],
    "lang": "en",
    "translations": {
        "en": 10819
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10819",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=10819"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10819/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 10877,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10819/revisions/10877"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/10822"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=10819"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=10819"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=10819"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}