{
    "id": 15484,
    "date": "2024-08-19T15:00:00",
    "date_gmt": "2024-08-19T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=15484"
    },
    "modified": "2024-08-20T00:09:14",
    "modified_gmt": "2024-08-19T21:09:14",
    "slug": "last-opportunity-to-get-the-hostages-home-with-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/last-opportunity-to-get-the-hostages-home-with-doron-spielman/",
    "title": {
        "rendered": "Last Opportunity to Get the Hostages Home? | with Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Last Opportunity to Get the Hostages Home? | with Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/rX0gkV9DUJY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a>Today marks day 318 of the October 7th War and the ongoing Hamas hostage crisis. This may be the last opportunity to bring our hostages home, according to U.S. Secretary of State Antony Blinken, as Hamas has once again rejected a deal. Hamas threatens, &#8220;Give us the ability to murder more people in Israel in the next October 7th, or we will murder more hostages right now,&#8221; just as they claimed to have done a few days ago. Hamas is a group of murderers; this is their operational DNA. People ask how they could have done what they did on October 7th. The answer lies in Hamas being a cult of evil, a cult of death. This has not changed over the past 10 months, and it is evident at the negotiating table. Israel needs our hostages home and must ensure that Hamas cannot take more hostages tomorrow.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217; Demands and Israel&#8217;s Response</h3>\n\n\n\n<p>Hamas demands that Israel withdraw before releasing all the hostages, which would allow them to hold the surviving hostages as insurance forever or worse. Israel is defeating Hamas on the battlefield and does not want to hand Hamas a victory at the negotiation table. Israel does not want to give Hamas the ability to threaten the lives of Israelis again. Hamas is exploiting the negotiations because they do not want the war to end. Instead of ending the war they started on October 7th, Hamas is preparing for the next war.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Philadelphia Corridor and Hamas&#8217; Weapon Smuggling</h3>\n\n\n\n<p>Hamas demands that Israel leave the Philadelphia Corridor, where tunnels have been found leading from Egypt into Gaza. These tunnels are large enough to drive semi-trucks through, which Hamas did, bringing in weapons used to attack Israel on October 7th and in subsequent attacks. Allowing Hamas to control this route would enable them to bring in more weapons to attack Israel. For Hamas, the Philadelphia-to-Gaza route is a weapons lifeline; for innocent Israelis, it is a deathline. If Israel were to leave the Philadelphia Corridor, it would have to return, just like last time.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Threat of Future Attacks</h3>\n\n\n\n<p>Hamas intends to use the Philadelphia-to-Gaza route to send weapons into Northern Gaza to attack Israeli communities like Kerem Shalom and Be&#8217;er Sheva. Former Hamas leader Ismail Haniyeh stated weeks after October 7th, &#8220;We need the blood of women, the blood of children, and the blood of the elderly.&#8221; This declaration foreshadowed the atrocities Hamas carried out under his leadership on October 7th. Hamas believes its secret weapon for winning and carrying out another October 7th massacre is civilian casualties. Every time the number of Gazan civilian casualties rises, Hamas cheers from deep inside their tunnels, believing this will manipulate global audiences and force Israel to stop fighting.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Three D&#8217;s to End the War</h3>\n\n\n\n<p>Most rational people recognize the evil of Hamas. They understand that Hamas cannot be left standing, still holding hostages. This war must end with the three D&#8217;s: destroy Hamas, demilitarize Gaza, and deradicalize the Gazans. Last night, a man attempted a suicide attack in Tel Aviv, and earlier, a terrorist murdered a 38-year-old man with a hammer in an industrial zone where Jews and Arabs work together. These attacks are reminders that the threat from Iranian-backed Hamas, Islamic Jihad, and Fatah terrorists is constant.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Role of Fatah and Mahmoud Abbas</h3>\n\n\n\n<p>Hamas does not control most West Bank areas, Judea, and Samaria because Israel is there to keep them in check. However, the so-called moderate Palestinian Fatah President Mahmoud Abbas controls these areas and pays murderers. The more people they kill, the more money they receive—a practice known as &#8220;pay to slay.&#8221; Abbas educates his people to hate Jews and glorifies those who succeed in murder by naming streets after them. Fatah officials have praised Hamas&#8217; October 7th massacre, and Abbas himself recently prayed for Hamas leader Ismail Haniyeh. This ideology is reflected in Abbas&#8217; doctoral thesis, &#8220;The Secret Relations between Nazism and the Leadership of the Zionist Movement,&#8221; where he blames Zionist Jews, not the Nazis, for the Holocaust as a means to gain world sympathy for a Jewish state. This is the same Abbas, the same ideology, and this is why Israel views Abbas and Fatah as another face of the Hamas problem. Therefore, Israel objects to returning Abbas and his radicalization to the Gaza Strip.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Day 318 of the October 7th War sees <a  href=\"/hamas\">Hamas</a> rejecting deals while threatening more violence. <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> is breaking <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> on the battlefield but faces demands to withdraw, risking future attacks. The war must end by destroying Hamas, demilitarizing <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, and deradicalizing Palestinians, with Fatah&#8217;s complicity also under scrutiny.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1304
    ],
    "class_list": [
        "post-15484",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-doron-spielman"
    ],
    "lang": "en",
    "translations": {
        "en": 15484
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15484",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=15484"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15484/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15486,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15484/revisions/15486"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=15484"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=15484"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=15484"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}