{
    "id": 15007,
    "date": "2024-08-15T15:00:00",
    "date_gmt": "2024-08-15T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=15007"
    },
    "modified": "2024-08-16T12:38:41",
    "modified_gmt": "2024-08-16T09:38:41",
    "slug": "pressure-hamas-letthemgonow-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/pressure-hamas-letthemgonow-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "Pressure Hamas: #LetThemGoNow | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Pressure Hamas: #LetThemGoNow | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/PqhMroee9Zg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is day 314 of the October 7th War and the Hamas hostage crisis. The world needs to pressure Hamas to release the hostages now. This is a critical moment as Israel, the US, and mediators are meeting today in Qatar for ceasefire talks, but Hamas is refusing to negotiate.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hostage Families&#8217; Demands and Hamas&#8217;s Reluctance</h3>\n\n\n\n<p>The families of the hostages are demonstrating, demanding that the Israeli government bring them home. However, Hamas needs a reason to let them go. Hamas started this war and does not want to end it, and rewarding Hamas for October 7th is not the way to force them to release the hostages. Any inducements offered to Hamas or Iran by the US or other allies, however well-meaning, weaken Israel&#8217;s position. These talks should focus on how much pressure can be applied to Hamas and their backers—Iran, Turkey, and Qatar—rather than how far Israel can be blackmailed to secure the hostages&#8217; return.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217;s Terror and International Consequences</h3>\n\n\n\n<p>Hamas has been abusing the hostages for 10 months in their terror dungeons, and their heinous acts must not be rewarded. Hamas and its Iranian patrons must not be allowed to view the horrors they inflicted on October 7th as any form of victory. If Hamas and Iran are told that terror works, Hamas will continue to commit atrocities like October 7th repeatedly, as they have explicitly promised.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Stance on Hostage Release and Future Security</h3>\n\n\n\n<p>The people of Israel know two things: the hostages must be freed from Hamas today, and Hamas must not have the ability to take more hostages tomorrow. This means Israel needs a deal that secures the hostages&#8217; return and prevents Hamas from regrouping and planning future attacks like those on October 7th. Pressure your leaders to press Hamas and its backers—Iran, Turkey, and Qatar—to release the hostages now.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran&#8217;s Blackmail and Israel&#8217;s Response</h3>\n\n\n\n<p>Iran is attempting to blackmail Israel at the negotiation table, threatening to attack Israel directly if its Gazan proxy army does not get what it wants. Israel is faced with the choice of allowing Hamas to survive and carry out another October 7th or facing Iranian aggression. However, Israel is not isolated nor alone, as the Free World understands that Iran and its proxy armies are not just enemies of Israel but enemies of the Free World. The US has positioned significant military assets in the region and approved a major military sale to Israel, making it clear that blackmail will not work.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Audience Q&amp;A</h3>\n\n\n\n<p><strong>Q: Schomo (X): The Hamas-run Health Ministry has reported over 40,000 dead. How does Israel respond to this?</strong></p>\n\n\n\n<p>These numbers, whether accurate or exaggerated, represent a terrible tragedy. However, it is essential to remember that this tragedy began when Hamas decided to massacre Israeli civilians on October 7th. Israel has no regrets for eliminating Hamas fighters, who are responsible for the ongoing conflict. The death toll, particularly among civilians, is indeed tragic, but Israel stands by its actions in dismantling Hamas and defending its citizens.</p>\n\n\n\n<p><strong>Q: Nancy (Instagram Live): What interest does Hamas have in letting the hostages go? What pressure can we put on them?</strong></p>\n\n\n\n<p>Hamas sees the hostages as leverage, but pressure needs to be applied from all sides—Israel, its allies, and the people of Gaza. Hamas must be dismantled, and the Gaza Strip disarmed before any normalcy can return. The pressure needs to be overwhelming to force Hamas to negotiate and release the hostages.</p>\n\n\n\n<p><strong>Q: Linda and Malan (Instagram): Do we have any idea where Sinwar is? Is he hiding in tunnels to Egypt?</strong></p>\n\n\n\n<p>Sinwar, like other overthrown dictators and terrorists of the past, has buried himself deep within Hamas&#8217;s operations. The goal is to dismantle Hamas&#8217;s remaining infrastructure and prevent leaders like Sinwar from perpetrating further atrocities like those on October 7th. Israel is working to ensure that such horrors cannot be repeated.</p>\n\n\n\n<p><strong>Q: Sammy (YouTube): Can you give an update on what&#8217;s happening with the IDF draft?</strong></p>\n\n\n\n<p>The IDF is stretched thin after 10 months of conflict, with reservists fighting on all fronts. While the specifics of domestic issues will be handled by others, it&#8217;s clear that Israel&#8217;s military, supported by its people, is committed to protecting the nation and ensuring the safety of its citizens.</p>\n\n\n\n<p><strong>Q: Dumbo Direct (Instagram Live): Will there be Israeli elections, and how will it affect the war?</strong></p>\n\n\n\n<p>Israel is a free democracy, and any future elections will be determined by the people. The situation in Gaza, under Hamas&#8217;s authoritarian rule, is a stark contrast to Israel&#8217;s democratic processes. Regardless of when elections occur, Israel will remain committed to defending its citizens and maintaining its democratic values.</p>\n\n\n\n<p><strong>Q: Joshua (Instagram Live): How can Qatar be pressured not to support Hamas and other terrorist organizations?</strong></p>\n\n\n\n<p>Global unity is crucial in pressuring nations like Qatar to cease their support for terrorist organizations. Israel&#8217;s allies must work together to weaken the support base for regimes backing Hamas, ensuring that free, liberal democracies like Israel prevail over tyrannical forces.</p>\n\n\n\n<p><strong>Q: Social Media Questions: The US reportedly leaked names of Mossad agents to Iran. Can you clarify and explain?</strong></p>\n\n\n\n<p>It&#8217;s essential to rely on verified information and avoid speculation. While rumors and reports circulate, the focus should be on facts. Israel and its allies are working diligently to achieve a ceasefire, return hostages, and end the ongoing conflict.</p>\n\n\n\n<p><strong>Q: Samy: Why are so many airlines canceling flights until 2025? Should we expect the war to continue until then?</strong></p>\n\n\n\n<p>Airlines make decisions based on safety, political, and commercial factors. While the situation is unpredictable, Israel remains hopeful for peace and continues to live life as normally as possible. The Israeli people are resilient, and life goes on, even amid uncertainty.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>That concludes today&#8217;s briefing. We will be back on Sunday at 3:00 PM Israel time, 8:00 AM Eastern Standard Time. Thank you for tuning in and supporting us. Please like, share, and subscribe to help us reach a wider audience. Shabbat Shalom, and stay safe.<a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>As the October 7th War and <a  href=\"/hamas\">Hamas</a> hostage crisis continue, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and allies press for hostage release while resisting Iranian blackmail. <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> refuses to negotiate, seeking leverage through terror. Global pressure is essential to dismantle Hamas, secure <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>&#8216; freedom, and prevent further atrocities. Israel remains committed to defense and peace.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306
    ],
    "class_list": [
        "post-15007",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans"
    ],
    "lang": "en",
    "translations": {
        "en": 15007
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15007",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=15007"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15007/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15018,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15007/revisions/15018"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=15007"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=15007"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=15007"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}