{
    "id": 15518,
    "date": "2024-08-22T15:00:00",
    "date_gmt": "2024-08-22T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=15518"
    },
    "modified": "2024-08-23T19:24:07",
    "modified_gmt": "2024-08-23T16:24:07",
    "slug": "sinwar-wants-martyrs-just-not-himself-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/sinwar-wants-martyrs-just-not-himself-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "Sinwar Wants Martyrs – Just Not Himself | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Sinwar Wants Martyrs – Just Not Himself | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/1ByKYK3KmtI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is day 321 of the October 7th War and the Hamas hostage crisis. Hamas doesn&#8217;t want to end the war; it wants to escalate. Israel said yes to the deal on the table, but Sinwar is still refusing to let the hostages go.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Hamas’ Strategy and Iran&#8217;s Influence</strong></h2>\n\n\n\n<p>Let me explain Hamas&#8217;s strategy. Hamas wants its Iranian backers to save it from a ceasefire because the Hamas army of terror wants to drag out this war for as long as possible. The October 7th Massacre was the opening shot of the Iranian regime&#8217;s regional war against Israel through its proxy armies on seven fronts. You know them by now: Gaza, the West Bank, Lebanon, Syria, Yemen, Iraq, and Iran itself.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Threats from Iran and its Proxies</strong></h2>\n\n\n\n<p>The Islamic Republic and Hezbollah are threatening massive attacks on Israel while Iran&#8217;s proxy armies continue targeting civilians in Israel every day. Israel&#8217;s allies have already condemned those threats of aggression and vowed to support Israel&#8217;s defense. Sinwar is stalling because he knows if Iran attacks Israel, it won&#8217;t have to let the hostages go; it can keep abusing them in its terror dungeons. The Islamic Republic is still saying it will attack Israel even if its proxy army Hamas reaches a ceasefire.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>The Need to Rescue Hostages and the Philadelphia Corridor</strong></h2>\n\n\n\n<p>Israel needs to get the hostages out today and make sure Hamas cannot take hostages tomorrow. Sinwar wants a deal where Hamas keeps the hostages, where Hamas again smuggles Iranian weapons from Egypt, and where Hamas brings those weapons to Israel&#8217;s border, just 35 miles from Tel Aviv. Gaza&#8217;s terrorist leaders are looking out only for themselves. Sinwar is reportedly stalling because he wants a guarantee that he won&#8217;t be assassinated. Sinwar wants every Gazan to be a martyr, to die attacking Israel—except for himself.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Sinwar&#8217;s Tactics and the Philadelphia Corridor</strong></h2>\n\n\n\n<p>This is the same Sinwar who&#8217;s made a strategy out of shooting at Israel&#8217;s children from behind Gaza&#8217;s children. In the meantime, Israel is clear that Sinwar cannot control the Philadelphia Corridor, the Gaza-Egypt border. The Philadelphia Corridor is a lifeline for Hamas and a death line for Israeli and Palestinian civilians. Israel found over 150 tunnels under the Gaza-Egypt border, some of them large enough to drive trucks through, and all within plain sight of Egyptian forces. Egypt and Sinwar don&#8217;t want Israel on the border because they don&#8217;t want any witnesses; they want the situation as it was on October 6th.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>The War&#8217;s End and the 3Ds</strong></h2>\n\n\n\n<p>Israel cannot return to October 6th. This war cannot end with the Hamas army of terror in power or with hostages in Gaza. It cannot end with Hamas free, emboldened, and able to continue attacking Israel like it did in decades culminating in the October 7th Massacre. We want peace with Gaza, but that runs through the 3Ds: Destroy Hamas, demilitarize Gaza, deradicalize Palestinian society. We need massive global pressure on Hamas to take the deal that&#8217;s on the table and let them go now.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>UNRWA and Hamas’ Use of School Buildings</strong></h2>\n\n\n\n<p>By now, we all know UNRWA is a Hamas front. It lets Hamas fight out of its school buildings. Hamas systematically fights out of school buildings because it knows the UN will cover up for it. This isn&#8217;t a one-off; Hamas abuses children and Hamas abuses school buildings. Note I say school buildings because since November, there have been no schools in Gaza after Hamas started this war.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>UNRWA Leadership and International Funding</strong></h2>\n\n\n\n<p>UNRWA&#8217;s leader, Philippe Lazzarini, accuses Israel of inhumanity for striking his school buildings as if Hamas had not already taken over them as command and control centers. UN officials covering up for Hamas&#8217;s human shield strategy are enabling and encouraging that strategy—they have blood on their hands. International funding for UNRWA is a subsidy to Hamas&#8217;s army of terror. Your taxpayer money is literally going to the buildings with Hamas military bases, and the UN has never reported armed terrorists operating out of its facilities.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Israel’s Commitment to Minimizing Civilian Harm</strong></h2>\n\n\n\n<p>UNRWA has never told its donors, your governments, that Hamas is exploiting the neutrality of schools, abusing humanitarian protections, making them legitimate military targets under international law. If the UN had done its job, then Gazans would be safe from Hamas rather than have Hamas fighting out of every UN school and shelter. Even when terrorists make use of school buildings, Israel still takes care to minimize harm to civilians because Israel cares much more about international law than those who will twist it to say whatever is good for Hamas.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Precision Strikes on Hamas</strong></h2>\n\n\n\n<p>Remember the strike on the Al-Albina former school building? Hamas immediately claimed 100 people were killed, then quickly reduced that to a few dozen, and Israel proved they were almost all terrorists. The IDF said it used a high-precision munition, and CNN verified that. It reported that Israel used a GBU-39 small diameter bomb, which CNN confirmed is designed to result in low collateral damage. It&#8217;s the smallest munition that Israel&#8217;s jets can carry, and it&#8217;s precise to a range of just three meters. Terrorists don&#8217;t get immunity just because they bring their rockets into abandoned classrooms.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Hezbollah’s Attacks from the Nort</strong></h2>\n\n\n\n<p>Now from Gaza, let&#8217;s move to the situation in the North. Hezbollah, Iran&#8217;s proxy army in Lebanon, fired 180 rockets into Israel yesterday at civilian targets, at civilian homes, just as they&#8217;ve been doing for the last 10 months and as they explicitly promised last month. Iran&#8217;s proxy army in Lebanon has fired hundreds of rockets this week, some of the 7,000 rockets, missiles, and drones that they have launched into Israel since Hezbollah started this war in the North on October 8th in solidarity with the October 7th Massacre.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Hezbollah’s Continued Targeting of Civilians</strong></h2>\n\n\n\n<p>Hezbollah&#8217;s rockets slammed into homes in a town on the Golan Heights. It&#8217;s a miracle that more people were not hurt—there were no military targets nearby. Hezbollah is openly targeting civilians. Hezbollah is trying to murder innocent people in Israel. Hezbollah has 200,000 rockets—bigger than most of NATO put together. Hezbollah dug cross-border tunnels that were meant to infiltrate Israel and murder innocents along the border, the exact scenario that Hamas perpetrated on Israel&#8217;s southern border on October 7th. Hezbollah needs to end its war against the people of Israel. Iran&#8217;s proxy army in Lebanon must back off, or Israel will have to push it away.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Question</strong>s</h2>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question from Instagram: Do we have intelligence that Sinwar is in the terror tunnels?</strong></h4>\n\n\n\n<p>Since the beginning of the war, Hamas&#8217;s terrorist leaders have been hiding underground. Hamas has spent the last 16 years deliberately designing Gaza to hide its military assets underground. It built a network of tunnels one and a half times the length of the New York subway, with tunnel shafts poking out inside schools, homes, mosques, and hospitals. There are tunnels everywhere in Gaza, and that explains, by the way, the extent of the destruction to infrastructure inside Gaza because those legitimate military targets are underneath everywhere.</p>\n\n\n\n<p><strong>Hamas Leadership’s Underground Tactics</strong></p>\n\n\n\n<p>Recently, we&#8217;ve seen Hamas moving to operate out of former school buildings. Why? Because Israel has been systematically demolishing those tunnels underneath Gaza, destroying whole command and control centers underneath Gaza City. I&#8217;m talking about tunnel networks that are several layers deep underneath Gaza&#8217;s civilian infrastructure. Now, I don&#8217;t know what our top-secret intelligence says about where Sinwar is hiding, but it would make sense that he is hiding in a tunnel somewhere under a home or a school or a hospital, and in all likelihood surrounding himself with hostages as human shields.</p>\n\n\n\n<p><strong>Israel’s Targeting of Hamas Leadership</strong></p>\n\n\n\n<p>Israel has been systematically picking off Hamas&#8217;s leadership. Just look at the top list of who Hamas&#8217;s leadership were at the start of this war. Ismail Haniyeh—gone. Marwan Issa—gone. Muhammad Deif—gone. Salah al-Arouri—gone. Israel has been systematically decapitating Hamas&#8217;s leadership and doing exactly what the international community has been telling it to do, which is to go after the monsters who did October 7th. And Sinwar is looking out for his own skin.</p>\n\n\n\n<p><strong>Sinwar’s Stalling and Negotiations</strong></p>\n\n\n\n<p>There are reports now that he is stalling negotiations that would bring relief to the people of Gaza, let the hostages go—some of the hostages, at least—because he wants a guarantee that he won&#8217;t be assassinated, that he can climb onto the rubble of Gaza and declare victory, having launched this war, fed out of civilian areas, and brought untold misery to the people of Gaza through his sick human shield strategy.</p>\n\n\n\n<p><strong>Recap: Sinwar’s Likely Hiding Spot and the Importance of Pressure</strong></p>\n\n\n\n<p>So to recap, look, we don&#8217;t have open intelligence about where exactly Sinwar is hiding, but he is probably hiding in a tunnel under civilian areas. And I hope that as he looks down at the other Hamas leaders who are in hell right now, looking up at him, thinking they should have released the hostages while they had the chance, that he is having that same thought right now. If we get to a ceasefire, it will only be through military pressure on Hamas. Sinwar needs to be given a reason to let the hostages go. Israel has said yes to the deal—it&#8217;s a bad deal, but Israel has said yes. And now we need massive international pressure from your governments on Hamas and its backers—Qatar, Turkey, and Iran—to let them go now.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question from Instagram: Do we have intelligence that the hostages are still alive</strong></h4>\n\n\n\n<p> Hamas is holding 109 hostages, including 105 from October 7th and four from before. We know that of the 105 hostages who are still trapped in Gaza, at least 34 have been killed. Their blood is on Hamas&#8217;s hands, and we will have to settle a score for that.</p>\n\n\n\n<p><strong>The Hostages’ Plight and Israel’s Efforts</strong></p>\n\n\n\n<p>We have to assume that the rest are alive and to keep fighting on the assumption that they are alive. Now, Hamas isn&#8217;t giving us proof of life. Hamas will not let the Red Cross visit the hostages. Hamas will not let the Red Cross give medical aid to the hostages. The Red Cross has not really tried to force Hamas, and I think that many people have given up on even trying to pressure the Red Cross because they understand that it is useless. The hostages&#8217; families in Israel are being put through psychological torture by a terrorist army that will release a propaganda video once in a while, but that&#8217;s not proof of life.</p>\n\n\n\n<p><strong>Hamas’s Inhumane Tactics and the Urgency of Rescue</strong></p>\n\n\n\n<p>They&#8217;ve released some videos. We know that some of the hostages are alive—at least at the time that the videos were recorded. But time is running out. Time has run out for too many of them who are being starved and tortured and raped and executed in the Hamas terror dungeons, and every day that goes by is an immediate risk to their lives. So, of the 109 hostages, we know at least 36 are dead, and Hamas is holding on to their hostages as human shields. As for the rest, no evidence has been confirmed and shared with the families. We have to assume they&#8217;re alive, and we have to fight to get them all out.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question from Instagram: Why does Israel not just take out the Iranian regime?</strong></h4>\n\n\n\n<p>Stepan, you raise a very important and interesting question. You&#8217;re right to note that this war is not a war between Israel and a small Palestinian terrorist group in Gaza. This is a war that the Iranian regime is fighting against Israel on seven fronts through its proxy armies—a war in which the fundamentalist leaders in Tehran want to destroy Israel.</p>\n\n\n\n<p><strong>The Complexity of a Direct Conflict with Iran</strong></p>\n\n\n\n<p>Iran doesn&#8217;t just want to destroy Israel; it is actively working on its plan to destroy Israel. Iran&#8217;s strategy is to surround Israel with a ring of fire and watch it burn. And it&#8217;s very difficult to imagine how the Iranian regime can be contained, how its aggression can be deterred until the regime in Tehran is brought down. But you should be under no illusions about what a direct war between Israel and Iran would look like. It would be catastrophic. It would involve simultaneous attacks by Iran and its proxy armies on seven fronts that would overwhelm Israel&#8217;s missile defenses, and Israel will need the support of its allies in order to stand up against Iran.</p>\n\n\n\n<p><strong>The Importance of International Support Against Iran</strong></p>\n\n\n\n<p>That&#8217;s why it&#8217;s so important that as Iran has been threatening to attack Israel, the UK, the US, France, Germany, and Italy all said, &#8220;We condemn Iran&#8217;s threats. This would be an act of aggression, and we support Israel&#8217;s right to defend itself.&#8221; But Israel has made clear it will not allow the Iranian regime to acquire nuclear weapons. And this is an important point: Israel is the only country in the world that has actually bombed a nuclear reactor—not once, but twice. In the 1980s, it destroyed Saddam Hussein&#8217;s nuclear reactor in Iraq. The world condemned it; now they should say thank you. In the 2000s, it destroyed Bashar al-Assad&#8217;s nuclear reactor in Syria just before it went online. Again, people should say thank you. And Israel is saying, &#8220;We will not allow the Iranian regime to acquire nuclear weapons.&#8221; Iran is pursuing a strategy of destroying Israel and must not be allowed to acquire the weapons with which to do it.</p>\n\n\n\n<p><strong>The Role of International Pressure and the Abraham Alliance</strong></p>\n\n\n\n<p>That&#8217;s why it&#8217;s so important in your countries to keep up the internal pressure on the Iranian regime. Make it clear that if Israel is attacked by Iran, it will have the support of allies that will stand together with it. The Prime Minister has also spoken about the need for an Abraham alliance with other countries in the Middle East to contain Iran&#8217;s aggression. But ultimately, the Iranian regime will have to fall.</p>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>Questions from Daphne and Oshri on Instagram: How many countries still support and fund UNRWA today? What are your thoughts on the UN ignoring Jewish terror victims yesterday on the International Day of Terror Victims?</strong></h5>\n\n\n\n<p>Daphne, as for your first question about UNRWA funding, after Israel revealed evidence that UNRWA staff members took part in the October 7th Massacre, many countries suspended funding. They&#8217;ve all turned the funding taps back on, with the exception of the United States. It is a terrible betrayal. UNRWA is a Hamas front. Its staff members took part in the October 7th Massacre, as even the United Nations has confirmed. Most of the October 7th monsters were graduates of UNRWA schools; almost all of them were recipients of UNRWA aid.</p>\n\n\n\n<p><strong>UNRWA’s Role in Hamas Operations</strong></p>\n\n\n\n<p>UNRWA lets Hamas fight out of its school buildings and other facilities. It launders money for Hamas; it lets Hamas hijack aid, and when Hamas hijacks aid, it covers it up. UNRWA is a Hamas front, and I don&#8217;t know where you&#8217;re asking this question from, but if it&#8217;s a country that donates to UNRWA, your taxpayer money, when you go to work today, is being given to—essentially to Hamas as a subsidy for its army of terror. That has got to stop.</p>\n\n\n\n<p><strong>UN’s Failure to Address Palestinian Terrorism</strong></p>\n\n\n\n<p>I would advise you to watch the episode of &#8220;State of the Nation&#8221; that we have filmed with Hillel Neuer of UN Watch. That should be coming out next week, in which he lays out the evidence of UNRWA&#8217;s complicity in terrorism and the need to cut off funding from it. Unfortunately, far too many countries prefer to stick their heads in the sand, either because they don&#8217;t want to face the evidence about how UNRWA is fueling the Palestinians&#8217; forever war against Israel, or the more disturbing interpretation is that they do. Anyway, watch that episode of &#8220;State of the Nation&#8221; with Hillel Neuer for that briefing.</p>\n\n\n\n<p><strong>UN’s Inadequate Recognition of Jewish Terror Victims</strong></p>\n\n\n\n<p>And the second question: For those who aren&#8217;t following, the United Nations has put on an exhibition at the headquarters in New York for the International Day of Remembrance of Victims of Terrorism, mentioning most of the major terror attacks in the world, and not only glossing over the October 7th Massacre but any Palestinian terror attack against Israel. This is no surprise from an organization that has been systematically covering up Palestinian terrorism—not just covering it up, actively funding it, actively subsidizing it through an agency like UNRWA, which is a Hamas front.</p>\n\n\n\n<p><strong>UN&#8217;s Bias and Israel’s Right to Self-Defense</strong></p>\n\n\n\n<p>It would be one thing if after October 7th, the UN Security Council had convened and condemned Hamas&#8217;s massacre and stood by Israel&#8217;s right to defend itself, but it never did any such thing. And so many UN agencies, so many UN officials have, since day one, been abusing their positions to try to force Israel to end the war Hamas started with Hamas still in power and hostages still in Gaza, instead of standing by the Israeli people&#8217;s right to dismantle the terrorist organization that perpetrated the deadliest terror attack in world history since 9/11 and has been threatening to do it again and again and will try to do it again and again unless we stop it.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question from Nicole on Instagram: How do we deal with the news channels that twist the narrative, and when are you coming to Australia?</strong></h4>\n\n\n\n<p>Nicole, what do you do about news channels that twist the narrative? Hold them to account. Write them letters, phone up the news desk. If you&#8217;re using social media, expose what you see as examples of bias or covering up the facts. It is important—they need to be held to account for bad reporting as well, and for adopting a narrative that views the world in black and white: Israeli is bad, Palestinians good. They need to be held to account.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Upcoming Visit to Australia</strong></h2>\n\n\n\n<p>I will be heading to Australia next week with JNF Australia. They are flying me out as part of their fundraising for Australia to raise money for Israel&#8217;s south. JNF Australia is hoping to raise $100 million over the next seven years to rebuild Israel&#8217;s south, to take money from Down Under for Israel&#8217;s down under—from Oz to rebuild Nahal Oz and Nirim. I&#8217;ll be in Sydney, Melbourne, and Perth, and hope to meet as much of the community there as possible to continue making the case for Israel and to start rebuilding because there is so much rebuilding and healing that this country needs to do after the October 7th Massacre. We&#8217;re</p>\n\n\n\n<p>coming up to the one-year anniversary now. I&#8217;ve been meeting a lot of the displaced families, hostages&#8217; families as well—they need to rebuild their lives, and they&#8217;re going to do it, they&#8217;re going to do it together with the generous support from the diaspora.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Closing Remarks</strong></h2>\n\n\n\n<p>Okay, that&#8217;s all we have time for today. Please subscribe on whatever platform you&#8217;re not watching on at the moment. Share a link—please share a link with at least one friend. Tell them to continue watching. We&#8217;ll be back next week, every day at 3 p.m. Israel time, 8:00 a.m. Eastern. Follow us on all social media platforms. I&#8217;m Elon Ley—thanks for joining us.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On day 321 of the October 7th War, <a  href=\"/hamas\">Hamas</a> continues to refuse peace, seeking to escalate the conflict with <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s backing. <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> faces ongoing attacks from <a  href=\"/hezbollah\">Hezbollah</a>, while the international community is urged to pressure <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> to release <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a> and end the war. The focus remains on dismantling Hamas.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 15519,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-15518",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 15518
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15518",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=15518"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15518/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15520,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15518/revisions/15520"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/15519"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=15518"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=15518"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=15518"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}