{
    "id": 16527,
    "date": "2024-08-27T15:00:42",
    "date_gmt": "2024-08-27T12:00:42",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=16527"
    },
    "modified": "2024-09-03T00:23:59",
    "modified_gmt": "2024-09-02T21:23:59",
    "slug": "the-one-word-that-diplomats-fail-to-say-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/the-one-word-that-diplomats-fail-to-say-with-eylon-levy/",
    "title": {
        "rendered": "The One Word That Diplomats Fail to Say | with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"The One Word That Diplomats Fail to Say | with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/6ziOZKhXFVY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today is day two, day 325 of the October 7th War. It has been more than 24 hours since Hezbollah mobilized to fire hundreds of missiles into Israel&#8217;s cities, an assault that Israel&#8217;s Air Force foiled at the last minute before Hezbollah could cause massive destruction. Hezbollah did manage to fire more than 200 rockets into Israel and 20 suicide drones. An Israeli soldier aboard a naval vessel was killed from shrapnel from the Iron Dome missile defense system protecting Israeli civilians, but the damage to the Israeli home front was far less than Hezbollah hoped before Israel thwarted that imminent attack.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Social Media Reactions and Arab Perspectives</h3>\n\n\n\n<p>On social media, Arabs mocked Hezbollah. They noted that while Israel has targeted senior Hezbollah leaders, all Hezbollah managed to strike yesterday was a chicken coop in Israel. Many Arabs in the Middle East, including leaders and regular citizens, understand the threat of the Iranian regime and its proxy armies to regional and global security. I was interviewed just yesterday on Saudi TV, and we spoke about how Lebanese people are against Hezbollah dragging their country into a needless war, all for the sake of Hezbollah&#8217;s warlord patrons in the Islamic Republic.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Criticism of Western Diplomats and the United Nations</h3>\n\n\n\n<p>You know who doesn&#8217;t seem to understand? Top Western diplomats. The Secretary-General of the United Nations should resign immediately; his leadership is a total failure. Hezbollah, a terrorist army holding the state of Lebanon hostage, declared a war on October 8th against Israel, a democratic state and a member of the United Nations, and Antonio Guterres has remained neutral at best. In the case of Hamas, no UN Secretary-General has gone further to secure the survival of a terrorist organization, and the same is happening here.</p>\n\n\n\n<p>This is what he tweeted: &#8220;I&#8217;m deeply concerned by the increase in exchanges of fire across the Blue Line. These actions put the Lebanese and Israeli populations at risk, and they threaten regional security and stability. I call for immediate de-escalation and appeal to the parties to return to a cessation of hostilities.&#8221; De-escalation doesn&#8217;t go far enough. De-escalation takes us back to Hezbollah&#8217;s illegal presence on Israel&#8217;s border on October 6th, and an October 6th reality means a danger of another October 7th and another October 8th, when Hezbollah joined Hamas&#8217;s war. Guterres should demand the implementation of UN Security Council Resolution 1701 and publicly call on Hezbollah to back off. Guterres doesn&#8217;t call on Hezbollah to disarm. He doesn&#8217;t condemn Hezbollah for attacking Israel, as it has been doing daily since October 8th, when it joined the war Hamas started. He doesn&#8217;t call on Hezbollah to back off from the Israeli border. He doesn&#8217;t even mention Hezbollah by name. After Israel stopped Hezbollah from burning Israeli cities, he said he was deeply concerned by the increase in exchanges of fire. Excuse me? Iran&#8217;s proxy army aiming hundreds of missiles at Israeli cities—that&#8217;s concerning. Israel stopping those terrorists at the last minute—that&#8217;s a relief. Why be the leader of the United Nations if you have no interest in upholding its principles and its own resolutions?</p>\n\n\n\n<h3 class=\"wp-block-heading\">Disappointing Western Leadership Responses</h3>\n\n\n\n<p>The reaction from other Western leaders was also disappointing. The EU Foreign Policy Chief Josep Borrell rightly called for the implementation of UN Security Council Resolution 1701, but he didn&#8217;t actually say what that means. It calls on Hezbollah to disarm and back away from the border, and he didn&#8217;t mention Hezbollah by name. British Foreign Secretary David Lammy said all parties must work to prevent an escalation in conflict across the Middle East. Again, he didn&#8217;t mention Hezbollah by name, let alone condemn Hezbollah.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Media Coverage and Misrepresentation</h3>\n\n\n\n<p>Journalists also published some laughable headlines. Dominic Waghorn from Sky News published an analysis for Sky News with the headline: &#8220;Israel will say it had no choice, but its airstrikes in Lebanon risk igniting a regional war.&#8221; The opposite is the case. Hezbollah&#8217;s imminent missile attack was a major escalation in the war that Hezbollah joined on October 8th. Since then, Hezbollah has fired 7,000 rockets and drones into Israel. Israel taking action against that imminent threat isn&#8217;t inflammatory; it&#8217;s putting out the flames.</p>\n\n\n\n<p>Iran&#8217;s proxy army Hezbollah is a major threat to international peace and security. The world must make it clear: Hezbollah must back off, or Israel has every right to push it away and get its people home to safety. World leaders can&#8217;t bring themselves to name Hezbollah. I think I know why. Because if they call out Hezbollah by name, if they call it an Iranian proxy army, if they call out its unprovoked aggression against Israel, they&#8217;ll be admitting there is a massive security threat that Israel has a right and obligation to address. But they don&#8217;t want to prepare their public for Israeli military action against Iran&#8217;s proxy armies, so it&#8217;s easier to try to sweep the issue under the rug. They don&#8217;t want it to be their problem, but the Islamic Republic of Iran and its proxy armies are their problem.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran&#8217;s Regional War and Israel&#8217;s Defense</h3>\n\n\n\n<p>Hezbollah itself says its real war is against the United States, and Israel is just a tool. And the world needs to wake up before it&#8217;s too late. October 7th was the opening shot of Iran&#8217;s regional war against Israel on seven fronts. Every day, Israel is fending off attacks from Iran&#8217;s proxy armies on seven fronts. Just yesterday, Israel was attacked from several directions, not just from Lebanon. Did you hear about it? Hamas fired a long-range rocket from Khan Yunis to the central Israeli city of Rishon LeZion—that&#8217;s 50 miles. Luckily, the rocket struck an empty field, but the boom was heard throughout Tel Aviv. The IDF targeted the launcher in Gaza. There were secondary explosions after the IDF strike, which means that there were even more rockets hidden in the area. Israel is breaking Hamas on the battlefield, but Hamas continues to fight the war it started on October 7th when it invaded Israel by air, land, and sea, when it sadistically massacred 1,200 Israelis, and when it ripped 251 hostages from their families, throwing them in the terror dungeons. They&#8217;re still holding 109 hostages, including a baby. Also yesterday, the IDF intercepted a suicide drone from Syria. Earlier yesterday, Iran-backed militias in Iraq said that they launched suicide drones into Israel, and a ship is still on fire in the Red Sea from attacks by Iran&#8217;s Islamic pirates, the Houthis. Do you see a pattern here? Iran has established a ring of fire around Israel on seven fronts: Gaza, the West Bank, Lebanon, Syria, Iraq, Yemen, and Iran itself—eight, including attacks on Jews in the diaspora. Everyone who cares about the future of humanity, the future of peace, the future of security, should stand up with Israel as it stands up to Iran&#8217;s aggression. Iran wants to light the Middle East on fire and watch it burn. Everyone needs to do their part to put out the fires. That&#8217;s what Israel is doing.</p>\n\n\n\n<p>Tell the truth about the Iranian regime. Tell your leaders to tell the truth about the Iranian regime. Call out those bad actors by name. Stand up to anyone who cannot tell simple truths about the barbaric enemies that Israel faces. The future of humanity is at stake.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section</h3>\n\n\n\n<p><strong>Alon:</strong> This is a very common question on our Instagram stories. People are responding and asking: <em>Can you please explain the issues that are holding up the hostage negotiations?</em></p>\n\n\n\n<p><strong>Answer:</strong> Hamas took hostages on October 7th, and Hamas does not want to give them back. Hamas wants the war that it started on October 7th to go on and on and on, because the human suffering in Gaza isn&#8217;t a problem for Hamas; it&#8217;s an advantage for Hamas. The more people suffer, the more international pressure there is on Israel to leave Hamas alone and let it survive the war that it started. That is all Hamas has in its arsenal now that Israel has nearly demolished its military: to spread lies and to cause suffering to get pressure on Israel to let Hamas survive this war. Israel wants to get the hostages back today and needs to make sure Hamas cannot take more hostages back tomorrow. And so, there are several sticking points to Israel simply accepting the terms that Hamas is demanding.</p>\n\n\n\n<p>Here&#8217;s one: the Philadelphia Corridor. That&#8217;s the border between Gaza and Egypt. Hamas has used that to smuggle weapons into Gaza—the weapons it used for the October 7th massacre, the missiles that it continues to shoot at Israeli cities. Israel wants this war to end with Hamas not able to smuggle the weapons for the next war. Hamas wants this war to end able to smuggle the weapons for the next war. That&#8217;s why Israel is demanding it must remain on the border to prevent Hamas from smuggling weapons, and Hamas is demanding that Israel leave because it says it will do October 7th again and again. And it needs the weapons for it. The Philadelphia Corridor is a lifeline for Hamas, and it&#8217;s a deathline for Israeli and Palestinian civilians. For Hamas, the only acceptable ceasefire is one in which Israel ceases firing so that Hamas can continue plotting to set more Israeli families on fire.</p>\n\n\n\n<p>We need massive international pressure on Hamas to let the hostages go now. We shouldn&#8217;t normalize the fact that Israel is supposed to negotiate with a terrorist army to get back a baby—a baby, for God&#8217;s sake—K. Bibas, who is still being held hostage. That is not normal behavior. The mediators have put a deal on the table. It&#8217;s a bad deal, but Israel has said yes because we need to get the hostages home. Hamas is stalling because it wants this war to go on. Tell your leaders to put pressure on Hamas and its backers—Qatar, Turkey, and Iran—to let them go now.</p>\n\n\n\n<p><strong>Alon:</strong> There was recently a New York Times report about the search for Hamas leader Yahya Sinwar, and a lot of people on our social media are asking questions. <em>There was an article about how he may be moving around dressed as a woman. Can you shed some light on the challenges of the search for Hamas leader Sinwar and what it means if he is removed from the battlefield?</em></p>\n\n\n\n<p><strong>Answer:</strong> Yes, I saw those reports that Yahya Sinwar is moving around dressed as a woman, which would certainly explain the support from the Queers for Palestine movement. But jokes aside, Yahya Sinwar is probably hiding in a tunnel. That tunnel is probably underneath a school, a hospital, a home, a mosque, or some other facility. Yahya Sinwar is probably surrounding himself with Israeli hostages to use as human shields. Why not? Israel got to Ismail Haniyeh; it got to Muhammad Deif; it got to Marwan Issa; it got to Salah al-Arouri. Israel has been systematically decapitating Hamas&#8217;s leadership and doing exactly what the international community has been telling it to do—the US, the UK, other allies telling it to go after the people who did this. So, Sinwar is probably hiding underground in the massive network of tunnels that Israel is trying to destroy—the massive network of tunnels that Hamas built in order to deliberately rig Gaza to make it impossible for Israel to destroy its military assets without going through civilian areas.</p>\n\n\n\n<p>This is the real point people don&#8217;t understand about Gaza. Ten months into the war, Hamas spent 16 years building a tunnel network longer than the New York subway in order to put civilians at risk, to shield its own military assets, and gain immunity for its terrorist army. And that is probably what Yahya Sinwar is doing now. I saw reports that he is demanding guarantees for his own safety, that he won&#8217;t be assassinated if a ceasefire is reached. I spoke to hostage families yesterday. They said, &#8220;What are the guarantees for our safety? We want guarantees there won&#8217;t be another October 7th while Hamas is threatening to do it again and again.&#8221; You talk about humanitarian protections. We want protections for our lives because we want to bring the hostages home. And that means home—back to the homes from which they were abducted, and they need to be able to sleep there safe and sound in their beds. And that&#8217;s why Israel is saying two things: We have to do everything to bring back the hostages, and we have to make sure that Hamas cannot take more hostages tomorrow. That means getting the hostages out, but continuing to fight until Hamas is dismantled, because otherwise, it will attempt October 7th again, as it is promising to do again and again.</p>\n\n\n\n<p><strong>Sarah on Instagram:</strong> <em>How many countries in the Middle East have openly expressed their support of Israel? Can you give some information on which countries may be in Israel&#8217;s camp, whether publicly or privately?</em></p>\n\n\n\n<p><strong>Answer:</strong> Sarah, countries in the Middle East have not been expressing their open support of Israel, but that doesn&#8217;t mean they&#8217;re not doing it behind the scenes. Publicly, Gulf countries have to put on a facade of support for the Palestinians, but they understand what Israel knows: The Islamic Republic of Iran is a threat not only to Israel but to the whole Middle East. When Israel fights Hezbollah in the north, it&#8217;s fighting a terrorist army trained and funded by the same Islamic Republic that trained and armed the Houthis in Yemen, who have been shooting rockets at Saudi Arabia and the United Arab Emirates. They want Israel to thump Hamas because they know that that kind of Islamic fundamentalism, they know that Iran&#8217;s strategy of building proxy armies is a threat to them as well. And that&#8217;s why you haven&#8217;t seen the countries that only recently normalized relations with Israel—Morocco, the UAE, and Bahrain—cut off relations. It hasn&#8217;t happened because they&#8217;re secretly rooting for Israel. They know that Hamas is an enemy not just of Israel, but an enemy of humanity. And so is the Islamic Republic of Iran.</p>\n\n\n\n<p><strong>GTI asks:</strong> <em>How confident is the IDF that they have shut down supply from Egypt?</em></p>\n\n\n\n<p><strong>Answer:</strong> The IDF is still working to shut down the Philadelphia Corridor. We&#8217;re talking about a long border between Gaza and Egypt in which, at the last count I saw, over 150 tunnels have been discovered, and it&#8217;s going to take time to make sure that that border is sealed hermetically. But the real question is: How do we make sure that it remains sealed? Because if this war ends with Israel forced to withdraw from the Philadelphia Corridor, Hamas will continue smuggling weapons into the Gaza Strip. It will aim those weapons at Israel, and at a time of its choosing, it will shoot those weapons or use them to stage another invasion like it did on October 7th. And that&#8217;s why it&#8217;s so important that this war end, and that it end in a way that makes sure Hamas cannot restart it.</p>\n\n\n\n<p><strong>Sammy on YouTube:</strong> <em>When is the Citizen Spokeskid going to start giving live briefings?</em></p>\n\n\n\n<p><strong>Answer:</strong> The Citizen Spokeskid, Ben Carasso, has already recorded his first reel, and I encourage everyone to follow us on all social media platforms—on Instagram, on Twitter, on LinkedIn, on YouTube, everywhere—and you will see his first briefing about the threat that the Hamas child abuser regime poses to children inside Gaza. I recommend following in order to catch that. As for live briefings, I don&#8217;t know—maybe he needs a little bit more training. But the Citizen Spokesdog, Simha, is also training to give his first live briefing.</p>\n\n\n\n<p><strong>Conclusion</strong> Thank you very much for watching. Like and subscribe on whatever platform you&#8217;re not currently on. If you&#8217;re on Instagram, go follow us on Twitter and vice versa. Citizen Spokesman Daniel Paul Rumstein will be back tomorrow at briefing 3:00 PM Israel time, 8:00 AM Eastern. Thank you very much, everyone, and keep safe.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The October 7th War continues, with <a  href=\"/hezbollah\">Hezbollah</a> launching attacks on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>, which were largely thwarted by the IDF. Criticism arises over the weak international response, particularly from <a  href=\"https://iron-swords.co.il/t/the-un/\">the UN</a> and Western leaders, who fail to condemn <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>. The conflict underscores <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s regional aggression and the need for global support for Israel.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-16527",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 16527
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16527",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=16527"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16527/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16528,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16527/revisions/16528"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=16527"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=16527"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=16527"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}