{
    "id": 15516,
    "date": "2024-08-21T15:00:00",
    "date_gmt": "2024-08-21T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=15516"
    },
    "modified": "2024-08-23T19:07:03",
    "modified_gmt": "2024-08-23T16:07:03",
    "slug": "time-for-global-pressure-on-hamas-to-let-them-go-now-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/time-for-global-pressure-on-hamas-to-let-them-go-now-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "Time for Global Pressure on Hamas to Let Them Go Now | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Time for Global Pressure on Hamas to Let Them Go Now | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/mC02TQZvxVo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Now today is day 320 of the October 7th war and Hamas hostage crisis. Israel said yes to the deal, and Hamas said no to the deal. It&#8217;s time for massive international pressure on Hamas to let them go. Hamas is still saying no to releasing hostages and ending this war, but it is saying yes to another October 7th massacre given the opportunity again and again and again, as they promised. Just yesterday, we got explicit proof of this fact with Hamas publishing a letter to Hezbollah in which they state, and I quote, &#8220;We are winning, and it&#8217;s time to finish off the Zionist regime.&#8221;</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Hamas’ Intentions and Actions</strong></h2>\n\n\n\n<p>Hamas doesn&#8217;t want to end its war against the people of Israel. Hamas wants to expand it together with the other Iranian-backed terrorist armies, and Hamas is waging a forever war against Israel. The world must pressure Hamas to stop, to say yes to the mediators&#8217; deal, and to put this nightmare behind all of us because right now, Hamas has no reason to say yes. To put it frankly and in numbers, Israel has killed more than 17,000 Hamas murderers, destroyed 22 of 24 battalions, and killed three out of five commanders, more than 20 battalion commanders, and approximately 150 company commanders. Hamas leader Ismail Haniyeh was killed, and Israel killed Hamas&#8217;s military head, Muhammad Deif. Hamas now cannot send a barrage of rockets—thousands of deadly rockets, we should specify—into Israel, and Hamas cannot make new rockets in facilities inside the Gaza Strip. Hamas cannot smuggle weapons into the strip from Egypt, and Hamas can no longer invade Israel. By all these metrics and more, we can see that Hamas is losing on the battlefield, but that doesn&#8217;t change reality on the ground because it wants to drag out the war because it thinks the global pressure will eventually force Israel to leave it in power. That is why it plays these desperation moves and these desperation games because it thinks that backed into a corner, it is in power. Hamas thinks the global pressure will allow it to rebuild, to rearm, and to do another October 7th again and again, as explicitly promised.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Hamas&#8217; Terms for Ceasefire and Global Response</strong></h2>\n\n\n\n<p>So, for Hamas, the only acceptable ceasefire is one where Israel ceases dismantling Hamas while Hamas prepares to keep firing at the people of Israel. U.S. officials are telling media, &#8220;We don&#8217;t know if Sinwar even wants this deal.&#8221; Israel agreed to a deal, a bad deal, but one that gets surviving hostages back to their homes in Israel, which is the most important factor right now. Whereas Hamas only agrees to a deal where they keep the hostages to keep using them as leverage and continue planning attacks on the hostages&#8217; homes here in Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Israel&#8217;s Discovery and Humanitarian Zones</strong></h2>\n\n\n\n<p>Israel retrieved the body of six hostages killed in Hamas captivity. Those six dead hostages were found in a tunnel under the humanitarian zone—just to make that clear, under the humanitarian zone. Israel creates these humanitarian zones, and then Hamas uses them for very inhumane acts. Hamas uses anywhere Israel isn&#8217;t located in order to fire rockets, to launch attacks, and most importantly, to imprison innocent hostages. The reason that Israel makes these safe zones is to try and protect Gazan civilians from their own leaders, Hamas. But Hamas makes unsafe zones by intentionally firing from inside the designated safe zones because it serves Hamas&#8217;s interests to have Gazans die. Israel designated humanitarian zones where civilians could move out of Hamas strongholds in order to be in safety, but it never designated a safe zone for Hamas to abuse hostages or fire on Israel with impunity.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Israel&#8217;s Desire for Peace and the Necessity of the 3Ds</strong></h2>\n\n\n\n<p>Israel wants peace. Israel wants a ceasefire, and Israel wants a resolution to this war. But October 7th proved there can be no peace with the Hamas terror regime still in power. The displaced families must go back to their homes. They can&#8217;t do that if Hamas is still their neighbor. That&#8217;s why we circle back around to the most important part of this, that we need the 3Ds: We need to destroy Hamas, we need to demilitarize Gaza, and we need to deradicalize Palestinian society after 17 years of radicalization and incitement at the hands of Hamas.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>International Call to Action Against Hamas</strong></h2>\n\n\n\n<p>Now, in the meantime, the world must tell Hamas and its backers in Qatar, Turkey, and Iran that the time is up, and you must let them go now. No, we won&#8217;t let you prepare for another October 7th, and if you don&#8217;t let them go, we stand with Israel as it fights to free the hostages.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Hezbollah’s Continued Aggression</strong></h2>\n\n\n\n<p>Now, elsewhere, Hezbollah is continuing to target civilians. Iran&#8217;s proxy army in Lebanon fired 50 rockets into Israel just today—so far, more may still be coming. These rockets were fired straight at the town of Katzrin in the Golan Heights. Hezbollah fired hundreds of rockets into Israel just this week, and Hezbollah today destroyed a house in a city and hospitalized a man in his own home, while, importantly, there were no military targets nearby. Now, Hezbollah said just a few weeks ago that they were targeting civilians in Israel, and Hezbollah continues to commit war crimes again with impunity, without accountability on the international stage.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Hezbollah&#8217;s Role in the Northern Conflict</strong></h2>\n\n\n\n<p>Now, Hezbollah started the war in the North on October 8th, just one day after the October 7th massacre, in solidarity with their brethren in Hamas. Since then, they&#8217;ve launched over 7,000 rockets, missiles, and drones at Israelis. Hezbollah has murdered dozens in Israel and displaced for over 10 months 60,000 people, forcing them from their homes inside Israel. Hezbollah must back off, or Israel will have to push it away.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>International Day of Remembrance and UN&#8217;s Oversight</strong></h2>\n\n\n\n<p>Today is also the International Day of Remembrance and Tribute to the Victims of Terrorism. The UN is hosting an exhibit highlighting some of the world&#8217;s worst terror attacks, such as 9/11 and Jihadi attacks in East Africa and East Asia. Somehow completely ignored was the October 7th massacre—no mention at all of the deadliest day for the Jewish people since the Nazi Holocaust and one of the deadliest terror attacks ever, with around 1,000 people killed. The UN actually ignores any terror attack carried out against people in Israel. Palestinian terrorist groups are literal pioneers of terrorism—let&#8217;s not forget the airplane hijackings, the hostage-taking, and suicide bombers on buses and in pizzerias. This is the pioneering action of Palestinian terrorists and their ilk for decades since the foundation of the State of Israel—in fact, even before that time.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>UN Women’s Lack of Focus on Israeli Victims</strong></h2>\n\n\n\n<p>Likewise, for UN Women concerned with gender equality and women&#8217;s empowerment, women tend to be a bit less seen—in fact, even, I&#8217;d go so far as to say, unseen—when those women come from Israel. There have been multiple reports, including from UN officials, of Hamas weaponizing rape on October 7th and afterwards—documented reports that Hamas themselves documented in their own atrocious and heinous footage. But in the last nine months, UN Women posted only twice about women in Israel, while in the same time period, UN Women discussed Gazan women around 69 times. So, the next time you hear the UN say anything, remember how they erase innocent victims when those victims come from Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Question</strong>s</h2>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question from Jodi on Facebook: </strong><br><strong>What will happen to the hostages if Hamas doesn&#8217;t agree to the deal?</strong></h4>\n\n\n\n<p>Well, Jodi, thanks so much for your question, and the question of what will happen to the hostages should a deal not be achieved—well, they will continue, most certainly, to be used by Hamas as leverage, as tools in their sick game, in order to perpetuate the war, in order to perpetuate their own sick power plays, in order to retain some sense of power because that&#8217;s exactly what these human beings are to Hamas—they are not truly human beings, they are simply tools and weapons of war, leverage to be utilized against Israel and against Israeli people to show that they retain some semblance of power despite the fact that their battalions have been dismantled, their commanders killed, their weapons factories dismantled, and their capacity to rearm greatly diminished. They continue to hold on to power in whatever way they can, and the hostages are a primary tool for doing that. They hold that over Israel like a swinging Sword of Damocles in order to try and prevent any sort of action to truly dismantle this heinous terrorist army—all at the expense of the Israeli hostages and, of course, the people of Gaza, who do not get to live in any true sense of safety while their masters from Hamas rule them with an iron fist and keep those humanitarian zones that Israel designates so unsafe by continuing to operate from inside civilian infrastructure, as they&#8217;ve done so frankly for the past 17 years, but most certainly since October 7th. As to what happens in the future and what future ceasefire negotiations remain on the table, it&#8217;s hard to know exactly what can come from the next stages of ceasefire negotiations, but I will say that Israel and the Israeli people will not give up on getting those hostages home, and they will continue to fight and do whatever they can to try and bring them back, and if that means negotiating with such horrendous bad faith actors such as Hamas, well, so be it. For the time being, those hostages must be returned home, and as I&#8217;ve stressed and as we continue to stress here at the Israeli Citizen Spokesperson&#8217;s Office day in and day out, this is the most important goal—to get Israelis back home, sleeping in their beds safely at night, and the hostages returned home.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question from X on Instagram Live: </strong><br><strong>What do you make of the disruptions and violence at the DNC in Chicago, and what about Iran&#8217;s involvement?</strong></h4>\n\n\n\n<p>Well, certainly, as we&#8217;ve all seen footage coming out of the DNC there in the United States, there are those outside the proceedings who would like to turn this into a political football of Israel, you know, speaking out against Israel in this forum while the cameras are turned to the attention there in Chicago. But frankly, I want to move away from the specific partisan politics when it comes to the US and recall back the key element of the Israel-US relationship, which is that they are allies, the closest of allies. Israel and the US are allies going back to the foundation of the State of Israel. They are key partners—they are key partners of liberal democratic values who are fighting to ensure that those values are instilled, maintained, and expanded across the globe because that is the most important mission here: to fight against the sort of authoritarianism and tyranny that Israel is currently battling right now on seven fronts, and that is being funded so much in large part by Iran and their militias. So, as we&#8217;ve seen in the past, you know, we had statements from the Director of National Intelligence come out in the past, talking about the tentacles that took place on US campuses and showing how there were elements of those operations that were being supported, backed, and even, in some cases, funded by Iranian regime interests. Perhaps that might be happening again—we can&#8217;t know, we don&#8217;t have the intelligence to know that explicitly right now, but what we can know for sure and for certain is that no matter what element of the US political spectrum you come from, no matter where in the US political space you come from, it is so important to retain that relationship with Israel, a key and clear ally here in the Middle East, to espouse the sort of values that we in the Western world all value and hold so dear.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Debbie on YouTube: </strong><br><strong>What is Israel going to do about the violence taking place in the West Bank?</strong></h4>\n\n\n\n<p>Look, Israel is looking to spread largely and collectively to ensure that there is peace maintained across Israel and across all elements of territory controlled by and through Israel. The fact of the matter is we need to understand Israel has been through the sort of heinous atrocities of two intifadas in the past—they&#8217;ve seen the sort of actions that occur when violence spirals out of control, and it is so important within Israel and for the Israeli people that we focus on the key important message right now, which is to get our people returned back from the Gaza Strip, from the control of Hamas. That is a key element that we want to weigh in on and focus our message and intelligence on—that we make sure that Israel secures its borders against the seven different fronts in which they are facing threats from Iranian-backed militias all over. As we said earlier, we&#8217;ve seen the 50 rockets fired from Hezbollah just today that landed in civilian areas. These elements and so many more are critical to maintaining peace and security within the region, and we know from multiple actors that were a ceasefire deal to be agreed upon, there would likely be a significant de-escalation of tensions, at least for the short term. That is the most important thing right now, and I think that is what everyone who is interested in achieving some sort of change in this heinous status quo that so many of us have been living through for the past over 10 months now—we need to make that change, we need to see that change, we need that ceasefire to come in and help protect against that change. So, I think that&#8217;s really the goal that we need to be focused on right now in order to be able to move forward and get past the tense situation which we all find ourselves in the Middle East here in right now.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Adam on Instagram Live: </strong><br><strong>How does Israel propose deradicalizing the population in Gaza?</strong></h4>\n\n\n\n<p>Adam, it&#8217;s an important question you ask there, and, you know, frankly, the plans are being laid out, you know, incrementally and with differing ideas as to how exactly these policies can be laid out. You know, there have been particular plans that have been suggested in the past about collective organization of different Arab nations from the surrounding areas who might work together to create a sort of peacekeeping force to help maintain order and present some sort of authority there in Gaza. There are a multitude of different proposals on the table right now, and I&#8217;m not going to go through each one and detail each in specificity, but rather to say the point of the matter is that the status quo with Hamas remaining in power simply cannot be maintained. That is the key point right here. They have proven themselves to not only be the worst of bad faith actors, not only to be an absolute heinous terrorist army, but with October 7th and the promise to commit October 7th again and again, they have proven themselves a completely unsustainable neighbor in any way, shape, or form, and ones that cannot be left in power in any way lest they risk the sort of atrocities that they would commit if they had the power to truly do so. Israel has worked so hard to demilitarize the Gaza Strip, to destroy Hamas, to demilitarize the Gaza Strip, and yes, of the 3Ds, deradicalizing the Palestinian society is the sort of generational project that must be instilled. It will not be achieved today, it will not be achieved tomorrow, but it is a goal to be achieved throughout the next days, months, years, decades even. And the point is that we need good faith actors in place that can instill that sort of action. It has happened in various contexts in the past where populations have been able to move forward, move past the sort of radicalized extreme agenda that they&#8217;ve seen in the past, and achieve some sort of sense of normality and reintegration back into the wider international community. That is something that we hope for the people of Gaza in the future, but it must start with the destruction of Hamas and the disarming of the Gaza Strip so that we can move forward with that third D—the deradicalization of the Gazan society and Palestinian society as a whole. It is really so important, and that is why this is one of the key elements of the 3Ds, albeit the one with the longest time frame.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question from Instagram Live: </strong><br><strong>What is the best response to people who still accuse Israel of committing genocide?</strong></h4>\n\n\n\n<p>I think that is actually one of the most fundamentally important questions and one which I&#8217;ve been grappling with—the question of genocide—my entire life. For those who don&#8217;t know, my own grandfather, Professor Colin Tatz, was a key professor of genocide studies, operating in Australia and studying the Holocaust, the genocide of Aboriginal peoples in Australia, and so many other genocides—the Armenian Genocide and others throughout the world—throughout his entire life. So, this is a question of understanding genocide and understanding how to interpret it as something that I have actually grown up with and spent my entire life personally dealing with and understanding. But I will say quite clearly there is no doubt that right now, what Israel is doing is attempting to dismantle a terrorist organization, Hamas—a terrorist organization that operates from within civilian areas, that hides behind civilians in order to use them as human shields, and justifying their own insane actions, their own horrific and cruel actions. If we look to the actions of Israel, we can see very clearly with the humanitarian aid that continues to flow into Gaza, the Gaza Strip every single day, the designation of safe zones within Gaza in an attempt to try and separate civilians from the terrorist masters that try to control them—who do not respect those safe zones and make them, as I said earlier, unsafe zones—and the myriad other actions, not to mention the growth and flourishing of the Palestinian population inside Gaza over the last several decades. Just look at demographic charts, and you can see those numbers grow out—that this is not a genocide. That accusation is frankly ludicrous, and in fact, I would call it projection. I would call it projection from those Hamas monsters who came in on October 7th, looking to wipe out, murder, and kill any Israeli that they could in acts that can only not be called—that only isn&#8217;t called genocide because they were prevented from the true views and true actions that they would like to take. If left to their own devices, they would have cleansed their way, as they say so clearly, from the river to the sea across Israel, killing any person that got in their way, no matter who they were—innocent, military, young, old, frail, sick, ill—it wouldn&#8217;t matter to them. They would slaughter them if given the opportunity. So, I call the accusations of genocide pure projection from those who wish to commit genocide on their own if only they were given the power. Thankfully, the people of Israel, the IDF, and all our allies and supporters around the world prevent that sort of action from happening because I shudder to think what would happen if Hamas were given their way in the future, and that is why I call the accusation of genocide so utterly and completely ridiculous.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Closing Remarks</strong></h2>\n\n\n\n<p>Alright, I&#8217;d like to thank you so much for taking the time to watch us today. It is so important that we get these briefings out as far and as wide as possible, so please like, subscribe, and share. We&#8217;ll, of course, be back at the same time tomorrow—that&#8217;s 3 p.m. Israel time, 8:00 a.m. Eastern time. I&#8217;ve been As Westrop Evans, thanks for watching.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> faces continued conflict with <a  href=\"/hamas\">Hamas</a> on day 320 of the October 7th war. Despite significant losses, <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> refuses peace, using <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a> as leverage. International pressure is crucial. <a  href=\"/hezbollah\">Hezbollah</a> also escalates violence. Israel&#8217;s goals: destroy Hamas, demilitarize <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, and deradicalize Palestinian society to ensure lasting peace and security.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306
    ],
    "class_list": [
        "post-15516",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans"
    ],
    "lang": "en",
    "translations": {
        "en": 15516
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15516",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=15516"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15516/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 15517,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/15516/revisions/15517"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=15516"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=15516"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=15516"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}