{
    "id": 10826,
    "date": "2024-08-06T15:00:00",
    "date_gmt": "2024-08-06T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=10826"
    },
    "modified": "2024-08-09T22:11:40",
    "modified_gmt": "2024-08-09T19:11:40",
    "slug": "unrwa-admits-staff-joined-hamas-oct-7-massacre-daily-briefing-with-rachel-lester",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/unrwa-admits-staff-joined-hamas-oct-7-massacre-daily-briefing-with-rachel-lester/",
    "title": {
        "rendered": "UNRWA Admits: Staff Joined Hamas Oct. 7 Massacre | Daily Briefing with Rachel Lester"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"UNRWA Admits: Staff Joined Hamas Oct. 7 Massacre | Daily Briefing with Rachel Lester\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/-rqr0NgslNw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a>Today marks the 305th day of the October 7th War and the ongoing Hamas hostage crisis. The people of Israel are anxiously waiting to see if the criminal caliphate in Iran will attempt to murder their families, as they have openly announced their intentions to target civilians. Iran&#8217;s proxy army in Lebanon, Hezbollah, continues its daily attacks, having launched 7,000 rockets, missiles, and drones since October 8th. The U.S. is reportedly warning of a possible two-wave attack: one from Hezbollah and one directly from Iran and its other proxy armies in Syria, Iraq, and Yemen. Just yesterday, Iran&#8217;s proxies in Iraq attacked Americans, firing rockets at a U.S. base and seriously injuring U.S. personnel. Iran considers Israel the &#8220;little Satan,&#8221; but America is the &#8220;great Satan.&#8221; Hezbollah has clearly stated that Israel is merely a tool, and this war is actually about America. Israel&#8217;s safety is America&#8217;s safety, and Israel&#8217;s victory is America&#8217;s victory. Iran&#8217;s goal is to harm Israel in order to harm America, which is why the U.S. is preparing to support Israel if Iran attacks. Supporting Israel is crucial for global security, and the U.S. is building up an unprecedented military presence to deter any Iranian aggression, sending a clear message to Iran: don&#8217;t mess with our ally, Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">UNRWA&#8217;s Involvement in the October 7th Massacre</h3>\n\n\n\n<p>In a shocking revelation, the UN has confirmed that UNRWA staff participated in the Hamas-led October 7th Massacre, the deadliest day for Jewish people since the Nazi Holocaust. Despite initial denials and mockery of the accusations, UNRWA&#8217;s boss, Philippe Lazzarini, was forced to admit that some UNRWA staff were involved. However, Lazzarini is still covering up the full extent of UNRWA&#8217;s complicity with Hamas. He claims only nine UNRWA participants were involved, but this is based on an investigation of just 19 staff members, half of whom were found to be directly involved in the massacre. This admission must include UNRWA staff seen on video snatching Jonathan Samano&#8217;s corpse into a UN vehicle and those recorded bragging about having female captives. UNRWA staff have also been implicated in imprisoning hostages in their Gaza homes. Despite these horrific actions, Lazzarini insists that UNRWA is continuing its &#8220;life-saving&#8221; work with more neutrality than anyone else. In reality, UNRWA facilitated the most Jewish lives taken in one day since the Holocaust. Lazzarini wants your government to continue funding this Hamas front group, using taxpayer money to subsidize Hamas&#8217;s war on the Jewish state. It&#8217;s crucial that UNRWA releases the full report, not just a press release, and is fully investigated for its complicity with Hamas.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Ongoing Efforts Against Hamas</h3>\n\n\n\n<p>Meanwhile, Israel&#8217;s soldiers continue to destroy Hamas, having killed an estimated 177,000 terrorists so far, over half of Hamas&#8217;s fighting force. Key Hamas commanders like Muhammad Deif and Ismail Haniyeh have been killed, while others, like Yahya Sinwar, are hiding in the dark. Hamas&#8217;s ability to smuggle in weapons from Egypt or manufacture weapons has been severely crippled. Just yesterday, Israeli troops in combat in the Gaza Strip killed Hamas&#8217;s smuggling commander Muhammad Mahasa and 45 more terrorists. Israel vowed at the outset of the war to end Hamas&#8217;s ability to harm the people of Israel, and right now, Hamas is unable to carry out another massacre like the one on October 7th. Whatever comes next will only succeed as long as that remains true.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How You Can Help</h3>\n\n\n\n<p>For those asking how they can help, there are links to a JGiv campaign across our social media. These donations provide the support needed to keep spreading the word. You can also sign up for our email list to receive direct messages and special content without any spam.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions from Social Media</h3>\n\n\n\n<p><strong>Question from Laura on YouTube:</strong><br><em>If Hezbollah and Hamas leaders were assassinated, why are we waiting for an Iranian response?</em></p>\n\n\n\n<p><strong>Response:</strong><br>That&#8217;s a great question, Laura. The elimination of key figures like Shad Fuker in Beirut and Ishia in Iran highlights the deep connection between Hezbollah, Hamas, and Iran. Iran is the head of the snake, and its proxies like Hezbollah and Hamas are merely extensions doing its dirty work on Israel&#8217;s borders. Iran sees these assassinations as a direct threat to its leadership, which is why we are waiting for an Iranian response.</p>\n\n\n\n<p><strong>Question from Malcolm F on Instagram Live:</strong><br><em>Why does UNRWA exist if Palestinians are no longer refugees, and there is already a UN body for refugees (UNHCR)?</em></p>\n\n\n\n<p><strong>Response:</strong><br>That&#8217;s an excellent question, Malcolm. UNRWA was founded in 1948 when the Palestinian refugee crisis was a significant issue. However, the situation has changed. Palestinians in Gaza and the West Bank are no longer refugees in the traditional sense, and Hamas, not UNRWA, should be responsible for their needs. UNRWA&#8217;s continued existence is a biased decision by the UN, and given the recent revelations about its involvement in the October 7th Massacre, it&#8217;s time to reconsider its funding.</p>\n\n\n\n<p><strong>Question from Deborah Gold:</strong><br><em>What can Israel do about Iran&#8217;s nuclear capabilities?</em></p>\n\n\n\n<p><strong>Response:</strong><br>Israel has a few options, including launching a preemptive strike on Iran&#8217;s nuclear sites, though this would escalate the situation significantly. Israel&#8217;s primary responsibility right now is to weaken the terrorist armies on its borders, which are funded and directed by Iran. As Hamas and Hezbollah grow weaker, so does Iran. The question of Iran&#8217;s nuclear capabilities is one for the G7 countries, as Israel currently has its hands full.</p>\n\n\n\n<p><strong>Question from I Hagag on Instagram:</strong><br><em>Given the possibility of a wider all-out war in the Middle East, why isn&#8217;t the entire free world pressuring Lebanon and Iran with sanctions?</em></p>\n\n\n\n<p><strong>Response:</strong><br>That&#8217;s a fantastic question, and the answer lies in a lack of understanding. The free world, particularly those far from Israel, may not fully grasp the severity of the situation. They don&#8217;t understand the constant threat that Israelis face, living in bomb shelters and under the shadow of imminent attacks. If the Western world were truly paying attention, they would recognize that Iran started this conflict and that Israel is trying to end it. Sanctions on Lebanon and Iran would be a logical step, and it&#8217;s important to be politically active and urge elected officials to take action.</p>\n\n\n\n<p><strong>Question from Ramona on LinkedIn:</strong><br><em>Any thoughts on Israel&#8217;s performance in the Olympics?</em></p>\n\n\n\n<p><strong>Response:</strong><br>I&#8217;ve been too busy with reserve duty to follow the Olympics closely, but I know that Israel has won at least one gold and two silver medals, which is an incredible achievement given the circumstances. Israeli athletes are showing their strength and resilience on the world stage, and I&#8217;m excited to catch up on their performances when I have time.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you all for joining us today. We know this is an incredibly stressful time, but Israel is strong and will get through this. Join us again tomorrow at 3:00 p.m. Israel time (8:00 a.m. Eastern time), and in the meantime, stay safe.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On the 305th day of the October 7th War, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> remains under threat from <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> and its proxies. <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a>&#8216;s involvement in the <a  href=\"https://iron-swords.co.il/c/october-7th/\">October 7th Massacre</a> is confirmed, raising concerns about its funding. Israel continues to dismantle <a  href=\"/hamas\">Hamas</a>, while global support and vigilance against Iranian aggression are emphasized.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 10848,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        498
    ],
    "class_list": [
        "post-10826",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-rachel-lester"
    ],
    "lang": "en",
    "translations": {
        "en": 10826
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10826",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=10826"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10826/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 10876,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/10826/revisions/10876"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/10848"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=10826"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=10826"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=10826"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}