{
    "id": 16393,
    "date": "2024-01-01T00:00:00",
    "date_gmt": "2023-12-31T22:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/01-01-2024/"
    },
    "modified": "2024-08-27T23:39:55",
    "modified_gmt": "2024-08-27T20:39:55",
    "slug": "01-01-2024",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/aid/01-01-2024/",
    "title": {
        "rendered": "Israel Aid and Humanitarian Efforts in Gaza: Jan. 1, 2024"
    },
    "content": {
        "rendered": "<h1>Humanitarian Aid Transfer to Gaza Strip</h1>\n<p>A total of 170 trucks carrying humanitarian aid, including food, water, medical supplies, and shelter equipment were inspected and transferred to the Gaza Strip yesterday (Dec. 31). 90 trucks inspected at Nitzana crossing and transferred to the Gaza Strip via the Rafah Crossing, and 80 trucks inspected and transferred to Gaza via Kerem Shalom.</p>\n<h2>Food and Medical Supplies Delivered</h2>\n<p>4 humanitarian aid trucks carrying food have successfully delivered to known shelters in the northern Gaza Strip. On the same day, 4 tankers of cooking gas designated for the operation of essential infrastructure in Gaza, have entered the Gaza Strip. So far, 60 ambulances entered the Gaza Strip to bolster first responder capabilities. 25 ambulances were donated by Kuwait, 2 by Egypt, 2 by Qatar, and 25 by Saudi Arabia. Additionally, 24 solar panels designed for the operation of medical refrigerators by WHO entered the Gaza Strip.</p>\n<h2>Vaccines and Medical Facilities</h2>\n<p>Tens of thousands of vaccines entered the Gaza Strip. A field hospital in Rafah operated by the Red Crescent has begun treating patients. It has a capacity of 50 beds, with a personnel of 120, and includes 6 intensive care units and 3 operating rooms. Further field hospitals are in the pipeline and are expected to be operational in the coming days. Additional equipment and personnel for these field hospitals have also entered the Gaza Strip.</p>\n<h2>IDF Operational Pause for Humanitarian Aid</h2>\n<p>Today, (Jan. 1) between 10:00 and 14:00, the IDF will pause operations in the Al-Shaboura in Rafah in order to enable the movement of humanitarian aid.</p>\n<h2>Floating Hospitals Arrive</h2>\n<p>A field hospital in Rafah operated by the Red Crescent has begun treating patients. A French floating hospital has arrived at the Al-Arish port and will be docked there for a month. Gazan patients exit the Gaza Strip via the Rafah Crossing for treatment. So far, 80 patients have been treated on the ship, which is expected to leave during January 2024. Italy has also dispatched a floating hospital, which is now operational. The ship is equipped with surgery, trauma care, and other medical capabilities, with 45 patients treated so far.</p>\n<h2>Emergency Medical Efforts</h2>\n<p>60 ambulances have entered the Gaza Strip to bolster first responder capabilities. A breakdown of donations shows that 25 ambulances were donated by Kuwait, 2 by Egypt, 2 by Qatar, and 25 by Saudi Arabia.</p>\n<h2>Water Supply Initiatives</h2>\n<p>We coordinated repair work for three pumps at the UNICEF desalination plant in Deir-Albalah. This repair has reinstated the plant&#8217;s capacity to process 1,000 cubic meters per day, providing clean water for approximately 50,000 residents in the region. On Dec. 18, the first stage of implementing a water pipeline from mobile desalination facilities situated on the Egyptian side of Rafah was successfully concluded. This initiative, led by the United Arab Emirates, aims to provide clean water access to approximately 150,000 people. On Dec. 27, the second water pipeline from mobile desalination facilities situated on the Egyptian side of Rafah was successfully established.</p>\n<h2>Treatment Abroad</h2>\n<p>In coordination with Egypt, the United Arab Emirates, and Turkey, ill and wounded patients have been exiting the Gaza Strip for treatment. So far, 1,603 ill and wounded individuals, along with escorts, have exited the Gaza Strip to receive medical treatment in Egypt, the UAE, Turkey, Qatar, and Jordan.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Humanitarian aid and medical support successfully delivered to <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 15696,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        1338
    ],
    "tags": [
        1352
    ],
    "class_list": [
        "post-16393",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-aid",
        "tag-daily-humanitarian-aid-update"
    ],
    "lang": "en",
    "translations": {
        "en": 16393,
        "he": 16394,
        "ru": 16395
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16393",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=16393"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16393/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16396,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/16393/revisions/16396"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/15696"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=16393"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=16393"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=16393"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}