{
    "id": 4700,
    "date": "2023-12-03T12:50:18",
    "date_gmt": "2023-12-03T10:50:18",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8091/"
    },
    "modified": "2023-12-03T12:50:18",
    "modified_gmt": "2023-12-03T10:50:18",
    "slug": "8091",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8091/",
    "title": {
        "rendered": "&#8220;IDF and SHABAK&#8217;s Successful Joint Operation: 34 Wanted Individuals Apprehended Across West Bank and Jordan Valley&#8221;"
    },
    "content": {
        "rendered": "<p>Joint announcement from IDF (Israel Defense Forces) Spokesperson Unit and SHABAK (Israeli Shin Bet):</p>\n<p>IDF, SHABAK, and Border Guard officers apprehended 34 wanted individuals throughout the regions of Judea and Samaria (the West Bank), and the Jordan Valley Brigade last night. Eight of them are active members of the Hamas terrorist organization. A significant number of suspects were detained and investigated in two separate brigade-sized operations.</p>\n<p>In a operation conducted by the Ephraim Brigade in the village of Beit Rima, soldiers apprehended ten wanted men and also investigated other suspects. In operations taking place in the city of Qalqilya, another wanted individual was arrested. During the operation, terrorists fired at the forces and threw an explosive device at them. In addition, they threw stones at the force, which responded by firing back, hits were identified.</p>\n<p>In an operation conducted by the Etzion Brigade in the village of Sa&#8217;ir, eight wanted men were detained, a great number of suspects were investigated and terrorist funds &#8216;Haramed&#8217; (confiscated). Suspects threw stones and shot fireworks at the forces, who returned fire. Hits were identified.</p>\n<p>In the city of Hebron, forces arrested two wanted individuals, and confiscated knuckles, shockers and drones. In addition, ammunition was confiscated in the village of Az Zuwaydīn, and four wanted individuals were arrested in the village of Kalkas, where a hunting rifle was &#8216;Haramed&#8217; (confiscated).</p>\n<p>In an operation conducted by soldiers in Jenin, another wanted individual was arrested. Armed individuals fired at the forces and threw an explosive device at them, the force responded by firing back. In the city of Jericho, which is in the Jordan Valley Brigade area of operations, soldiers arrested two sought-after individuals.</p>\n<p>In operations conducted by forces in Nablus, parts of weapons were located. Armed individuals fired and threw an explosive device at the forces. In operations conducted yesterday in the Beitot villages, soldiers found and &#8216;Haramed&#8217; (confiscated) a weapon&#8217;s manufacturing lathe.</p>\n<p>The wanted men who were arrested have been handed over for further investigation by security forces; no injuries were reported among our forces.</p>\n<p>Attached is a photo of the weapon &#8216;Haramed&#8217; (confiscated) in the Kalkas village and the lathe found in Beitot: https://IDFANC.activetrail.biz/ANC03122023.02589</p>\n<p>Since the start of the war, approximately 2,100 wanted men have been arrested across the Judea and Samaria Division, and the Jordan Valley Brigade. About 1,100 of them are affiliated with the Hamas terrorist organization.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Joint announcement from IDF (<a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> Defense Forces) Spokesperson Unit and SHABAK (Israeli Shin Bet): IDF, SHABAK, and Border Guard officers apprehended 34 wanted individuals throughout the regions of Judea and Samaria (the West Bank), and the Jordan Valley Brigade last night. Eight of them are active members of the <a  href=\"/hamas\">Hamas</a> terrorist organization. A significant number of suspects were detained and investigated in two separate brigade-sized operations. In a operation conducted by the Ephraim Brigade in the village of Beit Rima, soldiers apprehended ten wanted men and also investigated other suspects. In operations taking place in the city of Qalqilya, another</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4700",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4700
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4700",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4700"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4700/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4700"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4700"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4700"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}