{
    "id": 4689,
    "date": "2023-12-04T10:37:54",
    "date_gmt": "2023-12-04T08:37:54",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8102/"
    },
    "modified": "2023-12-04T10:37:54",
    "modified_gmt": "2023-12-04T08:37:54",
    "slug": "8102",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8102/",
    "title": {
        "rendered": "&#8220;Successful Counter-Terror Operations: IDF and Shin Bet Thwart Terrorist Cells, Arrest Numerous Suspects in Judea and Samaria&#8221;"
    },
    "content": {
        "rendered": "<p>Joint message from the IDF Spokesperson and the Shin Bet Spokespersons:</p>\n<p>As part of extensive counter-terrorist activities in Judea and Samaria overnight, a cell of terrorists who fired at our forces in the city of Qalqilya was thwarted, and the terrorist who shot at an IDF fighter yesterday in Silat al-Dahr in Samaria was arrested.</p>\n<p>Soldiers of the IDF, the Shin Bet, and Border Police arrested 29 wanted individuals last night and seized about ten weapons across Judea and Samaria and the Jordan Valley and the Valleys Brigade. Five of the detainees are members of the Hamas terrorist organization.</p>\n<p>In an operation of the Ephraim Brigade in the city of Qalqilya, soldiers of the Gideonites Unit (33), IDF reserve soldiers, and Border Police under the direction of the Shin Bet thwarted a cell of terrorists who have shot at our forces several times in the city of Qalqilya.<br />\nDuring the operation, the forces pursued the wanted individuals, resulting in an exchange of fire in which two terrorists were killed and others were injured.<br />\nAmong the terrorists killed was Allah Nazal, the cell leader, aged 29 from Qalqilya, who recently carried out several shooting attacks and received funding for his activities from foreign terrorist command centers.<br />\nThe forces seized a handgun, an M-16 type firearm, and magazines used by the terrorists from their vehicle.</p>\n<p>In addition, the forces operated last night in a brigade-level operation in Samaria in the village of Silat al-Dahr after an IDF soldier was lightly injured yesterday when armed individuals fired and hurled an explosive device at forces during a proactive operation in the village. During the operation, two wanted individuals were arrested, including the suspect who injured the soldier. The forces found hunting firearms, a Carlo rifle, ammunition, and a bag with explosives.</p>\n<p>During extensive counter-terrorist activities in the city of Jenin in the Menashe Brigade, the soldiers arrested six wanted individuals. During the operation, armed individuals fired and hurled explosives at the forces who responded with gunfire.</p>\n<p>In extensive counter-terrorist activities in the villages of Silwad, Jifna, and the Jilazun refugee camp in the Binyamin Brigade, many weapons were found including a drone, lasers, two hunting rifles, and ammunition. In a brigade operation in the Etzion Brigade, nine wanted individuals were arrested.</p>\n<p>Additionally, during proactive IDF and Shin Bet operations in the villages of Tilt and Ezon in the Ephraim Brigade, three Carlo firearms and improvised mortars used by the terrorists for the November 19 shooting attack on Highway 5 were seized.</p>\n<p>The arrested wanted individuals have been transferred for further investigation by the security forces. There were no casualties to our forces.</p>\n<p>Attached are pictures of the seized weaponry: https://IDFANC.activetrail.biz/ANC1204202326514</p>\n<p>So far, since the beginning of the war, about 2,150 wanted individuals have been arrested across the Judea and Samaria Division and the Jordan Valley and the Valleys Brigade, about 1,100 of them are associated with the Hamas terrorist organization.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Joint message from the <a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a> and the Shin Bet Spokespersons: As part of extensive counter-terrorist activities in Judea and Samaria overnight, a cell of terrorists who fired at our forces in the city of Qalqilya was thwarted, and the terrorist who shot at an IDF fighter yesterday in Silat al-Dahr in Samaria was arrested. Soldiers of the IDF, the Shin Bet, and Border Police arrested 29 wanted individuals last night and seized about ten weapons across Judea and Samaria and the Jordan Valley and the Valleys Brigade. Five of the detainees are members of the <a  href=\"/hamas\">Hamas</a> terrorist organization. In</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4689",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4689
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4689",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4689"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4689/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4689"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4689"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4689"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}