{
    "id": 4659,
    "date": "2023-12-06T12:03:04",
    "date_gmt": "2023-12-06T10:03:04",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8133/"
    },
    "modified": "2023-12-06T12:03:04",
    "modified_gmt": "2023-12-06T10:03:04",
    "slug": "8133",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8133/",
    "title": {
        "rendered": "&#8220;Decisive IDF Operation: Crackdown on Bomb-Making Workshops, Arrest of Terror Suspects &#038; Seizure of War Weapons in Jenin Refugee Camp&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>At the conclusion of operations held during the day at the Jenin refugee camp in the Menashe Brigade; IDF forces, the Shin Bet, and Border Police destroyed workshops for bomb-making and underground tunnels, arrested ten suspects, and located numerous weapons and means of war. </p>\n<p>An operational mission in the Menashe Brigade concluded tonight, with reserve soldiers of the brigade, &#8220;Duvdevan&#8221; reserve combatants, LOTAR, and Border Police, under the direction of the Shin Bet, which began yesterday (Tuesday) in the afternoon at the Jenin refugee camp. The forces arrested ten suspects involved in terrorist activities, located and destroyed two underground tunnels, and three bomb factories containing multiple bombs.</p>\n<p>Searching for war weaponry, the forces located and seized ten weapons, dozens of homemade bombs, thousands of shekels of terror money, ammunition, and military equipment.</p>\n<p>Additionally, during these operations, exchanges of fire took place and bombs were thrown at the forces who responded with gunfire, casualties were identified. Also, an IDF soldier was lightly injured and transported for medical treatment in a hospital, his family has been updated.</p>\n<p>Furthermore, 16 suspects have been arrested overnight throughout Judea and Samaria, three of them affiliated with the Hamas terrorist organization. In the village of Shoqba and the city of Qalqilya in the Ephraim Brigade, a gun, a drone, and an ax were found.<br />\nIn the village of Tamun, terrorists fired and threw bombs at the forces, who responded with gunfire, casualties were identified.<br />\nIn the village of Halhul in the Etzion Brigade, a print shop that printed Hamas terrorist organization’s incitement material was closed.</p>\n<p>The arrested suspects and seized war materials were transferred for further handling by security forces.</p>\n<p>Attached are photos of the means of reported warfare and during the operation and the night throughout Judea and Samaria: https://ISFANC.activetrail.biz/ANC06120232365</p>\n<p>Attached is documentation of the seized warfare: https://bit.ly/4aaDRaK</p>\n<p>Attached are photos of the bombs and the underground tunnels that were destroyed: https://ISFANC.activetrail.biz/ANC120620231514</p>\n<p>Attached are photos from situation assessment held during operations by the Central Command Chief Yehuda Fox, together with the Commander of the Judea and Samaria Division, Brigadier General Avi Blot and the Commander of the Menashe Brigade, Lieutenant Colonel Ayub Kayuf: https://ISFANC.activetrail.biz/ANC051202032654</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: At the conclusion of operations held during the day at the Jenin refugee camp in the Menashe Brigade; IDF forces, the Shin Bet, and Border Police destroyed workshops for bomb-making and underground tunnels, arrested ten suspects, and located numerous weapons and means of war. An operational mission in the Menashe Brigade concluded tonight, with reserve soldiers of the brigade, &#8220;Duvdevan&#8221; reserve combatants, LOTAR, and Border Police, under the direction of the Shin Bet, which began yesterday (Tuesday) in the afternoon at the Jenin refugee camp. The forces arrested ten suspects involved in terrorist activities, located and destroyed two</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4659",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4659
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4659",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4659"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4659/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4659"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4659"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4659"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}