{
    "id": 4624,
    "date": "2023-12-08T12:46:45",
    "date_gmt": "2023-12-08T10:46:45",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8168/"
    },
    "modified": "2023-12-08T12:46:45",
    "modified_gmt": "2023-12-08T10:46:45",
    "slug": "8168",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8168/",
    "title": {
        "rendered": "&#8220;Crushing Terror: IDF and Shin Bet Arrest Top Hamas Activists Amidst Sweeping Anti-Terror Operations in Judea, Samaria, and Jordan Valley&#8221;"
    },
    "content": {
        "rendered": "<p>Joint message for the IDF spokesperson and the Shin Bet spokespersons:</p>\n<p>IDF, Shin Bet and Border Police fighters have arrested five wanted individuals throughout the Judea and Samaria Division and the Jordian Valley Brigade, among them two activists from the Hamas terrorist organization; the suspected terrorist involved in a shooting from which an IDF soldier was wounded was arrested in the village of Silet al-Dhahr.</p>\n<p>In a joint operation by Shin Bet and IDF forces against terror targets in the Jordan Valley Brigade, two wanted residents of Far&#8217;a refugee camp were arrested &#8211; Moaad Abdallah, born 1990, a prominent formerly incarcerated terror activist, and Moa&#8217;ataz Al-Jawad, born 1998, a prominent terror activist, formerly incarcerated due to involvement in a shooting attack. During exchanges of fire with our forces, several terrorists were killed, including Braa Amir and Omar Subuh &#8211; both armed and involved in terror activities against our forces. On the eliminated terrorists, two M-16 guns were located.</p>\n<p>During operations in the village of Silet al-Dhahr, a terrorist, suspected of involvement in shooting at forces on December 3, 2023, from which an IDF soldier was wounded, was apprehended due to Shin Bet intelligence. In addition, during the operation, a &#8220;Carlo&#8221; type weapon was located and confiscated.</p>\n<p>In operations in the village Romana in the Menashe Brigade, reserve force fighters operated and confiscated a &#8220;Shotgun&#8221; type gun, ammunition and military equipment. In the village of Abu Snina in the Judea Brigade, a &#8220;Carlo&#8221; type weapon, ammunition and incitement materials were confiscated.</p>\n<p>In the village of El Hadar, reserve force fighters confiscated rockets. During the operation, the suspects threw stones and blocks at the forces, who responded with fire. A hit was identified. In the village of Rantis, the fighters located and confiscated terror funds.</p>\n<p>The arrested suspects were transferred for further investigation by security forces, there were no casualties to our forces.</p>\n<p>So far, since the beginning of the war, about 2,200 wanted individuals have been arrested throughout the Judea and Samaria Division and the Jordan Valley Brigade, approximately 1,175 of them are affiliated with the Hamas terrorist organization.</p>\n<p>Photos of confiscated warfare means are attached: https://IDFANC.activetrail.biz/ANC08122023.02154.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Joint message for the <a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a> and the Shin Bet spokespersons: IDF, Shin Bet and Border Police fighters have arrested five wanted individuals throughout the <a  href=\"https://iron-swords.co.il/t/judea-and-samaria-division/\">Judea and Samaria Division</a> and the Jordian Valley Brigade, among them two activists from the <a  href=\"/hamas\">Hamas</a> terrorist organization; the suspected terrorist involved in a shooting from which an IDF soldier was wounded was arrested in the village of Silet al-Dhahr. In a joint operation by Shin Bet and IDF forces against terror targets in the Jordan Valley Brigade, two wanted residents of Far&#8217;a refugee camp were arrested &#8211; Moaad Abdallah, born 1990, a prominent formerly</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4624",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4624
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4624",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4624"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4624/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4624"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4624"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4624"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}