{
    "id": 4572,
    "date": "2023-12-11T19:59:19",
    "date_gmt": "2023-12-11T17:59:19",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8221/"
    },
    "modified": "2023-12-11T19:59:19",
    "modified_gmt": "2023-12-11T17:59:19",
    "slug": "8221",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8221/",
    "title": {
        "rendered": "&#8220;Intensifying Achievements in Gaza: An Exclusive Insight from IDF Chief and Shin Bet Head&#8221;"
    },
    "content": {
        "rendered": "<p>IDF spokesperson:</p>\n<p>The IDF Chief of Staff and the head of the Shin Bet in Khan Younis</p>\n<p>The IDF Chief of Staff: &#8220;We are intensifying achievements in the northern strip, in the south and under the ground.&#8221;</p>\n<p>The head of the Shin Bet: &#8220;I am glad to meet here in the streets of Khan Younis, coordinators and our soldiers who work with you together. There is no power that can withstand this combination.&#8221;</p>\n<p>The IDF Chief of Staff and the head of the Shin Bet held a situation assessment today (Monday) in the Gaza Strip with the Southern Command commander, the Brigade 98 commander, and the Command HQ chief.</p>\n<p>Attached is documentation of the situation assessment: https://bit.ly/3Toa9ZF</p>\n<p>Attached is documentation on the subject: https://bit.ly/3GzpDCF</p>\n<p>Attached are pictures on the subject: https://IDFANC.activetrail.biz/ANC3654</p>\n<p>Attached are the full words of the IDF Chief of Staff: &#8220;There is a lot of pressure here, I think this surrender, people coming out and raising their hands is also a breaking of the spirit, it also accelerates the achievements, in the end we want to move quickly. We also are intensifying the achievement in the north strip, the entrance in the south strip, and also dig deep under the ground &#8211; all these places, all these depths, are very important for the benefit of the achievement. The main method is really the combination &#8211; both of the Combat Engineers, the Armored Corps Engineering together here on the ground, your connection to intelligence, Shin Bet and AMAN, and indeed the physical presence here I meet it with all the power very very important, all the time to test the intelligence we have, HQ chiefs, translate it best into action, and of course the connection to the Air Force which is very significant. I tell here to the entire forum, pass this also to people, you each return after this to your home, to your place, the pace of the entrance and the progress of the entrance is very impressive, I tell you also in historical terms, with a defense system ready and waiting and all, the presence here in a built-up complex area is very very impressive, and now to dismantle piece by piece by piece. Happy Hanukkah.&#8221;</p>\n<p>Attached are the full words of the head of the Shin Bet: &#8220;I am glad to meet here in the streets of Khan Younis, both coordinators and our fighters who work with you together, I think what was presented here about the connection of intelligence and fire at very very fast pace, both things that we decipher and come here, and also things that really come at the speed of light or sound more precisely, also save lives, also bring results, also bring commanders and so breaks the enemy. I think this is a war of results, I think what is special about this war is that it needs to be broad in order to undermine operational and executive infrastructures, but also very very focused in order to get to our citizens and take them out, I think there is no power that can withstand this combination.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a>: The IDF Chief of Staff and the head of the Shin Bet in Khan Younis The IDF Chief of Staff: &#8220;We are intensifying achievements in the northern strip, in the south and under the ground.&#8221; The head of the Shin Bet: &#8220;I am glad to meet here in the streets of Khan Younis, coordinators and our soldiers who work with you together. There is no power that can withstand this combination.&#8221; The IDF Chief of Staff and the head of the Shin Bet held a situation assessment today (Monday) in the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip with the Southern Command commander,</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4572",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4572
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4572",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4572"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4572/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4572"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4572"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4572"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}