{
    "id": 4549,
    "date": "2023-12-13T13:38:04",
    "date_gmt": "2023-12-13T11:38:04",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8244/"
    },
    "modified": "2023-12-13T13:38:04",
    "modified_gmt": "2023-12-13T11:38:04",
    "slug": "8244",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8244/",
    "title": {
        "rendered": "&#8220;30-Hour Counter-Terror Operation: IDF and Shin Bet&#8217;s Massive Search, Arrests, and Weapon Seizure in Jenin Refugee Camp&#8221;"
    },
    "content": {
        "rendered": "<p>Joint message to the IDF spokesperson and Shin Bet spokespersons:</p>\n<p>Activity spanning over 30 hours: IDF, Shin Bet, and Border Police forces are operating in the refugee camp in Jenin in the Menashe Sector; so far, the forces have searched over 400 buildings, detained hundreds of suspects, confiscated weapons and ammunition, and destroyed multiple explosive devices and terrorist infrastructures.</p>\n<p>IDF, Shin Bet, and Border Police forces were active throughout Judea and Samaria last night and arrested 17 wanted terrorists, 7 of whom are affiliated with the Hamas terrorist organization.</p>\n<p>In an operation lasting over 30 hours, IDF reserve soldiers, undercover Border Police units from Judea and Samaria, and sappers guided by Shin Bet and the Israeli Police, have been working to thwart terror under the command of the Menashe Brigade in the Jenin refugee camp.</p>\n<p>So far, during the operation, the forces have searched hundreds of buildings and detained hundreds of suspects for investigation. About 30 weapons, a large quantity of ammunition, military equipment, and many weapon parts were confiscated. Additionally, six bomb-making laboratories, several underground tunnels in the camp area, four observation posts, and many explosive devices found during searches were destroyed.</p>\n<p>The forces are continuing their operations at this time.</p>\n<p>In additional activity in the Al-Amari refugee camp in the Benjamin Sector, a Kalashnikov rifle was confiscated. In the village of Rahima, a wanted individual was arrested, a pistol was found, and a large amount of terror funds were confiscated. During the forces&#8217; activity in the village of Beit Iba in the Samaria Sector, a pistol, ammunition, and two more pistols were found.</p>\n<p>The forces also operated in the city of Hebron, arrested four wanted persons, and found weapon parts. During an activity in the city of Qalqilya in the Ephraim Sector, a suspect threw a device at the soldiers, who responded with gunfire, resulting in a hit. In an operation to confiscate illegal vehicles in the village of Turmus Ayya, over 40 illegal vehicles were confiscated.</p>\n<p>During the operation in the Jenin refugee camp, four IDF soldiers were lightly wounded by shrapnel as a result of controlled explosions and our forces&#8217; gunfire, received medical treatment on site, and were evacuated for further treatment in a hospital. Their families were notified.</p>\n<p>The arrested suspects were handed over for further investigation by the security forces.</p>\n<p>Attached are photos of the warfare equipment confiscated in Jenin: https://IDFANC.activetrail.biz/ANC131222023.0258</p>\n<p>Attached is documentation of the soldiers&#8217; activity in Jenin and the destroyed infrastructures: https://bit.ly/489fj0p</p>\n<p>Attached are photos of the warfare equipment confiscated throughout Judea and Samaria: https://IDFANC.activetrail.biz/ANC13122023.215</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Joint message to the <a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a> and Shin Bet spokespersons: Activity spanning over 30 hours: IDF, Shin Bet, and Border Police forces are operating in the refugee camp in Jenin in the Menashe Sector; so far, the forces have searched over 400 buildings, detained hundreds of suspects, confiscated weapons and ammunition, and destroyed multiple explosive devices and terrorist infrastructures. IDF, Shin Bet, and Border Police forces were active throughout Judea and Samaria last night and arrested 17 wanted terrorists, 7 of whom are affiliated with the <a  href=\"/hamas\">Hamas</a> terrorist organization. In an operation lasting over 30 hours, IDF reserve soldiers, undercover</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4549",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4549
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4549",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4549"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4549/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4549"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4549"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4549"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}