{
    "id": 4544,
    "date": "2023-12-13T19:56:30",
    "date_gmt": "2023-12-13T17:56:30",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8249/"
    },
    "modified": "2023-12-13T19:56:30",
    "modified_gmt": "2023-12-13T17:56:30",
    "slug": "8249",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8249/",
    "title": {
        "rendered": "&#8220;Chief of Staff Honors IDF Casualties in Candlelight Ceremony: A Testament to Israeli Bravery and Spirit&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The Chief of Staff during a candle lighting ceremony with IDF casualties, referring to the incident in Saj&#8217;iyya: &#8220;The commanders who fell in battle are an expression of our spirit &#8211; commanders at the forefront, that&#8217;s how we educate in the IDF.&#8221;</p>\n<p>The Chief of Staff lit candles today (Wednesday) with IDF wounded at the &#8220;Returning to Life&#8221; rehabilitation center in Sheba, along with the director of the center, Professor Yitzhak Kreiss.</p>\n<p>Attached is footage from the Chief of Staff&#8217;s speech: https://bit.ly/3GIpPiW</p>\n<p>Attached is footage of the Chief of Staff lighting candles with Res. (Mil.) Yehiam Israel Bar Eli from Brigade 460 who was injured in combat in the Gaza Strip: https://bit.ly/3uY0UFq</p>\n<p>Pictures on the subject are attached: https://IDFANC.activetrail.biz/ANC4574576</p>\n<p>Full speech of the Chief of Staff: “Your choice to go and be in battle, that in itself is a great act of bravery. The positions and locations and actions where you were injured, that is true supreme bravery, and so I tell you, it&#8217;s not just a cliché, I really see in you the exemplary generation of Israeli society. Your courage and the courage of those who fell, who sadly we didn&#8217;t manage to get to this stage of recovery, is truly the light that pushes away the darkness, and this room is filled with a lot of light. I want you to know that I spend a lot of time among the combat forces. They look at you, they are interested in what is happening with you, they admire you, the soldiers look at you and your story in all of us, everyone and their story, inspires great pride in all of us, boundless respect for you and for what you&#8217;ve done, and much more than that, it also drives us forward to keep going and to keep doing, with a force that has both power and values that we draw from you. In spite of this, we are well aware that courage is not something you learn in school, it is also not a result of random circumstances. Courage is an expression of spirit, it is an expression of the spirit of the IDF, it is an expression of the spirit of the State of Israel, it is an expression of the spirit of the Jewish people and it is an expression of everything one brings from their upbringing, from home and from the individual as a soldier and as a commander. The soldiers and commanders who have fallen in battle are an expression of this spirit and as we all know, yesterday we experienced a difficult incident, but it is an incident in which one force enters danger and many forces and senior commanders go into the fire, into danger, with their commanders at the front, because that is how we educate in the IDF, that&#8217;s how we believe it is right to fight, that&#8217;s how we believe it is right to win. I tell you from my heart, we will accompany you throughout the journey, we will also learn from periods that perhaps we did not accompany well enough and we will be there for you. Just as you were there for the state, so shall we be for you.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The Chief of Staff during a candle lighting ceremony with IDF casualties, referring to the incident in Saj&#8217;iyya: &#8220;The commanders who fell in battle are an expression of our spirit &#8211; commanders at the forefront, that&#8217;s how we educate in the IDF.&#8221; The Chief of Staff lit candles today (Wednesday) with IDF wounded at the &#8220;Returning to Life&#8221; rehabilitation center in Sheba, along with the director of the center, Professor Yitzhak Kreiss. Attached is footage from the Chief of Staff&#8217;s speech: https://bit.ly/3GIpPiW Attached is footage of the Chief of Staff lighting candles with Res. (Mil.) Yehiam <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> Bar</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4544",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4544
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4544",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4544"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4544/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4544"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4544"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4544"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}