{
    "id": 4507,
    "date": "2023-12-16T18:56:01",
    "date_gmt": "2023-12-16T16:56:01",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8286/"
    },
    "modified": "2023-12-16T18:56:01",
    "modified_gmt": "2023-12-16T16:56:01",
    "slug": "8286",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8286/",
    "title": {
        "rendered": "&#8220;IDF Chief Takes Responsibility for Tragic Friendly Fire Incident: Steps Towards Prevention Outlined&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The Chief of Staff in the Southern Command: &#8220;The IDF, and I as its commander, are responsible for what happened, and we will do everything to prevent repetition of such incidents in the course of the fighting.&#8221;</p>\n<p>Attached is a statement by the Chief of Staff, Lieutenant General Hertzi Halevi: https://bit.ly/3TuCv4I</p>\n<p>Complete comments of the Chief of Staff: &#8220;The incident in which IDF soldiers accidentally killed Yotam Haim, Alon Shamriz and Samer Talalqa, may their memory be blessed, is a painful and tough event. The three abductees, who survived seventy scorched days, moved towards IDF soldiers and were killed by our forces. There is nothing IDF soldiers and their commanders in the Gaza Strip want more than to release the abducted alive. In this case, we failed. We identify with the deep sorrow of the families over the death of the abductees.<br />\nThe IDF, and I as its commander, are responsible for what happened, and we will do everything to prevent repetition of such incidents in the course of the fighting.<br />\nI put myself in the shoes of a fighter in Shuja&#8217;iyya, after days of hard fighting, close-range face-offs, encountering terrorists dressed in civilian clothes coming in various deceptive ways. He must be alert and ready for any threat.<br />\nA decision made in a split second can result in life or death. I think the three abductees did everything they could to make us understand &#8211; they moved without shirts so we wouldn&#8217;t suspect they were wired with explosives, and held a white cloth so we would understand.<br />\nShooting at the abductees was carried out in contradiction to the rules of engagement. It is forbidden to shoot at someone who raises a white flag and asks to surrender. But this shooting was carried out during combat and under pressure.<br />\nWe quickly and immediately completed a preliminary investigation of the incident, one that would allow us to learn lessons during the fighting and convey them to our fighting forces on the ground. We updated the families with the hard findings and published them transparently to the public. In the future there may be more cases in which abductees escape or self-evacuate during the fighting, and we bear the duty and responsibility to evacuate them alive. It is warfare that brings the opportunity to return the abductees. Our soldiers have been fighting for seventy days in Gaza and on other fronts, courageously and determinedly defending home. The complexity of our righteous war in Gaza was expressed in a single moment. We went to fight to defeat the enemy across the border and bring the abductees home. Without determined fighting, we won&#8217;t be able to bring the abductees back, and we won&#8217;t be able to restore security to the settlements. We must continue to fight courageously, without diverting our gaze from this goal.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The Chief of Staff in the Southern Command: &#8220;The IDF, and I as its commander, are responsible for what happened, and we will do everything to prevent repetition of such incidents in the course of the fighting.&#8221; Attached is a statement by the Chief of Staff, Lieutenant General Hertzi Halevi: https://bit.ly/3TuCv4I Complete comments of the Chief of Staff: &#8220;The incident in which IDF soldiers accidentally killed Yotam Haim, Alon Shamriz and Samer Talalqa, may their memory be blessed, is a painful and tough event. The three abductees, who survived seventy scorched days, moved towards IDF soldiers and were</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4507",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4507
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4507",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4507"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4507/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4507"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4507"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4507"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}