{
    "id": 4382,
    "date": "2023-12-26T08:42:28",
    "date_gmt": "2023-12-26T06:42:28",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8411/"
    },
    "modified": "2023-12-26T08:42:28",
    "modified_gmt": "2023-12-26T06:42:28",
    "slug": "8411",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8411/",
    "title": {
        "rendered": "&#8220;IDF Forces Neutralize Terror Cells, Strike Over 100 Targets in Gaza: A Comprehensive Report&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF soldiers neutralized a terrorist cell that tried to plant an explosive device near an IDF tank in the northern Strip; the forces continue to attack terror targets in the Strip from the air, sea and ground.</p>\n<p>IDF soldiers operating in the Gaza Strip, in collaboration with the Air Force and Navy, continue to attack many terror targets, terrorist cells, and military sites used by terrorist organizations. </p>\n<p>As part of the assistance to the forces operating in the area, the Air Force completed an attack flight in the southern Gaza Strip. As part of the flight, dozens of fighter jets attacked over 100 terror targets of the Hamas terror organization. Among the targets attacked were tunnel entrances, terror infrastructures of the Hamas terror organization and military sites used by the organization to harm IDF forces.</p>\n<p>Last night, forces from Brigade 261 (Armored Corps 1) encountered an armed terrorist cell in the Jabalia area that tried to plant an explosive device near an IDF tank where some of the soldiers were staying. The forces responded by attacking the terrorists and, during the battle with the cell, directed an aircraft of the Air Force to attack, with the assistance of the brigade&#8217;s fire system, killing the terrorists and destroying the military structure in which they were operating.</p>\n<p>During the last day, the fire complex of the 7th Brigade directed an Air Force aircraft that attacked and killed within minutes more than ten terrorists operating in the Khan Yunis area, near IDF forces.</p>\n<p>In another incident in the Khan Yunis area, the fire complex of the Givati Brigade identified a Hamas terrorist cell moving toward a military building of the organization where many weapons were stored. The forces directed an aircraft of the Air Force that destroyed the building and neutralized the cell.</p>\n<p>Also, as part of the sweeps carried out by the Shaked battalion from the 401 Brigade&#8217;s combat team at the military headquarters used by the PIJ terrorist organization in the Dir Al-Balah Tuffah area in the northern Gaza Strip, the forces located weapons, explosive devices, and ammunition, alongside intelligence documents and the organization&#8217;s military equipment.</p>\n<p>Attached is footage from the Air Force flight in the southern Gaza Strip: https://bit.ly/3THnWL1</p>\n<p>Attached is additional footage from IDF attacks in the Strip:  https://bit.ly/3RWck5A</p>\n<p>Attached is footage from IDF operations in the Gaza Strip: https://bit.ly/3RVkYRH</p>\n<p>Attached is footage from the neutralization of the terrorist cell that tried to plant an explosive device near an IDF tank: https://bit.ly/41IWYoj</p>\n<p>Attached is footage from the neutralization of the terrorist cell operating in Khan Yunis: https://bit.ly/3tzcab1</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF soldiers neutralized a terrorist cell that tried to plant an explosive device near an IDF tank in the northern Strip; the forces continue to attack terror targets in the Strip from the air, sea and ground. IDF soldiers operating in the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip, in collaboration with the Air Force and Navy, continue to attack many terror targets, terrorist cells, and military sites used by terrorist organizations. As part of the assistance to the forces operating in the area, the Air Force completed an attack flight in the southern Gaza Strip. As part of the flight, dozens of</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4382",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4382
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4382",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4382"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4382/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4382"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4382"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4382"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}