{
    "id": 4358,
    "date": "2023-12-28T08:42:48",
    "date_gmt": "2023-12-28T06:42:48",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8435/"
    },
    "modified": "2023-12-28T08:42:48",
    "modified_gmt": "2023-12-28T06:42:48",
    "slug": "8435",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8435/",
    "title": {
        "rendered": "&#8220;Operation Unveiled: IDF, Shin Bet, and Lahav Cyber Unit Seize Hamas Terror Funds in Judea and Samaria&#8221;"
    },
    "content": {
        "rendered": "<p>A joint message from the IDF Spokesperson, Israel Police Spokesperson, and the Shin Bet:</p>\n<p>The IDF forces, the 433 Lahav Cyber Unit, and the Shin Bet carried out an extensive operation across the Judea and Samaria Division to seize funds used for Hamas&#8217; terror; the soldiers seized millions of shekels and arrested 21 wanted individuals holding terror funds. </p>\n<p>The 433 Lahav Cyber Unit initiated a joint investigation with the IDF, Central Command, Prohibition of Capital Laundering and Terror Financing Authority, the Shin Bet, Treasury of Israel, Israel Police, and Tax Authority, against suspects from Judea and Samaria, suspected of being involved in financing the Hamas terror organization, using digital and cash money within their financial services activity.</p>\n<p>Overnight, IDF forces, Lahav 433 Cyber Unit, and the Border Police conducted a focused and joint operational activity under the guidance of the Shin Bet and the Military Intelligence Directorate, across the Judea and Samaria Division, arresting 21 wanted individuals from three major divisions &#8211; Menashe, Benjamin, and Etzion, suspected of involvement in financing the Hamas terror organization. At this time, the suspects are being investigated at the unit&#8217;s offices, and according to the findings they will be brought to a remand extension hearing at the military court in Ofer.</p>\n<p>During the operation, terror funds were found and tens of millions of shekels, coins, documents, recording systems, and telephones were seized.</p>\n<p>During the operation, an IDF aircraft attacked an armed terrorist cell in the city of Jenin, that fired at our forces and endangered them. Hits were identified in the terrorists. Furthermore, forces fired back at several locations across Judea and Samaria, where terrorists threw explosive devices, Molotov cocktails, stoned, and shot at the forces. Hits were identified.</p>\n<p>As part of the joint investigation, an order was issued by the Defense Minister today (Thursday) enabling administrative seizure of the property.</p>\n<p>Pictures from the operation are attached: https://IDFANC.activetrail.biz/ANC28122023.02154</p>\n<p>Documentation on the topic is attached: https://bit.ly/3vc9Ln3</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>A joint message from the <a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> Police Spokesperson, and the Shin Bet: The IDF forces, the 433 Lahav Cyber Unit, and the Shin Bet carried out an extensive operation across the <a  href=\"https://iron-swords.co.il/t/judea-and-samaria-division/\">Judea and Samaria Division</a> to seize funds used for <a  href=\"/hamas\">Hamas</a>&#8217; terror; the soldiers seized millions of shekels and arrested 21 wanted individuals holding terror funds. The 433 Lahav Cyber Unit initiated a joint investigation with the IDF, Central Command, Prohibition of Capital Laundering and Terror Financing Authority, the Shin Bet, Treasury of Israel, Israel Police, and Tax Authority, against suspects from Judea and Samaria, suspected of being</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4358",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4358
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4358",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4358"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4358/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4358"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4358"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4358"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}