{
    "id": 4329,
    "date": "2023-12-31T08:35:21",
    "date_gmt": "2023-12-31T06:35:21",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/8465/"
    },
    "modified": "2023-12-31T08:35:21",
    "modified_gmt": "2023-12-31T06:35:21",
    "slug": "8465",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/8465/",
    "title": {
        "rendered": "&#8220;Unveiling IDF&#8217;s Counter-Terror Operations: Dismantling Terrorist Infrastructures and Neutralizing Threats in the Gaza Strip&#8221;"
    },
    "content": {
        "rendered": "<p>IDF spokesperson:</p>\n<p>IDF forces are fighting in the Gaza Strip. Soldiers of the 14th Brigade combat team neutralized ready-to-use charges and destroyed terror infrastructures within a kindergarten. Soldiers of the 179th Brigade combat team eliminated 14 terrorists in a short time.</p>\n<p>Last night, as part of the support flights to the ground forces, Air Force planes attacked dozens of targets including military buildings, terrorist infrastructures, and a tunnel.</p>\n<p>During searches in the homes of activists, on the outskirts of Saja&#8217;iyya, a force of the 14th Brigade combat team came across a kindergarten, within which they found predetermined terror infrastructures in anticipation of IDF arrival. The force neutralized the charges and thwarted the enemy&#8217;s abilities in the area, thereby preventing damage to our forces.</p>\n<p>The combat team of the 179th brigade identified four terrorists carrying explosive charges moving towards them. An Air Force aircraft attacked and eliminated the group. About half an hour later, the forces identified four additional terrorists in the area who were also eliminated by an aerial strike. Simultaneously, a suspicious vehicle carrying terrorists heading towards our forces in the south of the city of Gaza was identified, and aircraft attacked the car, eliminating the terrorists inside.<br />\nIn addition, an Air Force fighter jet attacked a military building from which terrorists activated a charge at our forces.</p>\n<p>As part of the activities of the reserve soldiers of the 551st Brigade combat team to thwart terror threats in Beit Lahiya, the forces identified three Hamas terrorists who entered a building. With the assistance of the brigade&#8217;s fire, the force surrounded the suspects with the direction of an Air Force aircraft which attacked the terrorists.</p>\n<p>The fighters of the Bedouin Reconnaissance Battalion (585) under the command of the southern brigade acted in the south of the Strip to locate terrorist infrastructures and exposed two tunnel openings, which they destroyed in cooperation with armored and engineering forces using tanks and D9 bulldozers.</p>\n<p>Paratroopers brigade combat team fighters fighting in Khan Yunis identified three terrorists and with the guidance of an aircraft killed one of them. After that, the two remaining terrorists were identified with an RPG between two buildings and were fire tanked. </p>\n<p>Likewise, the combat team of the 7th Brigade identified three terrorists and the fighters directed an aircraft and eliminated those three terrorists in collaboration with the attack complex.</p>\n<p>Over the last day, naval forces attacked terror targets in support of the ground forces in the Strip.</p>\n<p>Attached documentation from the location of terror infrastructures in the kindergarten by the 14th Brigade combat team: https://bit.ly/3H24gdh</p>\n<p>Attached pictures of the tunnel openings exposed by the fighters of the Bedouin Reconnaissance Battalion: https://IDFANC.activetrail.biz/ANC31122023.156189198</p>\n<p>Attached documentation of IDF attacks in the Strip: https://bit.ly/3vaKGc3</p>\n<p>Attached photos of IDF ground force activities in the Strip: https://IDFANC.activetrail.biz/ANC31122023.15156189.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a>: IDF forces are fighting in the <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip. Soldiers of the 14th Brigade combat team neutralized ready-to-use charges and destroyed terror infrastructures within a kindergarten. Soldiers of the 179th Brigade combat team eliminated 14 terrorists in a short time. Last night, as part of the support flights to the ground forces, Air Force planes attacked dozens of targets including military buildings, terrorist infrastructures, and a tunnel. During searches in the homes of activists, on the outskirts of Saja&#8217;iyya, a force of the 14th Brigade combat team came across a kindergarten, within which they found predetermined terror infrastructures in</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-4329",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 4329
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4329",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4329"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4329/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4329"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4329"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4329"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}