{
    "id": 19180,
    "date": "2025-01-11T10:05:56",
    "date_gmt": "2025-01-11T08:05:56",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=19180"
    },
    "modified": "2025-01-11T10:06:27",
    "modified_gmt": "2025-01-11T08:06:27",
    "slug": "how-names-of-dissidents-are-handed-to-china",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/un/how-names-of-dissidents-are-handed-to-china/",
    "title": {
        "rendered": "The UN’s Complicity in Genocide: How Names of Dissidents Are Handed to China"
    },
    "content": {
        "rendered": "\n<p>Photo by <a href=\"https://unsplash.com/@mtenbruggencate?utm_content=creditCopyText&amp;utm_medium=referral&amp;utm_source=unsplash\">Matthew TenBruggencate</a> on <a href=\"https://unsplash.com/photos/people-sitting-on-chairs-inside-building-0HJWobhGhJs?utm_content=creditCopyText&amp;utm_medium=referral&amp;utm_source=unsplash\">Unsplash</a></p>\n\n\n\n<p>The United Nations, an institution created to safeguard human rights and prevent atrocities, has become embroiled in one of the most chilling betrayals of its principles. Evidence has surfaced that the UN systematically handed over the names of Chinese dissidents and activists to the Chinese government—knowing full well the dire consequences they would face. These actions, tantamount to complicity in ongoing genocide and severe human rights abuses, expose a level of corruption and disregard for human life that defies belief.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The Names That Signed Death Warrants</strong></h4>\n\n\n\n<p>Since at least 2006, the UN has been providing lists of attendees to China before human rights council meetings, including the names of Chinese dissidents planning to speak out against the regime’s atrocities. These individuals, many of them Weiger activists or critics of China’s human rights record, were often detained, tortured, or had their families subjected to unimaginable abuse.</p>\n\n\n\n<p>One harrowing case involves Rebiya Kadeer, a prominent Weiger activist. Despite warnings from within the UN that revealing her attendance would put her family in danger, her name was handed to Chinese authorities. Shortly after, her children were tortured. Other activists suffered similar fates: family members were detained in concentration camps, forced into televised confessions, or even killed. The evidence of these consequences is overwhelming, yet the UN continues to claim no wrongdoing.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>A Culture of Compliance and Cover-Up</strong></h4>\n\n\n\n<p>This policy of appeasement appears rooted in China’s financial influence. As the second-largest contributor to the UN budget, China exerts significant pressure to suppress dissent and manipulate the institution’s actions. Diplomats and senior managers at the UN have justified these actions as necessary to maintain smooth relations with Beijing. Critics argue that this excuse represents a callous trade-off of human lives for political convenience.</p>\n\n\n\n<p>Instead of addressing these grave concerns, the UN has gone to extreme lengths to silence whistleblowers. Emma Reilly, a former UN employee, brought this scandal to light after witnessing the organization’s complicity firsthand. For her courage, she faced relentless retaliation, including being fired, publicly defamed, and subjected to surveillance. The UN spent millions trying to silence her rather than investigate the abuses she reported.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Genocide in Xinjiang and the UN’s Silence</strong></h4>\n\n\n\n<p>This betrayal of dissidents is particularly damning when viewed alongside the ongoing genocide in Xinjiang. The Chinese government has established the largest network of concentration camps since the Holocaust, detaining over a million Weiger Muslims. Inside these camps, detainees endure forced labor, torture, sexual violence, and sterilization—all designed to destroy the Weiger people.</p>\n\n\n\n<p>Despite overwhelming evidence, including satellite imagery and survivor testimonies, the UN has remained silent. The Secretary-General and other senior officials have refused to condemn these atrocities or even acknowledge the risks they imposed by handing names to China.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The Global Implications</strong></h4>\n\n\n\n<p>The UN’s actions in this case go beyond mere negligence—they represent active complicity in genocide and crimes against humanity. By betraying dissidents and enabling a regime engaged in systematic oppression, the UN has undermined its credibility and betrayed the trust of the global community.</p>\n\n\n\n<p>This scandal raises urgent questions: Can the UN be trusted to uphold its founding principles? Who holds the organization accountable when it becomes complicit in atrocities?</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>A Call for Reform and Accountability</strong></h4>\n\n\n\n<p>The UN’s complicity in China’s human rights abuses cannot be ignored. Member states must demand accountability, transparency, and reform within the institution. Whistleblowers like Emma Reilly must be protected, not persecuted, for exposing corruption and saving lives.</p>\n\n\n\n<p>Most importantly, the global community must ensure that the UN ceases its role as an enabler of terror and genocide. Until then, it will remain a broken institution—a silent accomplice to some of the darkest crimes of the 21st century.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>UN systematically handed over the names of Chinese dissidents and activists to the Chinese government—knowing full well the dire consequences they would face</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 19181,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1700,
        "footnotes": ""
    },
    "categories": [
        1700
    ],
    "tags": [
        1750
    ],
    "class_list": [
        "post-19180",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-un",
        "tag-un-whistleblower"
    ],
    "lang": "en",
    "translations": {
        "en": 19180
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19180",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=19180"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19180/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 19183,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19180/revisions/19183"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/19181"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=19180"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=19180"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=19180"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}