{
    "id": 19155,
    "date": "2025-01-04T23:31:56",
    "date_gmt": "2025-01-04T21:31:56",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=19155"
    },
    "modified": "2025-01-04T23:32:02",
    "modified_gmt": "2025-01-04T21:32:02",
    "slug": "top-6-hamas-torture-and-physical-abuse-methods",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/top-6-hamas-torture-and-physical-abuse-methods/",
    "title": {
        "rendered": "Top 6 Hamas Torture and Physical Abuse methods"
    },
    "content": {
        "rendered": "\n<p>The barbarity unleashed by Hamas in their Gaza dungeons is so grotesque, so depraved, it stretches the limits of human comprehension. The Israeli Ministry of Health’s damning report doesn’t just reveal torture—it describes a methodical, sadistic campaign to annihilate the dignity and humanity of the hostages.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Branding Children Like Cattle</h4>\n\n\n\n<p>Let’s start with the sickening branding—a level of depravity so grotesque it defies comprehension. Several children were <strong>deliberately burned</strong> on their lower limbs with heated objects, as though their captors took pleasure in branding human beings like livestock. These weren’t accidents or collateral damage. This was <strong>intentional, calculated barbarity,</strong> carried out with the sole purpose of leaving physical and psychological scars that would last a lifetime. One child, trembling and scarred forever, recounted the ordeal: <strong>the searing pain, the stench of burning flesh, the terror of being completely powerless</strong> while monsters laughed at their suffering.</p>\n\n\n\n<p>Hamas didn’t stop there. For them, there was no such thing as too cruel. The branding wasn’t just an act of physical violence—it was an attack on these children’s humanity. The burn marks were not only wounds but signatures of ownership, like a grotesque calling card from a group reveling in its own sadism. It wasn’t enough for these depraved monsters to kidnap children, rip them from their families, and destroy their homes. They had to go further. They had to <strong>mark these kids, permanently and sadistically,</strong> with scars that scream &#8220;you are nothing&#8221; every time these children look at their own bodies.</p>\n\n\n\n<p>And it wasn’t only the children who bore this horrifying torture. Adults, too, were subjected to this vile practice. One returned hostage displayed <strong>permanent burn marks across her body</strong>, inflicted not in a chaotic frenzy of violence, but with cruel precision. These burns were deliberate acts, performed by people who <strong>enjoyed the power of inflicting unimaginable pain</strong> on defenseless captives. Imagine being held down, knowing what’s about to happen, and having no way to stop it as searing-hot metal is pressed into your skin, obliterating any semblance of dignity or hope.</p>\n\n\n\n<p>The branding, much like the entire ordeal of Hamas captivity, wasn’t merely an act of torture—it was <strong>a ritual of humiliation and domination.</strong> It showed a complete and utter disregard for life, targeting the most vulnerable with acts so heinous that they reveal the twisted depths of their captors’ depravity. These are the actions of terrorists who thrive not just on death, but on the slow, deliberate destruction of the human spirit. <strong>Burning children, scarring adults, laughing at screams—this is Hamas’ legacy of horror.</strong></p>\n\n\n\n<h4 class=\"wp-block-heading\">Isolation and Starvation: The Weaponization of Neglect</h4>\n\n\n\n<p>Then there’s the story of a woman bound and held in complete darkness for <strong>30 days</strong>—a chilling testament to Hamas’ unfathomable cruelty. Injured during the October 7 attack, she wasn’t just left to suffer; she was deliberately denied food, water, and medical care, her every basic need ignored. For an entire <strong>month,</strong> she lay immobilized, her body wasting away in a cold, pitch-black hellhole, completely cut off from any semblance of human contact or compassion. Her injuries, untreated and festering, became a source of unrelenting pain, while the darkness enveloping her crushed her psyche, leaving her to endure the cruel passage of time with no sense of day or night. Every second was a reminder that she was nothing more than an object for her captors, her life and suffering a matter of complete indifference to them.</p>\n\n\n\n<p>And she wasn’t alone in her torment. Other women endured similar fates in Hamas’ barbaric dungeons. Confined to <strong>filthy, squalid spaces</strong> that reeked of waste and decay, they were subjected to relentless abuse designed to strip away every last shred of dignity. Many were <strong>bound and immobilized,</strong> forced to sit or lie in their own filth for days or weeks on end, while their captors jeered at their misery. These weren’t just acts of neglect—they were <strong>calculated, deliberate acts of dehumanization.</strong> Hamas turned basic human needs into weapons, starving their captives while feeding off their despair.</p>\n\n\n\n<p>Deprivation wasn’t limited to physical necessities. The isolation, darkness, and unrelenting cruelty were psychological weapons, tearing apart these women’s minds just as effectively as the physical abuse shattered their bodies. They were left with nothing—no comfort, no hope, no sense of when or if their suffering would end. To these women, time ceased to exist; every moment was a waking nightmare, every breath a bitter reminder of their inescapable captivity.</p>\n\n\n\n<p>Some of the women were forced to endure this agony while battling untreated wounds and injuries inflicted during their initial abduction. One woman, like the others, bore the physical and emotional scars of Hamas’ brutality: the hunger that gnawed at her insides, the infections that spread unchecked through her body, the stench of the unwashed, the silence broken only by the occasional sadistic laughter of her captors. Each of these women was an individual, a human being, reduced to a state of pure suffering by an organization that thrives on inflicting pain and revels in its ability to dominate and destroy.</p>\n\n\n\n<p>This wasn’t war. It wasn’t collateral damage or the tragic byproduct of conflict. This was <strong>torture in its purest, most sadistic form,</strong> inflicted not for strategic gain but for the sheer pleasure of breaking their victims. It’s a story that should make the world recoil in disgust—a reminder that behind every political slogan defending Hamas lies a grotesque truth of <strong>unrelenting, inhuman cruelty.</strong></p>\n\n\n\n<h4 class=\"wp-block-heading\">Torture by Medical Neglect</h4>\n\n\n\n<p>For Hamas, even untreated wounds became instruments of torment—another weapon in their arsenal of inhuman cruelty. Hostages with <strong>shrapnel injuries, burns, and fractures</strong> sustained during the October 7 massacre were deliberately denied the most basic medical care, forcing them to endure <strong>days, weeks, even months of excruciating pain.</strong> These weren’t mere acts of neglect—they were deliberate choices, a sadistic refusal to provide relief. Wounds that could have healed with minimal care festered, grew infected, and turned into open sores, every moment of agony compounded by their captors’ indifference. It wasn’t enough to physically wound these victims; Hamas needed their suffering to linger, to become a constant reminder of their captors’ total control over their lives.</p>\n\n\n\n<p>When medical care was offered, it was an appalling farce of cruelty. <strong>Procedures were performed without anesthesia,</strong> turning what should have been moments of healing into spectacles of pain. Imagine having a shard of shrapnel ripped from your flesh with no numbing agent, the raw agony of every nerve screaming, or a fracture set while the captors sneered at your cries. These weren’t accidents; they were deliberate. Every stitch, every crude attempt at treatment, was executed with one purpose: to amplify suffering. For Hamas, a screaming hostage was a victory, their torment a perverse source of satisfaction.</p>\n\n\n\n<p>The toll wasn’t confined to wounds inflicted during the initial attacks. Chronic conditions, which require consistent care to manage, became death sentences under Hamas’ watch. <strong>Elderly hostages with diabetes, heart failure, and hypothyroidism</strong> were stripped of their life-sustaining medications. Their bodies, already fragile, were pushed to the brink by calculated neglect. One elderly woman, deprived of her necessary hypertension medication, nearly died, her body succumbing to the stress of captivity. Another hostage wasn’t as lucky, her death the inevitable result of untreated medical complications—a preventable tragedy that Hamas chose to allow.</p>\n\n\n\n<p>The suffering didn’t end there. Starvation, dehydration, and filthy living conditions exacerbated every injury and illness, turning even minor ailments into life-threatening crises. Many hostages experienced <strong>hypothermia, low blood pressure, and bradycardia</strong>, their bodies failing after weeks of malnutrition and untreated illness. Infections, worsened by Hamas’ refusal to provide even rudimentary hygiene, spread like wildfire. Elderly captives developed <strong>deep vein thrombosis</strong> from being immobilized for extended periods, some of them barely able to move when finally released.</p>\n\n\n\n<p>The captors’ callous disregard extended to the long-term consequences of their neglect. Wounds that were left to fester often required <strong>additional surgeries</strong> after the hostages’ release—procedures that could have been entirely avoided with basic medical care. Instead, their conditions worsened under Hamas’ control, ensuring that the hostages returned not just traumatized but permanently scarred, physically and emotionally.</p>\n\n\n\n<p>This wasn’t just negligence; it was <strong>intentional suffering,</strong> inflicted with the knowledge that every day of untreated pain would break these victims a little more. The refusal to treat even basic injuries or chronic illnesses wasn’t an oversight. It was a policy of <strong>systematic cruelty,</strong> calculated to strip hostages of hope, dignity, and humanity. Hamas turned the simple act of withholding care into another method of torture, proving once again that their brutality knows no bounds.</p>\n\n\n\n<p>No medical professional or humanitarian organization would ever allow such conditions to persist, and yet Hamas reveled in it. These acts weren’t the byproduct of chaos—they were the product of deliberate decisions to maximize pain and suffering. <strong>Every untreated wound, every withheld medication, every moment of agony endured without relief is a testament to Hamas’ depravity,</strong> their twisted glee in weaponizing human fragility.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Starvation: A Hunger Orchestrated to Break Spirits</h4>\n\n\n\n<p>The systematic starvation inflicted on the hostages by Hamas is one of the most grotesque illustrations of their calculated cruelty. Nearly half of the captives were subjected to prolonged deprivation, forced to survive on diets so inadequate they didn’t even qualify as sustenance. Adult hostages, stripped of muscle and energy, wasted away, losing <strong>10-17% of their body weight.</strong> Their bodies became frail and weak, leaving them vulnerable to infection, illness, and further abuse. The impact on children, however, was even more horrifying. With their growing bodies unable to endure such prolonged starvation, some children lost up to <strong>18% of their weight</strong>, their frames reduced to skeletal shadows of what they once were. One young girl returned to Israel in such a state of emaciation that she could barely move, her body ravaged by malnutrition that will likely leave lasting developmental scars.</p>\n\n\n\n<p>For children, this wasn’t just starvation—it was a deliberate attack on their futures. The hunger stunted their physical growth, weakened their immune systems, and impaired their cognitive development. As the days turned into weeks, the deprivation gnawed at their bodies and minds, leaving scars that no amount of nourishment will fully heal. Adults fared no better, their bodies succumbing to <strong>sarcopenia</strong>, a condition where muscle mass is lost to the point of dysfunction. Every movement became an ordeal, every breath a labor. For the elderly, the starvation pushed them closer to death, their bodies unable to fight the mounting effects of malnutrition.</p>\n\n\n\n<p>The food that was given, if it could even be called that, was often of such poor quality that it caused more harm than good. It was designed not to sustain life but to prolong suffering—just enough calories to keep them alive while their strength and will were steadily eroded. Infections like <strong>E. coli</strong> and <strong>Salmonella</strong> ran rampant, exacerbated by the lack of clean water or any form of sanitation. Diarrhea and abdominal pain became daily torments for the hostages, while some became so weak they could no longer control their own bodily functions, a final indignity in an unrelenting campaign of dehumanization.</p>\n\n\n\n<p>As if this deliberate starvation wasn’t abhorrent enough, Hamas’ manipulation didn’t end there. Before releasing some of the hostages, they were <strong>deliberately overfed,</strong> a cruel and calculated attempt to “fatten them up” for the cameras. The goal wasn’t to alleviate suffering but to fabricate a false narrative of humane treatment, a propaganda ploy to deceive the world. This sudden surge in food intake, after weeks of deprivation, carried its own risks—<strong>refeeding syndrome,</strong> a potentially fatal condition that occurs when malnourished bodies are suddenly overwhelmed by nutrients. Victims face electrolyte imbalances, severe metabolic disturbances, and even cardiac arrest, but Hamas didn’t care. Their only concern was appearances: the illusion of care, not the shattered lives of their victims.</p>\n\n\n\n<p>The starvation wasn’t simply a byproduct of captivity—it was a deliberate weapon, designed to break spirits and crush resistance. Denying food and water isn’t just a method of control; it’s a statement, a cruel declaration that the hostages were <strong>less than human</strong> in the eyes of their captors. It was a slow, grinding death sentence disguised as sustenance, a reminder every day that their survival was at the whim of those who delighted in their suffering.</p>\n\n\n\n<p>The weight loss was just one symptom of a broader strategy to strip away every shred of humanity. Imagine the psychological toll of feeling your body waste away, your strength evaporate, knowing that every morsel of food is a mockery of what your captors could provide if they wanted to. Imagine the despair of mothers watching their children weaken, unable to do anything to nourish them, knowing their captors took pleasure in the sight. Hamas wasn’t just starving bodies—they were starving hope, will, and dignity.</p>\n\n\n\n<p>Even after the hostages returned to Israel, the effects of this calculated starvation lingered. Many couldn’t eat without fear, hoarding food out of habit, their minds unable to accept that the torment had ended. Children, who should have been laughing and playing, stared blankly, too weak to process the sudden abundance of nourishment. Their bodies, scarred by deprivation, now face a lifetime of recovery.</p>\n\n\n\n<p>This was no accident, no oversight. It was cold, calculated sadism—a slow, methodical destruction of the human spirit. Hamas didn’t simply deny food; they used hunger as a weapon, turning the most basic human need into an instrument of suffering and control. This isn’t just cruelty—it’s <strong>monstrous, inhuman barbarity,</strong> and the world cannot look away.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Living in Filth: An Assault on Dignity</h4>\n\n\n\n<p>The hostages endured living conditions so unspeakably vile, they defy imagination—a calculated, deliberate assault on human dignity. Hamas forced these men, women, and children to exist in <strong>filthy, squalid spaces</strong> where basic hygiene was not just neglected but outright denied. Bathrooms were a luxury the captors never provided. Instead, the hostages were compelled to <strong>defecate and urinate on themselves</strong>, their bodies covered in their own waste as days turned into weeks, and weeks into months. The stench of human filth hung thick in the air, a constant reminder of their captors&#8217; inhumanity. Hamas, indifferent to the humiliation and suffering this caused, didn’t just tolerate the degradation—they weaponized it, turning filth into yet another tool of their cruelty.</p>\n\n\n\n<p>With no access to showers or clean water, the hostages’ skin became breeding grounds for infection. <strong>Skin diseases like dermatitis</strong> erupted across their bodies, the result of being confined in cramped, unhygienic conditions where sweat, waste, and dirt accumulated unchecked. Open wounds, left untreated, became grotesquely infected. Bacteria thrived in this nightmarish environment, with diseases such as <strong>E. coli, Clostridium, Salmonella, Vibrio, and Giardia</strong> running rampant. Every scratch, every minor cut, became a portal for disease, turning already frail bodies into battlegrounds for infections. Elderly hostages, with weakened immune systems, suffered the most, some developing life-threatening conditions like <strong>sepsis</strong> from untreated skin lesions and abscesses.</p>\n\n\n\n<p>Hamas’ denial of basic hygiene wasn’t just neglect—it was <strong>calculated sadism.</strong> Hostages were stripped of even the smallest comforts, like a clean face or a chance to wash their hands, forcing them to marinate in filth and self-loathing. Their captors didn’t just look on passively; they reveled in the hostages’ misery, using their degradation as yet another form of psychological torture. Imagine the unbearable humiliation of being unable to control your body, knowing your captors were watching, sneering, and taking pleasure in your suffering. For many hostages, the filth became as much a prison as the walls that surrounded them, stripping away their humanity one degrading moment at a time.</p>\n\n\n\n<p>The unsanitary conditions took a devastating toll on the hostages’ health. Many experienced <strong>chronic diarrhea, dehydration, and abdominal pain</strong>, exacerbated by the unclean water and meager food rations they were given. The confinement in such a contaminated environment led to widespread intestinal infections, further weakening already malnourished bodies. Even after being freed, some hostages required intensive medical care to recover from the infections and illnesses caused by these horrific living conditions. Others will likely live with the lingering effects—scars, weakened immune systems, and psychological trauma from the experience.</p>\n\n\n\n<p>The psychological impact of living in such filth cannot be overstated. For the hostages, the inability to maintain even a shred of personal hygiene was a constant reminder of their captivity and dehumanization. Many returned home struggling to adjust, haunted by the memory of their own stench, the feel of dirt and waste clinging to their skin, and the utter helplessness they felt as they were forced to endure conditions no human being should ever face. Even in freedom, some could not let go of the habits they had developed—refusing to leave their rooms, hoarding water and soap, compulsively washing their hands—as if trying to scrub away the months of humiliation they endured.</p>\n\n\n\n<p>Hamas’ treatment of their captives wasn’t just an affront to international law—it was a direct, grotesque violation of the most basic human rights. The denial of access to clean spaces and hygiene wasn’t an oversight; it was deliberate. Every ounce of filth, every infected wound, every moment spent sitting in waste was part of a calculated campaign to strip these hostages of their humanity and remind them of their captors’ absolute control. <strong>This was degradation by design—a sick, twisted method of asserting power and inflicting suffering.</strong> It’s a horror that no words can fully convey and a crime the world cannot ignore.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Beatings, Hair-Pulling, and Total Humiliation</h4>\n\n\n\n<p>No aspect of the hostages’ existence escaped Hamas’ relentless, sadistic cruelty. The captors turned violence into routine, using beatings as a form of control, punishment, and entertainment. Hostages were <strong>beaten senseless</strong>, their bodies pummeled so severely that bruises, welts, and open wounds became a permanent part of their existence. Every blow was a reminder of their captors’ <strong>absolute dominance and perverse joy in inflicting pain.</strong> Some hostages recounted being struck so hard and so frequently that they lost consciousness, only to be revived and beaten again. Their tormentors didn’t just seek to cause pain—they sought to obliterate their victims’ willpower, to make each breath a punishment, each moment an extension of their suffering.</p>\n\n\n\n<p>Hair-pulling became another favorite weapon of humiliation. Captors yanked hostages’ hair so violently that scalps were left bleeding, with patches of hair ripped out entirely. The pain was excruciating, but the humiliation was even worse. It was a <strong>deliberate act of dehumanization,</strong> one designed to assert control and strip away any sense of personal dignity. For women, this act was particularly cruel, exploiting cultural and personal sensitivities about hair as a symbol of identity and femininity. Male hostages, too, suffered the indignity of having their heads used as handles, their screams met with laughter as their captors treated them like animals or objects.</p>\n\n\n\n<p>These physical assaults weren’t confined to moments of anger or discipline—they were woven into the fabric of daily life in captivity. Hostages were slapped, punched, kicked, and thrown against walls with little provocation. Some were beaten for being too slow to obey commands, while others were attacked simply for being in the wrong place at the wrong time. The randomness of the violence was part of its power, creating an atmosphere of constant fear and helplessness. Hostages never knew when the next attack would come or what would provoke it, keeping them perpetually on edge, their bodies tensed for blows that could land at any moment.</p>\n\n\n\n<p>Humiliation was always part of the equation. Hostages were forced to crawl on the ground, their captors kicking them as they moved, treating them like animals. Others were slapped and spit on, their tormentors mocking them in crude, demeaning ways. Some were paraded in front of other captives, their bruised and bloodied bodies used as warnings to inspire fear and submission. The psychological toll of this constant humiliation was devastating. Hostages who had once been proud and self-assured were reduced to shells of their former selves, their spirits broken under the weight of relentless cruelty.</p>\n\n\n\n<p>For many hostages, the pain wasn’t confined to the physical realm. The beatings and humiliation became <strong>symbols of their utter helplessness</strong>, reminders that they were at the mercy of captors who thrived on their suffering. Every act of violence reinforced the same message: <strong>you are powerless, and we own you.</strong> This psychological warfare left scars that will never fully heal, haunting victims long after their release.</p>\n\n\n\n<p>The captors’ actions weren’t acts of rage—they were deliberate, calculated displays of power, designed to crush the hostages’ bodies and spirits alike. Every blow, every yank of hair, every insult hurled in their direction was another step in Hamas’ campaign of dehumanization. This wasn’t just violence; it was <strong>a systematic effort to strip away humanity, to turn people into objects of suffering for their captors’ sadistic amusement.</strong></p>\n\n\n\n<h4 class=\"wp-block-heading\">This is Who Hamas Is</h4>\n\n\n\n<p>Let’s be crystal clear—these aren’t isolated incidents, tragic mistakes, or collateral damage in the fog of war. This <strong>is Hamas.</strong> This is what they deliberately and methodically chose to do to innocent civilians—men, women, children, and the elderly. These are calculated acts of terror, not born of desperation but of malice. Every burn seared into a child’s body, every wound left to fester, every agonizing procedure performed without anesthesia—these were not necessities. They were choices. Choices made by people who gleefully stripped away every last shred of humanity from their victims. These are the actions of an organization that doesn’t merely tolerate suffering but revels in it.</p>\n\n\n\n<p>Hamas didn’t just harm their hostages—they dehumanized them in the most sadistic ways imaginable. They turned basic needs into weapons: denying food, clean water, and medical care not because they lacked resources but because they wanted to see their captives break. Every day spent starving, every minute spent lying in filth, and every second of untreated agony was another victory for Hamas, another step in their campaign to destroy the bodies and spirits of those in their power.</p>\n\n\n\n<p>This isn’t about political resistance or a fight for freedom. This is <strong>evil, unadulterated and unapologetic.</strong> There is no justification, no excuse, no explanation that can sanitize these horrors. Yet, there are still those who dare to romanticize Hamas as “freedom fighters” or defenders of a cause. To those people: <strong>look at the facts.</strong> Look at the deliberate branding of children, the systematic sexual abuse of women, the starvation, the medical torture, the psychological torment. Look at the scars on the bodies of survivors and the torment in their eyes. If you can still defend Hamas after that, then you are complicit in their crimes.</p>\n\n\n\n<p>Every single one of these actions is a crime against humanity. Every act of torture, every violation of basic human dignity, every instance of calculated cruelty reveals the depths of Hamas’ depravity. These aren’t isolated cases of rogue actors within a larger organization; this is <strong>their policy, their method, their identity.</strong> Hamas thrives on terror and suffering, and they don’t discriminate—children, mothers, elderly, the injured and weak—they all become tools in Hamas’ sadistic games.</p>\n\n\n\n<p>To call this “resistance” is an insult to the concept itself. Resistance implies a struggle for something better, a fight for dignity or justice. What Hamas does isn’t resistance—it’s sadism, plain and simple. They don’t fight to lift people up; they fight to tear people down, to degrade, to humiliate, and to destroy. Their atrocities aren’t collateral—they’re the point.</p>\n\n\n\n<p>And what’s worse, Hamas wants the world to see this barbarity and do nothing. They rely on the apathy of the international community, on the weakness of governments too afraid to take a stand, on the ignorance of those who cling to false narratives. But the world must see Hamas for what it is: <strong>an organization of monsters, unapologetic in their brutality, deliberate in their crimes.</strong></p>\n\n\n\n<p>This isn’t a time for silence, and it isn’t a time for equivocation. Every moment the world delays in holding Hamas accountable is another moment these monsters grow bolder, their crimes more horrific, their reach more devastating. The survivors of their terror carry the scars not only of their captors’ brutality but of a world that hasn’t yet delivered them justice. These survivors, and those still suffering in captivity, deserve better.</p>\n\n\n\n<p>The world must not only condemn these acts but take decisive, unified action to ensure these monsters are held accountable. Let there be no illusions—Hamas isn’t a political movement, a liberation force, or a resistance group. Hamas is an engine of destruction, a factory of human suffering, and a stain on humanity itself. <strong>If the world fails to act, it isn’t just the victims who will bear the cost—it’s all of us, as we allow evil to thrive unchecked.</strong></p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center has-bc-do-1-v-color has-text-color has-link-color wp-elements-6eeb20eb31d0cfe31ce4dcc7ec4b1def\">Woman, man, children, babies!<br>BRING THEM BACK HOME NOW</h2>\n\n\n\n<p></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Explore the untold story of how Palestinian resistance forces managed to capture and detain Israeli Zionists, highlighting the tactics and resilience of those fighting for liberation. This article delves into the conditions of captivity and the struggle for justice in a deeply divided region.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 19157,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        1748
    ],
    "class_list": [
        "post-19155",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-hostages-health-report"
    ],
    "lang": "en",
    "translations": {
        "en": 19155
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19155",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=19155"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19155/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 19159,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19155/revisions/19159"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/19157"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=19155"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=19155"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=19155"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}