{
    "id": 9233,
    "date": "2024-06-05T14:18:18",
    "date_gmt": "2024-06-05T11:18:18",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/10006-en/"
    },
    "modified": "2024-06-05T14:18:18",
    "modified_gmt": "2024-06-05T11:18:18",
    "slug": "10006-en",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/10006-en/",
    "title": {
        "rendered": "&#8220;IDF Operations: 18 Arrested and Hamas Weapons Seized in Coordinated Night Raids&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Operations were carried out simultaneously in four regional brigades; IDF soldiers, Shin Bet, and Border Police arrested 18 wanted individuals across Judea and Samaria overnight and confiscated weapons and incitement materials from Hamas.</p>\n<p>During the night, forces operated in missions across four regional brigades in the West Bank, from Menashe in the north to Judea in the south, during which they arrested 18 wanted individuals and confiscated weapons, military equipment, and a large amount of incitement materials, including those belonging to the terrorist organization Hamas.</p>\n<p>In a brigade operation in Beit Omar in the Etzion region, the soldiers apprehended six wanted individuals, during which a handgun and Hamas incitement materials were confiscated, and an explosive device was destroyed that was located in the area.</p>\n<p>In a brigade operation in the village of Ma’ale Adumim in the Benjamin Brigade, forces interrogated dozens of suspects, arrested two wanted individuals, and located weapons. In the villages of Al-Mu’ayar and Turmus Ayya within the brigade&#8217;s jurisdiction, the fighters arrested five additional wanted individuals.</p>\n<p>In a battalion operation in the village of Dan in the Menashe Brigade, the soldiers arrested a wanted individual, searched for weapons, interrogated suspects, and uncovered routes where explosives had been hidden. In another battalion operation in Al-Fawwar in Judea, many suspects were interrogated. In Kdema in the Samaria Brigade and in Jericho in the Jordan Valley Brigade, the forces arrested four wanted individuals.</p>\n<p>The arrested individuals were transferred for further handling by the security forces, and there were no casualties among our troops.</p>\n<p>Since the beginning of the war, about 4,150 wanted individuals have been apprehended across the Judea and Samaria Division and the Jordan Valley and Emek Brigade, with approximately 1,750 of them affiliated with the terrorist organization Hamas.</p>\n<p>Attached is a link to a statement by Major (Res.) Shlomo Ohayon: https://bit.ly/3RcZuPE</p>\n<p>Attached are photos from the forces&#8217; activities: https://idfanc.activetrail.biz/ANC050620244503</p>\n<p>Attached is documentation on the subject: https://bit.ly/4aQPL8K</p>\n<p>Attached are images of the confiscated weapons: https://idfanc.activetrail.biz/ANC05062024768</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Operations were carried out simultaneously in four regional brigades; IDF soldiers, Shin Bet, and Border Police arrested 18 wanted individuals across Judea and Samaria overnight and confiscated weapons and incitement materials from <a  href=\"/hamas\">Hamas</a>. During the night, forces operated in missions across four regional brigades in the West Bank, from Menashe in the north to Judea in the south, during which they arrested 18 wanted individuals and confiscated weapons, military equipment, and a large amount of incitement materials, including those belonging to the terrorist organization <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>. In a brigade operation in Beit Omar in the Etzion region, the soldiers</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-9233",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 9233,
        "he": 9234,
        "ru": 9235
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9233",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=9233"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9233/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=9233"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=9233"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=9233"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}