{
    "id": 9203,
    "date": "2024-06-06T13:01:43",
    "date_gmt": "2024-06-06T10:01:43",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/10016-en/"
    },
    "modified": "2024-06-06T13:01:43",
    "modified_gmt": "2024-06-06T10:01:43",
    "slug": "10016-en",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/10016-en/",
    "title": {
        "rendered": "&#8220;IDF Operation: 21 Arrests and Weapon Confiscations in Judea and Samaria&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>11 wanted individuals affiliated with the Hamas terrorist organization were arrested in an operation in the Ephraim Brigade, and nine weapons were confiscated throughout the area; IDF, Shin Bet, and Border Police forces arrested 21 wanted individuals across Judea and Samaria overnight.</p>\n<p>During the night, the forces conducted a battalion operation to thwart terrorism in the city of Qalqilya and in additional villages in the Ephraim Brigade area.<br />\nAs part of the operation, the fighters arrested 11 individuals affiliated with the Hamas terrorist organization and interrogated numerous suspects.</p>\n<p>In the Samaria Brigade, the forces arrested four wanted individuals and confiscated two M-16 rifles. In the villages of Aqab, Dir Jarir, and Al-Bireh in Benjamin, four wanted individuals were also arrested, and a pistol alongside an M-16 rifle was confiscated.</p>\n<p>In Beit Awa and Kalqilya in the Judea Brigade, the fighters arrested three wanted individuals, locating and confiscating two handguns, two M-16 rifles, and a Kalashnikov.</p>\n<p>Additionally, during the night, an explosion was heard about a kilometer from the Tayser checkpoint in the Jordan Valley and Gilboa Brigade area.<br />\nPreliminary investigations indicate it was a car bomb that exploded; there are no casualties, and the incident is under investigation.</p>\n<p>The arrested individuals have been transferred to security forces for further processing; there are no casualties among our forces.</p>\n<p>Since the beginning of the war, approximately 4,150 wanted individuals have been arrested throughout the Judea and Samaria Division and the Jordan Valley and Gilboa Brigade, about 1,750 of whom are affiliated with the Hamas terrorist organization.</p>\n<p>Attached are images of the confiscated weapons: https://IDFANC.activetrail.biz/ANC060620249389843053</p>\n<p>Attached are images from the operations of the forces throughout Judea and Samaria: https://IDFANC.activetrail.biz/ANC06062024982490842</p>\n<p>Included is documentation of the forces&#8217; activities throughout Judea and Samaria: https://bit.ly/4cbShrf</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: 11 wanted individuals affiliated with the <a  href=\"/hamas\">Hamas</a> terrorist organization were arrested in an operation in the Ephraim Brigade, and nine weapons were confiscated throughout the area; IDF, Shin Bet, and Border Police forces arrested 21 wanted individuals across Judea and Samaria overnight. During the night, the forces conducted a battalion operation to thwart terrorism in the city of Qalqilya and in additional villages in the Ephraim Brigade area. As part of the operation, the fighters arrested 11 individuals affiliated with the <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> terrorist organization and interrogated numerous suspects. In the Samaria Brigade, the forces arrested four wanted individuals</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-9203",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 9203,
        "he": 9204,
        "ru": 9205
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9203",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=9203"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9203/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=9203"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=9203"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=9203"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}