{
    "id": 8765,
    "date": "2024-06-18T15:37:48",
    "date_gmt": "2024-06-18T12:37:48",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/10162-en/"
    },
    "modified": "2024-06-18T15:37:48",
    "modified_gmt": "2024-06-18T12:37:48",
    "slug": "10162-en",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/10162-en/",
    "title": {
        "rendered": "&#8220;IDF Operations: 14 Arrests, Major Weapons Seizures, and Terror Funds Disrupted&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Seizure of weapons and approximately 100,000 shekels in terror funds; IDF, Shin Bet, and Border Police forces operated overnight to arrest 14 wanted individuals across Judea and Samaria and in the Jordan Valley and the Valleys Brigade.</p>\n<p>IDF, Shin Bet, and Border Police forces operated overnight to arrest 14 wanted individuals across Judea and Samaria and in the Jordan Valley and the Valleys Brigade.</p>\n<p>In the Harbata area of the Ephraim Brigade, the soldiers arrested a wanted individual and seized an &#8216;M16&#8217; weapon and about 100,000 shekels in terror funds. During the operation, the soldiers fired at a terrorist who threw stones at them, and a hit was confirmed. In the areas of Nabi Saleh, Dir Nizam, and Tzu&#8217;if in the Ephraim Brigade, the forces arrested five additional wanted individuals.</p>\n<p>During a battalion operation in the Qutzra area of the Samaria Brigade, the soldiers arrested a wanted individual, interrogated many suspects, and destroyed four pipe bombs that were located in the area. In the Nablus area, forces seized a &#8216;Carl Gustav&#8217; rifle, materials for making explosives, and destroyed a bomb that was found in the area. During the operation, an IDF soldier was moderately injured as a result of an operational accident and was evacuated for medical treatment at a hospital; his family has been informed.</p>\n<p>In Jericho, in the Jordan Valley and the Valleys Brigade, the soldiers arrested a wanted individual involved in the manufacture of explosives.</p>\n<p>In Dir Samet and Adna in the Judea Brigade, the forces arrested three wanted individuals and seized weapons and materials inciting terrorism.</p>\n<p>In the areas of Sinjil and Bido in the Benjamin Brigade, two wanted individuals were arrested, alongside another wanted individual arrested in the Husan area of the Etzion Brigade.</p>\n<p>The arrested wanted individuals and the confiscated weapons have been transferred for further handling by the security forces.</p>\n<p>So far, since the beginning of the war, approximately 4,150 wanted individuals have been arrested throughout the Judea and Samaria Division and in the Jordan Valley and the Valleys Brigade, about 1,750 of whom are affiliated with the terrorist organization Hamas.</p>\n<p>Attached are images from the forces&#8217; activities across Judea and Samaria: https://idfanc.activetrail.biz/ANC16082024587384</p>\n<p>Attached is a photo of the seized weapons: https://idfanc.activetrail.biz/ANC180620248474</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Seizure of weapons and approximately 100,000 shekels in terror funds; IDF, Shin Bet, and Border Police forces operated overnight to arrest 14 wanted individuals across Judea and Samaria and in the Jordan Valley and the Valleys Brigade. IDF, Shin Bet, and Border Police forces operated overnight to arrest 14 wanted individuals across Judea and Samaria and in the Jordan Valley and the Valleys Brigade. In the Harbata area of the Ephraim Brigade, the soldiers arrested a wanted individual and seized an &#8216;M16&#8217; weapon and about 100,000 shekels in terror funds. During the operation, the soldiers fired at a</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-8765",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 8765,
        "he": 8766,
        "ru": 8767
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/8765",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=8765"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/8765/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=8765"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=8765"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=8765"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}