{
    "id": 8525,
    "date": "2024-06-25T15:56:46",
    "date_gmt": "2024-06-25T12:56:46",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/10243-en/"
    },
    "modified": "2024-06-25T15:56:46",
    "modified_gmt": "2024-06-25T12:56:46",
    "slug": "10243-en",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/10243-en/",
    "title": {
        "rendered": "&#8220;IDF Operations: 24 Arrests and Major Arms Seizure in Judea and Samaria&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>IDF, Shin Bet, and Border Police fighters operated last night to arrest 24 wanted individuals, destroyed explosives, and confiscated weapons; a cache of arms was located in a structure in Bethlehem.</p>\n<p>IDF, Shin Bet, and Border Police arrested 24 wanted individuals across Judea and Samaria, as well as the Jordan Valley and the Jezreel Valley.</p>\n<p>During the night (Tuesday), several terrorists opened fire at a military vehicle operating in the Manasseh Brigade area. There were no casualties, but damages to the military vehicle were reported. The terrorists did not cross into Israeli territory. A large number of IDF forces are deployed and searching for the terrorists in the area.</p>\n<p>The forces conducted a battalion operation in Balata, near Nablus, arresting 14 wanted individuals, confiscating weapons, and destroying explosives in the area.</p>\n<p>In Bethlehem, in the Etzion district, the forces located a cache of arms hidden in a structure in the area and arrested the suspect in the concealment. The cache included weapon parts, dozens of vests, and a significant amount of ammunition. In Bethlehem and Tekoa in the Etzion district, four more wanted individuals were arrested. In Tamun, in the Jordan Valley and the Jezreel Valley, three wanted individuals inciting terrorism were arrested, and a hit was confirmed on an armed terrorist.</p>\n<p>In Ramallah in the Binyamin district, forces arrested another wanted individual, and during the operation, a violent public disturbance developed in which suspects threw stones at the forces, who responded with crowd dispersal means, resulting in a confirmed injury. In Beitunia and Beit Dako in the brigade&#8217;s sector, two additional wanted individuals were arrested, and terror funds were confiscated. Additionally, in Kiryat Arba in Judea, two shotguns and ammunition were located and confiscated.</p>\n<p>The arrested wanted individuals and confiscated weapons have been transferred for further handling by security forces.</p>\n<p>Since the start of the war, approximately 4,150 wanted individuals have been arrested throughout the Judea and Samaria Division and the Jordan Valley and the Jezreel Valley, about 1,750 of whom are affiliated with the Hamas terrorist organization.</p>\n<p>Attached is body camera footage from the operation in Nablus: https://bit.ly/3zigPAE</p>\n<p>Attached are images from the forces&#8217; activities: https://IDFANC.activetrail.biz/ANC2506202429351324</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: IDF, Shin Bet, and Border Police fighters operated last night to arrest 24 wanted individuals, destroyed explosives, and confiscated weapons; a cache of arms was located in a structure in Bethlehem. IDF, Shin Bet, and Border Police arrested 24 wanted individuals across Judea and Samaria, as well as the Jordan Valley and the Jezreel Valley. During the night (Tuesday), several terrorists opened fire at a military vehicle operating in the Manasseh Brigade area. There were no casualties, but damages to the military vehicle were reported. The terrorists did not cross into Israeli territory. A large number of IDF</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-8525",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 8525,
        "he": 8526,
        "ru": 8527
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/8525",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=8525"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/8525/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=8525"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=8525"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=8525"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}