{
    "id": 2874,
    "date": "2024-06-01T10:24:55",
    "date_gmt": "2024-06-01T07:24:55",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized/9951/"
    },
    "modified": "2024-09-04T21:48:40",
    "modified_gmt": "2024-09-04T18:48:40",
    "slug": "9951",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9951/",
    "title": {
        "rendered": "&#8220;Key Hamas Terrorists Eliminated in Successful IDF and Shin Bet Joint Operations: An Inside Look&#8221;"
    },
    "content": {
        "rendered": "<p>IDF spokesperson:</p>\n<p>The IDF and the Shin Bet have eliminated key terrorists from the Hamas organization in recent days.</p>\n<p>In a joint operation of the IDF and the Shin Bet the day before yesterday (Thursday), air force combat planes, under the intelligence direction of the Military Intelligence Directorate and the Shin Bet, struck in the Nuseirat area and eliminated the terrorist Mansur Adal Mansur Kashalan, who was involved in promoting terrorist operations and directing attacks by the Hamas terrorist organization on Israeli territory, particularly in the areas of Judea and Samaria.<br />\nThe terrorist Adel Mansur initiated and conducted terrorist activities, coordinated and collaborated with terrorist organizations in the Gaza Strip and in other countries.</p>\n<p>In another joint operation that occurred this week, an air force aircraft attacked in the Central Camp and killed the terrorist Walid Abed Abu Dalal, an operative in the military wing who also served as the head of the technology department in the internal security mechanism of the <a href=\"https://iron-swords.co.il/hamas/\"  data-wpil-monitor-id=\"12\">Hamas</a> terrorist organization.<br />\nThe organization&#8217;s internal security mechanism and the technology department led by the terrorist, impede the IDF&#8217;s freedom of action in the Strip and also constitute a central part of attempts to thwart espionage that the Hamas terrorist organization perpetrates.</p>\n<p>Additionally, yesterday (Friday), the Air Force, under precise aerial intelligence direction, attacked and eliminated in the Nuseirat area the terrorist Tarek Darwish who served as a key figure in the aerial array of the Nuseirat battalion in Hamas.<br />\nDarwish took part in planning and executing terrorist operations against Israel.<br />\nHis elimination was completed against the backdrop of terrorist actions carried out by the terrorist organization last month, including attempts to harm the IDF&#8217;s aerial freedom of action.</p>\n<p>Attached is documentation of the elimination of the terrorist Tarek Darwish: https://bit.ly/3wXoVha</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF spokesperson</a>: The IDF and the Shin Bet have eliminated key terrorists from the <a  href=\"/hamas\">Hamas</a> organization in recent days. In a joint operation of the IDF and the Shin Bet the day before yesterday (Thursday), air force combat planes, under the intelligence direction of the Military Intelligence Directorate and the Shin Bet, struck in the Nuseirat area and eliminated the terrorist Mansur Adal Mansur Kashalan, who was involved in promoting terrorist operations and directing attacks by the <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> terrorist organization on Israeli territory, particularly in the areas of Judea and Samaria. The terrorist Adel Mansur initiated and conducted terrorist activities,</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-2874",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 2874
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2874",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=2874"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2874/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 17434,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2874/revisions/17434"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=2874"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=2874"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=2874"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}