{
    "id": 9275,
    "date": "2024-06-04T13:26:55",
    "date_gmt": "2024-06-04T10:26:55",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/9992-en/"
    },
    "modified": "2024-06-04T13:26:55",
    "modified_gmt": "2024-06-04T10:26:55",
    "slug": "9992-en",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/9992-en/",
    "title": {
        "rendered": "&#8220;IDF Strikes Hamas in UNRWA School: Precision Attacks and Weapon Discoveries in Gaza&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The IDF and Shin Bet attacked from the air with precision against Hamas operatives in an UNRWA school in Al Burij in the central Gaza Strip; fighters from the Nahal Brigade identified RPG missiles and other weaponry in the Rafah area.</p>\n<p>Remotely piloted aircraft of the Air Force, guided by intelligence from the IDF Intelligence Corps and Shin Bet, struck during the night in the Al Burij area on a facility used by the terrorist organization Hamas in the &#8220;Abu Alhallu&#8221; UNRWA school, where Hamas operatives were present.<br />\nThe attack was planned and executed carefully, using precision munitions and taking all possible precautions to avoid harming civilians.<br />\nThe facility that was targeted served Hamas terrorists to plan various terrorism plots against IDF forces currently operating in the Strip and against the Israeli home front.</p>\n<p>Forces from Division 162 continue the fighting in the Rafah area. In the last 24 hours, the fighters located significant tunnels and a large amount of weaponry during their search operations.<br />\nFighters from the Nahal Brigade&#8217;s combat team identified many weapons during a raid, including RPG missiles, magazines, AK-47 type weapons, and additional explosives.</p>\n<p>Division 99 continues to operate in the central Strip. Forces from the combat team of Brigade 2 destroyed terror infrastructure and identified weaponry and military equipment used by Hamas operatives during a raid.<br />\nNaval forces attacked various military targets as part of the fighting effort of the forces operating in the area.</p>\n<p>In the last 24 hours, Air Force aircraft and fighter jets attacked and destroyed approximately 65 terrorist targets across the Strip. Among the targeted sites were military buildings, weapons storage sites, launch sites, observation posts, terrorist squads, and additional military infrastructure.</p>\n<p>Attached is documentation of the attack on the terrorist facility at the UNRWA school: https://bit.ly/3KrXTBF</p>\n<p>Attached is documentation of the activities of the forces across the Gaza Strip: https://bit.ly/3VbwGby</p>\n<p>Attached are photos of the activities of the forces across the Strip: https://idfanc.activetrail.biz/ANC0406202484579385</p>\n<p>Attached are photos of the weaponry identified by fighters from the Nahal Brigade: https://idfanc.activetrail.biz/ANC0406202439857693</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The IDF and Shin Bet attacked from the air with precision against <a  href=\"/hamas\">Hamas</a> operatives in an <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a> school in Al Burij in the central <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> Strip; fighters from the <a  href=\"https://iron-swords.co.il/t/nahal-brigade/\">Nahal Brigade</a> identified RPG missiles and other weaponry in the Rafah area. Remotely piloted aircraft of the Air Force, guided by intelligence from the IDF Intelligence Corps and Shin Bet, struck during the night in the Al Burij area on a facility used by the terrorist organization <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> in the &#8220;Abu Alhallu&#8221; UNRWA school, where Hamas operatives were present. The attack was planned and executed carefully, using precision munitions</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-9275",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 9275,
        "he": 9276,
        "ru": 9277
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9275",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=9275"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/9275/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=9275"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=9275"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=9275"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}