{
    "id": 2808,
    "date": "2024-06-01T12:03:35",
    "date_gmt": "2024-06-01T09:03:35",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=2808"
    },
    "modified": "2024-06-01T12:27:22",
    "modified_gmt": "2024-06-01T09:27:22",
    "slug": "all-the-palestinians-in-the-world-are-falsifying-the-history-of-jerusalem",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/all-the-palestinians-in-the-world-are-falsifying-the-history-of-jerusalem/",
    "title": {
        "rendered": "All The Palestinians In The World Are Falsifying The History of Jerusalem"
    },
    "content": {
        "rendered": "\n<p>57 years after the liberation of Jerusalem, Palestinians are distorting the city&#8217;s history: they are linking the concept of &#8220;war crime&#8221; to the Western Wall, hiding Islamic texts from the last 1,350 years that confirm the Jewish connection to the Temple Mount, demanding the &#8220;return&#8221; of approximately 7,000 buildings in West Jerusalem, and since the &#8220;Al-Aqsa Flood,&#8221; they have once again harnessed the mosque for the production line of terror and destruction. It&#8217;s time for us to wake up.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Unforgivable Misuse of “War Crime”</strong></h2>\n\n\n\n<p>The unforgivable misuse of the concept of &#8220;war crime&#8221; by Palestinians now meets another victim, the Western Wall, on the eve of Jerusalem Day’s 57th anniversary. Palestinian media is recycling the false claim that the evacuation of the Mughrabi Quarter residents during the Six-Day War, its demolition, and the preparation of the prayer plaza for Jewish worshipers constituted a severe violation of the laws of war.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Spreading Lies Internationally</strong></h2>\n\n\n\n<p>Palestinians are spreading this story internationally and disseminating more falsehoods about the Western Wall along the way: “Jews have no connection to the Western Wall”; “The fabricated connection of the Jews to the Wall is only 400-500 years old”; “Muslims have exclusive religious, historical, and legal rights to the Wall, which is part of Al-Aqsa” (Abu Mazen). The Palestinian Authority TV even claimed that there is no documentation of Jews designating the Wall as a place of worship at any time except after the Balfour Declaration in 1917, and on another occasion reported that the Mughrabi Quarter would be re-established on the Jewish prayer plaza.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Historical Evidence and the Mughrabi Quarter</strong></h2>\n\n\n\n<p>Palestinians are turning history on its head, falsifying it, and rewriting it. Therefore, some order and accuracy are needed in the Palestinian pack of lies:</p>\n\n\n\n<p>The Western Wall indeed became the main place of Jewish prayer only in 1546, following the earthquake that struck Jerusalem that year. The earthquake collapsed the buildings adjacent to the Wall, in the area of the current prayer plaza. It allowed the Turks to respond to the Jews&#8217; request and allocate a narrow alley for prayer.</p>\n\n\n\n<p>However, contrary to the dismissive statement of the Wall’s detractors, this is not an invention of only a few hundred years. Historical evidence shows that from the moment the Muslim conquest allowed Jews to return to Jerusalem, over a thousand years ago (after Christians expelled them from the city), they prayed along the Western Wall, which, unlike today, was largely free of Muslim buildings. Jews prayed at the southern corner of the Wall and in its northern parts: near the Cotton Gate, the Iron Gate, and the Council Gate. Until Jerusalem fell to the Crusaders in 1099, a synagogue named &#8220;The Cave&#8221; even stood in the underground space of Warren&#8217;s Gate, fixed in the Western Wall.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>The Cave Synagogue and Historical Significance</strong></h2>\n\n\n\n<p>&#8220;The Cave&#8221; synagogue was situated precisely opposite the presumed location of the Holy of Holies, where the Foundation Stone in the center of the Dome of the Rock is located. The choice of the Western Wall was because it was closest to this point, more than any other wall of the Temple Mount. This proximity also influenced the continuous sanctity attributed to the Western Wall in Jewish midrashim over 1,500 years old.</p>\n\n\n\n<p>For those seeking to delve into the unknown Jewish presence at the foot of the Western Wall for over a thousand years, they can refer to the research of Dr. Arieh Kimelman, the humble and almost unknown man behind the project of uncovering the entire length of the Western Wall below ground level, who passed away this year, full of deeds.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Jewish Prayer and Historical Documentation</strong></h2>\n\n\n\n<p>Evidence of this is also abundant in the book of the Jewish scholar Yitzhak Yehezkel Yehuda, who published a comprehensive study on the Western Wall about a hundred years ago. Yehuda&#8217;s work was submitted to the British &#8220;Western Wall Commission&#8221; and established the Jewish connection to the site. The Cairo Geniza, discovered around 160 years ago in the attic of the Ben Ezra Synagogue in Cairo, also contains documentation of Jewish prayers at the Wall as early as the ninth and tenth centuries.</p>\n\n\n\n<p>For centuries, residents of the Mughrabi Quarter extorted protection money from Jews who wished to pray in the narrow Western Wall alley. They actively participated in desecrating and defiling it with animal dung, human excrement, garbage, and a whole scheme to restrict Jewish access. During the short period of Jordanian rule over East Jerusalem (19 years compared to Israel&#8217;s 57 years), Jordan violated its written commitment to allow Jews to access and pray at the Wall (Article 8 of the Armistice Agreement with Israel).</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Historical Justice and the Mughrabi Quarter Evacuation</strong></h2>\n\n\n\n<p>The evacuation and demolition of the Mughrabi Quarter during the Six-Day War did clear historical justice with its residents and held them accountable. It also allowed for the removal of toilets, latrines, and sewage pipes attached to the Western Wall stones, desecrating its sanctity. This enabled hundreds of thousands of Jewish worshippers to gather for prayers at the Wall (the narrow Wall alley could only hold a few hundred at most). The Arab families evacuated from the Mughrabi Quarter &#8211; slum housing that, according to Jordanian municipal documents, was set to be demolished anyway &#8211; received financial compensation and alternative housing. They even thanked the then-Mayor of Jerusalem, Teddy Kollek, in writing.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Muslim Claims and Historical Context</strong></h2>\n\n\n\n<p>The Muslim claim that the Wall is part of Al-Aqsa and that Jews have no connection to it took root after 1967 when Muslims expanded the definition of &#8220;Al-Aqsa&#8221; from just the southern mosque to the entire compound and its walls.</p>\n\n\n\n<p>The British commission on the Western Wall, established after the 1929 riots, did indeed determine that the Wall was owned by Muslims while Jews were only allowed to use it. However, legally, Israel corrected this biased report by nullifying the mandatory status quo arrangements at the Wall, expropriating part of it, and registering it in the land registry under the State of Israel.</p>\n\n\n\n<p>When tens of thousands wept at the Wall just months ago, praying for the safe return of hostages, the words of poet Avigdor Hameiri came to mind. He wrote in his poem about &#8220;the latter rain of tears&#8221; and the eyes &#8220;gazing (from the Wall) towards all generations&#8221; (from the poem &#8220;By the Wall&#8221;). Now, when Palestinians spread lies about the Wall and accuse us of war crimes there, we can and must refute them. However, it might be worth adopting Rabbi Kook&#8217;s approach to similar lies about the Wall, spread at the beginning of the last century. &#8220;By relying on documents,&#8221; Rabbi Kook told the Shaw Commission members, years before The Hague, &#8220;we can only weaken the truth&#8230; It is one of those well-known truths that need no evidence (the Jewish connection to the Wall). It is like someone lighting a candle to strengthen the sunlight.&#8221;</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Smuggled from Al-Azhar</strong></h2>\n\n\n\n<p>Hamas named this war: &#8220;Al-Aqsa Flood.&#8221; This name, like the lies about the Wall, expresses a huge deception, a double lie: the many Muslims who believe Al-Aqsa is in danger also believe that &#8220;their&#8221; Al-Aqsa in danger is located where our temple never stood; that the Temple on the Temple Mount is nothing but a fabrication and an invention, or in their words: &#8220;Al-Maz’um,&#8221; meaning: the pretender, the false and imaginary.</p>\n\n\n\n<p>Some of the legitimacy that terror draws from the allegation relies on this addition, as it is more legitimate to slander and murder Jews to &#8220;protect the captive Al-Aqsa and liberate it from the Jews who plan to destroy it,&#8221; when Israel and the Jews &#8220;plan to harm the place&#8221; whose connection to them is false and fabricated.</p>\n\n\n\n<p>Thus, the lie that supports the allegation enhances the legitimacy to murder in its name. From the perspective of the terrorists and their senders, they are not only killing Jews who are deeply connected to the Mount and its history to redeem Al-Aqsa from the impurity and grip of the Jews; from their perspective, they are also killing historical forgers who have no connection to the place. Essentially, they seek to liberate the Mount cognitively.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Historical and Religious Evidence</strong></h2>\n\n\n\n<p>Years before The Hague, Rabbi Kook told the Shaw Commission members: &#8220;The Jewish connection to the site is one of those well-known truths that need no evidence. It is like someone lighting a candle to strengthen the sunlight.&#8221;</p>\n\n\n\n<p>Here too, like in the Wall story, there is a broad spectrum of evidence and sources – religious, historical, and archaeological – that refutes the comprehensive Muslim denial of the Jewish connection and primacy to Jerusalem and the Temple Mount. Here too, it is like &#8220;lighting a candle to strengthen the sunlight,&#8221; but here there is an additional card: a long list of Muslim sources and scholars who have recognized the Temple Mount as the place of the Temple for about 1,350 years, and Israel would do well to finally use it.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Persian Historian Abu Ja&#8217;far Muhammad ibn Jarir al-Tabari</strong></h2>\n\n\n\n<p>The first and foremost is the Persian historian Abu Ja&#8217;far Muhammad ibn Jarir al-Tabari (923-838), who was one of the earliest, prominent, and renowned interpreters of the Quran and Muslim traditions. One of his ancient manuscripts, bearing the seal of Al-Azhar &#8211; the most important learning institution of Sunni Islam in the world &#8211; was photographed and smuggled years ago by Nuha Hassid (originally a Muslim) and given to Middle Eastern scholar Dr. Eddy Cohen. The text, known earlier, again sparked interest. Al-Tabari writes there, among other things: &#8220;The Temple (Temple Mount) was built by Solomon, son of David, and was made of gold, pearls, ruby, and peridot; it was paved with silver and gold, and its columns were of gold.&#8221;</p>\n\n\n\n<p>This documentation, from an Islamic figure like al-Tabari, naturally contradicts the recent Muslim revisions to the Temple Mount history. It is opposed to the Muslim claim that &#8220;the legend of the false Temple is the greatest forgery crime in history,&#8221; and to entire books written in this spirit.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Islamic Scholars and Historical Evidence</strong></h2>\n\n\n\n<p>Like al-Tabari, there are dozens of other Muslim scholars from ancient times. The &#8220;Al-Aqsa Flood&#8221; effectively erases their writings on the Mount and the Jewish historical connection. These do not align with the new Nazis of Hamas and their supporters in the Palestinian Authority with the philosophy of Jewish and Israeli destruction and the role given to Al-Aqsa to achieve this goal.</p>\n\n\n\n<p>This organized philosophy was embodied three years ago in the contents of the &#8220;End Times Conference,&#8221; held in Gaza under the auspices of Hamas leader Yahya Sinwar. They discussed not only Al-Aqsa but also &#8220;return.&#8221; The conference and its contents were exposed by MEMRI Institute and subsequently by &#8220;Israel Hayom,&#8221; but the Israeli media did not attach much significance to it. At the conference, Yahya Sinwar&#8217;s speech was read, discussing &#8220;the complete liberation of Palestine, from the sea to the river, and the return of Palestinian refugees to their homes.&#8221;</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Return and the Conference</strong></h2>\n\n\n\n<p>The conference chairman, Kana&#8217;an Abid, explained that the organization has &#8220;&#8230;records of the number of Israeli apartments and institutions, educational institutions, schools, and power stations, and we must prepare to manage them&#8230; We believe that the liberation will take place within a few years. The disappearance of Israel will be an unprecedented historical event globally and regionally, and there will be global implications.&#8221;</p>\n\n\n\n<p>The conference summary statement described various dimensions of &#8220;liberation&#8221; and &#8220;return&#8221; to the lands of 1948 and mentioned practical assistance for return and plans to absorb Palestinians in their cities of origin.</p>\n\n\n\n<p>One of these cities is Jerusalem. The Palestinian Authority, not Hamas, documented, with Turkish assistance, 7,000 buildings (in the west of the city) where Arabs lived before the War of Independence, including photographs, addresses, and registration extracts. Besides winning the narrative on the Temple Mount and Al-Aqsa, Hamas and the Palestinian Authority seek to realize the return, practically, especially in Jerusalem. This should also be remembered on the eve of the 57th Jerusalem Day.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Demographic Advantage and Urban Expansion</strong></h2>\n\n\n\n<p>The demographic balance has accompanied us here in Jerusalem since the city was unified, for almost six decades, and ministerial committees for Jerusalem affairs have even defined the Jewish demographic advantage as a goal, updating it numerically from time to time.</p>\n\n\n\n<p>In 1967, we started with 74% Jews versus 26% Arabs. Today, the ratio is 60:40 in favor of Jews. In 1967, there were 69,000 Arabs in Jerusalem. Today, about 400,000 Arabs live in the city. The Arab population has grown sixfold. In 1967, there were only about 200,000 Jews in Jerusalem. Today, about 600,000 Jews live in the city. The Jewish population has grown threefold.</p>\n\n\n\n<p>Despite the reversal in fertility rates &#8211; 4.3 children per woman in the Jewish sector, and 3 children per woman in the Arab sector &#8211; the Arab majority grows mainly due to Jewish emigration from Jerusalem. Every year about 18,000 Jews leave the city. Far fewer come to live there. This is called &#8220;negative migration balance.&#8221; Over the past 45 years, hundreds of thousands of Jewish residents have been lost to the city.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Addressing Demographic Challenges</strong></h2>\n\n\n\n<p>The Jewish demographic distress in Jerusalem can be addressed simply, but it requires political courage and vision. In the Arab neighborhoods beyond the security fence, a zone of lawlessness, crime, drugs, illegal construction, and terrorism, with a vast Israeli governmental vacuum, about a third of the East Jerusalem population lives; around 140,000 residents.</p>\n\n\n\n<p>These neighborhoods can be removed from the municipal boundaries of Jerusalem without excluding them from the State of Israel and establishing separate local or municipal councils for them, still under Israeli jurisdiction. The residents&#8217; residency certificates, which they hold, will remain with them, and by living within the boundaries of Israel, they will continue to enjoy resident status and its economic benefits.</p>\n\n\n\n<p>In parallel, it is desirable to formalize an official municipal linkage between Jerusalem and the Jewish settlements in &#8220;Greater Jerusalem,&#8221; a concept frequently used by the late Yitzhak Rabin. In 1998, Netanyahu&#8217;s first government decided to establish an umbrella municipality for Jerusalem and its surrounding Jewish settlements, like Ma&#8217;ale Adumim, Gush Etzion, and Givat Ze&#8217;ev, but the decision was never implemented. The Americans thwarted it, although it was only a municipal annexation and not the application of Israeli law.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Expanding Jerusalem as a Metropolitan</strong></h2>\n\n\n\n<p>Now, when all the cards are being reshuffled, it might be time to revisit this idea. If the northern Arab neighborhoods are removed from Jerusalem and Jewish neighborhoods in the periphery are municipally annexed, the demographic balance of Jerusalem will dramatically improve in favor of the Jews. Jerusalem, even in perception, will cease to be just a city. It will also be a metropolis. This would also stop the severe overcrowding within current Jerusalem limits, harming its beauty and the quality of life of its residents, and allow the construction of many more housing units for the Jewish population in &#8220;Greater Jerusalem,&#8221; the larger Jerusalem. It&#8217;s time to think big.</p>\n\n\n\n<div class=\"wp-block-gutenverse-divider guten-element guten-divider guten-6wpCZG\"><div class=\"guten-divider-wrapper\"><div class=\"guten-divider-default guten-divider-line guten-divider-regular\"></div></div></div>\n\n\n\n<h2 class=\"wp-block-heading\">sources</h2>\n\n\n\n<ol class=\"wp-block-list\">\n<li><a href=\"https://www.jewishvirtuallibrary.org/jewish-claim-to-the-land-of-israel\">Jewish Virtual Library &#8211; Jewish Claim to the Land of Israel</a></li>\n\n\n\n<li><a href=\"https://www.hoover.org/research/jewish-roots-land-israelpalestine\">Hoover Institution &#8211; Jewish Roots in the Land of Israel/Palestine</a></li>\n\n\n\n<li><a href=\"https://unitedwithisrael.org/archaeological-evidence-of-a-jewish-jerusalem/\">United with Israel &#8211; Archaeological Evidence of a Jewish Jerusalem</a></li>\n\n\n\n<li><a href=\"https://www.ajc.org/news/5-facts-about-the-jewish-peoples-ancestral-connection-to-the-land-of-israel\">AJC &#8211; 5 Facts About the Jewish People&#8217;s Ancestral Connection to the Land of Israel</a></li>\n\n\n\n<li><a href=\"https://blogs.timesofisrael.com/jerusalem-belongs-to-the-jews-an-islamic-truth/\">Times of Israel &#8211; Jerusalem Belongs to the Jews: An Islamic Truth</a></li>\n\n\n\n<li><a href=\"https://en.wikipedia.org/wiki/Jerusalem_in_Judaism\">Wikipedia &#8211; Jerusalem in Judaism</a></li>\n\n\n\n<li><a href=\"https://en.wikipedia.org/wiki/History_of_ancient_Israel_and_Judah\">Wikipedia &#8211; History of ancient Israel and Judah</a></li>\n\n\n\n<li><a>Temple Mount Sifting Project &#8211; Discoveries from the Temple Mount</a></li>\n\n\n\n<li><a>City of David &#8211; Archaeological Findings</a></li>\n\n\n\n<li><a>Israel Antiquities Authority &#8211; Jerusalem Excavations</a></li>\n\n\n\n<li><a>Jewish History &#8211; The Significance of Jerusalem in Jewish History</a></li>\n\n\n\n<li><a>Torah.org &#8211; The Centrality of Jerusalem in Judaism</a></li>\n\n\n\n<li><a>History.com &#8211; History of Jerusalem</a></li>\n\n\n\n<li><a>Biblical Archaeology Society &#8211; Unearthing Jerusalem</a></li>\n\n\n\n<li><a href=\"https://www.nationalgeographic.com/archaeology-ancient-jerusalem/\">National Geographic &#8211; Ancient Jerusalem</a></li>\n\n\n\n<li><a>Live Science &#8211; Jerusalem&#8217;s Ancient Artifacts</a></li>\n\n\n\n<li><a>Smithsonian Magazine &#8211; Discoveries in Jerusalem</a></li>\n\n\n\n<li><a href=\"https://bulletin.hds.harvard.edu/jerusalem-in-history/\">Harvard Divinity Bulletin &#8211; Jerusalem in History</a></li>\n\n\n\n<li><a>Reuters &#8211; Archaeological Proofs of Jewish Jerusalem</a></li>\n\n\n\n<li><a href=\"https://www.nytimes.com/2019/09/11/jerusalem-archaeology.html\">New York Times &#8211; The Archaeology of Jerusalem</a></li>\n\n\n\n<li><a>PBS &#8211; The Story of Jerusalem</a></li>\n\n\n\n<li><a>CNN &#8211; Ancient Jerusalem: Unearthed</a></li>\n\n\n\n<li><a>Haaretz &#8211; New Findings in Jerusalem</a></li>\n\n\n\n<li><a>Archaeology Magazine &#8211; Jerusalem: Archaeological Discoveries</a></li>\n\n\n\n<li><a href=\"https://www.bbc.com/news/world-middle-east-36358151\">BBC &#8211; Jerusalem&#8217;s Historical Roots</a></li>\n\n\n\n<li><a href=\"https://www.britannica.com/place/Jerusalem\">Encyclopaedia Britannica &#8211; Jerusalem</a></li>\n\n\n\n<li><a>Middle East Quarterly &#8211; Jerusalem&#8217;s Jewish Heritage</a></li>\n\n\n\n<li><a href=\"https://www.theguardian.com/world/jerusalem-archaeological-finds\">The Guardian &#8211; Unearthing Jerusalem</a></li>\n\n\n\n<li><a>Times of Israel &#8211; Archaeological Evidence of Jewish Presence in Jerusalem</a></li>\n\n\n\n<li><a href=\"https://www.jpost.com/archaeology\">Jerusalem Post &#8211; Jerusalem Archaeology</a></li>\n\n\n\n<li><a>Fox News &#8211; Discoveries in Ancient Jerusalem</a></li>\n\n\n\n<li><a>Scientific American &#8211; Archaeology in Jerusalem</a></li>\n\n\n\n<li><a>NPR &#8211; The Archaeological Findings in Jerusalem</a></li>\n\n\n\n<li><a>New Scientist &#8211; Jerusalem: Historical Findings</a></li>\n\n\n\n<li><a>Washington Post &#8211; Ancient Jerusalem Unearthed</a></li>\n\n\n\n<li><a>Discovery Channel &#8211; Jerusalem&#8217;s Hidden Treasures</a></li>\n\n\n\n<li><a>National Public Radio &#8211; Jerusalem&#8217;s Archaeological Discoveries</a></li>\n\n\n\n<li><a>Ancient Origins &#8211; Archaeological Evidence in Jerusalem</a></li>\n\n\n\n<li><a href=\"https://israelmyglory.org/article/amazing-archaeological-discoveries-affirm-jewish-claim-to-land/\">Amazing Archaeological Discoveries Affirm Jewish Claim to Land &#8211; Israel My Glory</a></li>\n\n\n\n<li><a href=\"https://www.timesofisrael.com/archaeologists-expose-muslim-jewish-dialogue-in-jerusalem-from-1300-years-ago/\">Archaeologists expose Muslim-Jewish &#8216;dialogue&#8217; in Jerusalem from 1,300 years ago &#8211; The Times of Israel</a></li>\n\n\n\n<li><a href=\"https://en.wikipedia.org/wiki/Archaeological_remnants_of_the_Jerusalem_Temple\">Archaeological remnants of the Jerusalem Temple &#8211; Wikipedia</a></li>\n\n\n\n<li><a href=\"https://www.jewishpress.com/indepth/opinions/denying-jerusalems-jewish-history-despite-archaeological-evidence/2019/10/03/\">Denying Jerusalem’s Jewish History Despite Archaeological Evidence &#8211; The Jewish Press</a></li>\n\n\n\n<li><a href=\"https://www.timesofisrael.com/archaeologists-unearth-1st-jerusalem-evidence-of-quake-from-bibles-book-of-amos/\">Archaeologists unearth 1st Jerusalem evidence of quake from Bible&#8217;s Book of Amos &#8211; The Times of Israel</a></li>\n\n\n\n<li><a href=\"https://www.bbc.com/news/world-middle-east-36358151\">BBC &#8211; Jerusalem&#8217;s Historical Roots</a></li>\n\n\n\n<li><a href=\"https://www.britannica.com/place/Jerusalem\">Encyclopaedia Britannica &#8211; Jerusalem</a></li>\n\n\n\n<li><a href=\"https://www.theguardian.com/world/jerusalem-archaeological-finds\">The Guardian &#8211; Unearthing Jerusalem</a></li>\n\n\n\n<li><a href=\"https://www.jpost.com/archaeology\">Jerusalem Post &#8211; Jerusalem Archaeology</a></li>\n</ol>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>We should wake up<br />\nAll the Palestinians in the world are falsifying the history of <a  href=\"https://iron-swords.co.il/t/jerusalem/\">Jerusalem</a></p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2811,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        54
    ],
    "class_list": [
        "post-2808",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-education"
    ],
    "lang": "en",
    "translations": {
        "en": 2808
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2808",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=2808"
            }
        ],
        "version-history": [
            {
                "count": 4,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2808/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 2815,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/2808/revisions/2815"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2811"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=2808"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=2808"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=2808"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}