{
    "id": 5718,
    "date": "2024-06-27T16:00:00",
    "date_gmt": "2024-06-27T13:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5718"
    },
    "modified": "2024-06-30T18:52:47",
    "modified_gmt": "2024-06-30T15:52:47",
    "slug": "episode-5-genocide-deep-dive-with-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/episode-5-genocide-deep-dive-with-doron-spielman/",
    "title": {
        "rendered": "Episode #5 Genocide | Deep Dive with Doron Spielman"
    },
    "content": {
        "rendered": "\n<div class=\"section-wrapper\" data-id=\"oVpReY\"><section class=\"wp-block-gutenverse-section guten-element guten-section guten-oVpReY layout-boxed align-stretch\"><div class=\"guten-background-overlay\"></div><div class=\"guten-shape-divider guten-shape-divider-top\"></div><div class=\"guten-shape-divider guten-shape-divider-bottom\"></div><div class=\"guten-container guten-column-gap-default\">\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-wcZt57\"><div class=\"guten-background-overlay\"></div><div class=\"sticky-wrapper\" data-id=\"wcZt57\"><div class=\"guten-column-wrapper\">\n<figure class=\"guten-element guten-video guten-8B5jJJ\"><div class=\"guten-video-wrapper\" data-property=\"{&quot;url&quot;:&quot;https://youtu.be/L1FX7hhzHsI&quot;,&quot;class&quot;:&quot;guten-video-background&quot;,&quot;width&quot;:&quot;100%&quot;,&quot;height&quot;:&quot;600px&quot;,&quot;playing&quot;:true,&quot;controls&quot;:true,&quot;playsinline&quot;:true,&quot;style&quot;:{},&quot;config&quot;:{&quot;youtube&quot;:{&quot;playerVars&quot;:{}}}}\"></div></figure>\n</div></div></div>\n\n\n\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-GfL5UK\"><div class=\"guten-background-overlay\"></div><div class=\"sticky-wrapper\" data-id=\"GfL5UK\"><div class=\"guten-column-wrapper\">\n<div class=\"guten-element gutenverse-text-editor guten-Ti4a2x\"><div class=\"text-content-inner\">\n<h3 class=\"wp-block-heading\">The Reality of Civilian Casualties</h3>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>The question often arises:</strong></h5>\n\n\n\n<p><strong>If there&#8217;s no genocide in Gaza, why are so many Gazan civilians dying?</strong> The answer is sadly quite simple: because Hamas wants them to die. This is Hamas&#8217;s survival strategy. They know that they can&#8217;t beat Israel in a war on the battlefield, so instead, they attack specifically in civilian areas, hoping civilians die in the crossfire. This will, in turn, cause global condemnation of Israel and force Israel to stop fighting. Then Hamas can go back underground, rebuild, and attack again, just as they have promised to do.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Debunking the Genocide Lie</h3>\n\n\n\n<p>It&#8217;s time to bury a lie once and for all: <strong>the lie that Israel is committing genocide in Gaza</strong>. This lie is told by Hamas, amplified by NGOs, and repeated by biased journalists. Since Hamas&#8217;s October 7th attack on Israel and the subsequent war in Gaza, Hamas and its network of collaborators and sympathizers have made the absurd claim that Israel has been committing genocide. Anyone who has followed Hamas&#8217;s PR strategy over the years should not be surprised by this.</p>\n\n\n\n<p>Hamas has one play in their PR handbook and they have used it again and again: it is to accuse Israel of the very crime that Hamas is guilty of committing. Unfortunately, their strategy is working. Genocide is the intentional destruction of a people, in whole or in part. The term was first coined by a Polish Jewish lawyer named Raphael Lemkin during World War II to describe Nazi Germany&#8217;s extermination policies against Jews and Poles. Since the Holocaust, additional genocides have taken place in places such as Armenia, Kosovo, Rwanda, and even as we speak in Darfur, Sudan.</p>\n</div></div>\n</div></div></div>\n</div></section></div>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Efforts to Protect Civilians</h3>\n\n\n\n<p>As opposed to these genocides, despite the extremely difficult conditions of fighting Hamas in Gaza, who are intentionally hiding amongst civilians, <strong>the Israeli Army has done more to help Gazan civilians move out of danger than any army in the history of armed conflict</strong>. Israel has enabled the safe movement of millions of people multiple times in Gaza to humanitarian zones while Hamas fires on the Israeli soldiers trying to protect these corridors. Israel has enabled the transfer of millions of tons of humanitarian aid, food, fuel, and health supplies into Gaza, despite Hamas constantly raiding these humanitarian trucks to take these supplies for themselves inside their tunnels, leaving their own population to starve above them. Israel has assisted the United States in establishing a new pier to transfer goods to the Gaza population from the sea.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217;s Genocidal Intentions</h3>\n\n\n\n<p>Hamas, on the other hand, has been open about being genocidal for years. In fact, the very first section of the Hamas Charter from 1988 reads: <strong>&#8220;Israel will exist and will continue to exist until Islam will obliterate it just as it obliterated others before it.&#8221;</strong> Hamas&#8217;s charter, their religious beliefs, and their education system all perpetuate this creed of death. Hamas has fired over 30,000 rockets over the past 15 years aimed at children in schools, kindergartens, hospitals, and homes. If this is not genocide, nothing is.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The October 7th Massacre</h3>\n\n\n\n<p><strong>On October 7th, 3,000 Hamas terrorists carried out an unprovoked cross-border massacre against 1,200 civilians</strong>. They slaughtered parents in cold blood in front of their children, found children hiding beneath their beds and shot them at point-blank range, raped women, mutilated their bodies, and abducted 250 hostages of all ages, including a 9-month-old baby. We found out about these massacres not only because we found the bodies but because Hamas proudly filmed their mutilations on live cams and released it to the general public. What were the crimes these people were punished for? Only one: they were born Jewish and they lived in the State of Israel. On October 7th, the goal was the extermination of an entire people. Hamas did not stop until it was stopped. If that&#8217;s not genocide, nothing is.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217;s Continued Threats</h3>\n\n\n\n<p>In the days following the attack, instead of expressing remorse, Ghazi Hamad, the Hamas spokesperson, had one response: they would repeat the October 7th slaughter for a second and third and fourth time until Israel is annihilated. The only reason this attempt at genocide didn&#8217;t spread is because Israeli forces are now fighting Hamas and the perpetrators of this massacre in the Gaza Strip. The defense against a genocide is not a genocide, and anyone who suggests this is an enemy of humanity.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Role of Collaborators and Sympathizers</h3>\n\n\n\n<p>Hamas are the ones that directly pull the trigger, but they are aided by their network of collaborators and sympathizers who amplify their grotesque lies. This includes the United Nations, UNRWA, anti-Israel NGOs, the government of South Africa, biased journalists, radical students on American campuses, and mobs of protesters in many world capitals. By failing to condemn Hamas and falsely accusing Israel, these groups are validating terrorism and inciting violence. They will go down in history as having the blood of innocents on their hands. They could have acted to stop further bloodshed. They would have saved Israeli lives and also Gazan lives, but they chose instead to be instruments of evil.</p>\n\n\n\n<h3 class=\"wp-block-heading\">A Call to Action</h3>\n\n\n\n<p>I have a message for those throughout the world who are echoing the appalling claims that Israel is committing genocide. <strong>This is your chance to show your strength and intelligence</strong>. Stop supporting these claims that are endlessly repeated throughout the world. Just as the Jewish people were falsely accused by the Nazis in the 1930s and 1940s, so we are being falsely blamed today. What legacy will you leave for your family and for yourself? Will you look back and see yourself as a coward who followed the chanting masses trying to convince you of the inverse of reality—that Israel and not Hamas is to blame? Or will you be a person of courage who uses their own free will to see the obvious truth in front of them?</p>\n\n\n\n<h3 class=\"wp-block-heading\">Final Thought</h3>\n\n\n\n<p>When you hear claims of genocide and crimes against humanity, take a step back, do your research, and come to an informed and intelligent opinion. If you do, you will see the anti-Israel, anti-Jewish propaganda and hopefully end up on the right side of history.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Civilian casualties in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> are high because <a  href=\"/hamas\">Hamas</a> intentionally operates in civilian areas, hoping to provoke international condemnation of <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>. Despite accusations of genocide, Israel has taken extensive measures to protect civilians, while <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>&#8216;s actions and intentions are clearly genocidal. Global sympathizers amplify Hamas&#8217;s false narratives, perpetuating the conflict.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5724,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5718",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5718
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5718",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5718"
            }
        ],
        "version-history": [
            {
                "count": 5,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5718/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5802,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5718/revisions/5802"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5724"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5718"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5718"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5718"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}