{
    "id": 5638,
    "date": "2024-06-26T15:00:00",
    "date_gmt": "2024-06-26T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5638"
    },
    "modified": "2024-06-27T23:29:47",
    "modified_gmt": "2024-06-27T20:29:47",
    "slug": "experts-admit-no-famine-in-gaza-daily-briefing-with-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/experts-admit-no-famine-in-gaza-daily-briefing-with-ruth-wasserman-lande/",
    "title": {
        "rendered": "Experts Admit: No Famine in Gaza | Daily Briefing with Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Experts Admit: No Famine in Gaza | Daily Briefing with Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/wKLxHw6ZAk8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Introduction</h3>\n\n\n\n<p><strong>Hello Everyone,</strong></p>\n\n\n\n<p>I&#8217;m citizen spokeswoman Ruth Wasserman Lande. This is the daily briefing of the Israeli citizen spokesperson&#8217;s office. We are live on YouTube, Instagram, and Twitter. Please begin submitting questions in the chat. Our briefings are now available shortly after broadcast as podcast episodes. Search for the Israeli citizen spokesperson&#8217;s office on Apple Podcasts, Spotify, Amazon Music, and all major podcast platforms.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Current Situation</h3>\n\n\n\n<p><strong>Today is Day 264 of the October 7th War.</strong></p>\n\n\n\n<p>Something unprecedented just happened. IPC, the Integrated Food Security Phase Classification experts, just admitted that they were wrong. They falsely accused Israel of provoking a famine in Gaza and just admitted that was made up. In March, a group of experts called the IPC predicted that Gaza would be in full-blown famine by now. They warned that 3,000 to 6,000 Gazans would be dying of starvation every week. But in a new report, IPC just admitted what has been plain to see: there is no famine in Gaza. Let me repeat that—they just admitted that their prediction of imminent famine was wrong and that there is no famine.</p>\n\n\n\n<p>They weren&#8217;t just wrong; they were way off. That means when the World Food Program declared that there was a full-blown famine in Gaza, it was making it up. When media hysterically repeated the famine claim, they were selling fairy tales. When the ICC prosecutor demanded arrest warrants for Israel&#8217;s leaders for using starvation as a mechanism for ethnic cleansing, he was simply starved of the facts.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Explanation of Miscalculations</h3>\n\n\n\n<p>How did the so-called experts get it so wrong? The IPC&#8217;s methodology is extremely flawed. You probably saw pictures of international airdrops in Gaza or heard about the US Army&#8217;s floating pier. The experts probably didn&#8217;t account for any of that. As we&#8217;ve mentioned here before, IPC doesn&#8217;t even count all the aid trucks entering Gaza and incredibly categorized food trucks as non-food deliveries. There is so much food entering the Gaza Strip that the UN has left hundreds of trucks on the Gazan side of the border undistributed—they just can&#8217;t handle all the food and aid.</p>\n\n\n\n<p>The World Food Program, the same one that claimed there was a famine, even asked Israel to stop sending so much aid to Northern Gaza because there was just too much food. Hamas keeps shooting at the humanitarian aid crossing because it wants to engineer a humanitarian crisis. Hamas is a death cult that wants the people of Gaza to suffer, but Israel will not let it win. Israel is flooding Gaza with so much aid that the UN is drowning under it. At this moment, the contents of 1,200 aid trucks are sitting on the Gazan side of the Kerem Shalom crossing waiting for UN agencies to pick them up. 7,000 pallets are waiting at the US floating pier, but the UN just is not doing its job and is scapegoating Israel to cover up for its failures. It&#8217;s easier for them to stick their heads in the sand.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Distribution Failures and International Reactions</h3>\n\n\n\n<p>That&#8217;s why their report doesn&#8217;t mention Hamas, the government of Gaza. The amount of food going into Gaza has increased in recent months. Since Hamas declared war on October 7th, over 710,000 tons of food have entered Gaza by air, land, and sea. Have you seen headlines announcing this good news? How about an apology from the experts? Their predictions of famine were one of the reasons the ICC prosecutor tried to get arrest warrants against Israeli leaders for allegedly starving the people of Gaza. Only someone carefully reading the IPC report would catch the quiet admission that food supplies keep going up. The whole case against Israel is based on a massive lie that the IPC just refuted.</p>\n\n\n\n<p>The UN has done such a bad job of distributing aid that UNRWA deleted its online dashboard to hide the figures. As we highlighted here at the citizen spokesperson&#8217;s office, the UN is scared of armed Palestinian gangs looting the trucks to steal smuggled cigarettes. Before, the UN relied on Hamas for protection. Now that Israel is close to dismantling Hamas, the UN doesn&#8217;t have terrorists to protect it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p><strong>We&#8217;ll now take questions from the audience watching on the various social media platforms.</strong></p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 1: Asaan</h4>\n\n\n\n<p><em>Q: What is the world doing to prevent Iran from getting a nuclear bomb?</em></p>\n\n\n\n<p>A: That&#8217;s a very good question. In my opinion, and not only mine, Iran has begun this whole spectacle of Gaza and the West Bank, Lebanon, and throwing the region into instability to take away attention from its nuclear program. The world is simply not doing enough. All international bodies have stopped getting full access to the places where Iran is secretly keeping its nuclear program. It&#8217;s already at 60% of enriching uranium, which is a huge problem. The world should focus on preventing Iran from getting nuclear power for the sake of war.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 2: Liz</h4>\n\n\n\n<p><em>Q: Doctors Without Borders said Israel killed one of their staff, but Israel says he was an Islamic Jihad terrorist. How is that possible?</em></p>\n\n\n\n<p>A: We&#8217;ve seen before that it&#8217;s very possible for so-called journalists to be terrorists with arms, and for so-called kids holding arms to be counted as civilians. We&#8217;ve seen in hospitals where Hamas operatives have kept hostages and used them as bases with equipment to attack Israeli civilians and soldiers. It is no surprise that doctors have been recruited for Hamas operations. They use the civilian population for their own purposes and hide their real identity by calling them doctors or journalists.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 3: Mark from Twitter</h4>\n\n\n\n<p><em>Q: We saw a video of Hamas shooting at a humanitarian convoy. Why doesn&#8217;t the world call them out?</em></p>\n\n\n\n<p>A: The world has not been quick to call out Hamas in general. It is quick to call out Israel at every opportunity. Shooting the crossing is exactly what Hamas wants—to create a humanitarian crisis. Hamas doesn&#8217;t care about its own people. Its operations are under schools and hospitals in civilian areas to create a humanitarian crisis. The world needs to wake up, highlight these facts, and call out the hypocrisy.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 4: Omar Rain Ford from Instagram</h4>\n\n\n\n<p><em>Q: When will the educational curriculum for children in Gaza be changed from hatred and murder under the umbrella of jihad?</em></p>\n\n\n\n<p>A: Thank you for asking that key question. It&#8217;s all about indoctrination, incitement, and education. If we eliminate every Hamas and Islamic Jihad operative, but don&#8217;t change the educational system, none of this will make sense. We need a proper peacekeeping, peaceloving education for the Palestinian population. This should be the key in every future agreement.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 5: Multiple Posts Across Channels</h4>\n\n\n\n<p><em>Q: Why isn&#8217;t Israel calling for UN Security Council resolutions regarding Lebanon, and is there a potential diplomatic solution to prevent further war and escalation in the north?</em></p>\n\n\n\n<p>A: The UN resolution that decided Hezbollah must move away from the Israeli-Lebanese border beyond the Litani River is not maintained. UN forces on the ground are doing nothing, and Hezbollah is on the border. Israel has disbelieved the possibility of UN resolutions having any clout. If there is no resolution between the two parties with international aid, there will be no choice but to go to war.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 6: Instagram User</h4>\n\n\n\n<p><em>Q: Are there any further plans to bring home more hostages from Gaza, particularly with a focus on the Bibas family?</em></p>\n\n\n\n<p>A: The first priority of the Israeli government and people is to bring those hostages home, whether dead or alive. We will do everything possible to bring them home. We are close to eliminating Hamas militarily. This is our first priority.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 7: Mark R from Twitter</h4>\n\n\n\n<p><em>Q: Of the hostages that have been rescued and brought back from Gaza, why do we not hear more about their stories in the international media and around the world?</em></p>\n\n\n\n<p>A: Israel has always been more gentle and responsive to the sensitivities of the hostages and civilians. Many have experienced horrific deeds that are difficult to put into words. Not all videos have been shown out of respect for the people and their families. The world must know, but Israel is very thoughtful about what is shared to protect everyone involved.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you so much for everyone. Make sure you are following on all social media platforms—YouTube, Instagram, Twitter, TikTok, Facebook—and on podcast platforms as well.</p>\n\n\n\n<p>I&#8217;m Ruth Wasserman Lande. Thank you very much for joining us.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/ruth-wasserman-lande/\">Ruth Wasserman Lande</a>, Israeli citizen spokeswoman, refutes claims of a <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> famine, highlighting <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a>&#8216;s mismanagement and <a  href=\"/hamas\">Hamas</a>&#8216;s manipulation. She emphasizes <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s nuclear threat and the misuse of humanitarian roles by terrorists and calls for global awareness and action against <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>&#8216;s tactics while prioritizing the rescue of Israeli <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5639,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5638",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5638
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5638",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5638"
            }
        ],
        "version-history": [
            {
                "count": 4,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5638/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5679,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5638/revisions/5679"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5639"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5638"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5638"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5638"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}