{
    "id": 4920,
    "date": "2024-06-04T15:00:00",
    "date_gmt": "2024-06-04T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=4920"
    },
    "modified": "2024-06-05T19:33:35",
    "modified_gmt": "2024-06-05T16:33:35",
    "slug": "four-hostages-killed-in-hamas-terror-dungeons",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/four-hostages-killed-in-hamas-terror-dungeons/",
    "title": {
        "rendered": "Four Hostages Killed in Hamas Terror Dungeons | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Four Hostages Killed in Hamas Terror Dungeons | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/xsUUiZjS19k?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I&#8217;m Eylon Levy. Today is June 4th, 2024, day 242 of the October 7th War. This is the daily briefing of the Israeli citizens spokesperson&#8217;s office. We&#8217;re live on all social media platforms. I invite you to start sending questions, and we&#8217;ll answer them at the end.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Update on Hostages</h2>\n\n\n\n<p>Yesterday, the Israel Defense Forces announced it had confirmed the deaths of four Israeli hostages in the Hamas terror dungeons. The four hostages are Heim Perry, 80 years old; Amiram Cooper, 84; Yoran Metka, 80; and Adav Powell, 51. Hamas seized all four from their homes on October 7th and abducted them into Gaza. The IDF said, based on new intelligence, that the four were killed together in the KH Unis area several months ago.</p>\n\n\n\n<p>What kind of monsters, what kind of barbaric savages, look at men who are old enough to be their grandparents and take them hostage? The level of dehumanization on display by Hamas and its supporters on October 7th and every day since is unfathomable. Heim Perry was a peace activist who believed in coexistence. He volunteered to drive sick children from Gaza who came to Israel to receive medical treatment. None of that saved him.</p>\n\n\n\n<p>Peace activism didn&#8217;t save Vivien Silva when she was burned alive in her home in Kibutsu. It didn&#8217;t save Nar Levi, who is still a hostage in Gaza. None of this was relevant to Hamas terrorists who see every single Israeli and every Jew as a legitimate target.</p>\n\n\n\n<p>All four of the Israeli hostages whom the IDF confirmed were killed in the Hamas Terror dungeons—Perry, Cooper, Metka, and Powell—were seen alive in Hamas propaganda videos. Hamas paraded Powell in a propaganda video released just last month. The captors wanted to trick the Israeli public into thinking that he was alive, but we now know that Powell was already dead when Hamas published that &#8220;proof of life.&#8221; Hamas is waging psychological warfare against the hostages&#8217; families, torturing them with false hope.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Call to Action</h2>\n\n\n\n<p>We want our hostages home now. Hamas&#8217;s bases—Qatar, Turkey, and Iran—must be pressured to demand Hamas accepts the Israeli proposal that&#8217;s on the table. Iran continues to literally light Israel on fire and watch it burn every day. Iran&#8217;s proxy army in Lebanon, Hezbollah, fires rockets, shoots anti-tank missiles, and sends suicide drones towards Israeli homes.</p>\n\n\n\n<p>When you see news about rocket attacks and read that a rocket landed in an open area, that’s meant to be reassuring, as if to say everything&#8217;s fine, no one was hurt, nothing was damaged. But now we see what &#8220;landed in an open area&#8221; really means. Northern Israel is on fire. Hezbollah&#8217;s rockets and suicide drones strike Israeli fields and forests and start fires that spread quickly. Shrapnel from Israeli interceptor rockets that destroy the incoming Hezbollah missiles and suicide drones before they strike Israeli homes and kill Israeli families also start fires.</p>\n\n\n\n<p>It&#8217;s summer here in Israel; there is no rain here in the summer. Everywhere is dry. The situation in Israel&#8217;s north is untenable and unbearable. Israel is fighting fires while literally under fire. Israelis have been displaced—60,000 of them forced to flee their homes in the north since October 8th. Every day, rockets, missiles, and suicide drones from Hezbollah, Iran&#8217;s proxy army in Lebanon, strike Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Questions on Support and Allies</h2>\n\n\n\n<h4 class=\"wp-block-heading\">EU Member States Involvement</h4>\n\n\n\n<p>We&#8217;ve received a lot of questions in advance from the Instagram stories. One person asks, &#8220;Did the EU member states offer to help fight the fires in the north?&#8221; I&#8217;m not aware of any offers of help. Let&#8217;s remember Israel is fighting these fires under fire. If you&#8217;re talking about sending a helicopter team from Greece or Cyprus, you&#8217;re asking to send them into a war zone where Hezbollah can target them with anti-tank missiles and other precision-guided missiles and suicide drones as well. That is not a safe environment that any country would be willing to send forces into. In the north, it looks like, for now, Israel is on its own, and Israel will draw the lessons accordingly about what it means to keep our people safe if other countries are not coming to our aid.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Building New Alliances</h4>\n\n\n\n<p>This is a question from Mayori, who responded to the Instagram stories: &#8220;Israel will likely have to build new alliances once the war is over. Who are the likely allies?&#8221; I think we have allies and friends around the world, and it&#8217;s important not to forget that. You look on social media and see the noise and the hate, a lot of it coming from bots and coordinated campaigns, and it makes us think that we are alone. I can tell you from the direct messages that I&#8217;m receiving, we&#8217;re not.</p>\n\n\n\n<p>I get messages every day from people in Ireland, Norway, Spain—countries that just recognized the Palestinian State as a reward for October 7th—saying, &#8220;Drown out the haters; we are with you.&#8221; We have friends and allies in the free world, and that is where Israel belongs—in the free world, in the club of democracies. We know that their publics are still with us, even though the opponents of Israel and its haters are loud and using violent intimidation to make it impossible for people to speak up for us.</p>\n\n\n\n<p>Part of why we&#8217;re giving you the tools to fight for us is to show the world why Israel is doing what it&#8217;s doing, why we are doing what their countries would do if they came under such attack, why we&#8217;re doing what they would like to think they would be capable of doing if they had to fight for their lives. We&#8217;re not asking for sympathy; we&#8217;re demanding the world&#8217;s respect. I think that reasonable people around the world understand why Israel is fighting to bring the hostages home—to make sure Hamas can never again abduct Israelis from their beds—and they&#8217;ll respect us more for it and strengthen our place in the free world.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Questions on High-Profile Responses</h2>\n\n\n\n<h4 class=\"wp-block-heading\">Greta Thunberg’s Position</h4>\n\n\n\n<p>A common question on Instagram stories is, &#8220;Is there a statement from Greta Thunberg yet?&#8221; Yes, where is Greta? We really need her now. For everyone saying that Palestine is an environmental justice cause—no. The ecological movement didn&#8217;t care when Hamas set Southern Israel on fire. When Hezbollah sets Northern Israel on fire, you can see the imagery from outer space—the massive destruction that is being caused, not to mention the carbon emissions.</p>\n\n\n\n<p>This shows you the way that Israel is being used and that other issues, like climate, are being used to bash Israel, rather than out of serious concern for the environment. Anyone truly concerned for the environment should be speaking up now about Hezbollah setting thousands upon thousands of acres on fire and sending all those carbon emissions into the air.</p>\n\n\n\n<h4 class=\"wp-block-heading\">UN’s Role with Hezbollah</h4>\n\n\n\n<p>A question coming through right now on the YouTube live: &#8220;Why does the UN let Hezbollah shoot the missiles even with the UN troops there on the ground carrying out a mission?&#8221; That&#8217;s an excellent question and a reminder that you can send questions on YouTube, not just on Instagram.</p>\n\n\n\n<p>There is a peacekeeping force in southern Lebanon called UNIFIL, created after the 2006 war, whose job is to monitor Hezbollah and make sure it doesn&#8217;t move south of the Litani River. Guess where Hezbollah is? It&#8217;s south of the Litani River, right along the Israeli border. Hezbollah shows absolute contempt for UNIFIL, treating its observers as human shields and the resolution as a mere formality, firing rockets from literally meters away from UNIFIL positions.</p>\n\n\n\n<p>At the end of the day, this is a question for the Security Council, which includes countries like China and Russia, which are not friends of Israel, and countries like France, which are closely associated with Lebanon and should be using more pressure on Lebanon and Hezbollah to stop shooting rockets at Israel.</p>\n\n\n\n<p>This is a reminder that when people talk about security guarantees for Israel, this is what it looks like: not an army that goes in and fights Hezbollah for Israel, but observers whose jobs are, at best, to write reports without affecting the safety of Israelis. The terrorists can simply use them as human shields and ignore their mandate.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Additional Questions</h2>\n\n\n\n<h4 class=\"wp-block-heading\">Pressure on Egypt</h4>\n\n\n\n<p>Another question from the YouTube live from Nikki: &#8220;Why is more pressure not being put on Egypt to cooperate with Israel?&#8221; We need more pressure on Egypt. It was really dismaying after months of the world falsely accusing Israel of not letting aid into Gaza, even as the number of trucks went up and up and up. You can see the numbers; we&#8217;re reaching record numbers of food trucks going into Gaza. Israel has been flooding Gaza with aid, yet the UN tells a fabricated story about Israel not letting aid in.</p>\n\n\n\n<p>Here&#8217;s what Egypt did: it shut the Rafa Crossing between Gaza and Egypt and stopped letting trucks at the Elish port in Egypt reach Kerem Shalom. It not only refused to let its own crossing be used but also refused to let aid reach the Israeli crossing, and there was no international outcry. World leaders speaking to Egypt did so in the most polite diplomatic language possible.</p>\n\n\n\n<p>This is because, unfortunately, Israel is an easy country to push around, while Egypt is treated with more respect due to its larger size. We need our supporters worldwide to speak up and say, &#8220;No, you don&#8217;t get to push Israel around. If you tell lies about Israel, we will call you out and put you in your place.&#8221; When other countries are guilty of the same things you accuse Israel of, criticize them accordingly or risk being hypocrites. Stop scapegoating and bullying Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Volunteering and Supporting the Israeli Citizen Spokesperson’s Office</h2>\n\n\n\n<p>Our last question today comes to us on all the platforms all the time: &#8220;How can people work with you, volunteer, or support the Israel citizen spokesperson&#8217;s office?&#8221; It&#8217;s a really heartwarming question, and I&#8217;m glad we&#8217;re getting so many questions about how to help.</p>\n\n\n\n<p>First, follow the Israeli citizen spokesperson&#8217;s office on all social media platforms: Instagram, Twitter, TikTok, Facebook, LinkedIn, YouTube—you name it. Follow it, share the links with all your friends, not only on social media but also on WhatsApp and Telegram channels. Tell them this is the place to go in the afternoon in Israel (8:00 a.m. Eastern time) for the information, talking points, and messages needed to continue the fight.</p>\n\n\n\n<p>If you want to help in a more substantial way, we are raising donations. Our entire civilian operation relies on private donations. You can visit the JG Give website and donate generously. Some of that will be matched by the Israeli diaspora ministry, but we are still fundraising.</p>\n\n\n\n<p>Moreover, anyone wanting to get involved can join our community. We will share the link on all social media platforms, including our Instagram stories, to the citizen spokesperson community. There, we will keep you up to date and provide special insider information. We want to build a global community of citizen spokespeople who will speak up for Israel. It&#8217;s not just me; we have a team, and some will take over the briefings in the coming days.</p>\n\n\n\n<p></p>\n\n\n\n<p>That&#8217;s all we have time for today. Thank you very much, everyone. We will be back tomorrow at 3:00 p.m. Israel time (8:00 a.m. Eastern time). Thank you very much, and keep safe. Keep up the good fight. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/eylon-levy/\">Eylon Levy</a> gives a daily briefing on the October 7th War, confirming deaths of four Israeli <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a> and detailing current threats from <a  href=\"/hezbollah\">Hezbollah</a> in Northern <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>. He addresses global responses, Egypt&#8217;s role, and stresses international support. Viewers are encouraged to follow, support, and volunteer with the Israeli citizen spokesperson&#8217;s office.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 4938,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-4920",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 4920
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4920",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4920"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4920/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 4941,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4920/revisions/4941"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/4938"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4920"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4920"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4920"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}