{
    "id": 18617,
    "date": "2024-06-07T12:19:00",
    "date_gmt": "2024-06-07T09:19:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18617"
    },
    "modified": "2024-11-05T12:22:27",
    "modified_gmt": "2024-11-05T10:22:27",
    "slug": "hamas-terrorists-eliminated-while-planning-attacks-from-inside-unrwa-school-grounds-2",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/know-your-enemies/unrwa/hamas-terrorists-eliminated-while-planning-attacks-from-inside-unrwa-school-grounds-2/",
    "title": {
        "rendered": "Hamas Terrorists Eliminated While Planning Attacks From Inside UNRWA School Grounds"
    },
    "content": {
        "rendered": "\n<p>In a critical operation directed by IDF intelligence and the ISA, the Israeli Air Force (IAF) targeted and eliminated a group of Hamas terrorists operating from within the grounds of the &#8216;Asmaa&#8217; UNRWA school in Shati, Gaza. The strike specifically targeted a container used as a Hamas Operations Cell, which served as a coordination point for planning imminent attacks against Israeli forces.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>UNRWA Facilities as Shields for Terror Operations</strong></h4>\n\n\n\n<p>The operation revealed that the UNRWA school grounds had been co-opted by Hamas for use as a strategic operations base. The terrorists exploited the school premises as a shield, conducting their planning and meeting activities from within a facility recognized internationally for humanitarian and educational purposes. This deliberate use of UNRWA property for military purposes underscores a disturbing reality: UNRWA facilities are routinely utilized by Hamas as protective cover for their terrorist activities, placing civilians and the legitimacy of aid organizations at grave risk.</p>\n\n\n\n<p>The IDF, maintaining its commitment to minimizing civilian casualties, took extensive precautionary steps before the operation, including intelligence assessments and aerial surveillance. This preparation ensured that the strike would be as targeted as possible, aiming solely at the terrorists inside the operations container while sparing non-combatants. The operation was carried out with precision munitions, effectively neutralizing the threat without significant collateral damage.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Hamas&#8217;s Strategy of Using Civilian Sites</strong></h4>\n\n\n\n<p>Hamas’s use of civilian locations, such as UNRWA schools, for military operations is a violation of international law and a tactic that endangers Gazan civilians. By embedding operatives within these sites, Hamas not only jeopardizes the safety of innocent people but also leverages these spaces to shield their actions, knowing that military responses could be seen as controversial due to the use of civilian infrastructure.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>UNRWA’s Complicit Role</strong></h3>\n\n\n\n<p>This event is part of an established pattern where UNRWA facilities have been found supporting or sheltering terrorist activities. Whether through negligence or tacit compliance, UNRWA&#8217;s infrastructure has repeatedly been used for purposes that contravene its mission of neutrality and humanitarian aid. Such actions raise serious questions about the oversight and governance within UNRWA, which must be held accountable for allowing its premises to become operational bases for terrorist groups like Hamas.</p>\n\n\n\n<p>The elimination of Hamas terrorists from within the grounds of an UNRWA school in Shati highlights an ongoing, urgent issue: the misuse of humanitarian facilities for militant purposes. This strategic and systematic practice not only violates international law but also puts the lives of civilians at risk and undermines the very purpose of aid organizations. The international community must demand stricter oversight and accountability from UNRWA to ensure its facilities are not used as sanctuaries for violence and terrorism.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"/hamas\">Hamas</a> used an <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a> school as an operations base, exposing UNRWA’s complicity in terrorism and endangering civilians in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18618,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1342,
        "footnotes": ""
    },
    "categories": [
        1342
    ],
    "tags": [
        1663,
        1340
    ],
    "class_list": [
        "post-18617",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-unrwa",
        "tag-philippe-lazzarini",
        "tag-the-un"
    ],
    "lang": "en",
    "translations": {
        "en": 18617
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18617",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18617"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18617/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18619,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18617/revisions/18619"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18618"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18617"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18617"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18617"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}