{
    "id": 5680,
    "date": "2024-06-27T15:00:46",
    "date_gmt": "2024-06-27T12:00:46",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5680"
    },
    "modified": "2024-06-27T23:35:12",
    "modified_gmt": "2024-06-27T20:35:12",
    "slug": "hamas-shoots-at-unicef-daily-briefing-with-ashley-waxman-bakshi",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-shoots-at-unicef-daily-briefing-with-ashley-waxman-bakshi/",
    "title": {
        "rendered": "Hamas shoots at UNICEF | Daily Briefing with Ashley Waxman Bakshi"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas shoots at UNICEF | Daily Briefing with Ashley Waxman Bakshi\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/NAYT7YRMpd0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Introduction</h3>\n\n\n\n<p><strong>Hello Everyone,</strong></p>\n\n\n\n<p>I am citizen spokesperson Ashley Waxman Bakshi. This is the daily briefing of the Israeli citizens spokesperson&#8217;s office. We are live on YouTube, Instagram, and Twitter. Please begin submitting questions in the chat. Our briefings are now available shortly after broadcast as podcast episodes on all major podcast platforms.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Current Situation</h3>\n\n\n\n<p><strong>Today is Day 265 of the October 7th War.</strong></p>\n\n\n\n<p>Yesterday, I saw a very disturbing video. In the video, Hamas shoots at people helping Gaza&#8217;s children. Of course, you may not have seen it on the nightly news, but the video showed Hamas shelling UNICEF, the UN&#8217;s children&#8217;s organization. Israel and UNICEF were coordinating a convoy of clearly marked UN vehicles reuniting Gazan children with their families when Hamas terrorists opened fire at them in broad daylight. Thankfully, after taking cover, the UN children&#8217;s convoy was able to complete its mission.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217;s Tactics and Misinformation</h3>\n\n\n\n<p>We all know by now that the Hamas terror regime is trying to create a humanitarian crisis in Gaza, and Israel is trying to stop it. Hamas wants to intentionally cause civilian suffering to frame Israel and inflict international condemnation on the sovereign country at war with a genocidal terrorist organization. Israel is fighting to end the Hamas terror regime to promise a better future for the people of Israel and Gaza alike. The world must stop Hamas&#8217;s evil efforts to make their own people suffer.</p>\n\n\n\n<p>Hamas has repeatedly attacked Israel&#8217;s families from Gazan schools and hospitals. Hamas&#8217;s rockets, which aim at murdering children in Israel, have fallen short and murdered children in Gaza. Hamas has gunned down Gazans, stolen aid, and stopped them from evacuating out of harm&#8217;s way. Hamas shoots at Gaza&#8217;s children every day. Any day Hamas holds power is a day Hamas threatens every child in Israel and Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Report on Gaza Famine</h3>\n\n\n\n<p>My colleagues have previously discussed the IPC&#8217;s new report admitting there is no famine in Gaza. The report is clear that there never was a famine—they&#8217;d have to ignore literally tens of thousands of tons of food to say that. Their previous predictions that there would be a famine were completely disconnected from reality. Despite these findings, international media continues to report about famine, spreading misinformation and essentially contributing to Hamas propaganda. Many organizations and media that blasted the false famine claims are doubling down instead of admitting they were wrong.</p>\n\n\n\n<p>The IPC&#8217;s report not only shows that there isn&#8217;t and wasn&#8217;t ever a famine, but the people in Gaza are actually better fed now than before Hamas attacked Israel on October 7th. We also mentioned a few days ago that UNRWA hid its reporting of aid entering Gaza. Well, they must have finally been embarrassed into putting the numbers back online, except now UNRWA added a disclaimer. They admit in fine print that they are not counting all the aid. We&#8217;ve been saying for months that more aid is entering now than before the war. We&#8217;ve pointed out that groups like UNRWA were lying to cover up for Hamas because UNRWA is a Hamas front. Everything they have said is a lie targeting the Jewish state, meant to leave the October 7th monsters free to plan another massacre, as they again and again vow to do.</p>\n\n\n\n<h3 class=\"wp-block-heading\">International Organizations and Terrorism</h3>\n\n\n\n<p>UNRWA is not the only international organization in league with terrorists. Doctors Without Borders is also giving cover to jihadists. Earlier this week, Doctors Without Borders condemned Israel for the senseless killing of one of its medical staff, F. Al Wy. But it turns out F. Al Wy was a terrorist fighting with the Palestinian Islamic Jihad group, an internationally banned terror group and an Iranian proxy army that took part in the brutal massacres of October 7th. Psychotherapist by day, rocket expert by night, Al Wy used his knowledge of chemistry and electronics to develop the rockets that terrorized children in Israel and murdered children in Gaza. He used MSF to hide his terror under a veneer of humanitarian work.</p>\n\n\n\n<p>Doctors Without Borders owes us answers. Did they know he was a terrorist? Because we know Hamas and PIJ hire medics who pretend to be civilians. If they didn&#8217;t know, why not? Why don&#8217;t they bother to check? Anyone donating to these organizations should be outraged and should express that outrage to the people like Doctors Without Borders who used your money to fund a terrorist.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p><strong>We&#8217;ll now take some questions from our audience watching live on various social media platforms. Please continue to submit your questions.</strong></p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 1</h4>\n\n\n\n<p><em>Q: Israel has a strong army, but can they really defeat Hamas? How do you kill an ideology?</em></p>\n\n\n\n<p>A: It&#8217;s not the army&#8217;s job to kill an ideology. The goals of the war are very clear: to destroy Hamas&#8217;s military capability so that we don&#8217;t have the imminent threat as we did on October 6th. For the ideology, this will take time. It is possible to do, just as we have seen throughout history with Nazi Germany and the Japanese. Education is key. UNRWA, a Hamas front, can no longer be in charge of educating the children of Gaza. We need a coalition of moderate Arab-friendly neighbors to help re-educate the population to want peace and not simply to eradicate all Jews.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 2</h4>\n\n\n\n<p><em>Q: If Israel says that it is fighting Hamas, then what is Israel&#8217;s excuse for killing people in Jenin, Nablus, and Qalqilya?</em></p>\n\n\n\n<p>A: Great question. Contrary to popular belief, Hamas is very strong in the West Bank. If there were elections held tomorrow, Hamas would likely win, which is why the Palestinian Authority is not holding elections. It&#8217;s important to note that it&#8217;s not only Hamas operating from the West Bank. We have many organizations like PFLP, Palestinian Islamic Jihad, and Lion&#8217;s Den. Over the past months and years, we&#8217;ve seen numerous terrorist attacks coming out of the West Bank into Israel, killing innocent Israeli civilians. Israel has an obligation to defend and protect its civilians from terrorism, whether it comes from Gaza or the West Bank.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 3</h4>\n\n\n\n<p><em>Q: Arabic media reported that explosives were found in Jordan on the way to the West Bank, but Jordan stopped them. What does the Arab world think of Hamas?</em></p>\n\n\n\n<p>A: This question shows how complicated the Middle East is. There is cooperation between Jordan and Israel to prevent illegal smuggling of weapons and arms. Jordan does not want radical Islamic terrorist organizations and Iranian proxies to have explosives within its borders. They understand, like many of our regional partners, that Iran is a threat not only to Israel but to the entire region. This is a broader geopolitical war. Iran aims to cause chaos and instability through Hezbollah, Hamas, and the Houthis. Israel will not allow them to bring chaos and instability to our region.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you very much for your questions and for joining us today. Please make sure you are following us on YouTube, Instagram, Twitter, and our new podcast. We will see you on Sunday at 3:00 PM Israel time and 8:00 AM Eastern Standard Time. Have a great weekend.</p>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/ashley-waxman-bakshi/\">Ashley Waxman Bakshi</a>, Israeli citizen spokesperson, addresses the false claims of a <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> famine, exposes <a  href=\"/hamas\">Hamas</a>&#8216;s tactics, and criticizes international organizations like <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a> and Doctors Without Borders for aiding terrorists. She emphasizes the need for <a  href=\"https://iron-swords.co.il/t/education/\">education</a> reform in Gaza and highlights the importance of regional cooperation against <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s destabilizing efforts.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5681,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5680",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5680
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5680",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5680"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5680/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5684,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5680/revisions/5684"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5681"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5680"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5680"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5680"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}