{
    "id": 4891,
    "date": "2024-06-03T15:00:00",
    "date_gmt": "2024-06-03T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=4891"
    },
    "modified": "2024-06-03T17:04:13",
    "modified_gmt": "2024-06-03T14:04:13",
    "slug": "hezbollah-terror-army-in-lebanon-intensifies-attacks-on-israel-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-terror-army-in-lebanon-intensifies-attacks-on-israel-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "Hezbollah Terror Army in Lebanon Intensifies Attacks on Israel | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Terror Army in Lebanon Intensifies Attacks on Israel | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/mgwxs_nOaZ4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I&#8217;m Eylon Levy. Today is June 3rd, 2024, day 241 of the October 7th War. This is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. We&#8217;re live on all social media platforms, and I invite you to start sending questions; we&#8217;ll answer them at the end.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Dov Yehud&#8217;s Tragic Fate</strong></h2>\n\n\n\n<p>Today, the IDF announced that Dov Yehud, who was assumed to be a hostage in Gaza, was murdered on October 7th and not taken hostage at all. Dov Yehud is a hero of Israel. He was a paramedic who left his house in Kibbutz Nirim on the morning of October 7th to try to save lives. He was murdered by Hamas. He left behind a pregnant wife, who has now given birth to a baby who will never meet its dad. Dov&#8217;s body was found in Nirim, but it was not possible until now to identify the body. The identification of the remains required the work of forensic anthropologists and other scientists. Just think about what that means—what barbaric atrocities Hamas committed on October 7th that left human remains unrecognizable for 8 months. This news brings no closure for the Yehud family because Dov&#8217;s sister, Arel, is still trapped in the Hamas terror dungeons, one of 124 hostages still trapped there. At least 39 of them were killed on October 7th or since in captivity.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Northern Israel Situation</strong></h2>\n\n\n\n<p>There is a full-scale war in northern Israel raging right now with constant rocket fire, anti-tank missile attacks, and drone infiltrations from the Hezbollah terror army in Lebanon. These attacks have forced 60,000 Israelis to flee from their homes, homes that are still being shelled every day. The October 7th war that started with a Hamas invasion quickly became the October 8th Regional War when Hezbollah in Lebanon attacked Israel. Everyone needs to understand what Hezbollah is. Hezbollah is a powerful Lebanese militia stronger than most armies in the world, and it is financed, trained, and armed by Iran. Hezbollah is also a political party. The name Hezbollah literally means Party of God. Hezbollah is part of the Lebanese government. Hezbollah is an Iranian proxy on Israel&#8217;s border, and Hezbollah&#8217;s goal, just like Hamas, is the destruction of Israel.</p>\n\n\n\n<p>On October 8th, Hezbollah chose to join Hamas&#8217;s war, and nearly every day since October 8th, Hezbollah has fired rockets and anti-tank missiles at Israeli homes and sent drones into Israeli airspace. Northern Israel is a war zone. Businesses are shut, homes are abandoned, and fires are raging. Just yesterday, a barrage of 10 rockets fired from Lebanon struck the city of Katzrin in the Golan Heights. A massive fire broke out. This is the new normal. Hezbollah terrorists wake up in the morning, set up their anti-tank missiles, and shoot them at Israeli houses. Countless Israeli houses have been destroyed by Hezbollah&#8217;s anti-tank missiles, and that threat is not confined to the border. Hezbollah&#8217;s attacks are going deeper and deeper into Israel. Just the other day, sirens went off in the city of Akko, just north of Israel&#8217;s major port city of Haifa. The IDF said a suspicious aerial target was intercepted over the city. We&#8217;re talking about an Iranian drone launched by Hezbollah. Think about the military capabilities that Hamas has demonstrated since October 7th. Hezbollah&#8217;s capabilities are greater. The threat from Hezbollah is greater. And you know what&#8217;s interesting? None of the people screaming for a ceasefire in Gaza to save Hamas&#8217;s skin are screaming at Hezbollah to stop attacking Israel. But it must. Hezbollah must back off, or Israel is going to be forced to make it back away.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Questions from the Public</strong></h2>\n\n\n\n<p><strong>Question:</strong> What&#8217;s the difference between the fighting from Lebanon now and a declared war?</p>\n\n\n\n<p><strong>Eylon Levy:</strong> The situation in Lebanon now is, for all intents and purposes, a fully-fledged war. One hasn&#8217;t been declared, but that&#8217;s the situation. It&#8217;s not a low-grade war; it&#8217;s not a drip-drip of rockets. It is constant barrages of dozens of rockets at northern Israel. The whole northern border has been cleared of civilians who have been forced to flee their homes. We&#8217;re having daily retaliations by the IDF and by the Israeli Air Force, also deeper and deeper into Lebanon, to try to degrade Hezbollah&#8217;s activities and to try to force it to back away. Now, for now, the two sides have been playing an uneasy tango within certain unwritten rules of the game. Hezbollah has contained most of its attacks to a certain distance from the border. It hasn&#8217;t unleashed its full capabilities. It has 150,000 rockets. Anyone who&#8217;s watched the State of the Nation podcast will remember Colonel Mary Eisen telling us that Hezbollah has the eighth largest missile stockpile in the world, and it&#8217;s not even a sovereign state. And if it chooses to unleash hell, it can rain over a thousand rockets on Israel every single day. And if the Iron Dome system intercepts 95% of them, we&#8217;re still talking about 50 massive precision-guided half-ton missiles that can get through every single day. That is what an all-out war would mean. But for all intents and purposes, now, there is a full-scale war raging with Hezbollah. It&#8217;s not getting attention from the media; it&#8217;s not getting attention from world leaders; it&#8217;s definitely not getting attention from the campus left. But we need world leaders to demand that Hezbollah stop and put pressure on it to back away from the border in line with UN Security Council resolutions. I&#8217;ll remind you: Resolution 1701 from 2006, which ended the Second Lebanon War, forced Hezbollah north of the Litani River. But it&#8217;s not there. It&#8217;s right on Israel&#8217;s border, and it needs to back off, or Israel is going to have to use much more force to make it back away.</p>\n\n\n\n<p><strong>Question:</strong> Do you have any updates after President Biden&#8217;s speech on Friday that have not been shared yet?</p>\n\n\n\n<p><strong>Eylon Levy:</strong> I understand the latest is Hamas has given an answer to Egypt that is now being reviewed by Israel. I&#8217;m seeing reports that the Prime Minister told the Knesset Foreign Affairs Committee that the plan presented by the US administration is not the full Israeli proposal. There are other details, but let&#8217;s wait and cross our fingers and hope that the Hamas terror organization will be pressured into accepting that deal and we can start to get the hostages back home.</p>\n\n\n\n<p><strong>Question:</strong> What is the latest humanitarian statistics about aid going into Gaza?</p>\n\n\n\n<p><strong>Eylon Levy:</strong> Excellent question. Israel&#8217;s policy is to let as much aid into Gaza as the world wants. There are no restrictions on the amount of aid. In just the last weeks, we saw 1,858 trucks entering via the Kerem Shalom and Erez crossings—1,858. Many of those came from Egypt; many others came from Jordan. That included also 13 tankers carrying over half a million liters of fuel. The problem at the moment is the UN is struggling to distribute the aid that is inside Gaza. On Saturday, Israel published that there were the contents of 600 trucks of aid sitting on the Gazan side of Kerem Shalom, and the UN hadn&#8217;t picked it up. Israel had invited the UN to come at 6:30 in the morning; they didn&#8217;t come till 10 or 11 to start picking up the aid. Israel is letting aid into the Gaza Strip faster than the UN can distribute it, and we&#8217;re seeing UN officials attacking Israel, making up stories about it not letting aid in to cover up the fact that they&#8217;re not managing to distribute aid. And that is why Israel is calling on the UN to scale up its humanitarian efforts in Gaza and why Israel is increasingly relying on the private sector inside Gaza. That means working with Palestinian businessmen in Gaza to get aid to the people who need it and make sure that Hamas can&#8217;t steal it.</p>\n\n\n\n<p><strong>Question:</strong> This is a question from our Instagram live feed from Talia. Yesterday, at the Israel Solidarity Rally in New York, signs read, &#8220;Kill the hostages, they&#8217;re not coming home.&#8221; How did America get to this point, and what could be done to prevent this from happening?</p>\n\n\n\n<p><strong>Eylon Levy:</strong> Yeah, really horrific. The basic lack of humanity that we&#8217;re seeing from the pro-Hamas protesters is not surprising, given they&#8217;re protesting for the inhumane Hamas terror organization. I think the answer is that when you have an ideology that tells you that the victim is always right and you don&#8217;t want to accept that Israel might be right and Israel might have a point, you have to deny that Israelis are victims. And in order to deny that Israelis are victims, you have to deny that they&#8217;re human. And that&#8217;s why you see people all around the world tearing down posters of the hostages because it conflicts with their basic worldview that the victim is always right and that Israel must be wrong. And I hope that people see the horrific signs and the really disgusting activities of the pro-Hamas movement and understand that this is an attack not only on Israel and Jewish people but on basic values of decency, of being good citizens, and understand that this repulsive behavior has no place anywhere in the free world—not in the US, not in Canada, not in the UK, and not in any other country that respects itself.</p>\n\n\n\n<p><strong>Question:</strong> Our last question today is from Maryanne, who replied to your Instagram story. &#8220;I want to read up on the history of Jews, Israel, and the region. Any book recommendations?&#8221;</p>\n\n\n\n<p><strong>Eylon Levy:</strong> A lot of recommendations. Let me give you one recommendation from one of our citizen spokespeople here at our office. Anat Wil wrote a fantastic book together with Adi Schwartz called <em>The War of Return: How Western Indulgence of the Palestinian Dream Has Fuelled the Israeli-Palestinian Conflict</em>. It&#8217;s a book about how we got to this situation where the Palestinians have their own refugee agency that is committed to delegitimizing the state of Israel, whose camps produce the terrorists who perpetrated the October 7th attacks. UNRWA is a front for Hamas, covering up its theft of aid and allowing Hamas to operate out of its facilities. It is an eye-opening read about how we got to this situation that a war that should have ended in 1948 is still raging because of the terrible activities of the United Nations and what we need to do to fix it so that we can look forward to a future peace in which Palestinians have made their peace with the fact that Israel is here to stay. So, <em>The War of Return</em> by our own citizen spokeswoman Dr. Anat Wil and Adi Schwartz.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Conclusion</strong></h2>\n\n\n\n<p>Okay, that&#8217;s all we have time for today. We&#8217;ll be back at the same time tomorrow, 3 PM Israel time, 8 AM Eastern, across all social media platforms: YouTube, Instagram, Twitter, Facebook—you name it. Thank you very much, everyone, and keep safe. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/eylon-levy/\">Eylon Levy</a>&#8216;s briefing on June 3rd, 2024, highlights the tragic murder of Dov Yehud by <a  href=\"/hamas\">Hamas</a>, escalating regional conflicts involving <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> and its proxies, the dire situation in northern <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> due to <a  href=\"/hezbollah\">Hezbollah</a> attacks, humanitarian aid challenges in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, and the importance of addressing global anti-Israel sentiment and pro-<a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> protests.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 4892,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-4891",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 4891
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4891",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4891"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4891/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 4907,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4891/revisions/4907"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/4892"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4891"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4891"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4891"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}