{
    "id": 5533,
    "date": "2024-06-24T10:00:00",
    "date_gmt": "2024-06-24T07:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5533"
    },
    "modified": "2024-06-24T21:09:12",
    "modified_gmt": "2024-06-24T18:09:12",
    "slug": "hezbollah-hides-arms-in-airport-daily-briefing-with-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-hides-arms-in-airport-daily-briefing-with-doron-spielman/",
    "title": {
        "rendered": "Hezbollah Hides Arms in Airport | Daily Briefing with Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Hides Arms in Airport  | Daily Briefing with Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/TKTqcfiZi8s?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Opening</h3>\n\n\n\n<p><strong>Hello, Everyone</strong> I am Deron Spielman. This is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on social media platforms Instagram, X, and YouTube. Wherever you are watching, you can submit questions into the live chat. Starting today, these daily briefings are now available shortly after broadcast as podcast episodes. Search for the Israeli Citizen Spokesperson&#8217;s Office on Apple Podcasts, Spotify, Amazon Music, and all major podcast platforms. Find a link across our social media.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Future Predictions</h3>\n\n\n\n<p><strong>Imagine Hezbollah&#8217;s Continued Aggression</strong> Imagine that Hezbollah, Iran&#8217;s proxy army in Lebanon, continues its war against Israel, which started on October 8th. Imagine it continues to launch thousands of missiles and suicide drones at Israelis, preventing 60,000 displaced Israelis from returning safely to their own homes. Imagine after months of warning Hezbollah to back off, Israel is finally forced to push it away. Soon after, there will be headlines screaming &#8220;Israel Bombs Beirut Airport.&#8221; The UN will claim an indiscriminate attack by Israel, and international organizations will blame Israel for the collective punishment of innocent civilians in Lebanon. How do I know this? It isn’t some top-secret intelligence leak; everyone in Lebanon plainly sees that Iran&#8217;s terror army Hezbollah has, for years, been embedding itself in civilian infrastructure, even in Beirut’s International Airport.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Activities</h3>\n\n\n\n<p><strong>Recent Exposés and Statements</strong> Beirut’s people are still traumatized by the devastating massive explosion at Beirut Seaport whose investigation has been blocked. Yesterday, the UK Telegraph ran a bombshell exposé: Hezbollah is storing huge quantities of Iranian weapons, including missiles and explosives, in Beirut’s main civilian airport. Whistleblowers reported unmarked containers arriving in Beirut Airport from Iran and being shepherded through customs by senior Hezbollah officials. Boxes containing unguided artillery rockets, short-range missiles, and even ballistic missiles. Lebanon’s Transport Minister, appointed by Hezbollah of course, tried to debunk the report with a tour for media diplomats. Look at this: they were stopped from actually entering into the cargo terminal. Where is the UN when you need it? Hezbollah is committing war crimes and endangering Lebanese civilians.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Lebanese Opposition</h3>\n\n\n\n<p><strong>Voices Against Hezbollah</strong> That’s not a surprise because just last week, Hezbollah warlord Hassan Nasrallah threatened to commit war crimes and fight without rules. If he says it, maybe we should believe him. Anyone who cares about innocent Lebanese lives, as we all should, needs to speak up and act now. Do you know who cares about the Lebanese people? The Lebanese people themselves. Over the last week, brave Lebanese have been campaigning online against Hezbollah&#8217;s war behind the Arabic hashtag &#8220;Lebanon doesn’t want war.&#8221; It’s been used over 100,000 times and reached millions of people around the world. Lebanese people have called to disarm Hezbollah and implement 1701, the UN Security Council resolution that ended the 2006 war and was meant to remove Hezbollah from control in southern Lebanon. In a Lebanon controlled by Hezbollah, not following the party line can mean danger for these brave Lebanese people and their families. But many Lebanese people know that silence is dangerous too.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Call for International Action</h3>\n\n\n\n<p><strong>The Global Responsibility</strong> In this war, Hezbollah has no problem sacrificing innocent civilians in both Lebanon and Israel to serve Iran, their patron’s goals. The world must stand with the Lebanese people and demand that Hezbollah back off and stop its war in Israel. Lebanon and Israel should be at peace, and without meddling from Iran&#8217;s terror army, they could again be at peace. Hezbollah believes they can continue firing rockets at homes in Israel with impunity. And why shouldn’t they believe this? For the last eight months, Hezbollah, Iran&#8217;s proxy army in Lebanon, has been taking notes from Hamas, Iran&#8217;s proxy army in Gaza, on how to manipulate the UN, the international community, and the media. Hezbollah has seen Hamas operate from hospitals, schools, and mosques and simply get away with it. When Hamas fought out of the basement of a hospital, UN officials didn’t attack Hamas; they attacked Israel and told Hamas it had immunity. When Hamas stored rockets in schools, the UN attacked Israel. Hezbollah has been watching the news just like you and I have. They’ve seen that even in the face of the clearest evidence, there are many who will almost never call out Hamas for endangering Gazan civilians. And they’ve seen that for some, there’s no accusation of alleged Israeli cruelty, no terrorist propaganda that they won’t report as fact, no matter how absurd.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Encouragement for Advocacy</h3>\n\n\n\n<p><strong>Demand for Action</strong> We should expect that as long as this works, as long as Hamas is rewarded, even incentivized to hide behind civilians, Hezbollah will continue embracing the same playbook in its war on Israel. As long as Hezbollah can explicitly say it will attack Israel with no rules, as long as it can threaten EU members like Cyprus with impunity, as long as it can hide behind Lebanese civilians, Hezbollah will hide behind Lebanese civilians and attack Israel knowing that the UN and the international media will cover for it and place the blame on Israel. Demand that your leaders stop Hezbollah and its war on Israel now before Israel is forced to end the war ourselves.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing and Q&amp;A</h3>\n\n\n\n<p><strong>Conclusion and Audience Interaction</strong> Our office and our spokespersons will continue to share analyses about these issues on social media. Now, let’s take some questions from our audience watching live on social media.</p>\n\n\n\n<p><strong>Question from Sophie Barnett via YouTube Live Feed:</strong> <em>Would a full-blown war with Hezbollah look different than our war with Hamas, and if so, how?</em></p>\n\n\n\n<p><strong>Answer:</strong> We have to understand that Hamas is a terrorist organization that launched a brutal massacre against Israel. However, Hezbollah is the jewel in the crown of Iran. They are five times the size of Hamas and have received billions of dollars from Iran. They have been compiling weapons, short-range weapons, long-range weapons, and precision-guided missiles. They have trained fighters who practice worldwide, preparing for an attack on Israel. Fighting Hezbollah is on the level of fighting any army in the world. They have committed more terror attacks globally than any other terrorist organization. Therefore, a war with Hezbollah would be very difficult. It&#8217;s a war Israel will win, but it&#8217;s a war Israel never wanted in the first place. Hezbollah violated the 1701 agreement with the UN, infiltrating southern Lebanon and attacking Israel on October 8th.</p>\n\n\n\n<p><strong>Question from David Toell on Instagram Live:</strong> <em>Score 0 to 100%, the likelihood of a full war between Hezbollah and Israel in the coming months?</em></p>\n\n\n\n<p><strong>Answer:</strong> If there was a terrorist, God forbid, outside your house shooting at it, what would be the likelihood that you would defend your family? That is the scenario. Hezbollah began this by shooting rockets at Israeli civilians. If our people cannot go back to their homes and we have to defend ourselves from a terrorist, we will do so. We are calling on the international community to take note. Israel does not want to go to war. Hezbollah must live up to the 1701 agreement and move beyond the Litani River. If they don&#8217;t, Israel will do whatever it takes to defend our homes.</p>\n\n\n\n<p><strong>Question from Elena Zonana via YouTube:</strong> <em>How is Israel going to defend itself on so many fronts: Lebanon, Syria, Iran, Houthis, and West Bank?</em></p>\n\n\n\n<p><strong>Answer:</strong> Iran has proxies attacking Israel on seven different fronts. Israel, a democratic country of 10 million people, is being attacked by massive forces. However, Israel is prepared. We have a fantastic army, an excellent air force, intelligence, and a unified population. We will defend our land and citizens. We call upon the international community, especially the United States, to help Israel defend itself. Iran and its proxies, like Hezbollah and the Houthis, are like the Nazi regime before 1939. We must stop them before they reach other targets worldwide.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Final Remarks</h3>\n\n\n\n<p><strong>Thank You and Encouragement</strong> Thank you for all of your questions and for joining us. Please continue to tune in to the Israeli Citizen Spokesperson&#8217;s Unit. You can find us on Twitter, Instagram, and YouTube. We’re here every day at 3 p.m. Israel time, 8 a.m. Eastern Standard Time. We look forward to your joining us again.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Deron Spielman of the Israeli Citizen Spokesperson&#8217;s Office discusses <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s aggression, Iranian support, and the impact on Israeli and Lebanese civilians. He calls for international action against <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>, highlights the challenges of a potential war, and addresses audience questions on the conflict&#8217;s implications and <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s defense strategies.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5534,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5533",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5533
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5533",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5533"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5533/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5535,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5533/revisions/5535"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5534"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5533"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5533"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5533"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}