{
    "id": 5489,
    "date": "2024-06-20T15:00:00",
    "date_gmt": "2024-06-20T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5489"
    },
    "modified": "2024-06-21T08:56:59",
    "modified_gmt": "2024-06-21T05:56:59",
    "slug": "hezbollah-leader-says-every-israeli-is-a-target-daily-briefing-with-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-leader-says-every-israeli-is-a-target-daily-briefing-with-daniel-rubenstein/",
    "title": {
        "rendered": "Hezbollah Leader Says Every Israeli Is a Target | Daily Briefing with Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Leader Says Every Israeli Is a Target | Daily Briefing with Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/5wl--RWpuNo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I&#8217;m Daniel Rubenstein. Today is June 20th, 2024, day 258 of the October 7th War. This is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. We&#8217;re live on social media platforms Instagram, Twitter, and YouTube. Please subscribe to the YouTube channel, tell your friends to tune in, and I invite you to start sending questions. If I&#8217;m not able to answer your questions that you send in the live chat, you can reply later when we post this video, and I&#8217;ll try to answer as many comments as I can.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Threats</h3>\n\n\n\n<p>This week, Hezbollah, the Iranian proxy army in Lebanon, made a number of threats that deeply worry the people of Israel and should worry the whole world. The first threat came in the form of a video that Hezbollah published on Tuesday. Hezbollah said the video came from one of its drones that entered Israeli airspace, flew over a number of sensitive sites in Israel, and returned home to Lebanon. The footage shows the port of Haifa, an Israeli navy base, and also what Hezbollah claimed were strategic military locations across Northern Israel, including air defense systems. There were also many houses in this video, family homes in Israel. As I was watching the video, I thought to myself, if this drone was a suicide drone with explosives, Hezbollah could have killed many Israelis. The message from Hezbollah is clear: it&#8217;s psychological warfare. Hezbollah is saying to Israel, &#8220;We know you, we know where your important sites are, we know how to evade your air defenses, you are not safe with us as your neighbor.&#8221; It&#8217;s true, Israel is not safe with Hezbollah as a neighbor.</p>\n\n\n\n<h3 class=\"wp-block-heading\">October 8th Escalation</h3>\n\n\n\n<p>On October 8th, one day after the October 7th massacre, Hezbollah joined Hamas&#8217;s war. Since that day and almost every day since, Hezbollah has fired rockets, anti-tank missiles, and suicide drones into Israel. The last sirens that sounded in Israel were 30 minutes ago. 60,000 Israelis have been displaced from their homes close to the Lebanese border, homes that are being destroyed by Hezbollah. I mean literally destroyed. Hezbollah is not shooting its anti-tank missiles at tanks; it&#8217;s shooting them at houses in Israel. The Israeli government has been clear for months: Hezbollah must back off, or Israel will have to push it away. Israel wants to resolve the situation with Lebanon diplomatically and enable the 60,000 Israelis who were displaced to return home. Eight months after October 8th, Hezbollah is not backing down. It is only intensifying its threats. Yesterday, Hezbollah leader Hassan Nasrallah said something outrageous. He said if the war between Israel and Hezbollah escalates, no place in Israel would be safe. Hezbollah would fight with no rules, no ceilings, and no red lines. Nasrallah is saying openly, everyone in Israel is a target. The Geneva Conventions do not apply. International humanitarian law is not worth the paper it&#8217;s written on. The laws of war do not exist.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Lack of International Response</h3>\n\n\n\n<p>I checked to see if there were reactions to Nasrallah&#8217;s threat. The prime minister of Lebanon? Nothing. The United Nations? Nothing. Human Rights Watch? Nothing. The prosecutor of the International Criminal Court? Nothing. South Africa, which condemned Israel on October 7th? Nothing. France? Nothing. The United States? Nothing. The people of Israel hear the silence. If you see any condemnations of Nasrallah&#8217;s threat, let me know in the comments. Nasrallah didn&#8217;t just threaten Israel in his speech; he threatened Cyprus, a nearby island country in the Mediterranean Sea that is a member of the European Union. Nasrallah accused Cyprus of offering its military bases to Israel, and he said if Cyprus did that, Hezbollah would treat Cyprus as an enemy country. Following Nasrallah&#8217;s speech, the president of Cyprus said that his country is in no way involved in any military operations in the region. It&#8217;s true, in fact, Cyprus has played a critical role in sending humanitarian aid to Gaza via a maritime corridor. What all of this shows—the Hezbollah drone footage, Nasrallah promising to target everything and everyone in Israel, and Nasrallah&#8217;s threat to an EU member—is that there is not enough international pressure on Hezbollah, and there has never been enough international pressure on Hezbollah.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions for Social Media Generals</h3>\n\n\n\n<p>This is where we are now: Hezbollah, an army in Lebanon that takes orders from Iran, has been attacking Israel for the past eight months. Many of Hezbollah&#8217;s attacks come from villages in Lebanon. Hezbollah is operating from civilian areas. I have a simple question for the social media generals: what can the Israeli military do to stop Hezbollah&#8217;s attacks in accordance with international law? Please be specific. I look forward to receiving your answers.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Taking Questions from the Live Stream</h3>\n\n\n\n<p>I will now take some questions from our live stream. YouTube, please subscribe to the YouTube channel, follow us on Instagram, Twitter, wherever you&#8217;re watching from. We want to hear from you.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Abraham: Israel&#8217;s Readiness to Conquer Lebanon</h3>\n\n\n\n<p>Yes, please, in May &#8217;67, Israel struck Egypt preemptively, conquering Sinai. Today, Yemen is doing the same in the Red Sea, and Hezbollah has plans to conquer shipping to Haifa. Abraham asks, is Israel ready to conquer Lebanon?</p>\n\n\n\n<p>Thank you, Abraham, for the question and for following us. Let&#8217;s talk about the dynamic here. Israel is a country with an army. Hezbollah is an army with a country. Hezbollah in Lebanon is a political party, it is a militia, it&#8217;s an army. Hezbollah is part of the Lebanese government. Hezbollah has seats in the Lebanese Parliament, and Hezbollah has enough power and influence to veto decisions along with its allies in the Lebanese cabinet. So, there is not a clear separation between Hezbollah and the country of Lebanon. Hezbollah is an integral part of Lebanon. Hezbollah is attacking Israel from Lebanon, from civilian areas, and if, God forbid, the war in the north escalates into Lebanon, the consequences for Lebanon are going to look severe. Because just like Hamas in Gaza, which is firing from civilian areas, hiding in civilian areas, using civilians as shields in order to draw condemnation from the international community, the same dynamic exists in Lebanon, and I fear it will look much worse, and the destruction in Lebanon will be proportionate with the threat. As every strike Israel carries out is weighed against the potential collateral damage, civilian casualties, while also considering we&#8217;re also going to be under rocket fire from Lebanon if the war escalates. This is exactly what Nasrallah threatened. He has fired so far 5,000. Hezbollah has fired 5,000 rockets, anti-tank missiles, and drones into Israel. In the last war in 2006, Hezbollah fired a total of 4,000 rockets. In that war, and I very much fear that in this upcoming war, if it escalates—we&#8217;re already in a war—if it escalates, that the rocket fire from Lebanon will be much greater, and so too will the Israeli response.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Adam Kershaw: Global Leaders&#8217; Awareness of Iranian Threats</h3>\n\n\n\n<p>Adam Kershaw asks on our Instagram feed: what will it take to get world leaders to understand the threats posed by the Iranian regime and their proxies following threats towards Cyprus? What will it take to get world leaders to understand the threat? This is a million-dollar question, and I can tell you at the Israeli Citizen Spokesperson&#8217;s Office, we&#8217;re doing our best to make the case and to amplify it, and with your help, you are spreading the word in whichever country you&#8217;re watching from. It helps if you communicate with all the people in power and the journalists and the political leaders so that people will understand. I fear that in many cases, the only time that they will understand is if it&#8217;s too late. Israel has been in a seven-front war since October 7th or 8th when Hezbollah joined. Yemen, the West Bank, Syria, Iraq, Iran, and this whole period of time Israel has been saying, &#8220;The West is next. We&#8217;re on the front line of a war that affects everyone.&#8221; And we saw this in Nasrallah&#8217;s speech just the other day. He is now threatening Cyprus, which is a peaceful island country in the Mediterranean Sea and is part of the European Union. However, Hezbollah has missiles that can reach many parts of Europe, and I&#8217;m sure that leaders in Europe understand this, but for the moment, not everyone is speaking as loudly as they should, and that&#8217;s what we should be doing is encouraging everyone to speak out. I mentioned that there were not enough or hardly any responses to Nasrallah&#8217;s speech where he admitted, claimed that he seeks to be a war criminal, to make no distinction between civilians and soldiers, that everyone is a target. We need to be shouting this loudly and clearly and expecting that our leaders will condemn this so that if a greater war comes, it will not be a surprise, and people will know, and they will have heard the message loud and clear.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Roxan: UN&#8217;s Role in Hezbollah&#8217;s Rocket Fire</h3>\n\n\n\n<p>Roxan asks via Instagram: why is the UN allowing Hezbollah to fire rockets and more past the Blue Line? Yes, why is the UN allowing Hezbollah to fire rockets? So, in the last war that we had with Lebanon in 2006, that war ended with a UN Security Council resolution called 1701. 1701, and the resolution called for Hezbollah to disarm. That was the effect of the resolution. It said no armed groups in southern Lebanon without the authorization of the Lebanese government, and therefore, that Hezbollah was expected to withdraw beyond the Litani River. Now, to supervise this, there is a UN force in Lebanon. It&#8217;s called UNIFIL, United Nations Interim Force in Lebanon. Do you know how old the interim force in Lebanon is? That temporary force, the interim force, the UN force in Lebanon was created in 1978. So, the UN being in Lebanon is not a new thing. The UN does not have the authority to physically disarm Hezbollah. All it can do is watch and report and mediate, and that&#8217;s what it&#8217;s doing now. I wish it was doing much more. I think it should be doing much more to drive around southern Lebanon to try to prevent Hezbollah from firing rockets into Israeli cities that will inevitably draw an Israeli response into those same Lebanese towns. So, we need the United Nations to be doing much more. We need UNIFIL to have an increased mandate. We need the whole UN Security Council to pay attention before there&#8217;s an even bigger war. But you may remember that the UN Security Council has not condemned Hamas for the October 7th massacre. I&#8217;m not confident that the United Nations will be ready in time if Hezbollah decides to make a major escalation in the north.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Jessica Rose: Israel&#8217;s Awareness of the War</h3>\n\n\n\n<p>Jessica Rose asks via the YouTube live feed: I keep hearing Israel did not expect this war. Is that really true? Surely the severe hatred for Israelis has not slipped the minds of leadership. Thank you, Jessica, for watching on YouTube. I hope you subscribe and tell all your friends. I want 2,000 subscribers by the next live stream. I agree with what you say. Everyone should have recognized, known, and understood the threat of Hamas, and that&#8217;s the most important thing that they could probably understand today is they try to analyze the present and the future. Hamas is an acronym. It stands for Islamic Resistance Movement in Arabic, Islamic Resistance Movement, and it&#8217;s very clear that its goal is to annihilate Israel. That&#8217;s why it&#8217;s popular. Hamas won a Palestinian election in 2006. Everyone knew that this is Hamas&#8217;s platform. Hamas seized power in Gaza in 2007, and from 2007, Hamas used Gaza as a military base for attacking Israel. We&#8217;re talking thousands of rockets. Already before 2007, we had a lot of rockets from Gaza, and the rockets accelerated after 2007, and we had a number of wars and rounds of violence with Hamas in Gaza. So, Hamas&#8217;s goals and intentions have been clear even before the rockets. We had more than 100 suicide bombings around the years 2000, 2001, 2002. So, every day Hamas is saying, &#8220;We must destroy Israel.&#8221; But at the same time, in Gaza, we looked at Gaza from Israel and said not everyone is Hamas. There are civilians in Gaza, and we don&#8217;t want them to get caught up in the middle of a war, and we should do everything possible while maintaining our security to ensure as much as possible a normal life for the people of Gaza, that they will be able to work. We had many people from Gaza were visiting Israeli hospitals for treatment. The situation before October 7th was not great, but it was much better than it is now. And we were watching with an understanding that Hamas&#8217;s long-term vision wants to destroy Israel, but the assessment from many in Israel at the time was that Hamas doesn&#8217;t want war right now. It was clear that this was a mistake, and as far as who&#8217;s responsible for the mistake, how do we know, how do we learn for the future, there is going to be a state commission of inquiry all about October 7th. Just like there was a 9/11 commission of inquiry in the United States, we will have an October 7th commission of inquiry, and many of the different organizations in Israel, the Israel Defense Forces, the Shin Bet, they will also have their own internal investigations. We need to learn quickly, and we should always keep our eye on the ball now. Now, which is we&#8217;re under attack from seven fronts, and on each of the seven fronts, there are militias, armies, Iranian proxies that say they want to destroy Israel. We don&#8217;t want this war. We didn&#8217;t want this war, and we would like this war to end, but we cannot end it while there are Iranian proxy armies on our border that are ready for it to keep going.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Melissa: US Support for Israeli Operations in Lebanon</h3>\n\n\n\n<p>Next question comes in from Melissa, who asks: what do you make of Amos Hochstein&#8217;s warning that the US would back a limited Israeli operation in Lebanon if Hezbollah doesn&#8217;t stop, as reported by The Times of Israel? Yes, I saw this report. For those who don&#8217;t know who Hochstein is, he is an American envoy, represents the Biden administration, and he is waging intense diplomacy right now between Israel and Lebanon to try to find a way to end the war that Hezbollah started on October 8th when it joined Hamas&#8217;s war that it started the day before. I think Hochstein is growing a little bit frustrated with Hezbollah&#8217;s refusal to end the war that it started. Hezbollah seems to be in a position of great confidence. It&#8217;s firing every day rockets, anti-tank missiles, suicide drones. 60,000 Israelis have had to leave their homes in the north that Hezbollah is attacking on a regular basis. And the recent comments from Hochstein, which are public comments, that you know Hezbollah, Lebanon should not be surprised if there is some type of limited Israeli military response, in addition to what Israel has already been doing, because Hezbollah needs to understand that it&#8217;s going to pay a price for its aggression, and we cannot accept a situation where the borders of Israel have shrunk. Not from the border that they were on October 8th, the blue line between Israel and Lebanon, but 10 miles or so away from the border is not going to be the new reality. Israel wants to change this situation diplomatically, which is why Amos Hochstein is shuttling back and forth between the parties. We hope that a diplomatic solution can be found, but if not, everyone should understand that a military response from Israel is very much on the table.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Shaina Zion: Food Situation in Gaza</h3>\n\n\n\n<p>All right, and last question today comes from Shaina Zion, asking the question: what can Israel do about the glut of food being held in Gaza? Is the food going bad in the heat? Fresh foods, she asks. Yes, so for those who don&#8217;t understand the reference in the question, according to the IDF, there are around 1,400 trucks worth of food sitting on the Gaza side of the Israel-Gaza border crossing, waiting to be picked up by the United Nations so that the United Nations can distribute it in Gaza to people in need. You&#8217;ve heard a lot of claims over the past month that Israel&#8217;s policy is to starve the people of Gaza, that there&#8217;s famine in Gaza, when in fact, the opposite is true. Israel has been doing everything possible to allow aid into Gaza from all four directions: from the sea, from the north, from the east, from the south. Egypt recently closed its Rafah border crossing, so that leaves one major crossing in the south. That&#8217;s the Kerem Shalom crossing, and that&#8217;s where the food that you referenced is sitting on the other side. Now, I don&#8217;t have a specific list of what food is in these cartons, but you are absolutely correct to raise the issue of food spoiling. If the food is in cans, it can sit there for a while. If it&#8217;s fresher, like eggs, cheese, even bread that&#8217;s going in, it&#8217;s going to spoil, and it&#8217;s going to sit there. I don&#8217;t know if you listened to our daily briefing yesterday. We referred to a story in the Wall Street Journal about the most expensive item in Gaza. The most expensive item in Gaza is not food, it&#8217;s not medicine, it&#8217;s not shelter equipment. The most expensive item in Gaza is a cigarette, which The Wall Street Journal said is selling for as much as $25. Now, there are gangs in Gaza, armed gangs, people affiliated with Hamas, separate armed gangs, who see the truck shipments coming in that the United Nations is bringing. They go and attack the trucks, and they leave the food on the street, but what they&#8217;re looking for is cigarettes. So, it&#8217;s very possible that the food is spoiling, but they&#8217;re just going into the trucks, trying to break it open and get cigarettes. So, the food is going into Gaza. Israel is doing everything within reason that it can to help the United Nations be in a position to distribute that aid, and it&#8217;s up to the United Nations and other international aid agencies to take the aid that is sitting there and distribute it wherever in Gaza that it is needed.</p>\n\n\n\n<p>Okay, that&#8217;s all the time we have. Thank you so much to everyone for watching this daily briefing and all the daily briefings of the Israeli Citizen Spokesperson&#8217;s Office. Please subscribe to our YouTube channel, follow us on Instagram. I&#8217;m going to go take a look at the comments after we post this video. I hope to stay in touch with all of you and answer more of your questions. Until next time, have a lovely day.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/he/t/daniel-rubenstein/\">Daniel Rubenstein</a> provides a daily briefing on the ongoing conflict, detailing <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s threats, the lack of international response, and the impact on Israeli civilians. He answers questions about <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s readiness, global awareness of threats, <a  href=\"https://iron-swords.co.il/t/the-un/\">the UN</a>&#8216;s role, and aid to <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, emphasizing the need for diplomatic and military solutions.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5491,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5489",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5489
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5489",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5489"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5489/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5492,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5489/revisions/5492"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5491"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5489"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5489"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5489"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}