{
    "id": 5012,
    "date": "2024-06-06T22:00:00",
    "date_gmt": "2024-06-06T19:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5012"
    },
    "modified": "2024-06-06T22:47:24",
    "modified_gmt": "2024-06-06T19:47:24",
    "slug": "idf-spokesman-update-06-06-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-06-06-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 06.06, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 06.06, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Q94eFJsOQM8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h4 class=\"wp-block-heading\">Early Morning Incident</h4>\n\n\n\n<p>Good evening. Early this morning, IDF forces thwarted a Hamas terrorist cell attempting to infiltrate Israeli territory from the Rafah area. The terrorists emerged from a tunnel shaft approximately 200 meters from the border, armed with Kalashnikovs. At 4 AM, under heavy fog conditions, the terrorists were spotted by observers, who alerted a force from the Bedouin Reconnaissance Battalion. The force encountered the cell at close range, prompting the terrorists to flee. They were pursued and neutralized by unmanned aerial vehicles and tank fire. Within five minutes of the incident&#8217;s onset, three terrorists were eliminated, and the fourth escaped back to the Rafah area.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Fallen Soldier and Tribute</h4>\n\n\n\n<p>Tragically, during the confrontation, Senior Sergeant Major Zaid Mazari, a 34-year-old tracker from Zarzir with extensive experience in the Southern Brigade of the Gaza Division, fell. We extend our deepest condolences to his family. Since the beginning of the war, the Bedouin Reconnaissance Battalion has played a significant role in the fighting and has borne heavy losses. This is the story of the war, where Muslims, Druze, Christians, and Jews from all segments of Israeli society participate in the fight for our shared home.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Continued Efforts in Gaza</h4>\n\n\n\n<p>In parallel with the defensive efforts on the border, IDF forces continue offensive operations in the Gaza Strip. In a joint operation by the IDF and the Shin Bet, we attacked a compound where Hamas and Islamic Jihad militants had gathered inside an UNRWA school in central Gaza. The terrorists operated from the school, planning and executing terror activities, some of whom participated in the brutal attack on October 7. Fighter jets used precision munitions to strike three classrooms, where about 30 terrorists were hiding. So far, the identities of nine terrorists killed in the attack have been confirmed. We are currently verifying the identities of additional terrorists killed in the strike, some of whom participated in the October 7 massacre. We will pursue everyone involved in the events of October 7.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Condolences to Another Fallen Soldier</h4>\n\n\n\n<p>This morning, we announced the death of First Sergeant Rafael Kauders, a reservist, who was killed by an unmanned aerial vehicle in Hurfeish. We send our condolences to his family and share in their grief over this tremendous loss.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Addressing Hezbollah Threats</h4>\n\n\n\n<p>We are confronting the Hezbollah threat and improving our operational responses. In the past 24 hours, we struck Hezbollah targets in southern Lebanon, killing several operatives. The images of fires in the north this past week cannot leave anyone indifferent. The IDF is working together with firefighting and rescue forces in a joint effort to provide an immediate response to such incidents, primarily to save lives and prevent the spread of fires. We maintain readiness against Hezbollah and are prepared for any scenario.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Arrest of Hamas Operative in Central Command</h4>\n\n\n\n<p>In the Central Command, undercover forces from the Duvdevan Unit, guided by the Shin Bet, arrested a wanted Hamas operative involved in manufacturing and developing explosives in an operation that concluded a few hours ago. Exchanges of fire occurred between the forces and the gunmen in the area. Our forces responded with gunfire, eliminating three terrorists and wounding others. An armed drone assisted the forces and attacked from the air to protect our troops. The arrested operative has been transferred for further interrogation.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Continued Efforts Against Terror</h4>\n\n\n\n<p>This operation follows yesterday&#8217;s activities on Jerusalem Day to prevent terror. This week, I visited the shiva of Dolev Yehud, of blessed memory, from the Niruz community. His sister, Arbel, is still held captive in Gaza. What can be said to Dolev&#8217;s family except to apologize for what they have endured since October 7 and to promise the parents, widow, family, and community that we will do everything to bring Arbel and the other 123 captives home as quickly as possible?</p>\n\n\n\n<h4 class=\"wp-block-heading\">Q&amp;a</h4>\n\n\n\n<p><strong>Sharon Idan, Kan 11:</strong></p>\n\n\n\n<p>&#8220;First, how is it possible that eight months after October 7, we still see terrorist cells managing to pass the first obstacle and attempt to enter Israeli territory? Additionally, how are we dealing with the escalation in the north, with direct hits from Hezbollah? How is it that the IDF&#8217;s response teams are missing them in recent days?&#8221;</p>\n\n\n\n<p><strong>Response:</strong></p>\n\n\n\n<p>&#8220;We are operating in Rafah against Hamas terror. The most crucial component of this operation is the Philadelphi Route, the Rafah crossing. We are detecting and destroying all underground infrastructure and tunnels leading to Egypt. This is Hamas&#8217;s lifeline, which we are currently destroying. Beyond that, we are targeting underground facilities used for terror and destroying them. One of these tunnels is the same tunnel from which terrorists emerged today near the border. At this moment, our forces are mapping and destroying the tunnel as part of the effort to eliminate terror infrastructure in Rafah.</p>\n\n\n\n<p>Our preparations at the border, even under heavy fog, highlight the importance of observers and their role in directing the Bedouin Reconnaissance Battalion to close the circle with aerial fire, preventing a significant attack on Israeli civilians.</p>\n\n\n\n<p>Regarding the threat from Hezbollah, we are addressing every incident with thorough analysis and improving our responses. There is a threat close to the border at short ranges, posing challenges in both detection and clarity. We have demonstrated our ability to handle UAV threats from very far ranges in large numbers during the Iranian attack, where we intercepted numerous UAVs without them hitting Israeli territory. In this case, it is a close-range event, and we will find operational solutions and respond accordingly.</p>\n\n\n\n<p><strong>Leah Schein, Yedioth Ahronoth:</strong></p>\n\n\n\n<p>&#8220;Can you address the criticism published today in Yedioth Ahronoth by a senior reserve officer, describing IDF attacks as lacking continuity and concentration of effort, and the fighting in Rafah, which is marketed as a success, reflecting IDF&#8217;s disconnection, taking a long time to launch the attack with one division instead of two? Forces in the field complain about shortages of equipment and lack of mission clarity.&#8221;</p>\n\n\n\n<p><strong>Response:</strong></p>\n\n\n\n<p>&#8220;We are fighting a multi-arena war, managing combat against Hezbollah in the north, defending Israeli airspace from Iran, Iraq, and Yemen, and also fighting in Gaza. It takes time to deal with Hamas, and anyone saying otherwise is misleading the public. Rafah is one of the most complex areas globally, if not in the Middle East. It has a population of 1.4 million. The IDF has demonstrated capabilities by evacuating a million civilians, an unprecedented event worldwide. We are now operating within Rafah. The importance of Rafah is its role as Hamas&#8217;s lifeline, which we are addressing. We are mapping and destroying tunnels and underground facilities, with special units conducting serious operations. We will disclose these operations in relation to the security of our forces at the right time and place.</p>\n\n\n\n<p>We are targeting Hamas battalions in Rafah accurately, maintaining the safety of our forces and the complexity of Rafah. This also preserves vital security relations with Egypt and our international legitimacy. We continue to show the world how we find all solutions.</p>\n\n\n\n<p>Last night&#8217;s operation, where after three days of monitoring, we struck an UNRWA school housing terrorists, demonstrates our ability. The IDF, together with the Shin Bet, separated the civilians from the terrorists, targeting three classrooms and killing dozens of terrorists. We have confirmed nine identities so far and will confirm more soon.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF thwarts <a  href=\"/hamas\">Hamas</a> cell in Rafah, eliminates terrorists, faces <a  href=\"/hezbollah\">Hezbollah</a> threats, and continues offensive operations in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> amid challenges.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-5012",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5012
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5012",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5012"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5012/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5015,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5012/revisions/5015"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5012"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5012"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5012"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}