{
    "id": 5795,
    "date": "2024-06-30T15:00:00",
    "date_gmt": "2024-06-30T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5795"
    },
    "modified": "2024-07-02T20:53:17",
    "modified_gmt": "2024-07-02T17:53:17",
    "slug": "iran-threatens-to-obliterate-israel-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/iran-threatens-to-obliterate-israel-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "Iran threatens to Obliterate&#8217; Israel | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Iran threatens to Obliterate&#039; Israel | | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/DocDDKWxViw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Daily Briefing Introduction</h3>\n\n\n\n<p>Hello everyone, I&#8217;m citizen spokesman  Eylon Levy. This is the daily briefing of the Israeli citizen spokesperson&#8217;s office. We&#8217;re live on YouTube, Instagram, and Twitter. Please start submitting your questions in the chat. These briefings are now available shortly after broadcast as podcast episodes, so search for the Israeli citizen spokesperson&#8217;s office on all major podcast platforms.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Current Situation Overview</h3>\n\n\n\n<p>Today is day 268 of the October 7th War. Friday night, while many of us were sitting down for dinner with our families, air raid sirens wailed across Northern Israel. Families fled their tables, parents ran with their little children to bomb shelters, and many of those children heard and felt explosions as dozens of rockets flew above their heads and drones crashed into civilian homes. These attacks from Lebanon have been ongoing for nearly 9 months.</p>\n\n\n\n<h3 class=\"wp-block-heading\">War Origins and Ongoing Conflict</h3>\n\n\n\n<p>On October 8th, one day after Iran&#8217;s proxy army in Gaza, Hamas, started this awful war, Iran&#8217;s proxy army in Lebanon, Hezbollah, joined this war. That&#8217;s why Israel is now fighting for its life against Iran and its proxy armies on eight fronts, including attacks on Jews around the diaspora. Iran&#8217;s proxy armies declared war on Israel on October 6th, and Iran is now threatening Israel with obliteration if it defends itself. Yes, obliteration.</p>\n\n\n\n<p>Iran&#8217;s proxy army in Lebanon, Hezbollah, joined this war on October 8th. It&#8217;s since fired over 5,000 missiles and UAVs into Israel, forcibly displacing 60,000 Israelis who have had to flee their homes. Israel is warning that if diplomacy fails and Hezbollah does not back off, we will have to push it away.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran&#8217;s Threat and the Call for Peace</h3>\n\n\n\n<p>Now, the evil regime in Iran is threatening Israel with an obliterating war if it operates against Hezbollah. It says all options are on the table, including major simultaneous attacks from all its proxy armies surrounding Israel. That&#8217;s the same Iran that is racing towards nuclear weapons, constantly threatening Israel with annihilation, and that fired 350 ballistic cruise missiles and UAVs at Israel in April.</p>\n\n\n\n<p>Here&#8217;s an option: if all the options are on the table, how about peace between Israel and Lebanon—not a ceasefire, peace. Lebanon&#8217;s Prime Minister Najib Mikati says his choice is peace and the implementation of Resolution 1701. We agree. UN Security Council Resolution 1701 demands that Hezbollah disarm and back off from Israel&#8217;s border. But let&#8217;s be more ambitious. To avoid an all-out war with Iran&#8217;s proxy army in Lebanon, let&#8217;s adopt the formula of land for peace. The Lebanese people get their land back from this Iranian proxy army, and we all get peace.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Root Problem in the Middle East</h3>\n\n\n\n<p>But that&#8217;s the root problem in the Middle East: Iran and its terrorist proxy armies keep ruining everything for everyone. Israel needs to get its people back to their homes. By now, the whole world realizes Hezbollah started this war; Hezbollah can end this war. But Hezbollah needs to be pressured to end it. That&#8217;s why countries across Europe and the Gulf are urging their citizens to evacuate Lebanon. The US is even sending naval vessels to support a possible evacuation because it&#8217;s clear to them that if Hezbollah does not back off, Israel will have no choice but to push it away.</p>\n\n\n\n<h3 class=\"wp-block-heading\">International Responses and Warnings</h3>\n\n\n\n<p>That&#8217;s why the Americans and Europeans are warning Hezbollah: don&#8217;t count on us to hold Israel back. If Israel has no choice, it will push Iran&#8217;s proxy army away from the northern border, and nobody can stop it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p><strong>First Question from Instagram:</strong> <em>Does China support Hezbollah the same as they support Hamas, and what is China&#8217;s role in arming Hamas and supporting the tunnel infrastructure?</em></p>\n\n\n\n<p>That&#8217;s an excellent question. What is at stake in this war is not only the peace and security of Israel but the future of the whole free world. There are right now three countries in the world at risk of extinction from aggressive neighbors: Israel at the hands of Iran, Ukraine at the hands of Russia, and Taiwan at the hands of China. Three sovereign democratic countries are at risk of being wiped off the map by aggressive neighbors with imperial ambitions. And that&#8217;s why what happens in Israel isn&#8217;t just about us in Israel; it&#8217;s about the rest of the world. The future of the free world depends on how it acts with these three countries: does it stand behind them, or does it allow them to slip under a bus?</p>\n\n\n\n<p>It&#8217;s becoming increasingly clear that Iran, Russia, and China are forming a single geopolitical axis that seeks to undermine the whole Western order and the freedoms that we all hold dear. They see attacking Israel as one of the ways in which they can attack the West and the free world. That&#8217;s why China, by the way, has made it so difficult for Israeli diplomats to tell their story inside China by controlling the narrative because we&#8217;re seeing public opinion there turn towards supporting the regimes that are attacking Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Broader Implications</h3>\n\n\n\n<p>The whole world has to be vigilant. This is not a war in which simply Israel&#8217;s future is at stake; it is one part of a game of chess and a much bigger attempt by revisionist powers—Iran, Russia, and China—to undermine the liberal world order that has given us peace and prosperity since the end of the Cold War.</p>\n\n\n\n<p><strong>Next Question from Gabriel on Instagram Live:</strong> <em>If Lebanon is truly seeking peace with Israel, then why don&#8217;t they join forces with Israel and attack Hezbollah as a united front?</em></p>\n\n\n\n<p>Because Lebanon doesn&#8217;t truly seek peace with Israel. Lebanon isn&#8217;t suggesting a peace treaty in which we recognize the border, have flights between Beirut and Tel Aviv, have citizens visiting each other&#8217;s countries, exchange diplomats. That&#8217;s not what they&#8217;re talking about. That&#8217;s ideal, by the way. Everyone in Israel would sign on the dotted line for a peace treaty with Lebanon. If there&#8217;s one city in the Middle East that I could choose to visit, it would be Beirut. It looks like an amazing place. But southern Lebanon is occupied now by Hezbollah, an Iranian proxy army that is far stronger than the Lebanese army.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Complexities of Lebanese Politics</h3>\n\n\n\n<p>Here&#8217;s another problem: Hezbollah isn&#8217;t just a terrorist army; it&#8217;s also a political party. It has seats in the Lebanese parliament, controls much of the power inside Lebanon, and means that the Lebanese state can&#8217;t act against Hezbollah because it is part of the Lebanese state. It has taken over large parts of the Lebanese state, embedded itself in southern Lebanon, and the Lebanese army is no match for Hezbollah. It&#8217;s a country that&#8217;s had experience with civil war, but the Lebanese army is no match for Hezbollah.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Position and Global Pressure</h3>\n\n\n\n<p>It&#8217;s important that we be very clear now. As Lebanon is saying it wants Israel to back off and stop these retaliatory strikes, we want peace with Lebanon, but the proxy army on its soil has to be pushed away. If there is any hope of avoiding an all-out war with Hezbollah, it&#8217;s that the people of Lebanon will continue to put pressure on Hezbollah and understand the disaster that it is about to bring on Lebanon by leaving Israel with no choice but to go on a much bigger offensive to get its people safely back to their homes. They realize it; it&#8217;s happening, but it&#8217;s not enough. We need the whole world to continue putting pressure on Lebanon and encouraging the Lebanese people to get Hezbollah to back off, or Israel is going to have to push it away.</p>\n\n\n\n<p><strong>Question from Ed Bar on YouTube Live:</strong> <em>Can you please comment on the attempted attack on the Israeli Embassy in Serbia over this past weekend?</em></p>\n\n\n\n<p>A very strange incident. The last I understand, it&#8217;s not quite clear what exactly happened there. The Israeli government has thanked the Serbian authorities for taking action against what seems like an attempted terror attack outside the embassy. But it&#8217;s a reminder that this is not just a war that Israel is fighting against Hamas or against Hezbollah. All Israeli targets around the world, all Israeli sites, all Israeli citizens are targets. That&#8217;s why in the early stages of the war, Israel warned its citizens to think twice if you really have to travel anywhere around the world and imposed a global blanket travel warning because we know that Iran and its terrorist supporters are going to seek out Israeli targets for attack. It was in the &#8217;90s that the Israeli embassy in Argentina was attacked by Hezbollah, and all Israeli embassies will be on high alert. There will be attempts to attack Israel not only here within our borders but also around the world. That&#8217;s why it&#8217;s important to remain hyper-vigilant.</p>\n\n\n\n<p><strong>Question from Instagram:</strong> <em>We saw a lot of appearances of pro-Hamas supporters presenting pictures of Sinwar, flags of Hezbollah and the Houthis in New York. What can be done to prevent this from happening, but more importantly, what can we do to protect the Jewish community?</em></p>\n\n\n\n<p>The Free World needs to get a grip. This is a reminder that Israel is fighting not enemies that have a beef with Israel, but enemies of the whole free world. You cannot walk around New York waving the flag of a banned terror organization that threatens Israel, the United States, and Europe alike. We need to be clear: this is not a war in which they&#8217;re fighting over any particular legitimate grievances. This is a war against terrorist organizations that openly glorify violence. Countries around the world have to understand the madness that has been unleashed on their streets and clamp down on the glorification of terrorism and people encouraging violent attacks.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Protecting the Jewish Community</h3>\n\n\n\n<p>When we say the West is next and they say globalize the intifada, we agree. They mean the same thing, but we mean it as a warning; they mean it as a threat. As for what needs to be done to protect Jewish communities, many Jewish institutions around the world already look like fortresses with the intense security they have. It&#8217;s important to continue working together with the authorities but also to step up their own efforts. It means if you can volunteer with your local Jewish security organization to patrol, to be an extra pair of eyes, do it. It won&#8217;t hurt to learn Krav Maga and self-defense either. We need to work in lockstep with liberal democratic countries and their authorities but also know how to be vigilant and protect ourselves if needed.</p>\n\n\n\n<p><strong>Final Question:</strong> <em>People are curious about the recent fire and fighting happening in Gaza and also whether Israel is ready for a two-front war, both in Gaza and with Hezbollah.</em></p>\n\n\n\n<p>Israel is warning that if we have to fight on two fronts at once, we&#8217;re ready to do so, and we will. Most of the army reserves have been called up against the north, and the Air Force has been pointed north. The intense stage of the war in Gaza is winding down. Prime Minister Netanyahu has said we&#8217;re very close to mopping up the Rafah operation, and Hamas will no longer be a functioning fighting force. That will, of course, leave the hostages still in Gaza—120 of them. We have to continue putting military pressure on Hamas to agree to a deal to release them and do hostage rescue missions wherever we can. But the intense phase of the fighting and dismantling Hamas as an organized military force is close to reaching its conclusion. That will leave Hamas essentially as an insurgency, and the IDF expects it will have to keep dipping in to stamp out Hamas control. But the intensive stage is over.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Preparing for Potential Escalation</h3>\n\n\n\n<p>As the Prime Minister said, that will free up more troops that we can divert north to send a very clear message and ultimatum to Hezbollah that it has to back off, or else we&#8217;re going to have to push it away. This really isn&#8217;t a war that Israel wants; the consequences could be cataclysmic. Hezbollah firing thousands of missiles at Israel every single day—many of those missiles will get through the missile defense systems, and you will see Israel responding with overwhelming force to avert the threat of simultaneous mass casualty events. We don&#8217;t want this war, but the government and the army are warning if we have to fight it, we&#8217;re ready to do it, and we&#8217;re ready to win.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Okay, that&#8217;s all we have time for today. Please remember to follow us on all social media platforms and subscribe on podcast platforms as well so you can catch up later if it&#8217;s not live. Please do me one favor: send the link wherever you&#8217;re watching to just one friend. Help us grow our reach across the world, not only the Jewish world but supporters as well. We hope these are useful for you. Please continue liking and commenting. Everyone keep safe. We&#8217;ll be back tomorrow. Thank you.</p>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>In today&#8217;s briefing, <a  href=\"https://iron-swords.co.il/t/eylon-levy/\">Eylon Levy</a> addressed ongoing attacks from Lebanon by <a  href=\"/hezbollah\">Hezbollah</a>, <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s threats, and <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s readiness to defend itself. He emphasized the global stakes, urging international pressure on <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a> and Iran. Levy also responded to questions about China&#8217;s role, Lebanon&#8217;s political complexities, and protecting Jewish communities worldwide.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5836,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-5795",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 5795
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5795",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5795"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5795/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5799,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5795/revisions/5799"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5836"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5795"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5795"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5795"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}