{
    "id": 5528,
    "date": "2024-06-23T15:00:00",
    "date_gmt": "2024-06-23T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5528"
    },
    "modified": "2024-06-24T17:55:52",
    "modified_gmt": "2024-06-24T14:55:52",
    "slug": "iran-lobbies-taliban-to-join-war-against-israel-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/iran-lobbies-taliban-to-join-war-against-israel-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "Iran Lobbies Taliban to Join War Against Israel | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Iran Lobbies Taliban to Join War Against Israel | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/XEWU_cLy8gA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Opening</h3>\n\n\n\n<p><strong>Hello, Everyone</strong> I&#8217;m Citizen Spokesman Eylon Levy. This is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on YouTube, Instagram, and Twitter. Please start submitting your questions in the chat, and we will get to them at the end.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Current Situation Overview</h3>\n\n\n\n<p><strong>Today is Day 261 of the October 7th War</strong> Since October 7th, Israel has been fighting for its life against Iran and its proxy armies on eight fronts: Gaza, the West Bank, Lebanon, Syria, Iraq, Yemen, Iran itself, and attacks on the Jewish diaspora. Reports indicate the conflict could expand to a ninth front: the Taliban.</p>\n\n\n\n<p><strong>Iran&#8217;s Coalition and Threats</strong> The Islamic Republic of Iran is trying to recruit the Taliban, the government of the Islamic Emirate of Afghanistan, to attack Israel. Iran is working to get the Taliban that helped Bin Laden plot 9/11 to partner with the Hamas regime that perpetrated 7/10. Last week, Iran&#8217;s foreign minister urged the Taliban foreign minister to take joint action against Israel. This comes after Iran hosted talks between the Taliban and Hamas, and Iranian sources say the Taliban is ready to send troops to fight Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Context and Analysis</h3>\n\n\n\n<p><strong>Iran&#8217;s Strategy</strong> Iran is building a coalition to destroy Israel as the regime in Tehran races toward acquiring nuclear weapons. It is surrounding Israel with proxy armies far more powerful than most NATO militaries. These countries should all have peace with Israel as there are no territorial disputes, but Iran is supporting these groups to advance its vision of regional domination.</p>\n\n\n\n<p><strong>The Broader Conflict</strong> These regimes want to repress and abuse their people while destabilizing the Middle East and plotting to destroy Israel. The Iranian axis doesn&#8217;t only hate Israel; it hates the West. Israel is on the front lines of the Free World against the forces of barbarism. By standing up to the enemies of America and Europe, Israel is keeping them safe. We need the Free World to stand with us against these terrorist forces that threaten our freedoms and have attacked our countries before. Israel is fighting for humanity, and it&#8217;s time for humanity to stand with Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p><strong>Audience Questions</strong> We will now take questions from the audience watching live on various social media platforms. Remember, you can submit questions on YouTube, Instagram, Twitter, and other platforms.</p>\n\n\n\n<p><strong>Question from TikTok (wave27129):</strong> <em>Who do you think should rule Gaza after the war?</em></p>\n\n\n\n<p><strong>Answer:</strong> Gaza needs to be run by Palestinians committed to turning a new leaf, who realize that terrorism is a dead end. We need Palestinian leaders in Gaza who are brave enough to stand up and admit Hamas&#8217;s strategy of turning Gaza into a launchpad for attacks against Israel was a mistake. They must abandon the dream of destroying Israel from the River to the Sea and start building Gaza as a permanent home for its people. Israel is not going to govern Gaza after this war. Hamas will not govern Gaza after this war. The Palestinian Authority is not fit for purpose either. We need Palestinians willing to take responsibility and guide their people towards peace with Israel.</p>\n\n\n\n<p><strong>Question from YouTube (oit_uh):</strong> <em>In light of everything revealed on the UN, has Israel considered leaving?</em></p>\n\n\n\n<p><strong>Answer:</strong> No, leaving the United Nations is not a sensible option. The UN is the only club in the world with all nation-states in it. Being part of the UN allows Israel to wage diplomatic battles, build alliances, and work towards collective action. Israel must fight from within and not from the outside, despite the deep-seated problems and criticisms of the UN&#8217;s bias.</p>\n\n\n\n<p><strong>Question from Instagram (Benji Lewis):</strong> <em>Is it safe to visit Israel this summer despite the Hezbollah threat?</em></p>\n\n\n\n<p><strong>Answer:</strong> Yes, visit Israel. Come on solidarity missions. We need your help with agricultural work, packing food for displaced families, soldiers, and victims of the massacres. Day-to-day life in Israel has a high sense of personal security, though we are in a war zone. Exercise caution, be aware of rocket alerts, and be prepared to seek shelter. Despite the conflict, Israel remains vibrant, with beaches packed on weekends and people living their lives fully.</p>\n\n\n\n<p><strong>Question from Citizen Spokesperson (Ashley Waxman Bakshi):</strong> <em>Why does it feel like the whole world doesn&#8217;t see what we see? Why has the UN become so biased?</em></p>\n\n\n\n<p><strong>Answer:</strong> The UN is not a club of democracies; most countries are dictatorships, tyrannies, and autocracies. They often gang up on Israel as it gives them a way to cooperate. With 50 Islamic states and over 20 Arab states, the numbers are against us. Many amplify Hamas propaganda, and some Western countries think appeasing the Arab world will gain favor. The UN&#8217;s bias is deep-seated, but Israel remains the frontline of defense against the barbaric terrorists threatening the Free World.</p>\n\n\n\n<p><strong>Question from YouTube (Tracy M, Australia):</strong> <em>What happened on October 7th for Hamas to get in en masse? How did the defense system fail so badly? Did anyone get sacked?</em></p>\n\n\n\n<p><strong>Answer:</strong> This is a critical question that everyone in Israel is asking. A commission of inquiry will provide answers after the war. Israel believed Hamas was deterred but underestimated their capability and intent. Hamas led by psychopaths breached the border at 30 points with 3,000 terrorists. The invasion included civilians looting, raping, and murdering. The lesson is to never underestimate enemies and to remain vigilant.</p>\n\n\n\n<p><strong>Question from YouTube (Pete):</strong> <em>Why does Israel produce their own weapons? Don’t they need them from the USA?</em></p>\n\n\n\n<p><strong>Answer:</strong> Israel has a booming defense industry, breaking records in defense exports. While Israel produces significant defense technology, it can&#8217;t create everything on mass. Cutting-edge weapons like the F35 fighter jet require superpower-level production capabilities. Strong relations with the USA are crucial, but Israel must also step up its domestic production to ensure strategic independence.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p><strong>Thank You and Final Remarks</strong> Thank you for joining today&#8217;s briefing. Follow us daily at 3:00 Israel time, 8 a.m. Eastern, for updates from the Citizen Spokesperson&#8217;s Office. Use this information to advocate for Israel and the Jewish people. Please share with a friend and follow us on all social media platforms. Stay safe and keep fighting. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/eylon-levy/\">Eylon Levy</a> Spokesman, addresses the ongoing conflict with <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> and its proxies, including potential Taliban involvement. He emphasizes <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s fight for survival, regional stability, and the broader implications for global security. Questions cover <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>&#8216;s future governance, UN bias, defense failures, and the importance of international solidarity with Israel.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5532,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-5528",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 5528
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5528",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5528"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5528/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5531,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5528/revisions/5531"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5532"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5528"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5528"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5528"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}