{
    "id": 5267,
    "date": "2024-06-13T15:00:00",
    "date_gmt": "2024-06-13T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5267"
    },
    "modified": "2024-06-14T18:21:29",
    "modified_gmt": "2024-06-14T15:21:29",
    "slug": "israeli-hostages-tortured-in-hamas-terror-dungeons-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/israeli-hostages-tortured-in-hamas-terror-dungeons-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "Israeli Hostages Tortured in Hamas Terror Dungeons | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Israeli Hostages Tortured in Hamas Terror Dungeons | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/0qKb5Z9_3HY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I&#8217;m Asha Westrop Evans and this is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. It&#8217;s June 13th, 2024. We&#8217;re live on YouTube, Instagram, and X. Please start submitting questions in the chat.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Update on the October 7th War</strong></h2>\n\n\n\n<p>Today is day 251 of the October 7th War. 120 hostages remain in Hamas captivity. We are learning more details about how the hostages that Israeli forces liberated from Hamas Terror dungeons last Saturday were treated. The Wall Street Journal has a must-read report on what Almog, Jan Andre Klov, and Shlom Ziv endured in captivity.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Condition of the Liberated Hostages</strong></h2>\n\n\n\n<p>While watching the rescued hostages walk free from the helicopter at the hospital in Israel, it is possible to think they look in good health. But it is important to remember that some wounds do not leave external marks. That is why it is critical that if you hear someone say they are fine, they most certainly are not. The hostages endured physical and psychological torture and have a long road ahead to any semblance of recovery. Almog, Jan Andre Klov, and Shlom Ziv were kept in subhuman conditions in a domestic home. The three were held in a dark room for most of their eight months in captivity. Their guards abused them, brainwashing them, trying to convince them that the IDF wanted them dead.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Identity of the Captors</strong></h2>\n\n\n\n<p>But who were their captors? One of them was Abdullah Al-Jamal, a Hamas terrorist who pretended to be a journalist. Another captor was his father, Ahmed Al-Jamal, a doctor. And I repeat that again, yes, a doctor and an imam at a local mosque run by Hamas, both of whom were killed in the rescue operation. Thousands of food trucks went into Gaza in recent months, but the Hamas captors fed their hostages next to nothing. The men ate dates and pita bread, and that&#8217;s it. Their muscles atrophied over the months from lack of protein. A nutritionist from the hospital here in Israel has said that the men were supplied only one-tenth of their nutritional needs. The captors wanted the hostages to suffer, to feel demoralized, and ultimately to feel hopeless.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Moments of Hope</strong></h2>\n\n\n\n<p>However, rays of sunshine came from the strangest of places. One day, the hostages were allowed to watch Al Jazeera in Arabic, and they saw a rally in Tel Aviv led by the families of the hostages. One of the hostages saw his own face, and that gave them all hope. That made them know that they were not forgotten. That made them realize that the people of Israel would not leave anyone behind. And frankly, it&#8217;s true. The people of Israel will not leave anyone behind. We want our people back home, and we want them back now. We want our citizens out of Hamas&#8217;s Terror dungeons.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Ceasefire Negotiations</strong></h2>\n\n\n\n<p>As regards the current ceasefire negotiations, there is a deal on the table, and Hamas is the party refusing to say yes. It is clear that Hamas&#8217;s refusal to say yes has frustrated US Secretary of State Anthony Blinken. While Hamas has proposed numerous changes to the deal, Blinken said it was time for Hamas to stop haggling. He noted that Israeli Prime Minister Benjamin Netanyahu has accepted the proposal on the table, and Blinken said he told governments throughout the Middle East that if they want to see a ceasefire in Gaza, they need to pressure Hamas now. Hamas leader Yahya Sinwar has reportedly said, &#8220;We have the Israelis right where we want them.&#8221; Think about what that means to say those words. Hamas is a death cult that has taken control of Gaza. It wants to maximize suffering in Gaza because it sees how Israel is blamed for Hamas&#8217;s actions. Hamas does not care about anyone&#8217;s life, be that Israeli or Palestinian. Hamas is prolonging this war by their choice not to give back the hostages, and it is time for everyone to increase the pressure on Hamas so that every hostage can come home now. Pressure Hamas to agree to the hostage release deal that is on the table now. Pressure Hamas&#8217;s allies, Iran, Qatar, and Turkey, to put that pressure back on Hamas to accept the deal on the table.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Situation in Northern Israel</strong></h2>\n\n\n\n<p>Finally, now a word about the situation in Northern Israel. Just yesterday, Hezbollah fired more than 200 rockets from Lebanon into Israel. This was the largest number of rockets that Hezbollah has fired in a single day since it joined Hamas&#8217;s war against Israel on October 8th. The rockets sparked several fires in the north of the country. Hezbollah said that the massive attack was a response to the Israeli targeting of Hezbollah arch-terrorist Talib Sami Abdullah, the most senior Hezbollah commander to be targeted by Israel since Hezbollah entered the war. The targeting of Hezbollah&#8217;s arch-terrorists should surprise no one. Hezbollah continues to violate UN Security Resolution 1701 by stationing its forces in the zone between the Blue Line and the Litani River. The Israeli government has been clear for months: Hezbollah must back off or it will be backed off. Israel would like to resolve the situation with Lebanon diplomatically and to enable the 60,000 Israelis who were displaced to return back home, but as Hezbollah continues to escalate, a diplomatic solution is looking less and less likely every day. It&#8217;s time for the whole world to wake up and take immediate steps to rein in Hezbollah so that it ends the war that it started and prevents this already tragic war from escalating even further.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q&amp;A Session</strong></h2>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question from Shirley: Is Israel Planning on Going to War with Hezbollah?</strong></h4>\n\n\n\n<p>Shirley from our Instagram Story questions feed asks: &#8220;Is Israel planning on going to war with Hezbollah?&#8221; Charlie, thank you so much for that question. I&#8217;d first like to change a little bit of the framing of what you&#8217;re saying there. Hezbollah has fundamentally chosen war with Israel. We are in that war right now, and it&#8217;s a war that Israel did not want, it&#8217;s a war that Israel did not plan for, and it&#8217;s a war that the 60,000 internally displaced people inside Israel are having to come to terms with every day, alongside the rest of their country, their families, their loved ones, and everyone else that we see here in this country. Now, as for planning future military operations, well, this is the role of the IDF. Their role is to continue to plan for Israel&#8217;s military and strategic future to make sure that the Israeli people remain safe and to prevent any sort of actions catching Israel by surprise and to prevent the sort of atrocities that we saw occurring on October 7th. Israel is ready and in position and will not put itself in the sort of vulnerable position it was on that day, and that is critical to Israel&#8217;s planning a strategic future. But again, to reiterate, neither Israel nor its people want to see a further escalation of the war that is currently raging in the north, harming so many people on both sides. And if we can find a diplomatic solution, as I said earlier, that will be key to the future of this entire region and perhaps even the rest of the world.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question from John: Dangers Faced by Jews in the Diaspora</strong></h4>\n\n\n\n<p>Asher, this question is from John on Twitter: &#8220;With the violence seen in Brooklyn due to the Nova Music Festival exhibition, what dangers are faced by Jews in the diaspora?&#8221; John, thank you again for that question. Look, we saw some horrendous scenes at the protest there in Brooklyn, which resulted in the homes of Brooklyn Museum director and multiple Jewish board members being vandalized with marks that harken to what we might have seen in Kristallnacht in 1935. These symbols targeted on doors, painted in red paint, threatening, looking like blood. I mean, if ever there was a message and a sign that the protesters had gone too far and reached levels of extremism that were utterly intolerable, this certainly is it. Going so far, even Congresswoman Alexandria Ocasio-Cortez of the progressive movement of the Democratic Party even came out with a tweet saying that she believed it had gone too far, highlighting that even those who are not traditional allies of Israel recognize that this is too much. You know, this sort of action must be reined in across the globe, and an awareness that this lack of subtlety, nuance, and the extremism that is being pushed by anti-Israel, anti-Zionist, and frankly anti-Semitic actors around the world are perpetuating truly is a danger and one that we must all be aware of, not just Jews in Israel and the diaspora, but any supporters of Israel around the world. This is something we must monitor closely to ensure it does not get further out of hand before that red paint turns into real blood on the streets.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question from Rumi: Response to Protests on Campus</strong></h4>\n\n\n\n<p>Rumi on Instagram writes: &#8220;I am deeply concerned about the seemingly apathetic response by police and politicians to protests on campus elsewhere and here in Melbourne, where I live. Any thoughts? Comments? Also, I would love to attend a pro-Israel march/gathering in Melbourne. Is there likely to be one, or where would I find out about one?&#8221; Well, Rumi, as a countryman myself from Australia, I can say that I&#8217;ve been monitoring closely some of the protests and actions that have been occurring across that fine country. That being said, I&#8217;ll give this message to the entire world rather than trying to point you in the direction of a particular cause or action or counter-protest that you can join. It is critical that we all, as Jews and supporters of Israel around the world, work together with our local communities to organize. I mean, contrary to the popular conspiracy theories, Judaism is not a top-down religion or approach or community. We resolve our issues from the grassroots and from the bottom up. So join your local community center, your local organizing group, wherever you may be around the world. Participate in actions, put up hostage posters, get your friends involved to come help you, support you, perhaps even protect you if that&#8217;s necessary where you live. But all these actions are critical to helping to keep the message out there, to get the hostages back home, to end this needless war that is being fought by Hamas against Israel, and Hezbollah, and so many others that have taken action in this region against Israel, and all the anti-Semitic, anti-Zionist hate speech that we are seeing on the streets across the globe. It is critical that we stand up as a community and continue to fight to ensure that these messages are not allowed to run freely, and the narrative and discourse is not stripped away from Israel and its supporters.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Question from Alma: Fighting Against the Misuse of &#8220;Zionist&#8221;</strong></h4>\n\n\n\n<p>Our last question today is from Alma, who&#8217;s watching on our Instagram live feed and writes: &#8220;The word Zionist has become an insult hurled at people as a label to condemn the way they think and feel. What can Jews and Zionists around the world do to fight against this?&#8221; Alma, that is a critical question right there. I mean, the word Zionism, the word Jew, you know, these words have been co-opted by enemies and haters of both Israel and the Jewish people for centuries now. But it is critical here in the modern day, as we fight against the use of these terms as a dirty word, that we remember that Zionism is not just an idea. I stand here now in the heart of a living, breathing Israel, a 76-year-old country that exists, is real, is credible, and is certainly not going anywhere. Alma, I would say to you and any others out there that we need to remember that this is not some concept that we are fighting for or against. This is a lived reality for so many millions of people and many tens and hundreds of millions more who support this idea around the world. People like to frame the Jews as a powerless group, but frankly, this is not the early half of the 20th century anymore. We have a Jewish state, we have advocacy, we have rights, and we need to fight for those and continue to fight for them around the world. And that is how we reclaim ideas like Zionism. That is how we turn Jew from a dirty word spat by how violent haters into a word of strength and power for our people. And I think that is just the most critical message that we can put forward today.</p>\n\n\n\n<p>All right, well that is all the questions we have time for today. I&#8217;d like to thank you so much for tuning into today&#8217;s daily briefing. Remember, you can always catch us at 3 PM Israel time every day, 8 AM Eastern on Twitter, X, Instagram, YouTube, TikTok, LinkedIn, all through our social media platforms. Make sure to stay in touch, write questions in. We want to know, we want to hear what you guys have to say and help to answer some of those questions. I&#8217;m Ash Westrop Evans, thanks for watching.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Asha Westrop Evans from the Israeli Citizen Spokesperson&#8217;s Office provided a briefing on June 13th, 2024. She discussed the October 7th War, hostage conditions, and ceasefire negotiations. She highlighted <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s recent rocket attacks and responded to audience questions on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s military strategy, Jewish diaspora safety, and combating anti-Zionist rhetoric.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5269,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5267",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5267
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5267",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5267"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5267/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5270,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5267/revisions/5270"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5269"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5267"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5267"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5267"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}