{
    "id": 5099,
    "date": "2024-06-10T15:00:00",
    "date_gmt": "2024-06-10T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5099"
    },
    "modified": "2024-06-10T18:15:26",
    "modified_gmt": "2024-06-10T15:15:26",
    "slug": "israel-under-attack-for-saving-its-citizens-daily-briefing-with-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/israel-under-attack-for-saving-its-citizens-daily-briefing-with-doron-spielman/",
    "title": {
        "rendered": "Israel Under Attack for Saving Its Citizens | Daily Briefing with Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Israel Under Attack for Saving Its Citizens | Daily Briefing with Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/1AIRqBRRem8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I am Deron Spielman, and this is the live Daily Briefing of the Israeli Citizen Spokesperson&#8217;s Office. Today is June 10th, 2024, day 248 of the October 7th War. Please start submitting questions through whichever platform you are watching: X, Instagram, and YouTube, and I will do my best to answer some of them at the end.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hostage Rescue Operation</h2>\n\n\n\n<p>More facts continue to come out about Israel&#8217;s heroic hostage rescue operation on Saturday, and as more facts come out, more warped opinions are emerging too. The enemies of Israel have been struggling to find ways to condemn Israel for rescuing its own people, who were held hostage for eight months in private residences in Gaza. Their main line of argument is to ask how the reportedly high number of casualties in Gaza can justify rescuing only four people. Sadly, this is being echoed by major news networks and newspapers as well.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Addressing the Ignorance</h2>\n\n\n\n<p>This question can only be asked out of ignorance. First of all, the reports on the number of casualties in Gaza are always laid at Hamas&#8217;s doorstep. Hamas lies about their numbers all the time. Everyone knows Hamas is lying all the time, and Hamas never says how many Hamas fighters were killed. Just one month ago, the UN dropped by half the number of women and children in Gaza that it had been reporting as killed. Even the UN realized that Hamas was lying.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Truth About the Hostage Rescue Operation</h2>\n\n\n\n<p>This is the truth about the hostage rescue operation: Hamas shot at the hostages as they tried to escape. Hamas attacked the rescue force, which was at risk of being trapped in a hostile area surrounded by enemy forces firing AK-47s and RPGs. Only then did the IDF respond. Those who condemn the rescue operation apparently think that the Israeli rescue force should have let Hamas execute everyone or let Hamas take more hostages instead of returning fire. People who think this way have a distorted view of reality and lack a basic sense of right and wrong.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Justification for the IDF&#8217;s Actions</h2>\n\n\n\n<p>Can you imagine any hostage rescue force asking for permission before returning fire against terrorists? The IDF defended themselves and brought our hostages home. It was their natural, moral, and legal right to do so. The people of Israel will not leave anyone behind.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Media Criticism</h2>\n\n\n\n<p>BBC news anchor Helena Humphrey wins the prize for the most puzzling question asked a day after the hostage rescue operation. She interviewed former IDF Lieutenant Colonel spokesman Jonathan Kriz. They were speaking about the casualties in Gaza when she asked him, &#8220;Would there have been a warning to those civilians for them to get out in time?&#8221; Kriz calmly answered, &#8220;We cannot expect Israel to warn ahead of time ahead of a raid on civilians because then what the terrorists would do is kill the hostages, and that would defeat the purpose.&#8221; It turns out that common sense is unfortunately not so common. I&#8217;m sure that most people know that Israel did the right thing by rescuing its citizens. I wish that the world&#8217;s most important news organizations would understand that too.</p>\n\n\n\n<h2 class=\"wp-block-heading\">New Information on Rescued Hostages</h2>\n\n\n\n<p>There&#8217;s another fact we learned since our daily briefing yesterday: three of the four hostages who were rescued were being held at the home of a man named Abdalah al-Jamal. Abdalah al-Jamal was a Hamas terrorist, but he told the world that he was a journalist. He published numerous articles on a news site called Palestine Chronicle while at the same time holding hostages in his home with his family. Al-Jamal was the Gaza correspondent for the Palestine Chronicle, a US-based 501(c)(3) nonprofit organization. People who support them get a US tax deduction. You can&#8217;t make this up. A few years ago, Al-Jamal published an opinion piece on the Al Jazeera website. Al Jazeera recently published a statement distancing itself from Al-Jamal, even though Al Jazeera knows it&#8217;s a bad look for them. Al-Jamal was previously a spokesperson for the Hamas-run Ministry of Labor in Gaza. He was 100% Hamas. He was killed in the Israeli rescue operation, but I am sure that we will find him on the list of casualties as a civilian.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Update on Northern Israel</h2>\n\n\n\n<p>Finally, an update on the situation in northern Israel: this morning, Hezbollah in Lebanon fired a guided anti-tank missile into a house in the Israeli community of Yon. Just two hours ago, sirens went off all across northern Israel warning of suicide drone infiltrations. Israel has been under attack from Hezbollah since October 8th when Hezbollah joined the war that Hamas started the day before. Almost every day, Hezbollah is firing rockets, shooting anti-tank missiles, and sending suicide drones into Israel. 60,000 Israelis have been displaced from their homes as a result of this threat.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Media Misrepresentation</h2>\n\n\n\n<p>I just read an article on CNN that said that Israel and Hezbollah are ramping up cross-border attacks, as if each side is equally guilty here. The article did not mention that Hezbollah made a choice to join the war that Hamas started, and it said nothing about the fact that Lebanon, a sovereign country, refuses to do anything to take back control of its territory from a terrorist army. It&#8217;s important to tell the truth about the situation. That&#8217;s what I&#8217;m doing as a citizen spokesperson, and I&#8217;m hoping that everyone watching will do the same. We expect that everyone, including every world leader, will speak up against Hezbollah&#8217;s attacks and demand that it back off from the border before Israel is forced into a major war to push it away. Hezbollah must back off, or it will be backed off.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Questions and Answers</h2>\n\n\n\n<h5 class=\"wp-block-heading\">Question from Instagram Live</h5>\n\n\n\n<p><strong>Q: The United States Secretary of State Anthony Blinken is due to visit shortly. What does Israel expect from this visit?</strong></p>\n\n\n\n<p><strong>A:</strong> Israel looks to the United States as our greatest friend in the world. We have an alliance that goes back many years to the founding of the state of Israel. We would hope that when Secretary of State Blinken comes to Israel, it would be to pressure Hamas to immediately accept the terms of the hostage deal and enable us to do two things: first, to bring all of our hostages home, and second, to achieve the absolute destruction of Hamas. Israel cannot live with Hamas on its border, just like no one would want to live with a terrorist on their border.</p>\n\n\n\n<h5 class=\"wp-block-heading\">Question from Instagram Live</h5>\n\n\n\n<p><strong>Q: How have the United States aided in returning their own citizens?</strong></p>\n\n\n\n<p><strong>A:</strong> Regarding American hostages, I hear rumors in the press, probably like many people, that the US is going to negotiate directly with Hamas for the return of US hostages. The question that all of us need to ask is: What would Hamas ask the United States in return? From our perspective, there is nothing to give Hamas except to ultimately destroy their terrorist organization and provide safety and security for the residents of Israel.</p>\n\n\n\n<h5 class=\"wp-block-heading\">Question from Instagram Live</h5>\n\n\n\n<p><strong>Q: Where was Noah Aramani being held?</strong></p>\n\n\n\n<p><strong>A:</strong> Noah Aramani was also being held in the home of civilians in Gaza. She reports that she was living in a room by herself under constant watch. The family would open the door and order her to clean up their food, wash their dishes, and treat her essentially as a servant. This calls into question the narrative about civilian casualties. If these civilians are holding Noah Aramani as a hostage and are killed in an IDF rescue operation, are they truly civilians?</p>\n\n\n\n<h5 class=\"wp-block-heading\">Question from Instagram Live</h5>\n\n\n\n<p><strong>Q: Is there a plan to bring back the refugees to Kiryat Shmona and other places in the north?</strong></p>\n\n\n\n<p><strong>A:</strong> There is no question that this is something the state of Israel is committed to. Can you imagine any country not ensuring that displaced people return home? Israel will not stand by and allow our land to be held hostage by Hezbollah&#8217;s constant cross-border attacks. These are 60,000 people, including farmers and workers in tourism, with children and families. We will ensure that they go back home safely. This is a national imperative and a personal imperative for every Israeli.</p>\n\n\n\n<h5 class=\"wp-block-heading\">Popular Question in DMs</h5>\n\n\n\n<p><strong>Q: What books are you reading? Can you recommend a book to read?</strong></p>\n\n\n\n<p><strong>A:</strong> The most interesting book I&#8217;ve picked up recently is called &#8220;18 Days of War,&#8221; about the Yom Kippur War. It parallels what we are facing today in Israel post-October 7th. The similarities in how Israel was caught off guard and the national response are startling. I highly recommend this book.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>I want to thank all of you for joining me on the Israeli Citizen&#8217;s Network. We are here every single day providing you with a daily briefing. I encourage you to log on to our live briefings and watch the recordings on Instagram, Twitter, Facebook, and YouTube. We are here for you, giving you the daily messages, and we hope that you will echo these messages and the truth around the world.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Deron Spielman from the Israeli Citizen Spokesperson&#8217;s Office discussed the ongoing October 7th War, highlighting <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s recent heroic hostage rescue operation, media misrepresentation, and ongoing attacks from <a  href=\"/hezbollah\">Hezbollah</a>. He addressed questions about US support, hostage details, and plans for displaced Israelis, emphasizing Israel&#8217;s commitment to truth and national security.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5101,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5099",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5099
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5099",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5099"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5099/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5102,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5099/revisions/5102"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5101"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5099"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5099"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5099"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}