{
    "id": 5079,
    "date": "2024-06-09T15:00:00",
    "date_gmt": "2024-06-09T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5079"
    },
    "modified": "2024-06-09T20:53:12",
    "modified_gmt": "2024-06-09T17:53:12",
    "slug": "no-one-left-behind-four-israeli-hostages-rescued",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/no-one-left-behind-four-israeli-hostages-rescued/",
    "title": {
        "rendered": "No One Left Behind: Four Israeli Hostages Rescued"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"No One Left Behind: Four Israeli Hostages Rescued\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/hANaHtVGbIw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Introduction</h3>\n\n\n\n<p>Hello everyone, I&#8217;m Daniel Rubenstein, and this is the daily briefing from the Israeli Citizen Spokesperson&#8217;s Office. It is June 9th, 2024, day 247 of the October 7th War. We are live on Instagram, Twitter, and YouTube. You can start submitting questions in the live chat. If I can&#8217;t answer you now, I&#8217;ll be online later, and you can tag me, and I&#8217;ll answer as many as I can.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hostage Rescue Operation</h3>\n\n\n\n<p>Yesterday afternoon, we all heard the dramatic news that four Israeli hostages were rescued from Hamas captivity in Gaza. Noah Aramani, Almog May, John Andre Klov, and Shlom Z were abducted from the Nova Music Festival on October 7th. They are now free, home in Israel, safe, and reunited with their families. Tragically, Almog May John&#8217;s father died of grief just hours before his son was rescued. The pain of knowing that his son was held in Gaza was too much for him to bear for eight months.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Rescue Mission Details</h3>\n\n\n\n<p>The rescue mission was complex. The hostages were being held in two separate buildings in a densely populated residential area of Gaza. During the rescue, Israeli forces came under intense fire. They extracted the hostages in two helicopters. An Israeli officer of the elite Yaman police counterterrorism force, Chief Inspector Arnon Morah, was killed in the operation, which was renamed Operation Arnon in his memory.</p>\n\n\n\n<h3 class=\"wp-block-heading\">International Media Coverage</h3>\n\n\n\n<p>I&#8217;ve spent the past day reading many international news reports about what happened. Here are some of the headlines:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Washington Post: &#8220;More than 200 Palestinians killed in Israeli hostage raid in Gaza.&#8221;</li>\n\n\n\n<li>Reuters: &#8220;Israel rescues four hostages in Gaza raid that Hamas says killed 210 Palestinians.&#8221;</li>\n\n\n\n<li>CNN: &#8220;Israel rescues four hostages in operation; Gaza officials say killed more than 200.&#8221;</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">Media Bias and Responsibility</h3>\n\n\n\n<p>Of course, &#8220;Gaza officials say&#8221; is another way of saying &#8220;Hamas says,&#8221; and Hamas does not distinguish between combatants and civilians in its press releases. Even the United Nations has come to understand that the Hamas government media office is not reliable, but that doesn&#8217;t stop the Washington Post, Reuters, CNN, and others from boosting Hamas&#8217;s claims. There is an intense campaign going on right now to condemn Israel for rescuing hostages. UN special rapporteur Francesca Albanese tweeted that she was relieved that four hostages have been released, but it should not have come at the expense of at least 200 Palestinians.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217;s Responsibility</h3>\n\n\n\n<p>You can see the pattern: it&#8217;s the four Israeli hostages versus the alleged 200 Palestinian casualties. Hamas has somehow escaped all responsibility. This is what people need to understand: the Israeli rescue forces entered Gaza under cover. They would have been happy to rescue the hostages without a battle. As soon as Hamas noticed that an Israeli hostage rescue force had come to free the hostages, Hamas had a decision to make. Hamas could realize that it had been compromised and let the four Israeli hostages go back home quietly, or Hamas could open fire on the rescue force and put everyone in danger. Hamas chose the second option. Hamas opened fire on the rescue force and the hostages.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Dilemma</h3>\n\n\n\n<p>Now, at this point, the rescue force had a decision to make. It could return fire, or it could die. The rescue force chose to return fire. The consequences of Hamas&#8217;s decision to open fire on the Israeli rescue force are Hamas&#8217;s responsibility. Anyone who claims to care about all human life should condemn Hamas for continuing the war it started on October 7th. Tell Hamas not to ask civilians in Gaza to hold hostages. Tell Hamas not to hold hostages in civilian areas. Tell Hamas not to fire at Israeli rescue teams. Tell Hamas to release all of the hostages immediately. Tell Hamas to surrender and end the war it started on October 7th.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Stance on Hostage Rescue</h3>\n\n\n\n<p>The logic that Israel is up against is unbelievably absurd. The logic is this: when you come under fire while rescuing hostages, the right thing to do is to die. Actually, it&#8217;s worse than that. The logic is since you&#8217;ll obviously come under fire when rescuing hostages and you&#8217;ll have to protect yourselves, don&#8217;t even try to rescue hostages at all. The people of Israel have a clear answer for this absurd logic, and the answer is no, we will not leave anyone behind. Hamas continues to hold 116 hostages in its terror dungeons. All of them must be released immediately.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A Session</h2>\n\n\n\n<p>Let&#8217;s take some questions from people watching live on Instagram, Twitter, and YouTube. I would be happy to hear from you.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 1: Qatar&#8217;s Role in the Conflict</h4>\n\n\n\n<p>The first question comes from Abraham on X: &#8220;Qatar fully controls Al Jazeera, and an Al Jazeera journalist was holding an Israeli hostage in Gaza. Qatar knew about this. Why does Israel negotiate with them? Why doesn&#8217;t Israel make a campaign to boycott Qatar?&#8221;</p>\n\n\n\n<p>I have seen these reports that an Al Jazeera reporter held Israeli civilians hostage. This report is not confirmed, and in fact, Al Jazeera put out a statement denying it. So, we&#8217;re going to have to wait until more information comes out about who exactly was holding hostages and so on. But the bigger picture that you bring up, the bigger issue of Qatar is certainly important. Qatar is playing a very, I&#8217;ll say, interesting role in the past number of months. Qatar is where the Hamas leaders live. They are there in Qatar. However, before the war, Qatar was sending money to Gaza with Israel&#8217;s blessing. Qatar is the state sponsor, the owner of the international television network Al Jazeera. I watch it every day; it&#8217;s broadcasting on the lower third of the screen in big letters &#8220;genocide in Gaza.&#8221; This is the message that Al Jazeera has been pushing for months. But at the same time that it is promoting a specific message that Qatar is pushing its own network to promote, Qatar is a mediator in the hostage release negotiations that are currently going on between Israel and Hamas indirectly. So, Qatar&#8217;s role is something that we&#8217;re going to have to take a look at in the days, weeks, and months ahead. But in the meantime, Qatar has itself in a very important position. They&#8217;re an important stakeholder, and Israel is going to continue to talk to them in an effort to get its hostages home.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 2: Hamas&#8217;s Representation of Palestinians</h4>\n\n\n\n<p>Ron, also on X, writes: &#8220;Does Hamas represent the Palestinians?&#8221;</p>\n\n\n\n<p>Ron on X, thank you for this question. X is my favorite platform; I&#8217;m still calling it Twitter, so you&#8217;ll forgive me. Does Hamas represent the Palestinians? My source for answering this question is the most prominent Palestinian pollster, Khalil Shikaki. He has published polls over many years, and if you study all of them, you can go to his website, you can establish a sort of general pattern of where Hamas is in Palestinian society. So, it&#8217;s safe to say about one-third of Palestinians support Hamas. That&#8217;s the low number that you&#8217;ll get in any given poll from Shikaki. And if his poll is a question about who would you vote for in a given contest between a Hamas presidential candidate and a candidate from Fatah, the rival, you may get something closer to 50/50 support for Hamas. It&#8217;s important to note also that Hamas&#8217;s political demands of Israel enjoy very wide, if not near-universal support among the Palestinian people. The divisions are about Hamas&#8217;s tactics and its vision for what a future state of Palestine would be. Not every Palestinian, of course, wants to live under a Hamas government and do not accept Hamas&#8217;s interpretation of Islam. It&#8217;s also important to note that since the year 2007, the two major Palestinian factions have been in a state of civil war with each other. Hamas took over Gaza in 2007 from its rival, Fatah, and they have been effectively in a state of civil war ever since. It&#8217;s also important to note that the rival, Fatah—talking about the Palestinian Authority—this is the Palestinian faction that Israel is cooperating with on a day-to-day basis. They have not condemned the October 7th massacre. The Palestinians that Israel is having open relationships with, negotiating with, communicating with, have not condemned the October 7th massacre. The only exception to this statement is they have condemned Hamas for carrying out the massacre without the permission of the Palestinian Authority and without consulting it, but they have not condemned the massacre as a barbaric atrocity. One of the reasons they have not condemned it is because the massacre has significant support within Palestinian society, and it would be politically unwise to condemn something that enjoys enormous support.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 3: Situation in Northern Israel</h4>\n\n\n\n<p>A question from Rachel on Instagram: &#8220;My Red Alert app keeps going off. What is the situation in the north, and when will Israelis be able to move back to their homes?&#8221;</p>\n\n\n\n<p>Yes, every day as I&#8217;m working on this briefing, I&#8217;m working on one topic, and then the Red Alert app will start going off, and I&#8217;ll wonder if I&#8217;ll have to change the subject entirely because of the situation in the north. That was again the case today, where there were many Red Alert sirens, which means real sirens for people in the north, whether it is rockets coming in, an anti-tank missile, or suicide drones coming from Lebanon. This has been the day-to-day reality of the residents of northern Israel since October 8th, when Hezbollah in Lebanon made the choice to enter the war that Hamas started one day before. Hezbollah looked at this situation, saw what Hamas did on October 7th, and said, &#8220;We like what you did, we want to be a part of that.&#8221; They have been firing at northern Israel every day almost since October 8th. These Hezbollah guys wake up in the morning, set up their anti-tank missiles, and shoot them into Israeli homes. It&#8217;s for this reason that about 60,000 Israelis have had to evacuate from northern Israel to safer areas until such time as a solution can be found. Now, Israel would prefer that a diplomatic solution is found to the problem of Hezbollah in Lebanon, that Hezbollah will back off and allow the residents of northern Israel to return to their homes. But if a diplomatic solution cannot be found, the Israel Defense Forces will back Hezbollah off so that the people of Israel can go home and live safely and in peace.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 4: Recommended Literature</h4>\n\n\n\n<p>The last question comes from Talia on Instagram: &#8220;With so much going on in the war, what literature would you recommend reading for someone looking to stay informed?&#8221;</p>\n\n\n\n<p>First, send me a DM on Instagram, and I&#8217;ll send you a reading list. Anyone who wants my reading list, I will send it directly to you. But if you&#8217;re just listening and you don&#8217;t want to DM me and ask me for my list, I&#8217;ll give you a few. You often hear that what happened on October 7th didn&#8217;t start on October 7th, and this is true. It&#8217;s important that we all study the big picture so that we can have a better idea of what&#8217;s going on, what will happen, how people see it, and so on. There are a few authors that I would recommend. If you&#8217;d like to study the 1948 War, I recommend reading Benny Morris; his book is &#8220;1948.&#8221; If you want to study the War in 1967, I recommend reading books by Michael Oren, specifically his book &#8220;Six Days of War.&#8221; If you want to understand what Palestinians say they&#8217;re fighting for, I highly recommend reading the book &#8220;War of Return&#8221; by Anat Wilf, who happens to be one of the Israeli citizen spokespeople. She has done an in-depth, exhaustive study on the Palestinian refugee issue from its beginning until today. So those are three books that I recommend immediately. There&#8217;s many more that I could recommend, but that was &#8220;1948&#8221; by Benny Morris, &#8220;Six Days of War&#8221; by Michael Oren, and &#8220;War of Return&#8221; by Anat Wilf and her co-author Adi Schwartz.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Okay, that&#8217;s all we have time for today. I&#8217;m going to go on social media soon and see if you&#8217;ve submitted any more questions that I can answer. This was the live daily briefing from the Israeli Citizen Spokesperson&#8217;s Office. Please tune in tomorrow at 3:00 p.m. Israel time for another live daily briefing. That&#8217;s 8:00 a.m. on the East Coast. Until then, have a lovely day and stay safe.</p>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/daniel-rubenstein/\">Daniel Rubenstein</a>&#8216;s daily briefing covered the rescue of four Israeli <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a> from <a  href=\"/hamas\">Hamas</a> in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, the complex mission details, media coverage biases, and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>&#8216;s responsibility for the conflict. He answered questions about Qatar&#8217;s role, Hamas&#8217;s representation of Palestinians, the situation in Northern <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>, and recommended literature on the Israeli-Palestinian conflict.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5081,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5079",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5079
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5079",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5079"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5079/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5089,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5079/revisions/5089"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5081"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5079"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5079"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5079"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}