{
    "id": 5189,
    "date": "2024-06-11T22:43:15",
    "date_gmt": "2024-06-11T19:43:15",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5189"
    },
    "modified": "2024-06-11T22:43:19",
    "modified_gmt": "2024-06-11T19:43:19",
    "slug": "the-israel-hamas-war-explained",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/know-your-enemies/hamas/the-israel-hamas-war-explained/",
    "title": {
        "rendered": "The Israel-Hamas War Explained"
    },
    "content": {
        "rendered": "\n<div class=\"section-wrapper\" data-id=\"9UGWNP\"><section class=\"wp-block-gutenverse-section guten-element guten-section guten-9UGWNP layout-boxed align-stretch\"><div class=\"guten-background-overlay\"></div><div class=\"guten-shape-divider guten-shape-divider-top\"></div><div class=\"guten-shape-divider guten-shape-divider-bottom\"></div><div class=\"guten-container guten-column-gap-default\">\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-6sqruM\"><div class=\"guten-background-overlay\"></div><div class=\"sticky-wrapper\" data-id=\"6sqruM\"><div class=\"guten-column-wrapper\">\n<figure class=\"guten-element guten-video guten-2L5vK0\"><div class=\"guten-video-wrapper\" data-property=\"{&quot;url&quot;:&quot;https://youtu.be/hXTwiLnS5DE&quot;,&quot;class&quot;:&quot;guten-video-background&quot;,&quot;width&quot;:&quot;100%&quot;,&quot;height&quot;:&quot;500px&quot;,&quot;controls&quot;:true,&quot;playsinline&quot;:true,&quot;style&quot;:{},&quot;config&quot;:{&quot;youtube&quot;:{&quot;playerVars&quot;:{}}}}\"></div></figure>\n\n\n\n<div class=\"guten-element gutenverse-text-editor guten-u4sobK\"><div class=\"text-content-inner\">\n<p>In the fall of 2023, Israel and Saudi Arabia stood on the brink of signing a normalization treaty led by President Joe Biden, which could have brought progress and prosperity to the entire region. This threatened Hamas and contradicted its Charter, which calls for the destruction of Israel and Jews worldwide. On October 7th, Hamas launched a barbaric surprise attack on Israel to derail this treaty. The attack was unprecedented in its brutality, scale, and violence. It was the deadliest day for the Jewish people since the Holocaust. It shook Israel to its core and made it crystal clear to both Israel and its allies that Hamas must be dismantled.</p>\n\n\n\n<p>Hamas had been preparing for a large-scale confrontation with Israel for years. The terrorist organization amassed an expertly trained force of over 30,000 fighters and a deadly arsenal of over 20,000 rockets, advanced anti-tank missiles, and attack drones. For 16 years, it diverted hundreds of millions of dollars, vast amounts of iron, cement, and construction materials, all donated to build Gaza&#8217;s economy, to dig one of the most intricate combat tunnel systems in human history underneath entire civilian neighborhoods. The IDF, trying to rescue the hostages and dismantle Hamas&#8217;s military capabilities to ensure such an attack will never happen again, was forced to launch a ground operation into the heart of Gaza. It found itself facing an unprecedented challenge in the history of urban warfare, fighting from building to building in one of the most densely populated areas on Earth against an enemy who converted entire neighborhoods in the Gaza Strip into combat complexes filled with observation posts, anti-tank, and sniper firing positions. Below ground, they are all connected through an extensive hive of combat tunnel systems with command centers and weapon depots. This enables Hamas fighters to blend among the local population, dressed as civilians, emerge from hidden tunnel shafts, booby trap houses, set explosives in the streets, strike at IDF forces, and quickly disappear back into the underground maze, using its own civilian population as human shields.</p>\n\n\n\n<p>Recognizing this could result in massive damage to infrastructure and a catastrophic loss of civilian lives, the IDF decided on two essential humanitarian steps that needed to be taken. The first step was to separate Gaza&#8217;s civilian population from the Hamas terrorists by encouraging them to temporarily relocate from their homes for their own safety, putting them out of harm&#8217;s way. The second was to facilitate the entry of humanitarian aid for the civilians relocated due to the fighting. To successfully separate Gaza civilians from Hamas, the residents of each specific neighborhood where IDF intended to operate received multiple warnings tailored specifically for them: a direct call using both traditional broadcasters and social media channels in Arabic, airdropping leaflets tailored for the residents of each neighborhood, and sending direct text messages and calling residents personally. Simultaneously, the IDF uses intelligence collected from Israeli Air Force reconnaissance aircraft, open-source intelligence, and cellular location tracking data to build a real-time picture of the remaining population density in each specific area and point out buildings that house civilians who have not yet evacuated. This color-coded map is then used to plan the IDF&#8217;s upcoming maneuvers. As a result of these efforts, countless lives are being saved as over 1 million Gazans moved southward via the two designated humanitarian corridors leading to the humanitarian zone.</p>\n\n\n\n<p>This was just the first step in the IDF&#8217;s humanitarian efforts. To provide the now relocated population with water, food, medical aid, and shelter, a complete logistic system had to be created. With the outbreak of the war, representatives from Israel, the United States, Egypt, and the UN convened to create a large-scale humanitarian aid operation focused on maximizing the amount of aid transported into Gaza. Various actions were taken to achieve this goal in all three key locations of the logistics chain. At Alish port in Egypt, where international aid supply ships dock, a specialized company that was taught to meet the security screening requirements of the IDF properly sorts, packs, and loads the goods. The shipment is then delivered to the Rafah border crossing, where preliminary inspections are conducted by Egypt and then transferred to the Nitsana border crossing for Israeli inspection. At Nitsana, the number of specialized cargo scanners was doubled, and additional inspection kits were added, allowing for quicker turnaround. Then the convoy continues to the Rafah crossing, where the goods are unloaded on the Gazan side. </p>\n\n\n\n<p>The goods are loaded onto trucks responsible for the delivery inside Gaza. These joint actions across the supply chain enabled a 1,000% surge in the daily aid volume delivered. The amount of food transferred feeds over half a million people daily and even exceeds a million during the operational pause. To support Gaza&#8217;s water needs, trucks enter daily carrying fresh water as well as fuel supplies to keep the water distillation facilities running. Two Israeli water pipelines damaged by Hamas on October 7th were reopened, and a new Emirati pipeline was built, now allowing over 33 million liters of fresh water to flow daily. Extensive medical aid infrastructure is facilitated through four large field hospitals, with four more being established, and two medical ships docked at the Alish port to support the field hospitals and allow for staff rotation. Israel facilitates the movements of international medical teams in and out of Gaza and supports the evacuation of patients requiring specialized care. The entire medical system is backed by more than 10,000 tons of medical equipment and supplies since the war began. Logistic needs are also continuously addressed; over 11,000 tons of shelter equipment, including tents, mattresses, blankets, and hygiene products, have been delivered. Recently, Israel doubled the entry and inspection points by opening Kum Shalom.</p>\n\n\n\n<p>The war against Hamas is unprecedented in its complexity and scale in the history of urban warfare. It is a fight for Israel&#8217;s own right to exist in peace, a fight for Western values and freedom from brutal terrorism for both Israelis and Gazans. This is why Israel is going to extreme lengths to mitigate harm to civilians and is calling on the international community to increase the volume of humanitarian aid being sent into Gaza. Israel is fully committed to facilitating and supporting all humanitarian efforts by the international community while working to free the Israeli hostages and dismantle Hamas and, with it, bring hope for a better future for the people of the Middle East.</p>\n</div></div>\n</div></div></div>\n\n\n\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-hI2Yki\"><div class=\"guten-background-overlay\"></div><div class=\"sticky-wrapper\" data-id=\"hI2Yki\"><div class=\"guten-column-wrapper\">\n<h3 class=\"wp-block-gutenverse-heading guten-element guten-KElhmZ\">Hamas</h3>\n\n\n\n<div class=\"guten-element gutenverse-text-editor guten-STtTwf\"><div class=\"text-content-inner\">\n<p>Hamas, established in 1987, has evolved from a violent offshoot of the Muslim Brotherhood into a powerful political-military entity in the Middle East. Under the leadership of Ismail Haniyeh and Yahya Sinwar, Hamas has become a significant regional actor, particularly in Gaza, where its military, political, and ideological activities have profound implications for regional security, especially concerning its tension with Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ideology</h3>\n\n\n\n<p>Hamas&#8217;s ideology is rooted in Sunni Islamic fundamentalism, with key objectives including the establishment of an Islamic state in the region and the slaughter of all Jews in the world, as well as the elimination of Israel through armed struggle. These goals are clearly stated in Hamas&#8217;s founding charter and other official statements.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Official Flag</h3>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"2560\" height=\"1600\" src=\"https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_.png\" alt=\"Hamas Terror Organization\" class=\"wp-image-226\" srcset=\"https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_.png 2560w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-300x188.png 300w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-1024x640.png 1024w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-768x480.png 768w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-1536x960.png 1536w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-2048x1280.png 2048w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" /><figcaption class=\"wp-element-caption\">Hamas</figcaption></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Order of Battle</h3>\n\n\n\n<p>Hamas commands approximately 40,000 to 50,000 fighters, including 25,000 active duty troops and various reserve units. The elite al-Qassam Brigades, comprising thousands of operatives, play a crucial role in the group&#8217;s strategic operations, including rocket attacks and tunnel incursions into Israeli territory.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Budget</h3>\n\n\n\n<p>Hamas&#8217;s annual budget exceeds 300 million dollars, with substantial financial, military, and intelligence support from Iran, as well as funds from taxes, fees, and diverted international aid.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Arsenal</h3>\n\n\n\n<p>Hamas&#8217;s arsenal includes an estimated 20,000 to 30,000 rockets, sophisticated anti-tank weapons, UAVs, and an extensive network of underground tunnels used for smuggling and military operations. This stockpile enables Hamas to sustain prolonged engagements and carry out significant attacks against Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Leadership</h3>\n\n\n\n<p>The leadership of Hamas is structured with a political bureau and a military wing. Ismail Haniyeh, the head of the political bureau, and Yahya Sinwar, the leader in Gaza, are pivotal figures. Their leadership has focused on both governance within Gaza and maintaining a state of perpetual conflict with Israel. They have leveraged both political maneuvering and military actions to solidify Hamas&#8217;s power and influence.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Military Tactics</h3>\n\n\n\n<p>Hamas employs a range of military tactics, from rocket and mortar attacks to complex tunnel operations aimed at infiltrating Israeli territory. The group&#8217;s strategy often involves using civilian infrastructure, such as schools and hospitals, to store weapons and launch attacks, thereby complicating Israeli military responses and maximizing civilian casualties for propaganda purposes.</p>\n</div></div>\n</div></div></div>\n</div></section></div>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>In 2023, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> faced a brutal <a  href=\"/hamas\">Hamas</a> attack, leading to extensive humanitarian efforts and a complex urban warfare operation in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 226,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 339,
        "footnotes": ""
    },
    "categories": [
        339
    ],
    "tags": [],
    "class_list": [
        "post-5189",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-hamas"
    ],
    "lang": "en",
    "translations": {
        "en": 5189
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5189",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5189"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5189/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5190,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5189/revisions/5190"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/226"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5189"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5189"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5189"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}