{
    "id": 5394,
    "date": "2024-06-17T15:00:00",
    "date_gmt": "2024-06-17T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5394"
    },
    "modified": "2024-06-17T20:58:37",
    "modified_gmt": "2024-06-17T17:58:37",
    "slug": "the-truth-about-the-famine-in-gaza-hoax-daily-briefing-with-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/the-truth-about-the-famine-in-gaza-hoax-daily-briefing-with-doron-spielman/",
    "title": {
        "rendered": "The Truth About the &#8220;Famine in Gaza&#8221; Hoax | Daily Briefing with Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"The Truth About the &quot;Famine in Gaza&quot; Hoax | Daily Briefing with Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/VNeQddE90hQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I am Donon Spielman. This is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on social media platforms Instagram, X, and YouTube. Wherever you are watching, you can submit questions into the live chat.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Main Topic: The Lie About Starvation in Gaza</h2>\n\n\n\n<p>I want to devote the main part of my daily briefing to one subject. There is a lie that has been told repeatedly about Israel, and once you find out how it was cooked up, you will be shocked. I&#8217;m talking about the lie that Israel is starving the people of Gaza. Let me explain to you how this lie started and how it spread.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Origin of the Starvation Claim</h3>\n\n\n\n<p>International NGOs that deal with food security may rely on a tool called the Integrated Food Security Phase Classification, or IPC for short. The IPC is a scale with five phases: phase one means a population is generally food secure, and phase five means famine. IPC classifications are published by a group of food security experts called the Famine Review Committee.</p>\n\n\n\n<p>In March, experts said that 677,000 people in Gaza were facing an imminent famine. They didn&#8217;t say there was a famine; they only said that phase five was coming soon. They predicted famine in Northern Gaza between March and May. Q headlines about Israel starving Gaza. Israel&#8217;s detractors quickly followed suit.</p>\n\n\n\n<h3 class=\"wp-block-heading\">False Declarations of Famine</h3>\n\n\n\n<p>In May, Cindy McCain, the head of the World Food Program, declared that there was a full-blown famine in Northern Gaza and that the famine was spreading to Southern Gaza. She did not explain on what basis she made this declaration. Even the New York Times noted that McCain&#8217;s declaration of famine was not an official declaration of famine. The famine claim was a hoax. You just had to look at the numbers to see the hoax. If the phase five famine was real, we would, God forbid, be seeing hundreds of deaths from starvation every day in Gaza, but that is not the case.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Reversal of the Famine Review Committee</h3>\n\n\n\n<p>Remember the Famine Review Committee that warned of imminent famine a few months ago? Well, they just made a U-turn and outright rejected recent studies that a famine in Gaza is imminent. They said that&#8217;s not plausible. So here&#8217;s the crazy thing: the same committee that told the world that famine was imminent only a few months ago now says that that&#8217;s just not true.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Miscounting of Food Trucks</h3>\n\n\n\n<p>More information has recently come to light that reveals an even greater absurdity of the famine claim. You have to see it to believe it. Listen to this: the prediction of imminent famine in Gaza was based on miscounting the food trucks going into Gaza. Yes, you heard me correctly. Miscounting the food trucks going into Gaza literally did not take into account all of the commercial and private food deliveries to Gaza. It also excluded World Food Program deliveries to bakeries in Northern Gaza. When these food deliveries are taken into account, it turns out the people of Gaza have more than enough food and calories.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Reality of Food Aid</h3>\n\n\n\n<p>In other words, the claim that Israel was starving the people of Gaza only made sense if you didn&#8217;t count the massive amounts of food that were entering Gaza. It&#8217;s completely insane. The conclusion is completely in line with data from a recent Hebrew University study that looked at all the food that entered Gaza. It shows clearly that the amount of food that went into Gaza exceeds international standards.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Hoax Exposed</h3>\n\n\n\n<p>For months, Israeli officials were baffled by the claim that they were starving Gazans, and now we understand why. The claim was not only based on false evidence; it was a hoax. The IDF was sending mass amounts of aid into Gaza by air, by land, and by sea. What we can see now is that the entire population of Gaza is being well-fed.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Global Campaign Against Israel</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Amplifying Lies</h3>\n\n\n\n<p>The truth didn&#8217;t matter. There&#8217;s a global campaign that seeks to stop Israel from defending itself against Hamas. This global campaign amplifies any lie that leads to pressure on Israel. The pressure campaign needs to be focused on Hamas, which continues to attack Israelis and continues to hold hostages in its terror dungeons. The pressure campaign needs to focus on the United Nations, which has done a terrible job distributing the massive amounts of food that have entered Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Spreading the Truth</h3>\n\n\n\n<p>I hope this was clear. Our office and our spokespersons will continue to share analyses about this issue on social media so that you can help spread the truth and combat these lies.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A Session</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Tactical Pauses in Fighting</h3>\n\n\n\n<p>Now let&#8217;s take some questions from our audience watching live on social media. This first question was submitted by a user on Instagram Stories who asks about the pauses in fighting that have taken place in recent days. The IDF announced a tactical pause for humanitarian purposes. Can you provide some context into these pauses, why they happen, where they happen, and what people should know about them?</p>\n\n\n\n<p>Sure. Right now, we are in a period of Muslim holidays. These are holidays for Muslims, and in order to ease the conditions in Gaza, despite the fact that Hamas is operating all around Gaza and putting their civilians in constant threat, the IDF has paused our operations—very important operations regarding the defeating of Hamas—in order to allow an easier transfer of aid to people in Gaza who are trying to celebrate their holidays. Since the beginning of this war, even with Hamas being a horrific enemy that is constantly shooting rockets at Israel and putting our troops in the way of fire, we have been constantly, from the very beginning of this war, having humanitarian pauses wherever possible.</p>\n\n\n\n<p>Keep in mind, Israel is having humanitarian pauses while Hamas is doing everything that is inhumane in Gaza possible. They use their own civilians as human shields, they fire at Israeli civilians without pause, and at the same time, it is up to us to not only protect the Israeli people but to try and ease the life of the people in Gaza, which is what we&#8217;re trying to do.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Potential War with Hezbollah</h3>\n\n\n\n<p>This question was submitted via direct message on Instagram, and it&#8217;s a question that we get a lot: will there be a war with Hezbollah in Lebanon?</p>\n\n\n\n<p>Well, it feels like there already is a war. Since the beginning of October 7th, when they joined Hamas&#8217;s massacre of Israeli civilians by shooting rockets, Hezbollah has shot over 5,000 rockets and anti-tank missiles at homes of civilians and people in Israel. Even today, I was watching with some of my children a show on TV, and all along the side of the TV, it alerted the 10 to 15 different communities that are being hit by live rocket fire. Can you imagine sitting with your children watching the screen when all of a sudden you see the list of cities and wait, could it be ours next, where you have to run into a shelter? Rockets, missiles, and suicide drones have been entering Israel non-stop. 60,000 Israelis have been displaced from their homes. So for us, it already feels like we&#8217;re at war.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas Preventing Civilians from Fleeing</h3>\n\n\n\n<p>This question just came through on the live chat of the Instagram stream: can you please talk about how Hamas prevents its own people from fleeing after Israel sent warning messages?</p>\n\n\n\n<p>This is something that we know; it&#8217;s been videoed; it&#8217;s absolutely available on the internet. There is no question that Israel has given days of pre-warning to civilians in Gaza to move out of the way. We have enabled millions of people in Gaza to relocate to safe areas from the beginning of this war. In fact, no other military in the history of armed combat in the world has done more to try to enable civilian populations to get out of the way of danger.</p>\n\n\n\n<p>What stands between these innocent civilians and these humanitarian zones is none other than Hamas. They hold these people at gunpoint, preventing them from leaving their homes. We&#8217;ve even had Hamas that have—we even have civilians that have risen up against Hamas. Again, you can find this on the internet. It&#8217;s another horrific tactic, but we shouldn&#8217;t be surprised because any regime that&#8217;s willing to massacre babies, men, and women in front of their children, even if they&#8217;re Israeli, it doesn&#8217;t take much for them to do the same thing—to put their own civilians in danger. This is a creed of death, and once you are dedicated to death and genocide against Israelis, you have no problem if you are Hamas putting your own people in the line of fire.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Duration of the War</h3>\n\n\n\n<p>This question is from Aden, who writes on our live stream on Instagram: how long will the war go on?</p>\n\n\n\n<p>Just yesterday, the IDF spokesman Daniel Hagari said regarding the north, regarding Hezbollah, that Hezbollah&#8217;s increasing aggression is bringing us to the brink of what could be a wider escalation. We have the Houthis that have shot missiles at Israel all the way from Yemen. You have Syria, you have Lebanon, you have Judea and Samaria where Hamas is operating, and of course, you have Gaza. This war will go on until what any country would do, which is to enable their civilians to rest peacefully at night and not feel under threat. Israel is standing alone amidst many enemies that are attacking us. We are the canary in the coal mine. When these entities burn Israeli flags, they&#8217;re also burning flags of the United States. They are against the freedom of the western world. We have the responsibility of protecting our own civilians, and the actions of the IDF to protect our civilians and defeat Hamas and all these other entities will continue until our people can go to sleep safely and soundly at night.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Safe Areas in Gaza</h3>\n\n\n\n<p>This question is from our Instagram live by a user named Jefferson: how can there be any safe areas in Gaza if Hamas embeds themselves in these safe areas?</p>\n\n\n\n<p>I very much appreciate this question. This is one of the greatest challenges that the IDF, that the state of Israel has faced from the very beginning. We have dedicated the Alasi corridor from the very beginning. Hamas was dedicated to attacking Israel on October 7th; already by October 8th, Israel was dedicated to finding a humanitarian corridor for Gazan civilians. There are numerous corridors, and from the same time that we began finding these locations and securing them and bringing in food trucks, Hamas has been shooting directly from those locations. We shouldn&#8217;t be surprised. This goes exactly in line with Hamas&#8217;s handbook, which is to put their civilians directly in the line of fire.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217;s Tactics</h3>\n\n\n\n<p>We know why they do this, and many of you know why they do this. They know they cannot beat the IDF on the open battlefield, but what can they do? They can cause the IDF, while going after Hamas, to mistakenly put their own civilians in the line of fire so they can then turn to the world and claim that Israel is committing crimes against humanity. This is Hamas&#8217;s playbook; this is their strategy. So while we are trying to establish humanitarian corridors and, as I mentioned just a few minutes ago, even having a pause in fighting, Hamas is manipulating those areas in order to carry on the war of terror against the IDF and against the Israeli population. It&#8217;s a tough battle, but we are doing everything we can to try and keep the Gazan civilian population safe. The world needs to point the finger at Hamas and understand that they are the ones putting all civilians in this region in the line of fire.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Threat of Hamas in the West Bank</h3>\n\n\n\n<p>Our last question today was submitted to us on YouTube: do you have any information on the threat of Hamas in the West Bank and how Israel is dealing with this threat?</p>\n\n\n\n<p>It&#8217;s often overlooked when we&#8217;re talking only about Gaza and Lebanon. Hamas is well embedded in the West Bank. Since the 7th of October and even before, Hamas has been targeting civilians, children waiting at bus stops, parents driving their cars throughout Judea and Samaria. They always go after civilians and the easy target. At times, they&#8217;ll go after a single soldier if they&#8217;re standing alone. This is a constant problem, but we know that this is what Hamas is for. Anywhere that they can find an Israeli, a Jew in the state of Israel, and we hope it doesn&#8217;t spread beyond those borders, Hamas will do everything they can to kill Jews. It&#8217;s right in their charter. It talks about the annihilation of the state of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF&#8217;s Efforts in Judea and Samaria</h3>\n\n\n\n<p>The IDF, since the very beginning of the 7th of October, has been deployed along Judea and Samaria to protect our civilians and search out those Hamas terrorists while at the same time, again, it&#8217;s the same playbook, trying to protect the civilians in all of those Palestinian cities while going after the Hamas terrorists. Once again, we have to place blame directly at Hamas&#8217;s doorstep. Every day that goes by that the international community focuses on Israel, it is instead of preventing bloodshed, it is contributing to bloodshed by validating and encouraging Hamas to continue more terror. We have to be able to stand on the right side of this understanding and be able to point the finger at Hamas and realize that Israel is doing as much as it can.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>Thank you very much. I want to thank everybody who joined us for this live briefing. Please tune in every day at 3 p.m. Israel time, 8:00 a.m. Eastern Standard Time. We&#8217;re available on TikTok, Twitter, Instagram, and YouTube, and we&#8217;re here for you. Please continue to tune in, and we look forward to seeing you tomorrow.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Donon Spielman, in a daily briefing, addressed false claims of starvation in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, explaining miscounted food trucks and ample aid. He discussed IDF&#8217;s humanitarian efforts, <a  href=\"/hamas\">Hamas</a>&#8216;s tactics, potential <a  href=\"/hezbollah\">Hezbollah</a> conflict, and threats in the West Bank. Emphasizing truth, he urged global focus on <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>&#8216;s actions and aid distribution challenges.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5395,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5394",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5394
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5394",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5394"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5394/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5398,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5394/revisions/5398"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5395"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5394"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5394"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5394"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}