{
    "id": 5435,
    "date": "2024-06-19T15:00:00",
    "date_gmt": "2024-06-19T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5435"
    },
    "modified": "2024-06-19T19:07:22",
    "modified_gmt": "2024-06-19T16:07:22",
    "slug": "the-most-valuable-item-in-gaza-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/the-most-valuable-item-in-gaza-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "The Most Valuable Item in Gaza | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"The Most Valuable Item in Gaza | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/m4IC4oc_oss?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I&#8217;m Eylon Levy. It&#8217;s June 19th, 2024, day 257 of the October 7th War. This is the live Daily Briefing of the Israeli Citizen Spokesperson&#8217;s Office. We&#8217;re live on Instagram, Twitter, and YouTube. Please follow if you are not already. Every day this week, new facts are revealed that demolish the big lie that there is famine in Gaza and that Israel&#8217;s policy is to starve the people of Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Revealing the Truth About Gaza</strong></h3>\n\n\n\n<p>We&#8217;ve spoken about an academic study from the Hebrew University that shows there is enough food going into Gaza for everyone to eat 3,000 calories a day—an enormous quantity of food. We&#8217;ve spoken about the 1,400 trucks worth of aid sitting on the Gaza side of the crossing that the UN has failed to pick up and distribute. We&#8217;ve spoken about how the situation in Gaza comes nowhere close to the international definition of famine, where we&#8217;d expect to see 400 people per day dying of starvation if that were the situation, which it&#8217;s obviously not. Anyone who says so is amplifying a blood libel designed to pressure Israel to leave Hamas in power while still holding hostages in its terror dungeons.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Images from Gaza</strong></h3>\n\n\n\n<p>We&#8217;ve spoken about the countless images in Gaza of busy food markets, food trucks, vendors preparing food, and healthy children. These images are all over social media, and Palestinians in Gaza are the ones posting them. Today, thanks to a master report in the Wall Street Journal, we learn something new about the big lie that there is a famine in Gaza. Do you know what the most valuable item is in Gaza? It&#8217;s not food, it&#8217;s not fuel, and it&#8217;s not medicine. The most valuable item in Gaza is a cigarette. A single cigarette sells for as much as 100 shekels or $25. Now, if one pack has 20 cigarettes, that&#8217;s $500 for a single pack of cigarettes. If one carton has 10 packs, we&#8217;re talking about $5,000 per carton.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The New Gold in Gaza</strong></h3>\n\n\n\n<p>As a UN official told the Wall Street Journal, cigarettes have become like the new gold in Gaza. Another UN official told a story of three armed men who came to a warehouse in Gaza. They demanded to search the boxes of aid. Were they desperate for food or medicine? No, they found the cigarettes they were looking for and left. When you see a video of men in Gaza swarming a truck and breaking open boxes, it&#8217;s not because they&#8217;re hungry. It&#8217;s because they&#8217;re looking for cigarettes that they can sell for a fortune on the black market. Boxes are torn open and the food items are left on the street.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Israel&#8217;s Efforts for Humanitarian Aid</strong></h3>\n\n\n\n<p>Israel is eager for humanitarian aid to enter Gaza: food, water, medicine, medical equipment, and shelters. Israel is flooding Gaza with so much aid that the UN is drowning under it. Cigarettes are not humanitarian aid. If Gazans want to smuggle cigarettes into Gaza, they need business partners on the outside to hide cigarette boxes in humanitarian aid shipments, and that&#8217;s exactly what&#8217;s happening. Ever since Egypt closed its Rafah crossing with Gaza, the smuggling of cigarettes has become much more difficult, and the price of cigarettes has skyrocketed. Packs of cigarettes are smuggled in hollowed-out watermelons—that explains the emoji, I guess—or in bags of cartons of legitimate humanitarian aid.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Truth About Aid in Gaza</strong></h3>\n\n\n\n<p>By now, the truth should be clear to everyone. Hamas keeps firing rockets at the aid crossings to stop aid from getting in, and armed gangs are sabotaging aid deliveries inside Gaza after it&#8217;s already in. That&#8217;s why so much humanitarian aid is sitting on the Gaza side of the border crossing, waiting to be picked up. The UN refuses to pick it up, and they&#8217;re falsely blaming Israel to cover up their fear of Palestinian criminal gangs. The UN needs to stop scapegoating Israel, do its job, and tell the truth: Hamas and Palestinian gangs are blocking aid distribution inside Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Rafah Campaign</strong></h3>\n\n\n\n<p>Speaking of Rafah, do you remember the &#8220;All Eyes on Rafah&#8221; campaign? It sure seems to have died down. Why is that? Is nobody looking at Rafah anymore? Well, I&#8217;m looking at Rafah, and I would love all eyes to be on Rafah. Share that graphic on social media, please. The whole world should see what the IDF is finding in Rafah because there is almost no home in Rafah without a terror tunnel. Terror tunnels connect the homes in Rafah. The terror tunnels in Rafah are how Hamas terrorists move underground undetected. Hamas also smashes holes in walls in houses in Rafah to move around from house to house without being detected.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>IDF Findings in Rafah</strong></h3>\n\n\n\n<p>In just the past few days, the IDF found 17 terror tunnels under the city of Rafah. At least 50 smuggling tunnels have been discovered on the Gaza-Egypt border. Half of them are major tunnels. Think of a major tunnel as an underground highway with cement walls, lights, ventilation, telephone cables, and living quarters. Every time the IDF destroys a terror tunnel, Hamas terrorists have fewer places to hide. The IDF has said that two of Hamas&#8217;s four battalions in Rafah are completely dismantled, and the other two battalions are degraded. Israel is continuing operations to completely dismantle Hamas&#8217;s military capabilities so it can never do October 7th again or terrorize Israeli communities with rocket fire and to keep up military pressure to get all the hostages back.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Israeli Actions in Rafah</strong></h3>\n\n\n\n<p>That&#8217;s why Israel must act in Rafah and is acting in Rafah despite international pressure: to destroy Hamas terrorist hiding places, to block their smuggling routes, to look for hostages, and to keep Israelis safe from the terror army promising to do October 7th again and again until our country is destroyed and all of us are dead.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q&amp;A Session</strong></h2>\n\n\n\n<p>We&#8217;ll take some questions from the audience watching live on social media platforms. As always, you can submit questions on YouTube, Instagram, Twitter—wherever you&#8217;re following. </p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Addressing Misinformation</strong></h4>\n\n\n\n<p>Martin on Instagram Live asks, &#8220;Why is the world so misinformed about what Hamas is doing and shifting the blame to Israel?&#8221;</p>\n\n\n\n<p>Part of the reason the world is misinformed is because the people we look up to for reliable information are covering up for Hamas. That&#8217;s what&#8217;s happening in Gaza right now. People look to the United Nations as a source of authority, but the UN is blaming Israel, scapegoating it for not letting in enough aid to cover up the fact that Hamas is stealing aid, that criminal gangs are disrupting the deliveries of aid, and that their agencies on the ground have been incapable of picking up the aid that is sitting out there rotting in the sun. It&#8217;s much easier to blame the Jews than it is to take responsibility for your own failures.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The Famine Lie</strong></h4>\n\n\n\n<p>We saw just now the big lie about famine in Gaza. It wasn&#8217;t long ago that UN officials claimed that Gaza was on the brink of an imminent famine at any point between March and May. Israel said, of course, that&#8217;s not the case. We&#8217;ve opened aid crossings by land, air, and sea. There&#8217;s more food going in than before the war—3,000 calories a day per person. There&#8217;s plenty of food. The UN said there&#8217;s imminent famine. You&#8217;d expect 12,000 people a month to die of starvation if that were the case, and it just didn&#8217;t happen. As Citizen Spokeswoman Ruth Wasserman Lande explained in her briefing yesterday, the UN, in a new report, has just admitted the data isn&#8217;t there to back up the original scaremongering of starvation inside Gaza.</p>\n\n\n\n<p>So we need these institutions to start doing their jobs, to call a spade a spade, to call out Hamas, to condemn Hamas instead of covering up the Hamas terror regime inside Gaza because they don&#8217;t want Israel to defend itself against it, and they&#8217;d rather leave Hamas in power and hostages in Gaza.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Live Feed at Karam Shalom</strong></h4>\n\n\n\n<p>Dogo on Instagram Live writes, &#8220;Is there a live feed provided of the Karam Shalom crossing to prove the trucks are indeed passing? How do we know what&#8217;s going on there?&#8221;</p>\n\n\n\n<p>There isn&#8217;t a live feed of the Karam Shalom crossing, but COGAT does regularly put out pictures of the aid lying out there in the sun. COGAT is the Israeli military unit responsible for Israel&#8217;s humanitarian aid policy in the Gaza Strip. They are active on Twitter and on social media. They also have a website where they update every day the trucks going into Gaza and provide more information on humanitarian aid. I advise you to follow them. It&#8217;s @COGATonline, and you will see regular pictures of the aid piling up inside Gaza because the UN isn&#8217;t distributing it. We learn today because criminal gangs are disrupting the supply of aid because they&#8217;re hunting for cigarettes, not doing their jobs, and blaming Israel instead. But the evidence is all out there.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Hostage Information</strong></h4>\n\n\n\n<p>This question is from Cindy on Instagram Live, who writes, &#8220;Conflicting news reports are coming out regarding the hostages. Are the hostages still alive? Is there any information on this?&#8221;</p>\n\n\n\n<p>We know that Hamas is holding 120 Israeli hostages in Gaza. We know for a fact that over 40 of them are dead, and Hamas is holding onto their bodies. As soon as Israel has concrete information one way or the other, it updates the families and tells the world. Unfortunately, we do not know for sure the fate of around 80 of those hostages. Hamas hasn&#8217;t even given Israel a list of the hostages it&#8217;s holding or who is alive. We know Hamas is starving them, we know it&#8217;s torturing them, we know that on some occasions it is executing them, and we have to keep fighting as if all 80 of those are alive. We must keep fighting and putting pressure on Hamas to bring back all the living hostages for rehabilitation and all the dead hostages for a dignified burial so their families can have closure.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Thomas Friedman&#8217;s Argument</strong></h4>\n\n\n\n<p>This question is about what Thomas Friedman wrote in the New York Times. He suggested that Israel needed to withdraw completely from Gaza, and he writes that if Sinwar restarted the war or attempted to smuggle weapons, it would be all on him. So what do you make of this argument that Thomas Friedman presented in the New York Times?</p>\n\n\n\n<p>I don&#8217;t know where to start with this. The allegation that Israel should pull out because if Sinwar restarts the war, everyone will know it was on him. Sinwar started this war. Everyone knows that it is on him. Israel didn&#8217;t want this war, didn&#8217;t start this war, didn&#8217;t expect this war. Hamas declared this war with the October 7th massacre, and everyone knows why it started. The tragic thing is most people in Gaza think that all the suffering that has happened since was worth it for the raping and pillaging and murder of October 7th. I wish this weren&#8217;t the case, but it is. The most recent poll by Palestinians of Palestinians shows that over 50% of people in Gaza think that the October 7th massacre was the correct decision by their government, Hamas. Despite everything they&#8217;ve been through since, they think their government, Hamas, which says if it could turn back time, it would do October 7th again and again and is threatening to do October 7th again and again, they think it was the correct decision. And they think it was the correct decision because they think that burning Israeli families alive and gang raping Israeli women took their cause forward.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>International Responses</strong></h4>\n\n\n\n<p>And you know what? They&#8217;re not wrong because when the governments of Norway, Ireland, and Spain recognize a non-existent Palestinian state in response to October 7th, they&#8217;re rewarding the barbaric atrocities of October 7th, and they&#8217;re directly incentivizing the next ones. They&#8217;re telling the Palestinians, &#8220;Commit the most barbaric atrocities of the 21st century, and we will reward you.&#8221; Unfortunately, Israel knows that if this war ends with Hamas still on its feet, there will be a next time, and it will be worse. It will be worse because Hamas&#8217;s leaders won&#8217;t think that if they start a new war, people will blame them because it&#8217;ll be on them. They know that many people around the world will be quick to reward them and to stand behind them as they fight to destroy Israel. That&#8217;s why we need the whole free world to stand by Israel&#8217;s side as it fights to destroy Hamas and bring back the hostages. We don&#8217;t want another war; we don&#8217;t want another blame game. We want the fighting to stop. For the fighting to stop, we need the hostages home, and Hamas has to go.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Hezbollah&#8217;s Involvement</strong></h4>\n\n\n\n<p>Our final question today, just moments before we went live, Hezbollah took responsibility for firing rockets at the northern Israeli city of Kiryat Shmona. What&#8217;s your reaction to this?</p>\n\n\n\n<p>Hezbollah joined this war on October 8th. Since then, it has been firing thousands of rockets and UAVs, suicide drones, non-stop at northern Israel, displacing tens of thousands of Israelis who can&#8217;t return home because in many cases their homes don&#8217;t exist. Hezbollah has laid waste to the cities of Kiryat Shmona, Metula, and other northern communities. They&#8217;ve been destroying them with daily rocket attacks, anti-tank missiles, and UAVs. Now, Israel really wants to resolve this peacefully. It wants the Iranian proxy army Hezbollah to back off from the northern border past the Litani River, just as UN resolutions say it has to do. But if Hezbollah doesn&#8217;t back off, Israel is going to have to force it to back away. We really don&#8217;t want to do that because we know what the cost of an all-out war with Hezbollah would be. It would mean over a thousand rockets fired at the Israeli home front every day, many of them precision-guided. They will get through. The Iron Dome will not be able to save us from all the Hezbollah rockets. But we need our citizens to return safely to their homes. That is the first duty of any country. We cannot live with a reality in which tens of thousands of Israelis are displaced at guesthouses and hotels and they can&#8217;t go home because an Iranian proxy army in Lebanon has destroyed their homes. So the whole world needs to be on notice. Israel will return its citizens to their homes one way or another. Hezbollah has got to back off or Israel will be forced to push it away.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Closing Remarks</strong></h3>\n\n\n\n<p>Okay, that&#8217;s all we have time for. As always, please follow the Israeli Citizen Spokesperson&#8217;s Office on all the major social media platforms. We live every weekday, Sunday to Thursday, 3 p.m. Israel time, 8 a.m. Eastern. We&#8217;ll be back with one of our other citizen spokespeople tomorrow. Thank you very much for joining us.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/eylon-levy/\">Eylon Levy</a> briefing debunks claims of famine in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, highlighting sufficient food supply and <a  href=\"/hamas\">Hamas</a>&#8216;s manipulation of aid for smuggling cigarettes. <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s ongoing efforts to provide humanitarian aid and dismantle <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>&#8216;s terror infrastructure are emphasized, while calling out <a  href=\"https://iron-swords.co.il/t/the-un/\">the UN</a> and international community for misinforming and blaming Israel.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5444,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-5435",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 5435
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5435",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5435"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5435/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5449,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5435/revisions/5449"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5444"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5435"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5435"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5435"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}