{
    "id": 4943,
    "date": "2024-06-05T15:00:00",
    "date_gmt": "2024-06-05T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=4943"
    },
    "modified": "2024-06-05T19:33:37",
    "modified_gmt": "2024-06-05T16:33:37",
    "slug": "the-un-is-failing-to-do-its-job-in-gaza-daily-briefing-with-rachel-lester",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/the-un-is-failing-to-do-its-job-in-gaza-daily-briefing-with-rachel-lester/",
    "title": {
        "rendered": "The UN is Failing to Do Its Job in Gaza | Daily Briefing with Rachel Lester"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"The UN is Failing to Do Its Job in Gaza | Daily Briefing with Rachel Lester\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/OuQQPtIj04A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hi everyone, I&#8217;m Rachel Lester. Today is June 5th, 2024, day 243 of the October 7th War. This is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on social media, and I invite you to start sending questions from wherever you&#8217;re watching.</p>\n\n\n\n<p>The United Nations is not doing its job in Gaza. To cover up the fact that it&#8217;s not doing its job, it is telling lies about Israel. The UN wants you to believe that Israel is blocking aid from entering Gaza. That&#8217;s not true. The true truth is Israel has flooded Gaza with so much aid the UN is drowning under it. Israel is getting aid into Gaza faster than the UN can distribute it. Instead of improving its game, the UN is telling lies about Israel.</p>\n\n\n\n<p>Israel is facilitating the transfer of massive amounts of humanitarian aid to Gaza. Just yesterday, 263 trucks entered Gaza from Israel through the Kerem Shalom Crossing. Last week, almost 1,900 trucks entered Gaza. That&#8217;s far more food than before the war. When trucks enter Gaza from Israel, they unload their cargo on the Gaza side of the crossing. The cargo then gets picked up by UN aid agencies to be distributed to the people of Gaza, or at least that&#8217;s how it&#8217;s supposed to work. It&#8217;s not working because the UN is not doing its job.</p>\n\n\n\n<p>Right now, as I&#8217;m speaking to you, there is enough food sitting inside the Gaza side of the border crossing to fill 1,000 trucks. It&#8217;s just sitting there; nobody is collecting it. There is so much food that there is no room to unload any more trucks. One reason that the UN is so bad at distribution is because they do not have enough trucks inside Gaza. We are eight months into the war, and the UN has only brought 24 new trucks into Gaza. There&#8217;s no excuse for this. It&#8217;s June 2024. The United Nations has had more than enough time to scale up its operations. But instead of scaling up its operations, the UN is telling lies about Israel.</p>\n\n\n\n<p>Here&#8217;s the truth: Israel is doing everything it can to help the UN, even as the UN wages an information war against Israel. Israel has helped the UN find ways to buy more trucks so that the UN can boost its own capabilities. Fuel for the UN trucks goes through Israel&#8217;s Kerem Shalom Crossing. Israel has widened the road that goes from the Kerem Shalom Crossing into Gaza. Israel wants humanitarian aid to flow into Gaza. It wants aid to reach the civilians who need it and our hostages while making sure that Hamas cannot steal it. The United Nations needs to get its act together, stop making excuses, and come collect and distribute the aid that is sitting in Gaza.</p>\n\n\n\n<p>In other places around the world where humanitarian aid needs to be delivered, international aid organizations send thousands of people. How many people has the UN sent to distribute aid in Gaza? Sixty. That&#8217;s nothing. The UN can do more, and it must do more.</p>\n\n\n\n<p>Yesterday, UNRWA tweeted that desalination plants have shut down because almost no fuel is available in Gaza. UNRWA is not a credible source. It is a Hamas front that covers up the fact that Hamas steals aid and uses UNRWA schools as terror bases. This is the truth. The UN can bring fuel into Gaza every single day, but the UN chooses not to. In the last week of May, the UN coordinated the entry of 670,000 liters of fuel. It&#8217;s possible to get double that amount of fuel into Gaza in a week. Instead of raising money off the lies it tells about Israel, the UN should start taking its job seriously.</p>\n\n\n\n<p>Let&#8217;s not forget the big picture. Gaza is a war zone. The reason that Gaza is a war zone is because the government of Gaza, the Hamas rapist regime, invaded Israel on October 7th, massacred families in their homes, gunned down people at a music festival, and abducted over 250 people, including grandparents and toddlers. Hamas could end the war immediately if it lays down its arms and releases the hostages from its terror dungeons. Hamas continues to fight, and it is responsible for the consequences of that decision.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A</h2>\n\n\n\n<p><strong>Question from Instagram Stories:</strong> &#8220;If so much aid is going into Gaza, why are there so many reports about famine?&#8221;</p>\n\n\n\n<p><strong>Answer:</strong> That&#8217;s a great question. I see these reports, and I&#8217;m baffled. I&#8217;m not the only one. There&#8217;s a new academic study from Hebrew University in Jerusalem that looked at all the data about food that has entered Gaza. The data came from COGAT, which is the unit of the IDF responsible for transferring aid into Gaza. The study found that the quantity of food that went into Gaza exceeds international standards and that there should be plenty of food for the entire population of Gaza to be well-fed. I can post the link to the study on Instagram stories if you want to read the whole thing. The problem is that the UN is failing to distribute the food that is already inside Gaza. That has been the problem for the entire war. If the world truly cared about the civilians in Gaza, they would put pressure on the UN to make serious improvements to their logistics capabilities.</p>\n\n\n\n<p><strong>Question from Twitter DM:</strong> &#8220;What has been the response to the Hezbollah-caused fires in Northern Israel from the IDF and from around the world?&#8221;</p>\n\n\n\n<p><strong>Answer:</strong> That&#8217;s a great question. As you probably know, on Monday night, Hezbollah, the world&#8217;s largest terrorist militia, fired rockets and suicide drones from Southern Lebanon into Northern Israel, sparking fires that burned 2,500 acres of land just overnight. That&#8217;s the equivalent of five Disneylands that Hezbollah burned in Northern Israel in one night. Hezbollah has been attacking Israel almost daily since October 8th when it joined its fellow Iranian proxy, Hamas, in the terrorist campaign against Israeli civilians. Yesterday, the IDF, as it has been doing almost daily since October 8th, struck Hezbollah infrastructure in southern Lebanon. Israel is being forced to take on Hezbollah targets deeper and deeper into Lebanon and is assessing even further military action because this new normal, where Northern Israel is on fire, 60,000 Israelis have been unable to live in their homes for eight months and counting, and we are under escalating attacks every single day, is not sustainable. No other country would put up with it. As far as the rest of the world&#8217;s response, there&#8217;s been unsurprising but nonetheless infuriating silence. No one is talking about it. We&#8217;re eight months into a war in which Israel is covered and scrutinized by the news every single day and protested by Hamas sympathizers around the world every single day. But when Hezbollah burns down five Disneylands of Israeli land, there&#8217;s silence. The New York Times: zero coverage. The Washington Post: no story. Same with the BBC and Sky News. CNN did write an article about the fires, but you have to scroll halfway down before they even mention the word Hezbollah. To sum up, it&#8217;s shameful and disappointing.</p>\n\n\n\n<p><strong>Question from Instagram Stories:</strong> &#8220;If a ceasefire happens in Gaza, will the fighting in Northern Israel stop, or is it a completely separate war at this point?&#8221;</p>\n\n\n\n<p><strong>Answer:</strong> That&#8217;s a fantastic question. During the ceasefire that happened back in November, we did see more quiet across the Middle East, not just from Hezbollah but also from other Iranian proxies in Syria and Iraq, as well as a decrease in Houthi attacks in the Red Sea. I would hope that if there is a ceasefire in Gaza, we would see quiet again. But the question is how long will the quiet last. At the moment, Israel is under attack on seven different fronts from terrorists in Gaza, Judea and Samaria, Lebanon, Syria, Iraq, Yemen, and of course the head of the axis of terror, Iran. These terrorists&#8217; stated goal is to wipe Israel off the map, and it&#8217;s unlikely that they&#8217;re going to back off until Israel makes them back off.</p>\n\n\n\n<p><strong>Question from Instagram Stories:</strong> &#8220;You said there&#8217;s more humanitarian aid going into Gaza now than before the war. Do you have the numbers from before the war?&#8221;</p>\n\n\n\n<p><strong>Answer:</strong> Yeah, that&#8217;s a great question, and I&#8217;ve spent a lot of time reading UN and COGAT reports to find this out for myself. Before October 7th, an average of about 72 trucks of food and 10 trucks of humanitarian aid were going into Gaza a day. You might have heard this big claim that 500 trucks a day were going into Gaza because that&#8217;s what virtually every news outlet has written. But the vast majority of what was going into Gaza before the war was construction materials, electronics, animal feed, and stuff like that. Now, as I said, there is more food and more aid going into Gaza than ever before in history. Just yesterday, for example, Israel delivered 217 trucks of food—just food—and 42 trucks of other kinds of humanitarian aid. That was just yesterday. I&#8217;ll say it one more time: Israel is delivering more humanitarian aid to Gaza than ever before, and it&#8217;s the UN that is failing to distribute it.</p>\n\n\n\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> is delivering massive amounts of aid to <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, but <a  href=\"https://iron-swords.co.il/t/the-un/\">the UN</a> is failing to distribute it properly. Despite Israel&#8217;s efforts to facilitate the aid flow, including providing fuel and improving logistics, the UN lacks sufficient trucks and personnel. Instead of addressing these issues, the UN falsely blames Israel.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 4944,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-4943",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 4943
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4943",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=4943"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4943/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 4947,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/4943/revisions/4947"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/4944"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=4943"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=4943"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=4943"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}