{
    "id": 5407,
    "date": "2024-06-18T15:00:00",
    "date_gmt": "2024-06-18T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5407"
    },
    "modified": "2024-06-18T17:55:19",
    "modified_gmt": "2024-06-18T14:55:19",
    "slug": "the-big-lie-collapses-daily-briefing-with-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/the-big-lie-collapses-daily-briefing-with-ruth-wasserman-lande/",
    "title": {
        "rendered": "The Big Lie Collapses | Daily Briefing with Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"The Big Lie Collapses | Daily Briefing with Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/ZEm6Qe_AFBg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hi everyone, I&#8217;m Ruth Wasam and Lande. This is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on social media platforms. Please submit questions wherever you are watching, and I will try and answer some of them at the end.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Big Lie</h3>\n\n\n\n<p>The big lie continues to collapse. Everyone can see the truth now. I&#8217;m talking about the big lie that there is famine in Gaza and the big lie that Israel&#8217;s policy is to starve the people of Gaza. The Gaza famine claim was always a hoax. It was a key part of a global pressure campaign to force Israel to end the war that Hamas had started and to leave Israeli hostages behind in Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Evidence Against the Gaza Famine Hoax</h3>\n\n\n\n<p>Every day, people are seeing more evidence that the Gaza famine hoax was manufactured by Hamas and its partners at the United Nations and other international NGOs. Here&#8217;s one example of what I&#8217;m talking about: yesterday, there were 1,400 trucks worth of aid sitting inside Gaza. The aid had passed through the Israeli border crossing and was waiting to be picked up by the United Nations and distributed in Gaza. Thanks to the United Nations, there are now 1,338 trucks waiting to be picked up. That&#8217;s right, a grand total of 62 trucks of aid were picked up yesterday inside Gaza, all of it by the private sector and none of it by the United Nations.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF Spokesperson&#8217;s Visit</h3>\n\n\n\n<p>Israeli officials have been making this point every single day, but only now people are finally starting to listen. Yesterday, IDF spokesperson Daniel Hagari took reporters to the Kerem Shalom border crossing to show them the truth about how much food is entering Gaza and how much is waiting to be picked up on the other side. Hagari encouraged international organizations to do their job, pick up the aid, and distribute it to the people of Gaza. That&#8217;s exactly the point: the United Nations needs to scale up its aid delivery operations and stop scapegoating Israel for its failure to do its job.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The United Nations&#8217; Role</h3>\n\n\n\n<p>The United Nations knows that Israel is not to blame. UN officials told the Wall Street Journal that people inside Gaza are looting the aid, which makes it unsafe for UN employees to deliver it. An official from the World Food Program also said that looting inside Gaza makes their work really difficult. So there you have it—the big lie has collapsed. It&#8217;s clear to everyone that Israel&#8217;s policy is to send as much food as possible into Gaza. In fact, more food is going into Gaza now than ever before, even before Hamas invaded Israel on October 7th.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hamas&#8217; Responsibility</h3>\n\n\n\n<p>The reason that the humanitarian situation in Gaza is difficult is because Hamas continues to attack Israelis, Hamas continues to promise more October 7 massacres, and Hamas continues to hold hostages in its terror dungeons. Hamas is responsible for the consequences of its own decisions, not Israel. Don&#8217;t fall for the Gaza famine hoax.</p>\n\n\n\n<h3 class=\"wp-block-heading\">International Perspective on Gaza</h3>\n\n\n\n<p>Earlier this month, the world&#8217;s authority on measuring famine, a group called the IPC, said it was not plausible that there is famine in Gaza and that there is no supporting evidence to make such a claim. Based on the definition of famine that international aid agencies rely on, a famine means that two out of 10,000 people per day will die of starvation. There are more than two million people in Gaza. If there is famine in Gaza, it means that over 400 people are dying per day and 12,000 people are dying in one month. Hamas and the World Health Organization are claiming only 30 deaths from starvation, and these are sadly people who clearly had severe underlying health conditions that had nothing to do with the lack of food in Gaza. 12,000 expected dead in a month versus a total of 30 reported dead by Hamas. It&#8217;s a hoax. If there was famine, you would expect to see photo evidence of famine. A senior World Food Program official was in Gaza recently; he shared no photos that indicate that there is a famine, and he had every incentive to do so.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Evidence of Food Availability</h3>\n\n\n\n<p>What I have seen in Gaza are countless images of busy food markets, food trucks, vendors preparing food, and healthy children. These images are all over social media, and Palestinians are the ones posting them. According to a study from the Hebrew University in Jerusalem, there was enough food going into Gaza to ensure that everyone has a 3,000-calorie-per-day diet. That&#8217;s an enormous amount of food. No one has refuted the study, and it is based on a detailed analysis of goods entering Gaza. The truth is clear. The evidence is overwhelming. Hamas wants everyone to suffer, and there is no lie that it won&#8217;t tell. It&#8217;s time that the United Nations and every NGO working in Gaza tell this truth loudly.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Section</h3>\n\n\n\n<p>Let&#8217;s take some questions from our audience right now that are watching on social media.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Naomi on Instagram</h4>\n\n\n\n<p>This question comes from Naomi, who&#8217;s watching live on Instagram: What will happen now with the war cabinet being disbanded? Are there any changes to the Israeli war aims?</p>\n\n\n\n<p>So, the war aims, according to the government, have not changed. The makeup of the cabinet has changed. There is a smaller cabinet that makes, let&#8217;s say, behind-closed-doors decisions and then brings it to a vote in the larger cabinet, but the absolute aims remain clear: disbanding Hamas, making Hamas no longer a ruling group within Gaza—that&#8217;s number one. And alongside it, also number one, is bringing back our hostages. It was and remains the aim of the operation.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Hillary on Instagram</h4>\n\n\n\n<p>This question comes from Hillary, who submitted it via our Instagram live feed: Is Egypt breaking their peace treaty with Israel by allowing Hamas to smuggle weapons into Gaza via the tunnels?</p>\n\n\n\n<p>So this is a bit of a tricky question because Egypt was always saying that it was not allowing for the tunnels to actually exist. And if there is one or two tunnels, then it&#8217;s a mistake or something that they overlooked. The number of tunnels that had been found are very numerous and very significant, and therefore, it&#8217;s clear that this is not the case. Now, the strategic peace agreement between Israel and Egypt and the security cooperation are vastly important on the one hand, but we understand that we need to be on our tiptoes in terms of what is going on on the Egyptian side because that number of tunnels, the regime cannot say that it overlooked it or it was something that they didn&#8217;t know about. It wasn&#8217;t only something that entailed daring or money, and therefore, we need to be on our tiptoes. Israel needs to be really guarding that particular Philadelphi Route because this is the only airline or the possibility for Hamas to get weapons smuggled through, and this is a very sensitive and focal point.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Sheri on Instagram</h4>\n\n\n\n<p>This question comes from Sheri on Instagram, who&#8217;s asking about the condition of the hostages: The Jerusalem Post reported last week that more than a third of the hostages are no longer alive. Today&#8217;s article states that scores of hostages are alive. Do you know where the truth sits regarding the fate of the Israelis who were in Hamas captivity in Gaza?</p>\n\n\n\n<p>So, honestly speaking, I don&#8217;t know where the truth is. And Hamas, this is part of their actual, let&#8217;s say, policy to play the minds of the Jewish people, the Israelis, particularly the families, in order to pressure the government and to pressure the decision-making process even more and to try and turn us against one another. This is the whole point—the psychological warfare of Hamas—and they are throwing statistics, most of them are lies, so it&#8217;s very, very difficult to understand. The first and foremost thing that would be expected from anybody that kidnaps, takes illegally, any kind of hostage is to say, &#8220;We have so-and-so many hostages, so many hostages are alive,&#8221; at least allow international NGOs to come in and see that they are healthy, that they are taken care of in the basics. But of course, they have not allowed that, and therefore, I personally would not either reiterate any such numbers or any such rumors, first and foremost, out of sensitivity to the families and second, because none of them are really verified at this point.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Ohad on Instagram</h4>\n\n\n\n<p>This question comes from Ohad, who submitted it on our Instagram live: What is the situation in Lebanon, and are there disagreements between the United States and Israel on how we approach the government of Lebanon?</p>\n\n\n\n<p>So that&#8217;s a brilliant question. I mean, the government of Lebanon is one entity, and Hezbollah is yet another within the government of Lebanon and really pressuring Lebanon to go along and to carry out the will of a completely foreign factor, which is in fact Iran. So what Hezbollah is doing is not necessarily in the vested interest of Lebanon, and there are voices within Lebanon shouting out their misfortune, their displeasure, their fear of an Israeli attack if Hezbollah continues to do what it is doing to the Israeli north and already encroaching upon the center. So there is a very complex situation in and within Lebanon itself. Now, the United States wants stability, particularly before the coming elections at the end of this year, and therefore, they are very, very keen to have Israel and Lebanon reach some kind of an agreement. Israel is very wary that any kind of an agreement would make Hezbollah really stay some distance away from the border and prevent itself and its people from attacking Israelis. Israel doesn&#8217;t believe that it hasn&#8217;t been the case, even though this has been the decision on the international arena for years, but it has been encroaching upon the border and doing whatever it&#8217;s doing, and now more so in a very ferocious manner. And Israel and the United States, therefore, have a huge vacuum, I would say, between the understanding of how one can bring security to the people of Israel living in the north. And this is an issue that they need to watch out for because we need the United States, we want to cooperate with the United States, we need to go hand in hand on the one hand, on the other hand, we have an issue that we certainly see differently with regard to Lebanon.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Final Question</h3>\n\n\n\n<p>Yes, we have time for one more question today, and this one comes to us via a direct message on Twitter. The question is about Iran&#8217;s nuclear program: It seems to have taken a backseat as an international priority. Is Israel still concerned about the Iranian nuclear program, where does it stand, and what kind of negative role is Iran playing that it&#8217;s getting away with?</p>\n\n\n\n<p>First of all, in my humble opinion, one of the main reasons, objectives, for Iran to have masterminded this whole huge nightmare for the entire region—and I dare say even the entire world—is because it wants the world to look to the other side while it&#8217;s continuing to go along with its nuclear program. And yes, the world is sidelined because of what&#8217;s happening in Gaza, because of what&#8217;s happening in the world, because suddenly campuses throughout the United States and elsewhere are coming in arms as if it&#8217;s a war in and within a war. And this was one of the main issues, the main objectives of Iran when it went out and actually funded, encouraged, and made Hamas begin what it began and what it did and perpetrated on October 7th. And that was just one arm, that was just one part of the puzzle because the mastermind or the master plan is much larger than that. It entails Hezbollah, it entails Hamas in the West Bank, it entails a war against the West, and this is a huge issue to take with you to everyone who&#8217;s willing and also unwilling to listen. This is not an Israel issue. This is first and foremost a war by Iran against the West, and this is the important thing to keep in mind.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you so much for listening today. I hope to see you tomorrow. Be with us same time, same place. Take care.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Ruth Wasam and Lande debunks claims of famine in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, citing <a  href=\"/hamas\">Hamas</a>&#8216; misinformation and highlighting ample food aid. She stresses <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s efforts to help, <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>&#8216; responsibility for Gaza&#8217;s hardships, and urges <a  href=\"https://iron-swords.co.il/t/the-un/\">the UN</a> to improve aid distribution. Questions cover Israel&#8217;s war aims, Egypt&#8217;s tunnels, <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>, Lebanon, and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s nuclear threat.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5411,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5407",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5407
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5407",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5407"
            }
        ],
        "version-history": [
            {
                "count": 4,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5407/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5412,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5407/revisions/5412"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5411"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5407"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5407"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5407"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}