{
    "id": 5187,
    "date": "2024-06-11T22:38:39",
    "date_gmt": "2024-06-11T19:38:39",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5187"
    },
    "modified": "2024-06-11T22:45:16",
    "modified_gmt": "2024-06-11T19:45:16",
    "slug": "the-full-history-of-hamas",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/know-your-enemies/hamas/the-full-history-of-hamas/",
    "title": {
        "rendered": "The Full History of Hamas"
    },
    "content": {
        "rendered": "\n<div class=\"section-wrapper\" data-id=\"9UGWNP\"><section class=\"wp-block-gutenverse-section guten-element guten-section guten-9UGWNP layout-boxed align-stretch\"><div class=\"guten-background-overlay\"></div><div class=\"guten-shape-divider guten-shape-divider-top\"></div><div class=\"guten-shape-divider guten-shape-divider-bottom\"></div><div class=\"guten-container guten-column-gap-default\">\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-6sqruM\"><div class=\"guten-background-overlay\"></div><div class=\"sticky-wrapper\" data-id=\"6sqruM\"><div class=\"guten-column-wrapper\">\n<figure class=\"guten-element guten-video guten-2L5vK0\"><div class=\"guten-video-wrapper\" data-property=\"{&quot;url&quot;:&quot;https://youtu.be/dB29k9vafEA&quot;,&quot;class&quot;:&quot;guten-video-background&quot;,&quot;width&quot;:&quot;100%&quot;,&quot;height&quot;:&quot;500px&quot;,&quot;controls&quot;:true,&quot;playsinline&quot;:true,&quot;style&quot;:{},&quot;config&quot;:{&quot;youtube&quot;:{&quot;playerVars&quot;:{}}}}\"></div></figure>\n\n\n\n<div class=\"guten-element gutenverse-text-editor guten-u4sobK\"><div class=\"text-content-inner\">\n<p>Hamas, the terrorist organization that rules Gaza, how did it all begin? Let&#8217;s go back to 1987. The first Intifada breaks out against Israel, and from within the Muslim Brotherhood in Gaza, a new, more violent branch is born: Kamas, an acronym for the Islamic Resistance Movement. Kamas published its Charter calling for killing the Jews, with Jihad as its path, refusing peaceful solutions on principle and swearing to invade Israel and be killed for the sake of Allah. Hamas&#8217;s first official terrorist attack happened in early 1989 when Hamas kidnapped and killed two IDF soldiers and soon after called for a Jihad against the Zionist enemy everywhere. Throughout the 90s, Hamas carried out suicide bombings all over Israel and landed itself on the U.S. State Department&#8217;s list of designated foreign terrorist organizations.</p>\n\n\n\n<p>In 2000, the Second Intifada began, even more violently than the first, terrorizing Israelis with more suicide bombings, car rammings, kidnappings, and firing rockets into Israel for the first time. Hamas also executed Gazans thought to be collaborating with Israel. This five-year reign of terror left over a thousand Israelis dead. As the Second Intifada came to an end, Israel tried land for peace. In September 2005, Israel unilaterally withdrew from Gaza, and the IDF removed over 9,000 Israelis from their homes throughout the Gaza Strip.</p>\n\n\n\n<p>This is where Hamas&#8217;s story really gets started. In January 2006, the Palestinian Legislative Council held elections between Hamas, Fatah, and other smaller parties. Hamas won the majority of the seats, and Ismail Haniyeh became the leader of Gaza. Shortly after, Hamas infiltrated Israel through a cross-border tunnel and kidnapped IDF soldier Gilad Shalit while killing two others. Meanwhile, the Hamas and Fatah unity government was unraveling, with a year and a half of bloody internal clashes. The violence culminated in June 2007 when Hamas infamously threw Fatah members off rooftops and carried out a complete military takeover of Gaza. Since June 15th, 2007, Hamas has controlled every aspect of government and life in Gaza, and there have been no elections since.</p>\n\n\n\n<p>Hamas quickly ran Gaza into the ground, maintaining armed resistance against Israel as its top priority while neglecting the basic needs of the Gazans they were now completely responsible for. Hamas raised taxes on Gaza&#8217;s businesses, imposed fees on smuggled goods, received about $100 million annually from Iran, and diverted billions of dollars of international aid all to finance building rockets, drones, and a 500 km long web of underground tunnels to hide and operate in. The Hamas leadership became billionaires as the majority of Gazans struggled in poverty under Hamas&#8217;s oppressive rule. Children are taught in school to want to kill Jews and are indoctrinated and trained in Hamas summer camps. Women in Gaza suffer from high rates of domestic violence, and LGBTQ+ people in Gaza are routinely imprisoned, tortured, and murdered.</p>\n\n\n\n<p>Since its foundation, Hamas has stored its weapons in homes, mosques, schools, and hospitals, infamously using Gazan civilians as human shields for their terrorism. To this day, in 2011, Hamas released Gilad Shalit after five years in captivity in a deal that released 1,027 convicted terrorists from Israel. Yahya Sinwar, known as the Butcher of Khan Yunis, returned to Gaza and eventually became Hamas&#8217;s new official leader. In the summer of 2014, Hamas members kidnapped and murdered three Israeli teen boys, launching a nearly two-month-long war during Israel&#8217;s Operation Protective Edge. Hamas fired 4,500 rockets into Israel, the IDF destroyed 32 Hamas tunnels, and Hamas violated several official ceasefires before the end of the war.</p>\n\n\n\n<p>In 2018, Hamas launched the Great March of Return and incited weekly riots at the security fence between Gaza and Israel in attempts to breach it and invade Israel en masse, foreshadowing what was to come in 2023. During that time, Hamas also came up with new ways to terrorize Israel. They tied explosives to balloons and kites to float into Israel, scorching and destroying thousands of acres of land across southern Israel. These violent riots and arson attacks lasted almost two years, peaking in May 2019 when the U.S. moved its embassy to Jerusalem. The next major escalation came in May 2021 when Hamas launched barrages of rockets towards Jerusalem, sparking Operation Guardian of the Walls. Hamas and Islamic Jihad fired nearly as many rockets at Israel in just 12 days as they had over the span of two months in 2014.</p>\n\n\n\n<p>Two years later, Hamas carried out the attack that would become the deadliest day for Jews since the Holocaust. On October 7th, 2023, thousands of Hamas terrorists broke through the border and invaded Israel, massacring over 1,200 Israelis, most of them civilians, while simultaneously firing thousands of rockets all across Israel. Hamas took hostage about 240 children, women, men, elderly civilians, and foreign nationals. Since October 7th, Hamas and Israel have been at war, with Hamas hiding behind the civilians of Gaza at every opportunity, including by operating inside hospitals, wearing civilian clothes while actively fighting, and physically preventing Gazan civilians from evacuating war zones. When Hamas launched this war on October 7th, the IDF declared two goals: to bring the hostages home and to completely eliminate Hamas.</p>\n</div></div>\n</div></div></div>\n\n\n\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-hI2Yki\"><div class=\"guten-background-overlay\"></div><div class=\"sticky-wrapper\" data-id=\"hI2Yki\"><div class=\"guten-column-wrapper\">\n<h3 class=\"wp-block-gutenverse-heading guten-element guten-KElhmZ\">Hamas</h3>\n\n\n\n<div class=\"guten-element gutenverse-text-editor guten-STtTwf\"><div class=\"text-content-inner\">\n<p>Hamas, established in 1987, has evolved from a violent offshoot of the Muslim Brotherhood into a powerful political-military entity in the Middle East. Under the leadership of Ismail Haniyeh and Yahya Sinwar, Hamas has become a significant regional actor, particularly in Gaza, where its military, political, and ideological activities have profound implications for regional security, especially concerning its tension with Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ideology</h3>\n\n\n\n<p>Hamas&#8217;s ideology is rooted in Sunni Islamic fundamentalism, with key objectives including the establishment of an Islamic state in the region and the slaughter of all Jews in the world, as well as the elimination of Israel through armed struggle. These goals are clearly stated in Hamas&#8217;s founding charter and other official statements.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Official Flag</h3>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"2560\" height=\"1600\" src=\"https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_.png\" alt=\"Hamas Terror Organization\" class=\"wp-image-226\" srcset=\"https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_.png 2560w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-300x188.png 300w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-1024x640.png 1024w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-768x480.png 768w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-1536x960.png 1536w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-2048x1280.png 2048w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" /><figcaption class=\"wp-element-caption\">Hamas</figcaption></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Order of Battle</h3>\n\n\n\n<p>Hamas commands approximately 40,000 to 50,000 fighters, including 25,000 active duty troops and various reserve units. The elite al-Qassam Brigades, comprising thousands of operatives, play a crucial role in the group&#8217;s strategic operations, including rocket attacks and tunnel incursions into Israeli territory.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Budget</h3>\n\n\n\n<p>Hamas&#8217;s annual budget exceeds 300 million dollars, with substantial financial, military, and intelligence support from Iran, as well as funds from taxes, fees, and diverted international aid.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Arsenal</h3>\n\n\n\n<p>Hamas&#8217;s arsenal includes an estimated 20,000 to 30,000 rockets, sophisticated anti-tank weapons, UAVs, and an extensive network of underground tunnels used for smuggling and military operations. This stockpile enables Hamas to sustain prolonged engagements and carry out significant attacks against Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Leadership</h3>\n\n\n\n<p>The leadership of Hamas is structured with a political bureau and a military wing. Ismail Haniyeh, the head of the political bureau, and Yahya Sinwar, the leader in Gaza, are pivotal figures. Their leadership has focused on both governance within Gaza and maintaining a state of perpetual conflict with Israel. They have leveraged both political maneuvering and military actions to solidify Hamas&#8217;s power and influence.</p>\n</div></div>\n</div></div></div>\n</div></section></div>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"/hamas\">Hamas</a>, established in 1987, aims to eliminate <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and slaughter all Jews, conducting violent attacks and governing <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> oppressively.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 226,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 339,
        "footnotes": ""
    },
    "categories": [
        339
    ],
    "tags": [],
    "class_list": [
        "post-5187",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-hamas"
    ],
    "lang": "en",
    "translations": {
        "en": 5187
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5187",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5187"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5187/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5193,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5187/revisions/5193"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/226"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5187"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5187"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5187"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}