{
    "id": 5633,
    "date": "2024-06-25T15:00:00",
    "date_gmt": "2024-06-25T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5633"
    },
    "modified": "2024-06-26T21:26:10",
    "modified_gmt": "2024-06-26T18:26:10",
    "slug": "un-hamas-money-laundering-scam-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/un-hamas-money-laundering-scam-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "UN: Hamas&#8217; Money Laundering Scam | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"UN: Hamas&#039; Money Laundering Scam | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/8rFcfMOC9zk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Introduction</h3>\n\n\n\n<p><strong>Hello Everyone,</strong></p>\n\n\n\n<p>I&#8217;m citizen spokesman Eylon Levy. This is the daily briefing of the Israeli citizen spokesperson&#8217;s office. We are live on YouTube, Instagram, and Twitter. Please start submitting questions in the chat. These briefings are now available shortly after broadcast as podcast episodes, so you can listen to them on your drive or commute on the way to work. Search for the Israeli citizen spokesperson&#8217;s office on Apple Podcasts, Spotify, Amazon Music, and all major podcast platforms.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Current Situation</h3>\n\n\n\n<p><strong>Today is Day 263 of the October 7th War.</strong></p>\n\n\n\n<p>For months, we&#8217;ve been warning that UNRWA is a Hamas front. It employs thousands of Hamas members, hires terrorists who took part in the October 7th massacre, and has teachers who held hostages in their homes. It covers up Hamas hijacking aid trucks, indoctrinates children to embrace Jihad, lets Hamas terrorists fight out of its schools, and perpetuates the fantasy of Palestinians moving to Israel and destroying it from the river to the sea. UNRWA even provided free electricity to Hamas’s intelligence headquarters built underneath its Gaza headquarters.</p>\n\n\n\n<p>UNRWA is a Hamas money-laundering machine. This UN agency helped the Hamas terror army steal $1 billion to buy weapons for the October 7th massacre and dig tunnels to hold hostages. A US lawsuit brought by survivors of October 7th reveals how Hamas&#8217;s money-laundering scheme works. Hamas pays salaries to its employees in Gaza in dollars. They need to convert these dollars to shekels to spend them at the market, and they can only do that through Hamas money changers, who take a 10-20% cut. That&#8217;s how Hamas stole over $1 billion donated by international taxpayers to buy weapons and tunneling equipment. Before October 7th, UNRWA funneled millions of dollars a month to Hamas’s terror army, helping it smuggle weapons to murder and abduct Israelis.</p>\n\n\n\n<p>This scheme is unique to Gaza; nowhere else does UNRWA give out dollars, making this a smoking gun of intentional support. UNRWA&#8217;s international leadership is fully complicit in the murder and abduction of Israelis on October 7th.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Call to Action</h3>\n\n\n\n<p>Here&#8217;s what else is really infuriating: UNRWA helped Hamas steal $1 billion of international taxpayer aid. Your governments are taking the tax money of hardworking families and giving it to Hamas&#8217;s money-laundering machine. If you&#8217;re watching us from the United States, Germany, France, Sweden, Japan, Norway, the Netherlands, Canada, or the UK, know that your governments have been sending part of your paycheck to the Hamas terror army through UNRWA. Enough is enough. UNRWA has been hijacked by Hamas. Its leaders must face justice for aiding and abetting terrorists. World governments must stop funding it immediately.</p>\n\n\n\n<p>The UN doesn&#8217;t only launder Hamas&#8217;s cash; they and too many others also launder Hamas&#8217;s information, amplifying its lies about who died and why. Ever since Hamas launched their war on October 7th, Israel&#8217;s new analysis exposes the UN&#8217;s Hamas-based casualty numbers as absurd lies. Hamas doesn&#8217;t differentiate between innocent civilians caught in the crossfire and its terrorists killed while doing terrorism. They make up numbers and count every death by natural causes as killed by Israel. They never acknowledge those killed by Hamas rockets landing inside Gaza.</p>\n\n\n\n<p>Did you know that Hamas passes off its own child soldiers as children killed by Israel? They even list male terrorists as women to fudge the stats. Hamas are rapists and murderers, and they lie. The UN and anyone who takes Hamas&#8217;s claims at face value are complicit in Hamas&#8217;s brutal terror and the information war it wages against the Jewish people.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Brutal Reality</h3>\n\n\n\n<p>We know well what that brutal terror looks like, thanks to Hamas, which proudly filmed its own barbaric rampage on October 7th. We saw young people hunted down at a music festival, survivors fleeing to a roadside bunker meant to protect them from rockets, only for Hamas monsters to throw grenades into the shelter at unarmed festival goers.</p>\n\n\n\n<p>Yesterday, the families released footage of American citizen HH Goldberg, who lost his arm in Hamas&#8217;s brutal attack, shown together with two other survivors as Hamas brutally abducted them into Gaza. The body of Muhammad Al-Adrash, an Arab Israeli father of 13 children, a Muslim, is being held hostage by Hamas. Over 120 hostages are still being held in Hamas&#8217;s terror dungeons in Gaza. Only over 40 of them have been killed either on October 7th or since in captivity. The Red Cross hasn&#8217;t visited them or ensured their safety.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Call to Action</h3>\n\n\n\n<p>We need you to tell your leaders, friends, and everyone to send one clear message to the Hamas rapist regime: let them go now.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p><strong>We&#8217;ll now take questions from the audience watching on the various social media platforms.</strong></p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 1: Samila Sarin</h4>\n\n\n\n<p><em>Q: Has it occurred to Israel that hostages are not in Gaza but will require a manhunt like what happened to Holocaust criminals?</em></p>\n\n\n\n<p>A: The prospect that Hamas might have smuggled hostages out of Gaza is a terrifying possibility. We know that Hamas had dozens of smuggling tunnels from Gaza into Egypt. We hope Hamas has not smuggled hostages out. The army hasn&#8217;t made public any intelligence to that effect, but as long as Hamas has smuggling tunnels into Egypt, we can&#8217;t discount it. The hostage crisis on October 7th shows us the threat of a repeat October 7th on the northern border with Hezbollah. If Hezbollah&#8217;s death squads were to invade Israel from Lebanon and take hostages, they could be in Iran by the afternoon. That&#8217;s why Israel is committed to pushing Hezbollah away from the northern border, where they&#8217;ve sent thousands of rockets and suicide drones, displacing tens of thousands of Israelis who cannot return home.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 2: Ariel</h4>\n\n\n\n<p><em>Q: What can trigger any possibility for Hamas to release the hostages as this war is expanding dramatically and needs to stop?</em></p>\n\n\n\n<p>A: Hamas does not want to release the hostages. Hamas wants this war to drag on because it thinks it is winning the global information war. It knows that if it forces Israel to continue fighting for the hostages, protests around the world will intensify, Israel&#8217;s diplomatic relations and alliances will come under strain, and more UN officials will accuse Israel of made-up atrocities. We need world leaders to tell Hamas to let the hostages go now and step up sanctions against Hamas to cut off its supplies for smuggling money. Hamas managed to siphon over a billion dollars of international taxpayer aid through UNRWA. That money laundering route is still open. Countries are still funneling money into UNRWA, enabling Hamas to continue its activities. We need serious sanctions against Hamas and all countries with any leverage over Qatar, Turkey, and Iran to use all available pressure to force Hamas to let the hostages go now.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 3: Jany B73</h4>\n\n\n\n<p><em>Q: What can we as the general public do to bring attention to the underhanded and anti-semitic UN?</em></p>\n\n\n\n<p>A: Keep exposing it. The UN enjoys a certain moral authority. People think what the UN says must be true. But it&#8217;s clear how complicit UN leaders, UNRWA leaders, and World Health Organization leaders are with the Hamas terror regime. UNRWA is an integral part of Hamas&#8217;s military machine. It covers up how Hamas hijacks aid, lets it fight out of its schools and clinics, and even gives it electricity to its underground intelligence centers. Difficult as it is to hear, that&#8217;s the message we need to share worldwide. Your governments are taking your taxpayer money and giving it to an agency that exists to perpetuate conflict and funnel over a billion dollars towards Hamas. Call them out for the lies. Don&#8217;t let them get away with things just because they have &#8220;UN&#8221; on their business cards.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 4: Galut Greg</h4>\n\n\n\n<p><em>Q: Is Israel ready for a massive wave of Aliyah?</em></p>\n\n\n\n<p>A: Israel is the national home of the Jewish people. It exists to reclaim our independence and sovereignty and to provide a safe haven for Jews fleeing persecution. It&#8217;s deeply disturbing to see Jews around the world fearing for their place within Western societies. We welcome anyone who wants to come and make Israel their home, but don&#8217;t run away. Stay and fight. The diaspora needs a strong Israel, and we in Israel need a strong diaspora. We need you to fight to keep your countries sane, liberal, and democratic. We need you to make the world safe for Israel so that Israel can make the world safe for the Jews. If you want to come and live in Israel, it&#8217;s great, but if Jews are not safe in Canada, they&#8217;re not going to be safe anywhere on Earth. Stay and fight for your place in your countries.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question 5: Deun 73</h4>\n\n\n\n<p><em>Q: How do you react to the BBC News&#8217;s continual anti-Israel bias?</em></p>\n\n\n\n<p>A: Media bias is a problem, and that&#8217;s why we have to continue fighting the information war. Hamas is trying to make good, ordinary, decent people around the world hate Israel. They&#8217;re spreading lies and luring Israel to fight in densely populated areas where they know people will get killed. This conflict is bigger than a war between Israel and a terrorist group in Gaza. Israel is fighting for its life against Iran and its proxy armies. They are priming international public opinion for the day they are ready to wipe our country off the map. That&#8217;s why it&#8217;s so important to fight against this information war, to give every interview we can, and to make information accessible to the general public and journalists to understand how Hamas is manipulating them.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>That&#8217;s all we have time for today. Thank you for joining us. We have now been running the citizen spokesperson project for one month. Thank you everyone for following. Make sure that you are following on all social media platforms—YouTube, Instagram, Twitter, TikTok, Facebook—and on podcast platforms as well.</p>\n\n\n\n<p>I&#8217;m Eylon Levy. Thank you very much for joining us.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/eylon-levy/\">Eylon Levy</a>, Israeli citizen spokesman, addresses the <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a>&#8216;s alleged support for <a  href=\"/hamas\">Hamas</a>, detailing how funds intended for aid were diverted to support terrorism. He urges international action against UNRWA and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>, emphasizes the importance of combating misinformation, and calls for global solidarity to release <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a> and support <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s security.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5637,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-5633",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 5633
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5633",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5633"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5633/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5636,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5633/revisions/5636"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5637"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5633"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5633"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5633"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}