{
    "id": 5199,
    "date": "2024-06-12T10:53:45",
    "date_gmt": "2024-06-12T07:53:45",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5199"
    },
    "modified": "2024-06-12T11:29:20",
    "modified_gmt": "2024-06-12T08:29:20",
    "slug": "what-is-hamas",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/know-your-enemies/hamas/what-is-hamas/",
    "title": {
        "rendered": "What is Hamas?"
    },
    "content": {
        "rendered": "\n<div class=\"section-wrapper\" data-id=\"9UGWNP\"><section class=\"wp-block-gutenverse-section guten-element guten-section guten-9UGWNP layout-boxed align-stretch\"><div class=\"guten-background-overlay\"></div><div class=\"guten-shape-divider guten-shape-divider-top\"></div><div class=\"guten-shape-divider guten-shape-divider-bottom\"></div><div class=\"guten-container guten-column-gap-default\">\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-6sqruM\"><div class=\"guten-background-overlay\"></div><div class=\"sticky-wrapper\" data-id=\"6sqruM\"><div class=\"guten-column-wrapper\">\n<figure class=\"guten-element guten-video guten-2L5vK0\"><div class=\"guten-video-wrapper\" data-property=\"{&quot;url&quot;:&quot;https://youtu.be/I0MBZU5z7Ks&quot;,&quot;class&quot;:&quot;guten-video-background&quot;,&quot;width&quot;:&quot;100%&quot;,&quot;height&quot;:&quot;500px&quot;,&quot;controls&quot;:true,&quot;playsinline&quot;:true,&quot;style&quot;:{},&quot;config&quot;:{&quot;youtube&quot;:{&quot;playerVars&quot;:{}}}}\"></div></figure>\n\n\n\n<div class=\"guten-element gutenverse-text-editor guten-u4sobK\"><div class=\"text-content-inner\">\n<p>October 7th, 2023, Israelis on the border with Gaza woke into a nightmare on Saturday. Hamas launched an unprecedented attack, sending more than a thousand fighters into Israel. Men, women, and children were ruthlessly and mercilessly killed. 260 bodies were removed from the desert. This slaughter was the largest mass murder of Jews in a single day since the time of the Holocaust. The brutality of Hamas brings to mind the worst rampages of ISIS. So who is the group behind the worst attack in Israeli history? Who is Hamas?</p>\n\n\n\n<p>Israelis thought they knew Hamas. This was the terror group that&#8217;s been around since the late &#8217;80s. They were responsible for 40% of attacks during the Second Intifada, which claimed the lives of over 1,000 Israelis. They&#8217;ve gone head-to-head with Israel in 2009, 2014, and 2021, but the scale and brutality of this recent attack is unprecedented. This is extreme brutality, and the numbers keep growing.</p>\n\n\n\n<p>How did we get here? Well, to answer that, we need to go back to the 1960s. Back in 1967, Israel won the Six-Day War, gaining control of the West Bank and Gaza from Jordan and Egypt, which meant that they were now responsible for the more than 1 million Palestinians who lived there. The umbrella organization that claimed to represent the Palestinians had a very clear goal. It called itself the PLO or Palestine Liberation Organization. Each faction within the PLO had its own ideas about how to achieve the stated goal of Palestinian liberation. Many of those ideas involved terrorism.</p>\n\n\n\n<p>&#8220;The gunman shot dead two Israelis and are now holding 20 athletes and six officials as hostages.&#8221;<br>&#8220;Eighteen coffins draped with the Israeli flag were driven slowly through the weeping crowd to be carried to the graves.&#8221;<br>&#8220;More than 100 hostages from pro-Palestinian hijackers at Entebbe Airport in Uganda.&#8221;</p>\n\n\n\n<p>As you might imagine, the PLO was Israel&#8217;s number one enemy. At the same time, Israel&#8217;s security service was keeping tabs on a Muslim cleric named Ahmed Yasin, who was gaining some popularity in Gaza. Yasin was a member of the Muslim Brotherhood, which Israel was hoping would act as a counterweight to the influence of the secularist, Marxist-aligned PLO. The Brotherhood had utilized violence in the past, but by the late &#8217;60s, the core of the Muslim Brotherhood in Egypt had given up on violence. The extreme members began leaving Gaza. The remaining Muslim Brothers developed a moderate worldview that focused mainly on spiritual revival. That seemed to be Yasin&#8217;s main interest. He spent his time building schools, mosques, and clinics. So as Israel cracked down hard on the PLO, they left Yasin alone to grow his network.</p>\n\n\n\n<p>But everything changed in 1979. &#8220;A tearful Shah of Iran left his country today on a vacation from which he may never return.&#8221; The secular, pro-Western government of Iran, which had been Israel&#8217;s ally, had fallen to a radical Islamist movement. The Islamic Revolution struck a chord all over the Muslim world, particularly with Sheikh Yasin. Imams in Gaza grew more and more radical, preaching armed struggle in the name of Islam. At first, Yasin and his followers brought their armed struggle to their secular rivals in the PLO, essentially a low-level civil war. But behind the scenes, Yasin was preparing to attack another, far bigger target: Israel. He seized his chance in the late 1980s. By this point, Israel had administered the West Bank and Gaza for 20 years, what some refer to as the occupation.</p>\n\n\n\n<p>&#8220;This is our land. They take the land by force.&#8221;</p>\n\n\n\n<p>Palestinians resented their economic dependence on Israel. They seethed as Israeli citizens built settlements in the West Bank, biblically known as Judea and Samaria, and Gaza. As the PLO kept up its campaign of terror, the IDF kept cracking down. Tensions were high. It did not take much to make them explode. This was the First Intifada.</p>\n\n\n\n<p>&#8220;Another outbreak of violence in the Israeli-occupied West Bank and the Gaza Strip.&#8221;</p>\n\n\n\n<p>And it was amid the chaos and violence that Yasin and his followers saw their chance. It was time to unveil their new group: the Islamic Resistance Movement, better known by its acronym, Hamas. They laid out their aims in a 36-point charter. Here are some of the key articles from the charter that many view as deeply dangerous for the Jewish state:</p>\n\n\n\n<p>Article 8: Allah is its target, the Prophet is its model, the Quran its constitution, jihad is its path, and death for the sake of Allah is the loftiest of its wishes.<br>Article 13: There is no solution for the Palestinian question except through jihad.<br>Article 32: The Zionist plan is limitless. After Palestine, the Zionists aspire to expand from the Nile to the Euphrates. When they have digested the entire region they overtook, they will aspire to further expansion and so on. Their plan is embodied in the Protocols of the Elders of Zion.</p>\n\n\n\n<p>Yep, you heard that right. Hamas&#8217;s 1988 charter literally quotes the world&#8217;s most famous bogus anti-Semitic conspiracy theory as proof of their validity. Unfortunately, Hamas wasn&#8217;t all talk. Their first act as an organization was the kidnapping and murder of two Israeli soldiers in 1988, mutilating their bodies for good measure. The Israelis were furious. They sentenced Yasin to life in prison, but it was too late. Hamas had been unleashed into the world. Their attacks kept coming, and they weren&#8217;t just targeting soldiers. They spread terror by attacking civilians.</p>\n\n\n\n<p>And then Israel made a huge strategic mistake. Desperate to get rid of Hamas, the IDF deported all known members to southern Lebanon. And that&#8217;s where they met Hezbollah, another terrorist group sworn to Israel&#8217;s destruction. Hezbollah, which had been created and trained by the Iranians, taught Hamas everything they&#8217;d learned from the Iranian Revolutionary Guard: encryption and codes, espionage, how to use a rocket launcher, how to make a bomb. It was this last one that would haunt Israelis through the coming decades.</p>\n\n\n\n<p>I want to pause here to address something you see a lot on social media. You might have heard statements like, &#8220;Israel created Hamas.&#8221; This is absolutely untrue. Yes, Israel made the strategic mistake of ignoring Yasin and later deporting the group to Lebanon, and yes, the dire economic conditions in Gaza have led many Palestinians to side with Hamas. But to say that Israel created Hamas is to misunderstand the group&#8217;s history. It&#8217;s victim blaming.</p>\n\n\n\n<p>But back to our story. Eventually, Israel caved to international pressure. They brought the Hamas men back into Gaza. Within a year, a Hamas fighter nicknamed &#8220;The Engineer&#8221; used his Hezbollah training to change the conflict completely. He engineered the first suicide bomb attack in Israeli history. Throughout the early &#8217;90s, Hamas&#8217;s preferred targets were buses or bus stops where civilians and soldiers mingled. But slowly they branched out to other soft targets: a mall, a cafe, a marketplace, all with the goal of terrifying and murdering civilians. Israelis were used to terrorism, but this was unprecedented. Hamas was convincing young people that death was preferable to life. The shahid (martyr) was a Muslim&#8217;s highest calling.</p>\n\n\n\n<p>&#8220;We came with our souls, our blood, our martyrs, and our wounded to sacrifice ourselves for Palestine and for our people.&#8221;</p>\n\n\n\n<p>After Israel and the PLO signed the first of the Oslo Accords in late 1993, Hamas, along with other terror groups, responded with a wave of attacks. The failure of the peace process was followed by a dark time in Israel: the Second Intifada.</p>\n\n\n\n<p>&#8220;A suicide bomber killed at least 15 people late today in Israel. Rescue workers said at least 60 people were hurt. Tonight&#8217;s explosion rocked the hotel just as guests were beginning the ritual meal that begins the Passover holiday.&#8221;</p>\n\n\n\n<p>For years, Israelis endured near-daily terrorist attacks, including suicide bombings. 40% of those were the work of Hamas. The other 60% came from other Palestinian terror groups like Palestinian Islamic Jihad and the Al-Aqsa Martyrs&#8217; Brigade, the military wing of Fatah, the political party in charge of the PLO. The violence of the Second Intifada caused intense trauma for Israelis and Palestinians. It&#8217;s a trauma that directly impacts the conflict to this day. By 2002, Israelis had had enough. They began building a barrier along what was essentially the border before the Six-Day War, eager to make the terror stop. And in 2005, then-Prime Minister Ariel Sharon made the highly controversial decision to remove all Israeli settlements from Gaza.</p>\n\n\n\n<p>&#8220;Until 2005, nearly 9,000 Jews called the Gaza Strip home. The block of Jewish settlements in the southern Gaza Strip was known collectively as Gush Katif.&#8221;</p>\n\n\n\n<p>But Sharon was determined to improve Israel&#8217;s security situation, not to mention its international standing, so he authorized a plan to remove all Israelis from Gaza. The move was not coordinated with the Palestinians. It was managed top to bottom by the Israeli government and military in what is described as a unilateral move. Many Israelis protested bitterly at being uprooted from their homes, and many Jewish people around the country protested with them.</p>\n\n\n\n<p>&#8220;We call on the Prime Minister to take his disengagement plan to a national referendum or call for early elections.&#8221;</p>\n\n\n\n<p>But the army had its orders. In August of 2005, not a single Jewish person was left in Gaza. Meanwhile, Hamas was busy wooing Palestinians. They continued the work of Ahmed Yasin, building infrastructure and schools and clinics. Ordinary Palestinians were already frustrated with the deep corruption of the ruling party, Fatah, so they turned to Hamas, the only Palestinian party that seemed to care about them. And in the 2006 Palestinian elections, Hamas won. Fatah, the US, and Israel were caught by surprise and</p>\n\n\n\n<p>utterly horrified.</p>\n\n\n\n<p>&#8220;The Hamas party has made it clear that they do not support the right of Israel to exist, and I have made it clear, so long as that&#8217;s their policy, that we will not support a Palestinian government made up of Hamas.&#8221;</p>\n\n\n\n<p>Fatah men, with the help of the US, tried to oust Hamas militarily, but they failed. Hamas fought back hard and won. They kicked Fatah out of Gaza entirely. They&#8217;ve been ruling the coastal enclave ever since. In all that time, they&#8217;ve never held another election. But if Palestinians in Gaza were hoping that Hamas would make their lives better, they grew more and more disillusioned with every passing year.</p>\n\n\n\n<p>Hamas receives huge sums of money from various sources, including the UN, Qatar, and most significantly, Iran. But most of this cash goes towards buying weapons and digging tunnels from which to attack Israel. In response, Egypt and Israel placed the strip under a blockade. Look, there&#8217;s a lot of misinformation out there about the blockade, so let&#8217;s be clear about exactly what a blockade entails. The blockade significantly limits Palestinians&#8217; freedom of movement, yet thousands of Palestinians can still cross into Israel for work or to get medical treatment. Humanitarian supplies and food can still come in, but work permits are significantly limited, electricity is rationed, and anything that goes into or out of the Gaza Strip legally is inspected and controlled by the Israeli government. Both Israel and Egypt defend their blockade as necessary to stop the flow of weapons into Gaza. But Hamas found ways to smuggle weapons in regardless. They built a dense network of tunnels under the border with Egypt. All sorts of contraband passes through there, some of it harmless supplies for people who are suffering terrible poverty and a 50% unemployment rate, but a lot of it is dedicated specifically to fighting Israel, including civilians.</p>\n\n\n\n<p>Hamas once enjoyed a reputation for idealism and lack of corruption, but that didn&#8217;t last. Today, many of Hamas&#8217;s leaders live in luxury in places like Qatar while ordinary Palestinians suffer. But when Palestinians began to speak out about Hamas&#8217;s authoritarian rule and terrible policies, Hamas did all it could to stop them. They silenced journalists who reported on their corruption. They persecuted Gaza&#8217;s tiny Christian minority. There is no freedom of press, no freedom of speech, no freedom of religion in Gaza, not under Hamas.</p>\n\n\n\n<p>Unfortunately, the suffering in Gaza is going to get much worse. Hamas&#8217;s attack of October 7th, 2023, changed everything. For years, Israel thought it could live with Hamas and manage the occasional flare-up of tension. Hamas&#8217;s brutal assault has made it clear that there is no living with a terror group on the border, especially not one who commits the human rights violations that Hamas broadcast to the world with such savage glee. It has always been Israeli policy to take the fight to the enemy, and that means the fight is going to Gaza. By the time you see this, the ground invasion may have already begun. Hopefully, it&#8217;s already over, because though no one can predict the future, we can all assume that the fight is going to be utterly devastating for both sides. For Israelis who will lose loved ones who are fighting to protect their borders, and for Palestinians, who Hamas has been exploiting and using as human shields since 2007.</p>\n\n\n\n<p>This is already happening. The IDF has been flooding Palestinians&#8217; phones with texts and calls directing them to leave areas that are about to be bombed, to the south or to the shore. But Hamas is encouraging those same civilians to stay put, not that they have anywhere to go. Egypt refuses to take in a single Palestinian refugee. So as Israel pummels Gaza in a bid to destroy Hamas once and for all, it isn&#8217;t just Hamas that suffers. It&#8217;s also ordinary Palestinians. Hamas&#8217;s leaders knew exactly what Israel&#8217;s response would be when they stormed the Israeli border, murdering over 1,300 Israelis. They knew ordinary Palestinians would suffer terribly in the war that is to come. But for Hamas, that is a PR victory, and they&#8217;d rather see both sides go down in flames than accept a world in which a Jewish state and a Palestinian state coexist side by side in peace.</p>\n</div></div>\n</div></div></div>\n\n\n\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-hI2Yki\"><div class=\"guten-background-overlay\"></div><div class=\"sticky-wrapper\" data-id=\"hI2Yki\"><div class=\"guten-column-wrapper\">\n<h3 class=\"wp-block-gutenverse-heading guten-element guten-KElhmZ\">Hamas</h3>\n\n\n\n<div class=\"guten-element gutenverse-text-editor guten-STtTwf\"><div class=\"text-content-inner\">\n<p>Hamas, established in 1987, has evolved from a violent offshoot of the Muslim Brotherhood into a powerful political-military entity in the Middle East. Under the leadership of Ismail Haniyeh and Yahya Sinwar, Hamas has become a significant regional actor, particularly in Gaza, where its military, political, and ideological activities have profound implications for regional security, especially concerning its tension with Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Ideology</h3>\n\n\n\n<p>Hamas&#8217;s ideology is rooted in Sunni Islamic fundamentalism, with key objectives including the establishment of an Islamic state in the region and the slaughter of all Jews in the world, as well as the elimination of Israel through armed struggle. These goals are clearly stated in Hamas&#8217;s founding charter and other official statements.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Official Flag</h3>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"2560\" height=\"1600\" src=\"https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_.png\" alt=\"Hamas Terror Organization\" class=\"wp-image-226\" srcset=\"https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_.png 2560w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-300x188.png 300w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-1024x640.png 1024w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-768x480.png 768w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-1536x960.png 1536w, https://iron-swords.co.il/wp-content/uploads/2024/03/Flag_of_Hamas.svg_-2048x1280.png 2048w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" /><figcaption class=\"wp-element-caption\">Hamas</figcaption></figure>\n\n\n\n<h3 class=\"wp-block-heading\">Order of Battle</h3>\n\n\n\n<p>Hamas&#8217;s annual budget exceeds 300 million dollars. The organization receives substantial financial, military, and intelligence support from Iran. Additional funding comes from taxes and fees imposed on Gaza&#8217;s residents and businesses, as well as diverted international aid. These financial resources are crucial for sustaining its military capabilities and governance in Gaza.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Budget</h3>\n\n\n\n<p>Hamas&#8217;s annual budget exceeds 300 million dollars, with substantial financial, military, and intelligence support from Iran, as well as funds from taxes, fees, and diverted international aid.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Arsenal</h3>\n\n\n\n<p>Hamas&#8217;s arsenal includes an estimated 20,000 to 30,000 rockets, sophisticated anti-tank weapons, UAVs, and an extensive network of underground tunnels used for smuggling and military operations. This stockpile enables Hamas to sustain prolonged engagements and carry out significant attacks against Israel. The group has also developed its drone capabilities, using them for reconnaissance and offensive operations.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Military Tactics</h3>\n\n\n\n<p>Hamas employs a range of military tactics, from rocket and mortar attacks to complex tunnel operations aimed at infiltrating Israeli territory. The group&#8217;s strategy often involves using civilian infrastructure, such as schools and hospitals, to store weapons and launch attacks, thereby complicating Israeli military responses and maximizing civilian casualties for propaganda purposes. These tactics also include suicide bombings, car rammings, and kidnappings, aiming to instill fear and disrupt Israeli society.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Social and Civil Services</h3>\n\n\n\n<p>Hamas runs a network of social and civil services in Gaza, providing education, healthcare, and welfare support. These services help to build a base of support among the Gazan population, though they are often intertwined with its military and ideological goals. For instance, schools run by Hamas promote its radical ideology, including the indoctrination of children to support jihad and martyrdom. Hospitals and charities operated by Hamas also serve as fronts for its military activities, blurring the lines between civilian and militant operations.</p>\n\n\n\n<h3 class=\"wp-block-heading\">International Relations</h3>\n\n\n\n<p>Hamas maintains complex relationships with various regional and international actors. While receiving significant support from Iran, it also navigates tensions with other Palestinian factions and Arab states. Hamas&#8217;s alignment with the broader axis of resistance, including Hezbollah and Iran, positions it as a key player in regional geopolitics, often at odds with Sunni Arab states and Western interests.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Impact on Gaza</h3>\n\n\n\n<p>Since taking control of Gaza in 2007, Hamas&#8217;s governance has been marked by economic hardship and repression. The organization&#8217;s prioritization of military expenditures over civilian needs has led to deteriorating living conditions for Gazans. Moreover, its authoritarian rule suppresses dissent and political opposition, often through violent means.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Key Events</h3>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>First Intifada (1987-1993):</strong> Hamas emerged during this period, distinguishing itself from the PLO with its religious ideology and commitment to armed struggle.</li>\n\n\n\n<li><strong>Second Intifada (2000-2005):</strong> Hamas escalated its activities, conducting numerous suicide bombings and attacks, significantly impacting Israeli security and politics.</li>\n\n\n\n<li><strong>Gaza Takeover (2007):</strong> Hamas violently seized control of Gaza from Fatah, leading to a split in Palestinian governance and ongoing internal conflict.</li>\n\n\n\n<li><strong>Operation Protective Edge (2014):</strong> A major conflict between Hamas and Israel, characterized by intense rocket fire from Gaza and significant destruction due to Israeli military responses.</li>\n\n\n\n<li><strong>Great March of Return (2018-2019):</strong> Hamas organized mass protests at the Gaza-Israel border, leading to violent clashes and numerous casualties.</li>\n</ol>\n\n\n\n<h3 class=\"wp-block-heading\">Official Flag</h3>\n\n\n\n<p>The Hamas flag features the Shahada (Islamic declaration of faith) in white Arabic script on a green background, symbolizing its Islamic identity and ideological commitment.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Leadership</h3>\n\n\n\n<p>The leadership of Hamas is structured with a political bureau and a military wing. Ismail Haniyeh, the head of the political bureau, and Yahya Sinwar, the leader in Gaza, are pivotal figures. Their leadership has focused on both governance within Gaza and maintaining a state of perpetual conflict with Israel. They have leveraged both political maneuvering and military actions to solidify Hamas&#8217;s power and influence.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Order of Battle</h3>\n\n\n\n<p>Hamas commands approximately 40,000 to 50,000 fighters, including 25,000 active duty troops and various reserve units. The elite al-Qassam Brigades, comprising thousands of operatives, play a crucial role in the group&#8217;s strategic operations. These operations include rocket attacks, tunnel incursions into Israeli territory, and guerrilla warfare tactics designed to maximize impact and casualties.</p>\n</div></div>\n</div></div></div>\n</div></section></div>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On October 7th, 2023, <a  href=\"/hamas\">Hamas</a> launched a brutal attack on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>, resulting in unprecedented violence and a devastating conflict.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 226,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 339,
        "footnotes": ""
    },
    "categories": [
        339
    ],
    "tags": [],
    "class_list": [
        "post-5199",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-hamas"
    ],
    "lang": "en",
    "translations": {
        "en": 5199
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5199",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5199"
            }
        ],
        "version-history": [
            {
                "count": 4,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5199/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6242,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5199/revisions/6242"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/226"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5199"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5199"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5199"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}