{
    "id": 5376,
    "date": "2024-06-16T15:00:00",
    "date_gmt": "2024-06-16T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5376"
    },
    "modified": "2024-06-17T07:58:06",
    "modified_gmt": "2024-06-17T04:58:06",
    "slug": "world-leaders-bash-hamas-for-endangering-civilians-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/world-leaders-bash-hamas-for-endangering-civilians-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "World Leaders Bash Hamas for Endangering Civilians | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"World Leaders Bash Hamas for Endangering Civilians | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/_XqPO8KbrUQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I&#8217;m Eylon Levy. This is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on YouTube, Instagram, and Twitter. Please start submitting questions in the chat.</p>\n\n\n\n<h2 class=\"wp-block-heading\">War Update</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Day 254 of the October 7th War</h3>\n\n\n\n<p>Today is day 254 of the October 7th War, 8 months after October 7th. The Hamas Terror Army continues to fight. Hamas continues to attack Israelis, continues to promise more attacks in the future, and continues to hold 120 hostages in its terror dungeons.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Price Paid by Israeli Soldiers</h3>\n\n\n\n<p>Israeli soldiers, many of them reservists with ordinary lives before this war, are paying a heavy price. On Saturday, eight Israeli soldiers were killed in an explosion while inside their armored combat engineering vehicle. It was the deadliest incident for Israeli soldiers in Gaza in nearly 6 months. Over the weekend, two Israeli reservists were killed in Northern Gaza. A few days before that, four Israeli soldiers were killed in Rafah in a booby-trapped building.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Reality of the Conflict</h3>\n\n\n\n<p>What does all of this tell us? It tells us that the price that the people of Israel are paying to live as a free people in their own land is painfully high. It tells us that the threat from Hamas is all too real. It tells us that Israel has no choice but to continue to fight Hamas until Hamas&#8217;s military and government capabilities are destroyed, until the hostages come home—all the hostages—and until Hamas can never again threaten Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\">International Support</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Global Solidarity with Israel</h3>\n\n\n\n<p>Nearly 9 months after the October 7th Massacre, Israel still has the support of the Free World. Don&#8217;t let anyone tell you that Israel is alone. Just days ago, Italy hosted the leaders of the G7—the club of liberal democracies including the US, UK, Germany, France, Canada, Italy, and Japan. They said unanimously, &#8220;We express our full solidarity and support to Israel and its people and reaffirm our unwavering commitment towards its security.&#8221; The world&#8217;s democracies know something: Israel is fighting a just war to protect its people from the barbaric terrorists threatening to do October 7th again and again until Israel is destroyed and we are all dead.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Condemnation of Hamas by the G7</h3>\n\n\n\n<p>The G7 leaders also did something the UN has never done—they condemned Hamas. They condemned Hamas for its continuing use of civilian infrastructure for its military activities and its failure to separate and distinguish itself from civilians in Gaza. What does that mean? It means the world&#8217;s democracies slammed Hamas for operating out of schools, homes, mosques, and hospitals, putting Palestinian civilians in danger. Hamas is not using them as human shields; it&#8217;s using them as human sacrifices. Hamas and its psychopath leaders want to maximize suffering in Gaza because they want Western democracies to hate Israel and join its war to destroy our country. But the free democracies of this world stand with Israel. We have our disagreements, but countries that share our values know that Hamas is a barbaric terror organization with no regard for human life.</p>\n\n\n\n<h3 class=\"wp-block-heading\">G7&#8217;s Demand for Hostage Release</h3>\n\n\n\n<p>The G7 demanded that Hamas fully and unequivocally accept Israel&#8217;s hostage release proposal. In other words, Hamas needs to stop haggling and say yes to the deal on the table. We want all of our people out of the Hamas terror dungeons. There will be no one left behind.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Aid and Humanitarian Efforts</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Increased Aid to Gaza</h3>\n\n\n\n<p>As fighting continues in the Hamas stronghold of Rafah, Israel has announced additional measures to increase the amount of aid yet again that can reach Rafah and everywhere else in Gaza. The IDF announced it would pause military activity along the road from the Kerem Shalom Crossing to the main north-south road in Gaza every day from 8:00 a.m. to 7:00 p.m. until further notice. Israel&#8217;s crossings with Gaza are open, including the new ones that opened this war. Israel is flooding Gaza with so much aid, the UN is drowning under it. Israel has flooded Gaza with so much aid that there is a backlog of 1,000 trucks&#8217; worth of aid sitting inside Gaza that the United Nations has not picked up. There&#8217;s no room to offload anymore. The UN needs to stop lying about Israel&#8217;s efforts and instead get to work scaling up its operations so that it can deliver the aid that is going in.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Eid al-Adha Greetings</h3>\n\n\n\n<p>Today is the Muslim holiday of Eid al-Adha, and I&#8217;ll take the opportunity to wish an Eid Mubarak to any Muslim followers. I saw a New York Times headline today: &#8220;In Eid al-Adha, Gazans Mark Another Somber Holiday Amid War.&#8221; It&#8217;s not an easy time for Muslims in Gaza, but there&#8217;s something the New York Times didn&#8217;t think to tell you about the hardships that people in Gaza are facing—Hamas is holding five Muslim Israelis hostage in its terror dungeons. How do you think their holiday is going? How&#8217;s it possible to leave that out of the article? I&#8217;ll tell you something else the New York Times left out: according to Khalil Shikaki, the leading Palestinian pollster, a majority of Gazans still think that the October 7th attacks were a good idea. They think the October 7 Massacre was the correct decision by their government, Hamas, and they think it was the correct decision because they think the world will reward it for it, as they saw with the governments of Norway, Ireland, and Spain recognizing a non-existent Palestinian state. They think that barbaric atrocities of October 7th will take their national cause forward.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Pathway to Peace</h2>\n\n\n\n<h3 class=\"wp-block-heading\">The Need for De-radicalization</h3>\n\n\n\n<p>We want a pathway to peace after this awful war, and for that to be possible, de-radicalization must be a part of the vision for a post-war Gaza. It&#8217;s crazy, but the numbers don&#8217;t lie. Most Gazans still think this war was a good idea. For peace, the world must help Palestinians realize that terrorism is a dead end so that their leaders never declare war on Israel again like they did on October 7th.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Northern Front</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Continued Attacks</h3>\n\n\n\n<p>Meanwhile, in the north, Hezbollah in Lebanon continues to attack Israel with rockets, anti-tank missiles, and suicide drones. 60,000 Israelis have been displaced from their homes close to the Lebanese border—homes that are being destroyed. Displaced for eight months now, stuck in hotels around the country. The Israeli government has been clear for months: Hezbollah must back off or Israel will have to push it away. Israel wants to resolve this situation with Lebanon diplomatically and enable the 60,000 displaced Israelis to return to and rebuild their homes. France is working on its own diplomatic proposal that reportedly includes the creation of a small buffer zone inside Lebanon and an increase of Lebanese troops in the border area. Israeli Defense Minister Yoav Galant has condemned the French initiative. He tweeted, &#8220;As we fight a just war defending our people, France has adopted hostile policies against Israel. Israel will not be a party to the trilateral framework proposed by France.&#8221; As Hezbollah continues to escalate its attacks, a diplomatic solution is looking less and less likely, but it&#8217;s necessary if we are going to avoid a full-scale war—a war that Hezbollah declared on Israel on October 8th in solidarity with the rapists of Hamas. It&#8217;s time for the whole world—it&#8217;s long past time for the whole world—to wake up and take immediate steps to reign in Hezbollah, Iran&#8217;s proxy army in Lebanon. There is no room for half measures.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A Session</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Legitimizing UNRWA</h3>\n\n\n\n<p>Leora on the Instagram live feed writes: &#8220;Many people are still legitimizing UNRWA as a place to donate. How do we educate people about why this is a problem?&#8221; Leora, thanks for your question. UNRWA is a Hamas front. It is an integral part of Hamas&#8217;s war machine that turns a blind eye as Hamas steals aid away from civilians in need, that allows Hamas to operate military facilities inside its schools, and that employs thousands of Hamas terrorists, including some who took part in the October 7 Massacre. It isn&#8217;t part of the solution; it&#8217;s part of the problem. And it&#8217;s part of the problem not only because Hamas uses it to launder propaganda for the international community and cover up its war crimes, but because UNRWA exists in order to perpetuate this conflict.</p>\n\n\n\n<p>At the end of the Second World War, there were refugee crises all around the world, and all but one of them was solved because the refugees were resettled and given new homes. The Palestinians are the only case of a group that got their own refugee agency whose job is to give them refugee status in perpetuity, one generation after the next. And as a result, 75% of people in Gaza—they were born in Gaza, their parents were born in Gaza, their grandparents were born in Gaza—are told Gaza is not your home, you have a right to live in Israel, and until you use violence to go and live in Israel, we will continue to give you welfare at the expense of international taxpayers. And that means that those countries that are supporting UNRWA are perpetuating this conflict. They are dragging this conflict on for longer than it needs because instead of telling Palestinians that the war of 1948 is over, you need to live next to Israel, they are encouraging them to continue the cause of violent struggle until Israel is destroyed.</p>\n\n\n\n<p>And it&#8217;s important for us to be clear that there is no room for UNRWA in Gaza after this war. When this war is over, in order for there to be peace between us and our neighbors, we need de-radicalization. We can&#8217;t have children growing up in schools being taught that violent struggle against Israel is something to be glorified until Israel is destroyed. And that&#8217;s the point of UNRWA, and that&#8217;s what they&#8217;re teaching them in their schools. We need a system that will teach them to embrace peace, that will not allow terrorists to hijack aid and definitely not hire terrorists and put them on their payroll. For the sake of peace, UNRWA must go. I hope that was clear. Next question, please.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Leadership in Gaza After the War</h3>\n\n\n\n<p>A related question from Arel, who wrote just now on Instagram live: &#8220;What type of leadership can be envisioned in Gaza after the war? Who in the PA would be able to bring a healthy leadership with a potential international coalition?&#8221; That&#8217;s a good question, Arel. The question of who will govern Gaza the day after is not a simple one. Israel has been clear it won&#8217;t be us—no one wants Israel to govern Gaza. It definitely won&#8217;t be Hamas after the way they militarized the whole Gaza Strip to build a war machine against us. But it can&#8217;t be the Palestinian Authority either. The Palestinian Authority isn&#8217;t able to impose security in Jenin, in areas under its own control. It is completely ill-equipped to impose order in Gaza, definitely when the Palestinian Authority agrees that most people in Gaza are refugees who should not be given health and education services from the PA and should instead be reliant on international taxpayers.</p>\n\n\n\n<p>Instead, I think Israel would like to see local leaders from inside Gaza take responsibility for their communities, make sure that aid reaches the people who need it, and commit to rebuilding Gaza in a sensible way. Now, I don&#8217;t know who that&#8217;s going to be, but I&#8217;ll tell you this: if the world wants us to have peace—if we really, really, really want peace and for this cycle of war to stop—we need a generation of Palestinian leaders who will be brave enough to turn to their people and to the protests around the world and say, &#8220;No, no, no, no, no. Stop saying &#8216;globalize the intifada,&#8217; stop saying &#8216;from the river to the sea,&#8217; because that means destroying Israel, and we don&#8217;t want to destroy Israel, we want to live next to Israel in peace and prosperity.&#8221; And until we have Palestinian leaders who are able to do that, we&#8217;re going to be condemned to a cycle of violence.</p>\n\n\n\n<p>That is why the decision by the governments of Norway, Ireland, and Spain to recognize a Palestinian state that doesn&#8217;t exist as a reward for October 7th is so dangerous, because it tells the Palestinians that if they commit more atrocities and more terrorism, the world will reward them instead of punishing them. So we need you, watching around the world, to put pressure on your governments to take steps that will embolden Palestinian leaders who accept Israel&#8217;s right to exist and want to coexist with it, and stop giving perverse incentives to terrorists who want to burn, rape, and abduct Israelis, because that is exactly what the governments of Norway, Spain, and Ireland are doing. It can&#8217;t go on, and no one should tolerate it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Position in the UN</h3>\n\n\n\n<p>This question is from Avraham on Twitter. He writes: &#8220;Ambassador Erdan said Israel is considering leaving the UN. Lately, the UN has become the diplomatic branch of Hamas, given their funding of UNRWA, political support for Hamas ceasefire positions. What are the pros and cons of Israel staying at the UN? Does Israel have a red line?&#8221; I&#8217;m not aware of any plans to leave the United Nations. It is a deeply flawed, some would say institutionally anti-Semitic, organization—one in which the world&#8217;s dictatorships and tyrannies find one thing they agree on, and that&#8217;s ganging up on the Jewish state. And they do it very well. They&#8217;ve managed to hoodwink the world&#8217;s democracies into thinking that just because you have &#8220;UN&#8221; on your business card, that gives you moral authority, even as they cover up for Hamas. But like it or not, as long as it exists, the United Nations is the international forum in which all nations are a part. Israel doesn&#8217;t want to be a pariah state. Israel wants to embrace its rightful place among the family of nations, and that is the stage where you fight, and that is the stage where you fight back against the propaganda, where you build alliances. And we have friends. Our role is not to fall into some slump and thinking we are alone. Just look at that powerful statement from the leaders of the G7 reaffirming Israel&#8217;s right to defend itself against Hamas. Israel needs to work together with partners around the world, and we have them. Our allies exist to help them understand why Israel is fighting, help them stand with us for human rights, for freedom, against terrorism, instead of trying to think that we can wage war on the whole world, even though the United Nations, again, is a deeply, deeply flawed organization in need of some deep-seated reform.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Addressing Anti-Semitism in the Diaspora</h3>\n\n\n\n<p>Our last question today just came through from Carri on our Instagram live: &#8220;How do we collectively address the growing anti-Semitism happening in the diaspora? None of our governments are protecting us.&#8221; First of all, you need to raise awareness with your governments because people are not aware of what is happening. People do not know how scary and dangerous it is to be Jews, how much security there is around communal organizations, how much people feel afraid to enter city centers when there are these massive protests. You have to bring it to their attention. And I think people are beginning to understand. We&#8217;re seeing some people, even on the left, beginning to understand the deep, deep sickness of anti-Semitism. Most people in most countries around the world, at least in the West, are fundamentally decent, law-abiding people who want to stand up to hate and intolerance, and you need to help them understand why &#8220;globalize the intifada&#8221; means kill Jews and Israelis wherever you find them. You need to help them connect the dots because it doesn&#8217;t make sense intuitively in their own heads. You need to help them connect the dots, and you need to stand up for your places in Western society as well. I&#8217;m not one of the people who will say, &#8220;Everyone should make Aliyah, pack up your bags, and come and live in Israel.&#8221; No. Israel needs and wants strong Jewish communities around the world because you are responsible for keeping Western countries sane and loyal to their own fundamental values when there are many extremists who want to drive them off a cliff. Do not let them do that. Help mainstream society wake up, connect the dots, and stand up to hatred and intolerance.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>Okay, that&#8217;s all we have time for today. We will be back tomorrow here at the Israeli Citizen Spokesperson&#8217;s Office. As always, I don&#8217;t know what platform you&#8217;re watching us on, please follow us on all the other ones—YouTube, Instagram, Twitter, TikTok, LinkedIn, Facebook, all of them. And we&#8217;ll be back tomorrow at 3:00 p.m. Israel time, 8:00 a.m. Eastern with a live briefing and Q&amp;A. Thank you for joining us. Thanks for following. Keep safe. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>In a daily briefing, Elon Leevy of the Israeli Citizen Spokesperson&#8217;s Office discussed the ongoing October 7th War, international support for <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>, increased aid to <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, and the need for de-radicalization. He addressed questions on <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a>, Gaza&#8217;s future leadership, Israel&#8217;s position at <a  href=\"https://iron-swords.co.il/t/the-un/\">the UN</a>, and rising anti-Semitism in the diaspora.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5378,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-5376",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 5376
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5376",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5376"
            }
        ],
        "version-history": [
            {
                "count": 4,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5376/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5381,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5376/revisions/5381"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5378"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5376"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5376"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5376"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}