{
    "id": 18985,
    "date": "2024-12-04T07:16:51",
    "date_gmt": "2024-12-04T05:16:51",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18985"
    },
    "modified": "2024-12-04T07:17:01",
    "modified_gmt": "2024-12-04T05:17:01",
    "slug": "canada-officially-designates-yemens-houthis-as-a-terrorist-entity",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/canada-officially-designates-yemens-houthis-as-a-terrorist-entity/",
    "title": {
        "rendered": "Canada officially designates Yemen&#8217;s Houthis as a terrorist entity"
    },
    "content": {
        "rendered": "\n<p>Canada has officially designated Yemen’s Houthi movement, also known as Ansar Allah, as a terrorist entity. This decision comes after a year of escalating aggression by the Iran-backed group, not only within Yemen but on a global stage, with Israel enduring relentless attacks that showcased the Houthis&#8217; expanding reach and violent ambitions.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Houthis&#8217; Year of Global Terror</strong></h3>\n\n\n\n<p>Over the past year, the Houthis have demonstrated their willingness to target nations beyond Yemen, making their presence felt on the international stage through acts of violence and terror. Central to their campaign was a series of attacks on Israel, starting in October 2023, when the group began launching ballistic missiles, cruise missiles, and drones toward civilian and strategic targets in Israel.</p>\n\n\n\n<p>These attacks culminated in significant moments of terror, such as the July 2024 drone strike on Tel Aviv, which killed one civilian and injured eight others. Hypersonic missiles were also introduced into their arsenal, as evidenced by a December 2024 strike targeting central Israel. These actions not only placed millions of Israeli civilians under constant threat but also created ripples of insecurity throughout the global community.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Global Disruption and Israeli Resilience</strong></h3>\n\n\n\n<p>The Houthis&#8217; campaign against Israel was not an isolated act of aggression. Their activities disrupted vital international trade routes in the Red Sea, targeted global energy infrastructure, and increased tensions across the Middle East. Their actions drew condemnation from the international community, as nations grappled with the implications of a non-state actor wielding advanced weaponry to destabilize regions far beyond its borders.</p>\n\n\n\n<p>Israel’s response to this year of sustained aggression showcased its resilience. Despite the unprecedented challenges, Israel launched precision airstrikes against Houthi-controlled areas in Yemen, targeting key military and logistical hubs in July and September 2024. These operations aimed to neutralize the Houthis’ ability to project power and ensure the safety of Israeli citizens.</p>\n\n\n\n<p>Canada’s decision to designate the Houthis as a terrorist organization reflects a growing consensus among nations that the group’s actions constitute a direct threat to international peace and security. By officially labeling the Houthis a terrorist entity, Canada joins efforts to curtail the group’s funding, restrict its international operations, and hold it accountable for its crimes.</p>\n\n\n\n<p>This move also highlights the Houthis’ role as a proxy for Iran, whose support has enabled the group to develop and deploy advanced weaponry. Canada’s designation sends a clear message to Tehran: its sponsorship of regional proxies will not go unchecked.</p>\n\n\n\n<p>The Houthis’ year of aggression underscores the need for coordinated international action. From missile strikes on Israel to disrupting maritime trade, the Houthis have proven that their ambitions and reach extend far beyond Yemen. The international community must act decisively to curb the group’s activities and prevent further destabilization.</p>\n\n\n\n<p>Canada’s designation of the Houthis as a terrorist organization is a critical step toward addressing this threat. By taking a firm stand, Canada reaffirms its commitment to combating terrorism and supporting global stability.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/canada/\">Canada</a> designates Yemen&#8217;s <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>-backed Houthis as terrorists after a year of global attacks, including relentless missile strikes on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18986,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        1722
    ],
    "class_list": [
        "post-18985",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-canada"
    ],
    "lang": "en",
    "translations": {
        "en": 18985
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18985",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18985"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18985/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18987,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18985/revisions/18987"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18986"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18985"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18985"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18985"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}