{
    "id": 19045,
    "date": "2024-12-18T21:52:25",
    "date_gmt": "2024-12-18T19:52:25",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=19045"
    },
    "modified": "2024-12-18T21:52:31",
    "modified_gmt": "2024-12-18T19:52:31",
    "slug": "jerusalem-always-was-always-is-always-will-be-palestinian",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/jerusalem-always-was-always-is-always-will-be-palestinian/",
    "title": {
        "rendered": "Jerusalem Always Was, Always Is, Always Will Be Palestinian"
    },
    "content": {
        "rendered": "\n<p>The slogan “Jerusalem always was, always is, and always will be Palestinian” has been deliberately crafted to erase the undeniable Jewish connection to Jerusalem while fueling anti-Israel sentiment and inciting violence. Far from being a statement of historical fact, this rhetoric is a tool often used by terrorist sympathizers, including Hamas and the Palestinian Authority, to delegitimize Israel’s sovereignty and distort centuries of Jewish history tied to the city.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Jerusalem</strong></h3>\n\n\n\n<p>The bond between the Jewish people and Jerusalem is unmatched in its depth, longevity, and significance. For more than 3,000 years, Jerusalem has been the beating heart of Jewish identity, faith, and culture—a city that symbolizes both spiritual fulfillment and the resilience of a nation. Through conquests, exiles, and persecution, the Jewish people’s connection to Jerusalem has remained unbroken. This historical truth stands in stark contrast to modern slogans like <em>“Jerusalem always was, always is, and always will be Palestinian,”</em> a false and dangerous narrative aimed at erasing millennia of Jewish history. To fully appreciate why such claims are not only inaccurate but offensive, it is essential to understand the deep-rooted history of the Jewish people in Jerusalem—historically, spiritually, and culturally.</p>\n\n\n\n<p>Jerusalem first entered Jewish history over 3,000 years ago, when King David established it as the capital of the unified Kingdom of Israel around 1000 BCE. David’s choice of Jerusalem was no accident. The city was strategically located, but more importantly, it was spiritually destined to serve as the center of the Jewish nation. It was here that the Ark of the Covenant was brought, signifying Jerusalem as the earthly seat of God’s presence. King David’s son, King Solomon, further cemented Jerusalem’s significance when he built the First Temple on <em>Har HaBayit</em> (the Temple Mount) around 957 BCE. The Temple became the center of Jewish worship, where sacrifices were offered, prayers were recited, and pilgrims traveled from near and far to seek spiritual closeness to God. The Temple Mount was, and remains, the holiest site in Judaism. Despite the destruction of the First Temple by the Babylonians in 586 BCE and the resulting exile, the Jewish connection to Jerusalem endured. The return of the exiled Jews to the city and the rebuilding of the Second Temple in 516 BCE reinforced the eternal bond between Jerusalem and the Jewish people. It was during this time that Jerusalem became a symbol of hope, resilience, and redemption. Even as the Jewish people faced future exiles, Jerusalem remained central to their faith and identity, immortalized in daily prayers and rituals.</p>\n\n\n\n<p>For over two millennia, Jews have prayed three times a day facing Jerusalem, regardless of where they were in the world. The words <em>“Next year in Jerusalem”</em>—recited at the end of every Passover Seder and Yom Kippur fast—are a timeless testament to the Jewish longing for return. Jerusalem is mentioned over 600 times in the Hebrew Bible, more than any other city. In contrast, the Quran does not mention Jerusalem even once, and its religious importance in Islamic tradition developed centuries later. While Islam reveres the city, particularly the Al-Aqsa Mosque, this came long after Jerusalem had been firmly established as the Jewish spiritual capital. The Second Temple, completed in 516 BCE, stood for nearly six centuries as the center of Jewish life. However, in 70 CE, Roman forces destroyed the Temple during the Jewish Revolt, marking one of the darkest moments in Jewish history. The Jewish people were exiled, yet their connection to Jerusalem endured. Even in diaspora, the city remained central to Jewish identity. Jews mourned the destruction of the Temple every year on <em>Tisha B’Av</em>, a solemn day of fasting and reflection. Synagogues around the world were built with their arks facing Jerusalem, and the Western Wall—the surviving remnant of the Temple Mount retaining wall—became a focal point of Jewish prayer and pilgrimage. Under Roman rule, Jerusalem was renamed <em>Aelia Capitolina</em>, and Jews were forbidden from entering the city. Later, during Byzantine and Islamic periods, control over Jerusalem shifted, yet the Jewish longing to return never wavered. Communities of Jews maintained a continuous presence in the city throughout the centuries, despite persecution, restrictions, and expulsions.</p>\n\n\n\n<p>Islam emerged in the 7th century CE, over 1,600 years after King David declared Jerusalem the Jewish capital. During this time, the Al-Aqsa Mosque and Dome of the Rock were constructed on the Temple Mount, a site already sacred to the Jewish people. While Muslims view the site with reverence, the fact remains that their structures were built atop the ruins of the Jewish Temples—an undeniable archaeological and historical truth. However, modern extremists and terror organizations like Hamas deny this reality, claiming the site as <em>exclusively</em> Muslim. Such denial erases centuries of Jewish history and has been weaponized to incite violence against Jews, particularly through false claims that Israel seeks to “destroy Al-Aqsa.”</p>\n\n\n\n<p>Throughout history, Jerusalem fell under the control of numerous empires—the Romans, Byzantines, Ottomans, and British, among others. Under Ottoman rule (1517–1917), Jews began to return in greater numbers, despite facing significant discrimination. By the mid-19th century, Jews were once again the majority population in Jerusalem—a fact documented by historical census records. When Jordan occupied eastern Jerusalem from 1948 to 1967, Jews were barred from accessing the Western Wall and their holy sites. Synagogues were desecrated, cemeteries were destroyed, and Jewish heritage was systematically erased. This was the tragic reality of Jerusalem under non-Jewish control.</p>\n\n\n\n<p>In 1967, during the Six-Day War, Israel liberated Jerusalem and restored Jewish access to its holiest sites. Unlike previous occupiers, Israel ensured freedom of worship for people of all faiths—Jews, Christians, and Muslims. The Islamic Waqf continues to administer the Temple Mount, a testament to Israel’s commitment to religious coexistence, despite the site’s centrality to Jewish identity. Today, Jerusalem thrives as the undivided capital of Israel, embodying both its ancient heritage and modern vibrancy. Yet the city remains a target of extremist rhetoric, as groups like Hamas and their sympathizers propagate slogans like <em>“Jerusalem is Palestinian”</em> to incite hatred and delegitimize Jewish history.</p>\n\n\n\n<p>The claim that <em>“Jerusalem always was, always is, and always will be Palestinian”</em> is not only historically false but a dangerous distortion designed to erase Jewish history and justify violence. It is a narrative perpetuated by terror organizations like Hamas, who seek the destruction of Israel under the guise of “liberating” a city that has belonged to the Jewish people for millennia. Jerusalem was, is, and always will be the eternal capital of the Jewish people. No amount of propaganda, denial, or incitement can change that truth.</p>\n\n\n\n<p>The history of Jerusalem is a story of resilience, faith, and an unbreakable bond between the Jewish people and their eternal capital. For over 3,000 years, Jerusalem has stood as a testament to Jewish survival and identity, through triumph and tragedy. Those who attempt to rewrite this history—denying Jewish ties to Jerusalem—do so not in pursuit of peace but to further a hateful agenda. Jerusalem remains a city of truth, history, and unity. It is not a “Palestinian” city, nor has it ever been. It is, and always will be, the heart of the Jewish people—eternal, indivisible, and unshakable.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Temple Mount and the Al-Aqsa Narrative</strong></h3>\n\n\n\n<p>The Temple Mount, known in Hebrew as <em>Har HaBayit</em>, is Judaism’s holiest site and the historical location of the First and Second Jewish Temples. King Solomon built the First Temple in the 10th century BCE, marking the site as the heart of Jewish worship. After its destruction by the Babylonians in 586 BCE, the Second Temple was rebuilt in 516 BCE and stood for nearly 600 years until it was destroyed by the Romans in 70 CE. This history is supported not only by Jewish texts and traditions but also by extensive archaeological evidence and historical accounts from contemporaneous sources, including Roman historians like Tacitus and Josephus.</p>\n\n\n\n<p>Despite these well-documented facts, extremist leaders and groups today deny the very existence of the Jewish Temples on the Temple Mount. This deliberate erasure of Jewish history serves a political agenda: to claim exclusive Muslim ownership of the site and delegitimize the Jewish people’s historical and spiritual connection to Jerusalem. The Al-Aqsa Mosque and the Dome of the Rock, iconic Islamic structures, were built on the Temple Mount centuries later, in the 7th century CE, after the Islamic conquest of Jerusalem. While these sites hold religious significance for Muslims, their construction does not negate or replace the thousands of years of Jewish history that precede them.</p>\n\n\n\n<p>The false narrative denying the Jewish Temples has been weaponized by extremist groups, such as Hamas and the Palestinian Authority, to incite violence. They propagate dangerous lies, claiming that Israel seeks to “destroy Al-Aqsa” or “Judaize” Jerusalem. These incendiary claims are used as a pretext for riots, terror attacks, and bloodshed. The infamous phrase “Al-Aqsa is in danger,” repeatedly invoked by terror organizations, has led to widespread violence, including attacks on Jewish civilians and the desecration of synagogues.</p>\n\n\n\n<p>This denial is not only historically false but also deeply dangerous. It fuels hatred and perpetuates conflict, undermining the very coexistence that Israel works to uphold. Since Israel reunified Jerusalem in 1967, the city has been governed under Israeli sovereignty, ensuring freedom of worship for all faiths—Jews, Christians, and Muslims alike. The Israeli government, in a remarkable act of restraint, allowed the Islamic Waqf to maintain administrative control over the Temple Mount, despite its profound importance to Judaism. This policy highlights Israel’s commitment to religious freedom and peace, even in the face of provocation and violence.</p>\n\n\n\n<p>This level of religious freedom starkly contrasts with the reality of Jerusalem under Jordanian rule from 1948 to 1967. During that period, Jews were barred from accessing the Western Wall—the holiest site for Jewish prayer—and synagogues in the Old City were systematically destroyed or desecrated. Jewish cemeteries were vandalized, with tombstones used as paving stones for roads and latrines. The Temple Mount itself was off-limits to Jews, despite its central role in Jewish history and faith.</p>\n\n\n\n<p>The modern narrative that denies the Jewish connection to the Temple Mount is not simply a historical distortion—it is a form of ideological warfare designed to delegitimize Jewish sovereignty in Jerusalem. By denying the existence of the Jewish Temples, extremist leaders seek to rewrite history and promote the dangerous claim that Jerusalem is exclusively Muslim. This rhetoric not only erases the millennia-old Jewish connection to the city but also perpetuates violence and incitement, as seen repeatedly in terror campaigns, such as the recent brutal October 7, 2023, massacre by Hamas.</p>\n\n\n\n<p>Ultimately, the Temple Mount is not a contested site because of competing histories—it is contested because extremists refuse to acknowledge historical truth. Israel’s governance of Jerusalem has brought unprecedented access and freedom of worship to people of all faiths, a stark improvement over previous regimes. By perpetuating lies and inciting violence under the guise of “defending Al-Aqsa,” terror groups and their sympathizers exploit the site’s religious sensitivity to advance their hateful agendas and justify bloodshed.</p>\n\n\n\n<p>The Temple Mount stands as a testament to Jewish history, faith, and resilience. Its centrality in Judaism cannot be erased, no matter how many lies are told or how much violence is incited. Acknowledging this truth is essential for any honest discussion about Jerusalem and its future.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Weaponization of “Palestinian Jerusalem”</strong></h3>\n\n\n\n<p>The claim that Jerusalem is “Palestinian” is not rooted in history or archaeology but in extremist ideology. Organizations like Hamas and the Palestinian Authority promote this falsehood as part of their broader campaign to delegitimize Israel and incite hatred. Hamas’s charter explicitly calls for the destruction of Israel, and slogans like this serve to justify its acts of terror.</p>\n\n\n\n<p>On October 7, 2023, Hamas carried out one of the most horrific massacres in recent history, slaughtering over 1,200 innocent Israelis—men, women, and children. The terror group claims such barbarity is part of their effort to “liberate Palestine,” including Jerusalem, exposing the violent consequences of such rhetoric.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The Modern Reality of Jerusalem</strong></h3>\n\n\n\n<p>Since reunifying Jerusalem in 1967, Israel has ensured access to the city’s holy sites for people of all faiths—Jews, Christians, and Muslims. This stands in stark contrast to the period of Jordanian control (1948–1967), when Jews were barred from accessing the Western Wall, synagogues were destroyed, and Jewish cemeteries were desecrated. Today, the Temple Mount remains under the administration of the Islamic Waqf, highlighting Israel’s respect for religious coexistence despite the site’s profound significance to Judaism.</p>\n\n\n\n<p>The slogan “Jerusalem always was, always is, and always will be Palestinian” ignores this reality and seeks to turn the city into a battleground for political and ideological warfare.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Rejecting the Erasure of Jewish History</strong></h3>\n\n\n\n<p>Jerusalem’s Jewish identity is not a matter of opinion but of historical record. Attempts to rewrite this truth are part of a broader campaign to erase Jewish ties to the land of Israel and to delegitimize the Jewish state. By perpetuating slogans like this, sympathizers of terror groups align themselves with an ideology that denies history, promotes hatred, and justifies violence.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>For Palestinians, <a  href=\"https://iron-swords.co.il/t/jerusalem/\">Jerusalem</a> symbolizes identity, heritage, and resistance, representing their enduring connection to the land and their historic struggle</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 19046,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        54
    ],
    "class_list": [
        "post-19045",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-education"
    ],
    "lang": "en",
    "translations": {
        "en": 19045
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19045",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=19045"
            }
        ],
        "version-history": [
            {
                "count": 4,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19045/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 19050,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19045/revisions/19050"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/19046"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=19045"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=19045"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=19045"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}