{
    "id": 19084,
    "date": "2024-12-23T20:31:24",
    "date_gmt": "2024-12-23T18:31:24",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=19084"
    },
    "modified": "2024-12-23T20:31:31",
    "modified_gmt": "2024-12-23T18:31:31",
    "slug": "the-rise-and-fall-of-jackson-hinkle",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/the-rise-and-fall-of-jackson-hinkle/",
    "title": {
        "rendered": "The Rise and Fall of Jackson Hinkle"
    },
    "content": {
        "rendered": "\n<p>Jackson Hinkle is not just a failed politician or a social media grifter—he is an open supporter of terrorism and a vile propagandist for the killing of Jews. His descent into irrelevance is the only fitting end for a man who has devoted his platform to promoting hate, spreading disinformation, and aligning himself with some of the world’s most reprehensible regimes and organizations.</p>\n\n\n\n<h3 class=\"wp-block-heading\">A Career Built on Lies and Opportunism</h3>\n\n\n\n<p>Hinkle began his public life posing as a bleeding-heart liberal, attaching himself to causes like environmentalism and the antinuclear movement. He knelt with Black Lives Matter protesters and loudly campaigned for progressive causes, including defunding the police. But his facade cracked during his ill-fated run for San Clemente City Council, where his campaign was terminated for violating the Political Reform Act by failing to disclose his sources of income. Hinkle wasn’t a reformer—he was just another opportunist.</p>\n\n\n\n<p>Unable to win in politics, Hinkle reinvented himself multiple times. First, he paraded as a “democratic socialist,” staging stunts like protesting in Nancy Pelosi’s office for the Green New Deal. When that failed to gain traction, he pivoted again, this time branding himself as a “MAGA communist,” a nonsensical ideology that claims communism is inherently conservative.</p>\n\n\n\n<h3 class=\"wp-block-heading\">A Propagandist for Russia</h3>\n\n\n\n<p>Jackson Hinkle’s transformation into a shameless propagandist for Russia is a glaring example of his opportunism and moral bankruptcy. Embracing Kremlin talking points, Hinkle has used his platform to spread pro-Putin propaganda, often parroting absurd claims to justify Russia’s aggression in Ukraine. During the early days of the Russia-Ukraine war, Hinkle proudly declared, “Putin has God on his side in his quest to defeat NATO Satanists,” aligning himself not just with Russia’s military aggression but with its broader campaign of disinformation. Hinkle’s rhetoric demonized NATO, painted Ukraine as a villain, and celebrated the actions of a regime responsible for countless war crimes, including the targeting of civilians.</p>\n\n\n\n<div class=\"section-wrapper\" data-id=\"KPubFE\"><section class=\"wp-block-gutenverse-section guten-element guten-section guten-KPubFE layout-boxed align-stretch\"><div class=\"guten-container guten-column-gap-default\">\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-ogu6XH\"><div class=\"guten-column-wrapper\" data-id=\"ogu6XH\">\n<p>Hinkle’s obsession with Russia went beyond mere rhetoric. He actively sought to normalize Putin’s authoritarian regime, portraying it as a bastion of morality and strength against what he called “Western decadence.” He frequently praised Russia’s ties with other authoritarian leaders, including Israeli Prime Minister Benjamin Netanyahu, highlighting a bizarre intersection of his anti-Israel and pro-Russia stances. For Hinkle, Russia became not just an ally but an idealized power, representing his warped worldview where dictatorships are virtuous, and democracies are evil.</p>\n\n\n\n<p>Hinkle’s personal connection to Russia also raised eyebrows. His brief engagement to Anna Linnikova, a former Miss Russia, became tabloid fodder when it ended in scandal. Linnikova accused Hinkle of being manipulative, abusive, and narcissistic, revealing a darker side to the man who once tried to use his relationship to bolster his pro-Russia image. Linnikova’s claims, combined with rumors that the two met under questionable circumstances, further tarnished Hinkle’s credibility. What initially seemed like a strategic alignment with Russia became a humiliating personal debacle, underscoring his inability to maintain even the facade of decency.</p>\n\n\n\n<p>Hinkle’s love affair with Russia was not without financial incentives. Allegations have circulated that he received payments from Russian sources to amplify Kremlin narratives, a claim that fits with his pattern of exploiting global conflicts for personal profit. His pro-Russia propaganda mirrors his support for Hamas, illustrating a man willing to side with oppressors and killers to sustain his relevance. In aligning himself with Moscow, Hinkle has cemented his reputation as a traitor to democratic values and a cheerleader for tyranny—a propagandist who puts profits and personal ambition over truth and morality.</p>\n</div></div>\n\n\n\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-nnyAXz\"><div class=\"guten-column-wrapper\" data-id=\"nnyAXz\">\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"1024\" src=\"https://iron-swords.co.il/wp-content/uploads/2024/12/image-1024x1024.png\" alt=\"\" class=\"wp-image-19086\" srcset=\"https://iron-swords.co.il/wp-content/uploads/2024/12/image-1024x1024.png 1024w, https://iron-swords.co.il/wp-content/uploads/2024/12/image-300x300.png 300w, https://iron-swords.co.il/wp-content/uploads/2024/12/image-150x150.png 150w, https://iron-swords.co.il/wp-content/uploads/2024/12/image-768x768.png 768w, https://iron-swords.co.il/wp-content/uploads/2024/12/image-1536x1536.png 1536w, https://iron-swords.co.il/wp-content/uploads/2024/12/image-75x75.png 75w, https://iron-swords.co.il/wp-content/uploads/2024/12/image-350x350.png 350w, https://iron-swords.co.il/wp-content/uploads/2024/12/image-750x750.png 750w, https://iron-swords.co.il/wp-content/uploads/2024/12/image-1140x1140.png 1140w, https://iron-swords.co.il/wp-content/uploads/2024/12/image.png 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></figure>\n</div></div>\n</div></section></div>\n\n\n\n<h3 class=\"wp-block-heading\">A Propagandist for Russia</h3>\n\n\n\n<p>Jackson Hinkle’s unwavering support for Hamas reveals the true depths of his moral depravity and willingness to align with evil for attention and profit. Since the horrific Hamas-led massacre on October 7, 2023, which resulted in the murder of over 1,400 Israelis and the kidnapping of more than 200 innocent civilians, Hinkle has shamelessly celebrated the violence. His social media is filled with vile posts mocking Jewish hostages and glorifying Hamas’s barbaric acts, openly endorsing their genocidal calls for the destruction of Israel and the extermination of Jews worldwide. This isn’t just provocative rhetoric—it’s the endorsement of terrorism and mass murder.</p>\n\n\n\n<div class=\"section-wrapper\" data-id=\"rV6L5v\"><section class=\"wp-block-gutenverse-section guten-element guten-section guten-rV6L5v layout-boxed align-stretch\"><div class=\"guten-container guten-column-gap-default\">\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-nnyAXz\"><div class=\"guten-column-wrapper\" data-id=\"nnyAXz\">\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"483\" height=\"439\" src=\"https://iron-swords.co.il/wp-content/uploads/2024/12/jackson-hinkle-hamas.jpeg\" alt=\"\" class=\"wp-image-19088\" srcset=\"https://iron-swords.co.il/wp-content/uploads/2024/12/jackson-hinkle-hamas.jpeg 483w, https://iron-swords.co.il/wp-content/uploads/2024/12/jackson-hinkle-hamas-300x273.jpeg 300w\" sizes=\"auto, (max-width: 483px) 100vw, 483px\" /></figure>\n</div></div>\n\n\n\n<div class=\"wp-block-gutenverse-column guten-element guten-column guten-ogu6XH\"><div class=\"guten-column-wrapper\" data-id=\"ogu6XH\">\n<p>Hinkle’s propaganda for Hamas appears to be financially motivated, with credible reports suggesting he received up to $30,000 a month from Qatar to spread pro-Hamas lies. By promoting their ideology, Hinkle has become a mouthpiece for one of the most dangerous terrorist organizations in the world. Hamas is responsible for decades of violence, targeting civilians through suicide bombings, rocket attacks, and kidnappings. Hinkle’s willingness to defend and glorify such acts of terror exposes him as not just a sympathizer but an active participant in the spread of their hate-filled agenda.</p>\n\n\n\n<p>Hinkle’s behavior following the October 7th massacre has been particularly vile. He has not only cheered on Hamas’s atrocities but has also mocked the victims—innocent men, women, and children brutally murdered or abducted. These actions highlight his utter disregard for human life and reveal him as a man who sees no moral boundaries when it comes to promoting his twisted ideology. His rhetoric emboldens terrorists and normalizes violence, making him a direct threat to peace and stability.</p>\n</div></div>\n</div></section></div>\n\n\n\n<p>By supporting Hamas, Hinkle has shown the world that he stands with terrorists, not with humanity. He has chosen to align himself with an organization that rejects peace and thrives on the murder of innocents. Jackson Hinkle’s disgraceful defense of Hamas places him firmly on the wrong side of history, and his actions should be condemned by anyone who values human life, dignity, and the fight against terror.</p>\n\n\n\n<h3 class=\"wp-block-heading\">A Life in Shambles</h3>\n\n\n\n<p>While Hinkle’s propaganda career made him wealthy for a time, his personal and professional lives have unraveled. His engagement to Anna Linnikova, a former Miss Russia, ended in disgrace after she accused him of abuse, manipulation, and narcissism. Linnikova described Hinkle as physically abusive, recounting a horrifying incident where he attacked her for refusing to show him her phone. She called him an abuser, a liar, and even mocked his physical inadequacies—a fitting end to their relationship.</p>\n\n\n\n<p>Meanwhile, his earnings have plummeted. Once raking in tens of thousands per month, Hinkle now struggles to pull in $700. His LLC, absurdly named “Fake News Media,” is a testament to his true nature—a fraud profiting off lies and misery.</p>\n\n\n\n<h3 class=\"wp-block-heading\">A Terrorist Sympathizer Unmasked</h3>\n\n\n\n<p>Let’s be clear: Jackson Hinkle isn’t just a washed-up grifter. He is a terrorist sympathizer who openly supports the murder of Jews and the destruction of Israel. His mockery of Jewish hostages and endorsement of Hamas’s barbarism reveal a man utterly devoid of humanity. He has chosen to align himself with genocidal terrorists, and no amount of rebranding can hide the blood on his hands.</p>\n\n\n\n<p>Jackson Hinkle’s downfall isn’t just deserved—it’s long overdue. His lies, his hate, and his open support for violence have made him a pariah, and history will remember him not as a political activist, but as a shameless, self-serving propagandist for evil. Good riddance.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Jackson Hinkle is a vile terrorist sympathizer who celebrates Jewish deaths and shamelessly promotes <a  href=\"/hamas\">Hamas</a>’s genocidal agenda.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 19085,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        97
    ],
    "class_list": [
        "post-19084",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-terrorists-in-the-wild"
    ],
    "lang": "en",
    "translations": {
        "en": 19084
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19084",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=19084"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19084/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 19089,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/19084/revisions/19089"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/19085"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=19084"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=19084"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=19084"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}