{
    "id": 8279,
    "date": "2024-07-02T20:05:00",
    "date_gmt": "2024-07-02T17:05:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/10326-en/"
    },
    "modified": "2024-07-02T20:05:00",
    "modified_gmt": "2024-07-02T17:05:00",
    "slug": "10326-en",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/10326-en/",
    "title": {
        "rendered": "&#8220;IDF Chief of Staff: A Long Campaign in Rafiah &#8211; Strategies for Success and Exhaustion of the Enemy&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>*Chief of Staff in Rafiah: This is a long campaign; with determination and perseverance, we are accomplishing our tasks and exhausting the other side.*</p>\n<p>The Chief of Staff, Lieutenant General Herzi Halevi, visited today (Tuesday) the refreshment areas in the Kerem Shalom region, accompanied by the Head of the Technology and Logistics Division, Major General Michel Yanko, the Head of the Logistics Division, Brigadier General Moti Mizrahi, the Chief Technology and Maintenance Officer, Brigadier General Ariel Shima, the Chief Logistics Officer, Brigadier General Chaim Malchi, and other commanders.</p>\n<p>Additionally, the Chief of Staff toured a forward logistics center established within the Gaza Strip and held discussions with the commanders and fighters.</p>\n<p>Attached is a video of the Chief of Staff&#8217;s remarks: https://bit.ly/45QTZwj</p>\n<p>Attached is a video on the topic: https://bit.ly/4briZeI</p>\n<p>Attached are photos on the topic: https://IDFANC.activetrail.biz/ANC354650</p>\n<p>The full remarks of the Chief of Staff are as follows:<br />\n&#8220;We are counting in the Rafiah Brigade; what we have seen with our own eyes, I cannot say from the air above 900 terrorists killed, among them also commanders, at least one battalion commander, many company commanders, and many operatives. The effort now, and the reason we are working here week after week, is the effort to destroy the infrastructure—both above ground and underground—and that takes time. Therefore, this campaign is long because we do not want to leave Rafiah with its infrastructure intact. There are people we have killed underground; there are people who tried to escape, and we killed them. </p>\n<p>This ongoing effort of ours, this pursuit, is very, very important. They should feel exhausted, and we will feel charged and determined. When we move to the next phase, we will adapt the appropriate measures to this stage, bring other methods, bring a different strategy, and provide logistical support in a way that fits this stage. All of these things ultimately converge into our determination, perseverance, and patience, turning it into exhaustion for the other side and realization of our tasks. A lot of will, a lot of patience, and persistence; the results will speak for themselves later. </p>\n<p>Much respect, thank you.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: *Chief of Staff in Rafiah: This is a long campaign; with determination and perseverance, we are accomplishing our tasks and exhausting the other side.* The Chief of Staff, Lieutenant General Herzi Halevi, visited today (Tuesday) the refreshment areas in the Kerem Shalom region, accompanied by the Head of the Technology and Logistics Division, Major General Michel Yanko, the Head of the Logistics Division, Brigadier General Moti Mizrahi, the Chief Technology and Maintenance Officer, Brigadier General Ariel Shima, the Chief Logistics Officer, Brigadier General Chaim Malchi, and other commanders. Additionally, the Chief of Staff toured a forward logistics center</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-8279",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 8279,
        "he": 8280,
        "ru": 8281
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/8279",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=8279"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/8279/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=8279"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=8279"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=8279"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}