{
    "id": 7846,
    "date": "2024-07-14T19:49:27",
    "date_gmt": "2024-07-14T16:49:27",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/10473-en/"
    },
    "modified": "2024-07-14T19:49:27",
    "modified_gmt": "2024-07-14T16:49:27",
    "slug": "10473-en",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/10473-en/",
    "title": {
        "rendered": "&#8220;IDF Chief of Staff: Targeted Strikes Crucial for Dismantling Hamas and Hostage Return&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Chief of Staff&#8217;s statement: The targeted killings are crucial for the systematic dismantling of Hamas and for creating conditions for an agreement for the return of hostages.</p>\n<p>The Chief of Staff on the Shaldag fighters: The citizens of Israel should know that there is a generation of exemplary fighters and commanders whose bravery will be spoken of for a long time.</p>\n<p>Attached is the Chief of Staff&#8217;s statement, Lieutenant General Herzi Halevi: https://bit.ly/3S2HBUg</p>\n<p>Here are the Chief of Staff&#8217;s full remarks:<br />\n&#8220;Good evening, I just came from a meeting with the commanders and fighters of &#8216;Shaldag&#8217;, one of the IDF units that has been fighting for the past nine months in a war that was forced upon us following Hamas&#8217;s murderous attack on October 7. I see the actions of the fighters and commanders of &#8216;Shaldag&#8217; throughout the war and in all theaters, and the citizens of Israel should know that there is a generation of exemplary fighters and commanders whose bravery will be spoken of for a long time.<br />\nWe do not stop; we do not cease to fight. We are operating throughout the Gaza Strip using various combat methods. For about two months, we have been maneuvering in Rafah and achieving significant military accomplishments. We are killing more and more terrorists, destroying Hamas&#8217;s terror infrastructure, and impairing its capabilities. Yesterday, in a joint operation of the IDF and Shin Bet, we attacked a compound in Khan Yunis where Mohammed Deif, the commander of Hamas&#8217;s military wing—who planned and ordered the attack on October 7—was hiding; alongside him, Rafa Salma, the commander of Khan Yunis Brigade, and other terrorists and accomplices. This attack is the result of the operational capability we have built, integrating advanced intelligence capabilities of Shin Bet and military intelligence along with very high-quality planning and execution capabilities of the Air Force. According to the intelligence we had at the time of the attack, there were no hostages in the compound. According to the information that emerged after the attack, no hostages were harmed during the strike. It is very important for me to clarify this.<br />\nIt is still early to summarize the results of the attack, which Hamas is trying to conceal. We are determined to continue pursuing Hamas leaders who planned and executed the massacre of October 7 and dedicated their lives to the murder of innocents. Mohammed Deif was afraid of dying, which is why he hid in such a way that even his ability to command was compromised. He hid and sacrificed his people and the surrounding civilians who were in danger, only a few were harmed. We found him, and we will find those next in line.<br />\nThese targeted killings are one part of the ongoing and evolving military pressure that the IDF exerts throughout the Gaza Strip. Every day there are numerous casualties for Hamas; ground forces are bravely attacking, pilots strike with precision and high quality, rescuing the wounded from the ground while employing varied tactics. All these are wrapped in quality and current intelligence. This is crucial for the systematic dismantling of the terrorist organization Hamas; it is also very important for creating the conditions for an agreement for the return of the hostages. An agreement for the return of the hostages is an urgent moral and ethical mandate to save lives. The IDF is generating all the necessary pressure to create the best conditions for such an agreement, and that is how we have acted since the end of the previous agreement. The IDF will be able to adhere to any agreement approved by the political leadership, and also, after a ceasefire ends, it will return to fight with great force. The IDF will not cease to act for the release of hostages, those for whom time is passing painfully, and we will not relent in our continued assault on Hamas until this goal is achieved, and of course, we will not compromise on securing safety for the citizens of the State of Israel.<br />\nWe are engaged in high-intensity fighting in the north. Alongside growing achievements in damaging Hezbollah, we do not forget for a moment the suffering of residents in the north over the last nine months; we deeply feel the pain of those killed and wounded from Hezbollah attacks. In recent days, I visited one of the communities close to the border, of course not for the first time. I saw the damage, met with the local leadership, and heard very hard things from them—the hardships we translate into determination in combat, which will lead to real solutions and the safe return of residents to their homes. We are ready and preparing for the next stage in Lebanon.<br />\nAlongside the continuation of the fighting, we are currently investigating the events of October 7 and what led to them. This is a necessary process so that we can learn, correct, and mainly ensure the safe return of residents from the south to their homes. Last week, we presented the aftermath of the battle in Kibbutz Be&#8217;eri to the kibbutz community and to bereaved families. There were reasons for which we first presented this investigation—controversial events in this battle that have troubled many. This is a necessary step in rebuilding trust between the IDF and the communities in the southern settlements, and it goes through honest, incisive, and professional investigation as we have conducted.<br />\nThe findings of the investigation are difficult and painful. Alongside them, we found many instances of bravery and spirit from residents, fighters, and many commanders, who physically protected the kibbutz members, risking their lives without limit. I have nothing but immense appreciation for the fighters who battled on October 7. I salute them and the bravery they displayed over many hours of fighting, under very difficult conditions and facing great complexities. Within such complex fighting, mistakes were made, decisions were made, some of which are fatal, from which we learn and will learn. It is not possible to operate in such a reality without making mistakes. I am very proud to be the commander of those fighters and commanders.<br />\nEvery act of bravery they performed belongs to them; in every mistake they made, I have a part.<br />\nThere is no aspect of military conduct that will not be investigated, and we will present it to the public as much as we can – this includes the perceptions of the military.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Chief of Staff&#8217;s statement: The targeted killings are crucial for the systematic dismantling of <a  href=\"/hamas\">Hamas</a> and for creating conditions for an agreement for the return of <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>. The Chief of Staff on the Shaldag fighters: The citizens of <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> should know that there is a generation of exemplary fighters and commanders whose bravery will be spoken of for a long time. Attached is the Chief of Staff&#8217;s statement, Lieutenant General Herzi Halevi: https://bit.ly/3S2HBUg Here are the Chief of Staff&#8217;s full remarks: &#8220;Good evening, I just came from a meeting with the commanders and fighters of &#8216;Shaldag&#8217;, one of</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-7846",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 7846,
        "he": 7847,
        "ru": 7848
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7846",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=7846"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7846/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=7846"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=7846"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=7846"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}