{
    "id": 7723,
    "date": "2024-07-17T20:28:36",
    "date_gmt": "2024-07-17T17:28:36",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/10515-en/"
    },
    "modified": "2024-07-17T20:28:36",
    "modified_gmt": "2024-07-17T17:28:36",
    "slug": "10515-en",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/10515-en/",
    "title": {
        "rendered": "&#8220;Bridging Divides: IDF&#8217;s Commitment to Integrate Ultra-Orthodox Soldiers at Recruitment Festival&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Head of the Manpower Directorate for those designated for military service at the Recruitment Festival: &#8220;In recent months, we have been working under the law to recruit and optimally integrate our ultra-Orthodox brothers into the IDF. Serving in the IDF, for the sake of the security of our beloved state, is a tremendous privilege for the generation of revival, a privilege and not a burden.&#8221;</p>\n<p>The head of the Manpower Directorate, Major General Yaniv Asor, visited the annual Recruitment Festival this evening (Wednesday), held at Ganey Yehoshua Park.</p>\n<p>The festival was organized by the &#8220;Maitav&#8221; unit in the Manpower Directorate in collaboration with the &#8220;More Club&#8221; soldiers&#8217; benefits club of Together for the Soldier, the Soldiers&#8217; Welfare Association, and the FIDF organization.<br />\nThe festival took place to facilitate direct communication and interaction between candidates for military service and the IDF prior to their enlistment and to encourage combat and meaningful recruitment.<br />\nDuring the festival, various IDF branches, led by the Ground Forces, held displays reflecting their activities. The displays were operated by representatives who answered the candidates&#8217; questions regarding enlistment and military service. Among the representatives were also male and female fighters who fought in various fronts and came to talk with the next generation of recruits.</p>\n<p>In addition, throughout the festival, there was a tent from the &#8220;Maitav&#8221; unit where candidates for military service could meet with selection officers and professional representatives in order to receive prompt and front-line responses to their needs.</p>\n<p>From the words of the Head of the Manpower Directorate, Major General Yaniv Asor: &#8220;Military service is a journey in which you will discover incredible powers within yourselves that you never knew existed. Among other things, service will allow you to meet and get to know friends from all segments of Israeli society. We have been working in recent months under the law to recruit and optimally integrate our ultra-Orthodox brothers into the IDF. Serving in the IDF, for the sake of the security of our beloved state, is a tremendous privilege for the generation of revival, a privilege and not a burden. Just as here in the &#8216;Maitav&#8217; tent, you met with recruiters and selection officers who are doing everything possible to match you with an appropriate position for the needs of the IDF, your skills, and your desires, we are working to build pathways and conditions that allow the ultra-Orthodox to serve and integrate into the army. I hope that next year, we will see everyone serving together in all units. In the maneuvering tank in the alleys of Gaza, let there fight together a soldier from Tel Aviv, from a kibbutz in the south, from a village in the Galilee, and also an ultra-Orthodox soldier from Jerusalem. So too in intelligence desks, in the air force and navy, in combat support units and in the General Staff.&#8221;</p>\n<p>Attached is documentation of the statements by the Head of the Manpower Directorate: https://bit.ly/4d5POip</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Head of the Manpower Directorate for those designated for military service at the Recruitment Festival: &#8220;In recent months, we have been working under the law to recruit and optimally integrate our ultra-Orthodox brothers into the IDF. Serving in the IDF, for the sake of the security of our beloved state, is a tremendous privilege for the generation of revival, a privilege and not a burden.&#8221; The head of the Manpower Directorate, Major General Yaniv Asor, visited the annual Recruitment Festival this evening (Wednesday), held at Ganey Yehoshua Park. The festival was organized by the &#8220;Maitav&#8221; unit in the</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-7723",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 7723,
        "he": 7724,
        "ru": 7725
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7723",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=7723"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7723/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=7723"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=7723"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=7723"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}