{
    "id": 7496,
    "date": "2024-07-23T10:10:38",
    "date_gmt": "2024-07-23T07:10:38",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/10594-en/"
    },
    "modified": "2024-07-23T10:10:38",
    "modified_gmt": "2024-07-23T07:10:38",
    "slug": "10594-en",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/10594-en/",
    "title": {
        "rendered": "&#8220;IDF Operations in Khan Yunis: Targeting Hamas and Civilian Infrastructure&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Division 98 has commenced divisional operations in the Khan Yunis area over the past 24 hours; failed launches by Hamas were identified, impacting a school in Nitzarit.</p>\n<p>The combat teams of Brigade 7, Paratroopers, and the Commando Division, under the command of Division 98, launched a divisional attack in the Khan Yunis area in southern Gaza over the past 24 hours. The combat team of Brigade 7 led the divisional attack, eliminating terrorists using tank fire and aerial bombardment. During the attack, Air Force aircraft targeted over 50 terror infrastructure sites, including weapons storage facilities, observation positions, buildings used by Hamas operatives, as well as tunnel routes in the area.</p>\n<p>Last night (Monday), IDF forces detected several launches fired by the terrorist organization Hamas from the Maghazi area in central Gaza. The launches fell within the Gaza Strip and did not cross into Israeli territory. One launch was identified as having struck a school in the Nitzarit area in central Gaza.</p>\n<p>The terrorist organization Hamas consistently violates international law by systematically exploiting civilian structures and the civilian population as human shields for terrorist actions against the State of Israel.</p>\n<p>Forces from Division 162 continue to operate in the Rafah area, and they have eliminated dozens of terrorists through targeted air strikes and close-quarters combat.</p>\n<p>Attached is an infographic of the failed launch that hit the school: https://idfanc.activetrail.biz/ANC230720247456</p>\n<p>Attached is documentation of IDF operations in the Gaza Strip: https://bit.ly/4feiM1k</p>\n<p>Attached is documentation of IDF strikes in the Gaza Strip: https://bit.ly/3zNdRUU</p>\n<p>Attached are photos from IDF operations in the Gaza Strip: https://idfanc.activetrail.biz/ANC23072024938642</p>\n<p>Attached is documentation of the entry checkpoint (Check Point 7) at the entrance to Khan Yunis: https://bit.ly/3ShLtkh</p>\n<p>Attached is documentation of the Battalion Commander of Battalion 75 speaking to his soldiers at the moment of entering Khan Yunis: https://we.tl/t-LDfSK2LQvt</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Division 98 has commenced divisional operations in the Khan Yunis area over the past 24 hours; failed launches by <a  href=\"/hamas\">Hamas</a> were identified, impacting a school in Nitzarit. The combat teams of Brigade 7, Paratroopers, and the Commando Division, under the command of Division 98, launched a divisional attack in the Khan Yunis area in southern <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> over the past 24 hours. The combat team of Brigade 7 led the divisional attack, eliminating terrorists using tank fire and aerial bombardment. During the attack, Air Force aircraft targeted over 50 terror infrastructure sites, including weapons storage facilities, observation positions, buildings</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-7496",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 7496,
        "he": 7497,
        "ru": 7498
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7496",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=7496"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7496/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=7496"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=7496"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=7496"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}