{
    "id": 7258,
    "date": "2024-07-29T11:06:47",
    "date_gmt": "2024-07-29T08:06:47",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/10671-en/"
    },
    "modified": "2024-07-29T11:06:47",
    "modified_gmt": "2024-07-29T08:06:47",
    "slug": "10671-en",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/10671-en/",
    "title": {
        "rendered": "&#8220;IDF&#8217;s Commitment to Security: Major General Blot Outlines Strategies for Judea and Samaria&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>Central Command Chief to the Heads of Authorities in Judea and Samaria and the Jordan Valley Brigade: &#8220;Our goal is to protect the residents of the State of Israel and thwart terrorism.&#8221;</p>\n<p>Central Command Chief, Major General Avi Blot, met yesterday (Sunday) with the heads of authorities and councils in Judea and Samaria and the Jordan Valley Brigade, including the heads of authorities along the seam line.<br />\nDuring the meeting, the main points of the operational assessment were presented, and an open dialogue took place with the heads of the authorities and councils.</p>\n<p>The Major General emphasized that the security of the communities and residents, as well as the relationship between the IDF and local leadership and settlement, is of great importance and at the heart of the efforts within Central Command.</p>\n<p>From the words of Central Command Chief, Major General Avi Blot: &#8220;The connection between the settlements and the brigade commanders is critical and important. We understand that it is essential for the internal circle of the communities to be strong; as a result, we have reinforced with thousands of weapons and means of combat, stationed soldiers in the communities, and enhanced a variety of security elements. Offensive activity is intensifying day by day &#8211; ambush fighters are eliminating dozens of terrorists, significant air strikes, similar to what the forces did last Saturday in Balata in Samaria and last week in Tulkarm in Menashe. Freedom of action is a critical condition for strengthening the sense of security among the residents. Defensive measures and barriers along the seam line are deterrent measures &#8211; the security components and the forces that respond to every call and event are what matter. A year ago, the Panther Battalion was established, dedicated entirely to protecting the seam line, and there is much more work being done in this field. The threats to the seam line communities will be addressed through offensive action to thwart them, not through the deployment of positions for defense.&#8221;</p>\n<p>Attached are images on the subject: https://idfanc.activetrail.biz/ANC1235498</p>\n<p>A video on the subject is attached: https://bit.ly/4dhH7BG</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: Central Command Chief to the Heads of Authorities in Judea and Samaria and the Jordan Valley Brigade: &#8220;Our goal is to protect the residents of the State of <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and thwart terrorism.&#8221; Central Command Chief, Major General Avi Blot, met yesterday (Sunday) with the heads of authorities and councils in Judea and Samaria and the Jordan Valley Brigade, including the heads of authorities along the seam line. During the meeting, the main points of the operational assessment were presented, and an open dialogue took place with the heads of the authorities and councils. The Major General emphasized that</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-7258",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 7258,
        "he": 7259,
        "ru": 7260
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7258",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=7258"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7258/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=7258"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=7258"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=7258"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}