{
    "id": 7165,
    "date": "2024-07-31T16:52:54",
    "date_gmt": "2024-07-31T13:52:54",
    "guid": {
        "rendered": "https://iron-swords.co.il/uncategorized-en/10702-en/"
    },
    "modified": "2024-07-31T16:52:54",
    "modified_gmt": "2024-07-31T13:52:54",
    "slug": "10702-en",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-updates/10702-en/",
    "title": {
        "rendered": "&#8220;IDF Chief of Staff: Strengthened Readiness Against Hezbollah Amid Northern Border Exercises&#8221;"
    },
    "content": {
        "rendered": "<p>IDF Spokesperson:</p>\n<p>The Chief of Staff during an exercise in the north: We have confidence in all our forward moves, our intention regarding Hezbollah is not to go back to October 6.</p>\n<p>The Chief of Staff, Lieutenant General Herzl Halevi, visited today (Wednesday) the brigade exercise of the Kfir Brigade at the northern border, alongside the Northern Command Chief, Major General Ori Gordini, the Central Command Chief, Major General Avi Blot, the Command for Training and Instructing Chief, Major General David Zini, the commander of Division 99, Brigadier General Barak Hiram, the commander of the National Ground Training Center, Brigadier General Kobi Heller, and additional commanders.</p>\n<p>The exercise was conducted in a multi-domain cooperation, during which Kfir Brigade fighters practiced various extreme scenarios, fighting in complex mountainous terrain, fire support, and urban warfare, as part of enhancing readiness for combat in the northern sector.</p>\n<p>Additionally, the Chief of Staff met with the head of the Yirka Council, Salman Moula.</p>\n<p>Attached is a video of the Chief of Staff’s remarks: https://bit.ly/4cbNVjg</p>\n<p>Attached is a relevant video: https://bit.ly/3YlQgFb</p>\n<p>Attached are photos on this subject: https://IDFANC.activetrail.biz/ANC13003107</p>\n<p>The full statements of the Chief of Staff are attached: &#8220;Yesterday afternoon we had the opportunity to kill Mohsen. Mohsen is the highest-ranking military figure in Hezbollah, and he is also a very close person to Nasrallah; he basically organizes all the military matters for him. This man is responsible for all the orders given, for the 12 children who were killed on Saturday afternoon in Majdal Shams, and for the operation we had yesterday in Gush Halav, in the afternoon hours. We have confidence in our planned moves forward because our intention regarding Hezbollah is not to return to October 6. Mohsen will not be around, but we are also not willing to let the situation return to a presence on the border, to 200 meters from Metula, or from Shlomi, or from Rosh Hanikra. The IDF knows how to operate and reach certain windows in neighborhoods in Beirut, it can also attack at specific points underground, and we also know how to conduct strong internal maneuvers. You are training on this this week, and this ability is very important.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/c/idf-spokesperson/\">IDF Spokesperson</a>: The Chief of Staff during an exercise in the north: We have confidence in all our forward moves, our intention regarding <a  href=\"/hezbollah\">Hezbollah</a> is not to go back to October 6. The Chief of Staff, Lieutenant General Herzl Halevi, visited today (Wednesday) the brigade exercise of the Kfir Brigade at the northern border, alongside the Northern Command Chief, Major General Ori Gordini, the Central Command Chief, Major General Avi Blot, the Command for Training and Instructing Chief, Major General David Zini, the commander of Division 99, Brigadier General Barak Hiram, the commander of the National Ground Training Center, Brigadier</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-updates",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        199
    ],
    "tags": [],
    "class_list": [
        "post-7165",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-idf-updates"
    ],
    "lang": "en",
    "translations": {
        "en": 7165,
        "he": 7166,
        "ru": 7167
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7165",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=7165"
            }
        ],
        "version-history": [
            {
                "count": 0,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/7165/revisions"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=7165"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=7165"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=7165"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}