{
    "id": 6885,
    "date": "2024-07-29T15:00:00",
    "date_gmt": "2024-07-29T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6885"
    },
    "modified": "2024-07-30T17:29:02",
    "modified_gmt": "2024-07-30T14:29:02",
    "slug": "after-soccer-massacre-hezbollah-threatens-genocide-daily-briefing-with-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/after-soccer-massacre-hezbollah-threatens-genocide-daily-briefing-with-ruth-wasserman-lande/",
    "title": {
        "rendered": "After Soccer Massacre, Hezbollah Threatens Genocide | Daily Briefing with Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"After Soccer Massacre, Hezbollah Threatens Genocide | Daily Briefing with Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/guALqEPPu6A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hi everyone, I&#8217;m citizen spokeswoman Ruth Wasserman Lande. It is July 29th, 2024. This is the live Daily Briefing of the Israeli citizen spokesperson&#8217;s office. We are live on Instagram, X, YouTube, and LinkedIn, and available afterward wherever you get your podcasts. Please start submitting questions in the chat. Like and subscribe to help us reach a wider audience.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Current Situation Update</h2>\n\n\n\n<p>Today is day 297 of the October 7th War and the Hamas hostage crisis. Two days ago, Hezbollah murdered 12 children with an Iranian rocket. Now, Hezbollah is threatening the Jewish state with genocide. A Hezbollah Member of Lebanon&#8217;s Parliament announced on Hezbollah-run media that if Israel takes large-scale military action, Lebanon will come to an end. Translation: Iran&#8217;s proxy army in Lebanon is saying it has a right to massacre Israeli children with impunity, and if Israel defends its own people, Hezbollah will try to murder us all. Hezbollah has 100,000 Iranian terror rockets aimed at our homes in Israel. Iran&#8217;s proxy army in Lebanon is more powerful than most military forces in NATO, and as Hezbollah has shown repeatedly, they will use those rockets to murder innocent civilians.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hezbollah&#8217;s Aggression</h2>\n\n\n\n<p>Hezbollah is already at war with Israel. It declared war on October 8th in solidarity with Hamas rapist and death squads. Hamas attacked from the south, and the next day Hezbollah attacked from the north. The terror organization has launched 6,500 rocket missiles and drones from Lebanon into Israel. 60,000 people in Israel have been forced to flee their homes, and these are the homes that Hezbollah is bombing all along the border. They have been refugees in their own country for 10 months. In Israel, people have stockpiled food and been told to prepare for possible weeks with no electricity. We&#8217;re tough, and we can manage if that&#8217;s what it takes to be safe. But we in Israel will not accept Hezbollah&#8217;s twisted logic that it&#8217;s allowed to attack Israelis, and Israelis are not allowed to defend themselves.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israel&#8217;s Response</h2>\n\n\n\n<p>Israel does not want an all-out war with Iran&#8217;s proxy army, but Israel needs to send a clear message that nobody gets to murder our people and get away with it. Those calling for de-escalation from Israel rather than from Hezbollah are actually part of the problem. If Israel shows weakness, Hezbollah will respond with more force. Hezbollah thinks it can get away with killing Israelis because the world will tell Israel to turn the other cheek. Friends, that is its insurance policy to keep up its aggression. We reject Hezbollah&#8217;s threat of genocide on behalf of their warlord patrons in the Islamic Republic of Iran, who is actually waging a war against Israel on seven different fronts. Hezbollah must back off, or Israel will have to push it away. Israel will do whatever it needs to in order to protect all of its people. Either Hezbollah will back off and end its war on the Jewish state, or else Israel will use its force to end the war and allow our people to return to their homes.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Media Responsibility</h2>\n\n\n\n<p>Do you know what I found nearly as horrifying as Hezbollah&#8217;s soccer massacre of children? How parts of the international media tried to justify that unprovoked murder of innocents and even to hide it from their audiences. Many headlines simply ignored who fired the rockets. Others didn&#8217;t mention who was being fired at or where Majdal Shams was. Some who did remember to mention Israel focused on occupation, as if Hezbollah murdering Arabic-speaking Druze children or any children for that matter is somehow related to or justified by the Assad regime&#8217;s real estate claims. How absurd! The BBC&#8217;s headline read &#8220;11 Dead in Rocket Attack on Israeli-Occupied Golan.&#8221; A pro-Israel personality edited it on social media in a post to what it should have been: &#8220;12 Murdered by Hezbollah Rocket Attack on Israeli Children Playing Soccer.&#8221; The post went viral and was shared by major media personalities like Sacha Baron Cohen. Maybe some of the BBC&#8217;s audiences noticed that&#8217;s truly awful.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Western Media and Public Awareness</h2>\n\n\n\n<p>It&#8217;s just the cynicism of those who deny moral indignation to innocents like the 12 Druze children, not to mention countless Jewish victims, when it doesn&#8217;t fit the narrative. The real problem is that Western audiences are left completely unaware and in the dark about the danger known to people here in Israel and known to people across the Arab world: that the Islamic Republic of Iran and its proxy armies are a threat to all of us and to the West too. The Islamic Republic of Iran is responsible for the slaughter of thousands across the Arab world, including their own people. When the BBC and others ignore that Iran&#8217;s proxy army in Lebanon, Hezbollah, is destroying that country and trying to destroy Jewish, Muslim, Christian, and Druze people in Israel, they also miss Iran&#8217;s broader threat that the West is next. In fact, the radical Islamic threat is already in Europe, the United States of America, and elsewhere.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Call to Action</h2>\n\n\n\n<p>Stand with Israel and the Arab world before the Islamic Republic of Iran comes for you. Now let&#8217;s take some questions from our audience watching live on social media.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Yena on X</h3>\n\n\n\n<p><strong>Q: How are the people in Lebanon responding to Hezbollah murdering 12 Druze children? What about the Druze community in Lebanon, Syria, and Jordan?</strong></p>\n\n\n\n<p>A: Thank you, Yena, for that question. It&#8217;s a very good one. Israel has a Druze community, many of whom serve in the IDF. Likewise, Lebanon and Syria have large Druze communities, and they are not happy. There are already some demonstrations within Lebanon against Hezbollah, not huge ones yet because of restrictions, but they have begun. This is exactly why Hezbollah first hurried to take responsibility for the actual shooting and the massacre of those children. But as soon as they understood the PR disaster and the backlash from the Druze population within Lebanon, they quickly stepped back and falsely blamed Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Sammy on YouTube Live</h3>\n\n\n\n<p><strong>Q: Some airlines are canceling flights due to fears of war with Lebanon. Is this causing panic? Is it necessary?</strong></p>\n\n\n\n<p>A: Sammy, if a country was bombarding your people, causing massacres of innocent civilians, would your government not respond and do everything to protect you and your family? The Druze community in the north of Israel is demonstrating and demanding severe action on their behalf and on behalf of all Israeli civilians against the perpetrators in Lebanon. This is the Hezbollah terror organization on behalf of the Islamic Republic of Iran. Would you agree to your government sitting back, de-escalating, and not doing anything to protect you and your family? It just doesn&#8217;t make any sense.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Naomi on Instagram</h3>\n\n\n\n<p><strong>Q: How does Israel see an end to all of this? It&#8217;s not realistic to disarm all of Iran&#8217;s proxy armies. We need other countries to help, but who will?</strong></p>\n\n\n\n<p>A: Excellent question, Naomi. The world needs to wake up to the real threat, which is radical Islam, not all Islam, but radicalism in Islam from both the Shiite Iranian-led camp and the Muslim Brotherhood Sunni radical Islam by Erdogan&#8217;s Turkey, Qatar, and other factors. The dream of radical Islam is to establish a worldwide radical Islamic caliphate. The way it will come to an end is through education and understanding of the masses to truly grasp what is at play. It&#8217;s not about Israel, Gaza, or Lebanon; it&#8217;s about radical Islam&#8217;s wish to take over the world.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Talia on Instagram</h3>\n\n\n\n<p><strong>Q: The Washington Post used a picture of the Druze children killed with the headline &#8220;Israel Attacks Lebanon.&#8221; How can we combat this?</strong></p>\n\n\n\n<p>A: Unbelievable and absolutely irresponsible. Druze are part of the Israeli population. Israel did not attack Lebanon on October 6th. There was no war with Lebanon or Gaza Strip then. When on October 7th, Israeli civilians were heinously attacked, Hamas attacked from the south, and a few hours later, Hezbollah attacked from the north. That&#8217;s why 60,000 Israeli civilians are displaced to keep them safe. The headline suggesting Israel&#8217;s prerogative to attack Lebanon is not only angering but a disrespect to the audience reading the news.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Max on LinkedIn</h3>\n\n\n\n<p><strong>Q: What&#8217;s up with Turkey? Has Erdogan lost his mind, or is there a method to his madness?</strong></p>\n\n\n\n<p>A: Brilliant question, Max. Erdogan has not lost his mind; he has been consistent since day one. We often fail to understand the depth of the evil of radical Islam. Erdogan is a radical Islamist, a disciple of the Muslim Brotherhood, an organization outlawed in several countries because it&#8217;s radical and threatening. His actions threaten world stability, and his recent threats to a sovereign country should result in his expulsion from NATO.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Mixed Questions from the Audience</h3>\n\n\n\n<p><strong>Q: For those in the diaspora community and around the world, what can we do to help combat the terrible headlines and false reporting we&#8217;ve seen in the last few days?</strong></p>\n\n\n\n<p>A: Write op-eds, call your representatives, write letters to the media, engage influencers, and educate the public. Many people don&#8217;t realize the full context or facts. Educate them to better understand the situation. We have the power to make a difference.</p>\n\n\n\n<p>Thank you very much, and we&#8217;ll see you tomorrow, same time, live at 3 PM.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/ruth-wasserman-lande/\">Ruth Wasserman Lande</a>&#8216;s July 29th briefing details <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s ongoing aggression against <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>, including the murder of 12 Druze children and rocket attacks. She emphasizes Israel&#8217;s right to defend itself, criticizes biased media coverage, and calls for international awareness and support against radical Islamic threats led by <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> and <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6886,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-6885",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 6885
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6885",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6885"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6885/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6888,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6885/revisions/6888"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6886"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6885"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6885"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6885"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}