{
    "id": 6231,
    "date": "2024-07-12T15:14:24",
    "date_gmt": "2024-07-12T12:14:24",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6231"
    },
    "modified": "2024-07-12T15:14:28",
    "modified_gmt": "2024-07-12T12:14:28",
    "slug": "four-against-an-army-of-terrorists",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/victims/story/four-against-an-army-of-terrorists/",
    "title": {
        "rendered": "Four Against an army of Terrorists"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"ארבעה נגד עשרות מחבלים: התיעוד המדהים של הכוח הקטן שנכנס לכפר עזה\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/7ndUyQF0dSM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>The bottom line of this battle sounds almost imaginary. Four Israelis found themselves in the heart of Kfar Gaza, surrounded by terrorists.</p>\n\n\n\n<p> There&#8217;s one car with a dead person and a terrorist pickup truck. <br>After hours of fighting, they came out alive, one of them injured. On the grass and between the houses, dozens of dead terrorists.</p>\n\n\n\n<p>What is there? Certainly, let&#8217;s flank from the right. We&#8217;re in position on the right. Receiving a call from Kfar Gaza that there&#8217;s actually shooting towards it, there are casualties. I call a friend in the village, he tells me: &#8220;I&#8217;m grabbing the handle of the stand, and there are terrorists in the house and the kibbutz. Don&#8217;t come, Noam.&#8221;</p>\n\n\n\n<p>Bonfad, a local resident, woke up that morning in Jerusalem, grabbed his gun, and rushed south. &#8220;I&#8217;m talking to the commander of the standby squad, he tells me: &#8216;Noam, I don&#8217;t want to be your hero, don&#8217;t come.'&#8221;</p>\n\n\n\n<p>&#8220;Police, is there anyone home?&#8221; I don&#8217;t understand where all the standby squads of the IDF are. &#8220;Let&#8217;s wash up to the fence and then start returning. We are almost at the fence. No, let&#8217;s advance. I get here with the motorcycle and see them. I still don&#8217;t know which direction to go, because I&#8217;m hearing reports from all directions. Keter Tsoran and a police motorcyclist on the way to Lotev, he even managed to kill a terrorist during the chase.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Preparing for Battle</h3>\n\n\n\n<p>The thinking from the entrance was that it didn&#8217;t really matter how many were here, what mattered was that we were the only force that, as we understood, could prevent a massacre here. Extending between the lines and thus an improvised force was hastily assembled. Zandani and we stuck to these houses. &#8220;Yes, you were on this side.&#8221; At 9:45, they enter the kibbutz, there are probably terrorists inside the settlement. We are a small force scanning here. The first decision they made was to go in on foot and make their way between the houses.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Fighting in the Dining Room</h3>\n\n\n\n<p>The first building they reach is the dining room. &#8220;Police, police, police! Give me a status report. There are terrorists here. Sergeant Kbitz and Avichai Brodets, members of the standby squad, are lying there injured after a fight.&#8221;</p>\n\n\n\n<p>Uriel, of course, treats the wounded immediately and tries to interrogate them: &#8220;How many people did you see? How were they dressed?&#8221; He couldn&#8217;t really say, said: &#8220;Both military and civilian, around ten people, something like that.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Rescuing the Injured</h3>\n\n\n\n<p>We are in the dining room, two injured from the standby squad joined us. Avichai also got shot, he started to fall asleep. &#8220;I tell him, &#8216;Okay, leave it, I&#8217;ll get you some water. Drink slowly, regular your breathing.'&#8221; I called his wife from my phone, at a certain point she answered. A quarter of an hour later, the connection with her was cut off. I took his M16, put some magazines in my pockets, and from here we start moving to the western part.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Battle Continues</h3>\n\n\n\n<p>As I shout &#8220;shadows, shadows&#8221; several times, we are suddenly bombarded from that direction. &#8220;Only him, only him, only them, only them!&#8221; &#8220;You got hit? Are you okay?&#8221; &#8220;I&#8217;m dead.&#8221; When he answered me &#8220;I&#8217;m dead,&#8221; I knew he wasn&#8217;t dead. &#8220;Can you crawl? Where did you get hit?&#8221; &#8220;Chest.&#8221;</p>\n\n\n\n<p>That&#8217;s the moment they realize they are in the heart of the kill zone, few against countless. The IDF is far away, civilians are being massacred. Yaron is now lying injured on the grass. &#8220;Brother, evacuate, brother, I&#8217;m evacuating you, I&#8217;m evacuating you.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Life-Saving Decisions</h3>\n\n\n\n<p>The decision that changed the course of the battle was made. They find a ladder, lean it against the wall, and start climbing. Noam climbs to the roof with Zanden and pulls the ladder after them. We look 360 degrees, we start to see all the smoke, see the destroyed houses, and start to realize the number of terrorists running through the alleys. We start shooting at terrorists in the flag area.</p>\n\n\n\n<p>Luckily, they also didn&#8217;t raise their heads, they didn&#8217;t understand where we were shooting from. That&#8217;s how their fighting sounded from behind the nearby window bars. Mir Tsror and Yam Susanna listened in terror to the exchange of shouts between Keter and Noam. Meanwhile, on the roof, Zanden tries to call for more forces.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Fighting from the Roof</h3>\n\n\n\n<p>Noam rests Avichai Brodets&#8217; rifle on the railing. Through the sights, he sees another terrorist and another terrorist. He waits for them to stand, squeezes the trigger, and brings them down. Gives them two horizontal bursts instead of two falling, and that was the first time a terrorist spotted us on the roof. I clearly remember his look, our gazes met, and oops, he got behind some concrete. Suddenly, red color.</p>\n\n\n\n<p>For about 25 minutes, half an hour, we lie on the roof while mortars fall all around. Complete silence, no one is on the radio, no screams of terrorists or civilians, just half an hour of mortars. &#8220;Listen, I&#8217;m on my way to you, tell me when you see me.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Dramatic End and Rescue</h3>\n\n\n\n<p>At 11:10, after 3 and a half hours of fighting, a Duvdevan force manages to reach the grass. &#8220;I have an injured man with bullets in his chest. The injured is here in the bush, I&#8217;m with him all the time.&#8221; &#8220;Okay, I&#8217;m crossing, let&#8217;s go, I&#8217;ll help you. Guys, now we need to take him to the vehicle or there&#8217;s civilians here, these are civilians.&#8221; Together, they manage to rescue Yaron and a few others, shooting at terrorists and starting to scan houses. &#8220;Are you alone? Cross the window quickly.&#8221;</p>\n\n\n\n<p>Before Cheter gets into the jeep, he shouts to Noam, who joined him, but Noam refuses to leave Kfar Azza. We continue managing the battle, identifying people trying to break into the vehicles and take hostages. This 360-degree perspective was a great point for us to strike them. Kfar Azza experienced a terrible massacre that day, lasting many hours, facing great inaction from security forces. Dozens of kibbutz residents were murdered or abducted. You can see it with your own eyes, there&#8217;s an area where nothing happened, and a line of houses that unfortunately, we couldn&#8217;t reach, that&#8217;s the line of the young generation&#8217;s houses that were massacred.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Bitter End</h3>\n\n\n\n<p>Noam and Zad came down from the roof only after hours. Noam gathered ammunition and joined special forces for house-to-house fighting. They understand there are many terrorists who entered the shelters. We still hear civilians&#8217; cries from inside. There was a great complexity in opening these houses because we didn&#8217;t know if the civilians were alive or dead. We opened houses and saw what they did to them inside. We realized that if they got in, there wasn&#8217;t much chance for the families. On the other hand, occasionally we did hear a mother&#8217;s cry, a girl&#8217;s, a boy&#8217;s.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Complexity After the Battle</h3>\n\n\n\n<p>There were about five more hours of very complex fighting. Around two in the morning, Noam left Kfar Azza for an interview with us. He arrives in uniform, since that day he has been recruited and fighting inside Gaza. Keter Tsoran got on his motorcycle and since then has been operational on the roads and fields of the south. One of hundreds and thousands of policemen who fought that day.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Human Story</h3>\n\n\n\n<p>Elad Zandani is the rear officer of the Azza brigade and now works on rehabilitating the border area the day after. Yaron arrived in his last breaths at the hospital. The doctors managed to save his life, and today he is recovering at Ichilov. How did four people enter the kill zone and come out alive? A good question. A miracle.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>This story is not about victory, it&#8217;s not a story with a happy ending. But the battle is another small light in that dark day, another piece in the huge puzzle of the blockade battles.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The bottom line of this battle sounds almost imaginary. Four Israelis found themselves in the heart of Kfar <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, surrounded by terrorists.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 0,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 380,
        "footnotes": ""
    },
    "categories": [
        380
    ],
    "tags": [],
    "class_list": [
        "post-6231",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "hentry",
        "category-story"
    ],
    "lang": "en",
    "translations": {
        "en": 6231
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6231",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6231"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6231/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6234,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6231/revisions/6234"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6231"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6231"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6231"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}