{
    "id": 6961,
    "date": "2024-07-31T15:00:00",
    "date_gmt": "2024-07-31T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6961"
    },
    "modified": "2024-07-31T16:31:51",
    "modified_gmt": "2024-07-31T13:31:51",
    "slug": "hamas-hezbollah-leaders-meet-justice-daily-briefing-with-rachel-lester",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-hezbollah-leaders-meet-justice-daily-briefing-with-rachel-lester/",
    "title": {
        "rendered": "Hamas &amp; Hezbollah Leaders Meet Justice | Daily Briefing with Rachel Lester"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas &amp; Hezbollah Leaders Meet Justice | Daily Briefing with Rachel Lester\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/-ftSQynUdLc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I am citizen spokeswoman Rachel Lester. Today is July 31st, 2024. This is the live Daily Briefing of the Israeli citizen spokesperson&#8217;s office. We are live on Instagram, on X, on YouTube, and on LinkedIn, and available afterwards wherever you get your podcasts. Please start submitting questions in the chat and, as always, like and subscribe to help us reach a wider audience.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Current Situation Update</strong></h2>\n\n\n\n<p>Today is day 299 of the October 7th War and the Hamas hostage crisis. Two vicious leaders of two heinous terrorist organizations are no longer with us. Ismail Haniyeh was an arch-terrorist, a leader of the Hamas terror organization that raped and murdered on October 7th. He called the massacre a victory and urged people in Jordan, Syria, Lebanon, and elsewhere to join his war. A few hours ago, Haniyeh was meeting with Iran&#8217;s leaders alongside Hezbollah and the Houthis, chanting &#8220;death to Israel, death to America.&#8221; Hours later, Haniyeh was hit with a missile. Haniyeh will never call for death again. America got to Bin Laden and Israel allegedly got to Haniyeh.</p>\n\n\n\n<p>Hezbollah&#8217;s number two, Fa Shakur, was behind this week&#8217;s massacre of 12 children playing soccer in Northern Israel. Shukur was behind the murder of 85 people with over 300 injured in the bombing of AMIA, the Jewish Community Center in Buenos Aires, the largest terrorist attack in Argentina&#8217;s history. Shukur was behind the murder of 307 people, including 241 US military members, in the Beirut US barracks bombing. A few hours ago, another missile found Shukur in Beirut. Shukur was sanctioned by the US and had a $5 million bounty on his head. Haniyeh was also US-sanctioned. Maybe Israel should get a check because Israel isn&#8217;t just defending its people from these blood-soaked murderers.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Global Context and Impact</strong></h2>\n\n\n\n<p>These evil men were key to Iran&#8217;s seven-front war on the Jewish State and Iran&#8217;s attacks on the Jewish people. But they were also agents of death in Iran&#8217;s war on the region and on the West itself. Israel warned Hamas and Hezbollah&#8217;s murderers are dead men walking. Nobody murders Israelis and gets away with it. If the message was missed in Beirut, we hope it was received clearly in Tehran. We hope all of Iran&#8217;s terror minions gathered around their mullahs and their new president took note. In the last 24 hours, Israel has shown that nowhere is safe for jihadis who want to murder its people. There is no immunity in Beirut and no immunity in Tehran. Israel will go to the ends of the Earth to bring its people home to safety and its captors to justice.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Israel&#8217;s Stance and Call to Action</strong></h2>\n\n\n\n<p>Let me remind you, Israel did not ask for this war, not for the barbaric Hamas rapes and murders on October 7th, and not for the 6,500 rockets, missiles, and drones launched by Hezbollah in Lebanon. But Israel will do what it must to protect its people and end the war. Israel is breaking Hamas in the Gaza Strip. Israel stands ready to push back Hezbollah if they don&#8217;t end their war. And Israel will act against all of Iran&#8217;s proxy armies wherever they may be, as shown in last week&#8217;s strike on the Houthi terror pirates in Yemen. The Tehran conference began with Iran&#8217;s Iraqi proxy saying that they will attack Americans and ended with Iran&#8217;s Lebanese and Gazan proxies being hit hard.</p>\n\n\n\n<p>In Tehran, tell your leaders now is the time to apply pressure and ensure that Iran understands the message: it must end its war. Now is the time to back Israel. Before we take questions, a few words to our viewers. For all those asking what you can do to help, there are links to a JayGive campaign across our social media. Those donations provide the support that we need to keep getting the word out. I&#8217;d also ask that you sign up to our email list. I promise we won&#8217;t bother you with junk; this will just allow us to get you our message directly and occasionally share special content.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Questions and Answers</strong></h2>\n\n\n\n<p><strong>Regional Response</strong> Our first question comes from YouTube: How have other countries in the region responded to these assassinations?</p>\n\n\n\n<p>Would you be surprised if I said that other countries in the Middle East are not reacting well to the assassinations of the leaders of two biggest terrorist organizations attacking Israel on a daily basis? Iran&#8217;s supreme leader has said that Iran has a duty to avenge Haniyeh and vows a harsh punishment for Israel. Syria said the assassination could set the region ablaze, as if Israel hasn&#8217;t been figuratively and literally on fire for nearly 10 months. Jordan condemned killing Haniyeh in the strongest terms. The Prime Minister of Qatar said, &#8220;How can the mediation succeed when one side assassinates the negotiator?&#8221; He then said, &#8220;Peace needs serious partners and a global stance against the disregard for human life.&#8221; The problem is, Minister, Ismail Haniyeh did not and has never stood for human life. He and the terrorist organization he led aimed to destroy as much human life as possible on both sides of the conflict. We did not lose a good-faith negotiator who wanted peace. No, we lost an evil man who was hiding far from Gaza while forcing his people to suffer a brutal war that he started. What all of these countries need to realize, what everyone needs to realize, is that enough is enough. We had the chance to take out the mastermind behind the deadliest day in our country&#8217;s history, and we took it because no one else was going to. This is an important day for Israel and the Jewish people. It&#8217;s also an important day for everyone around the world to decide if they stand with Israel or with terrorism. As far as I&#8217;m concerned, it&#8217;s time to either get on Israel&#8217;s side or stay on the losing side. But enough is enough.</p>\n\n\n\n<p><strong>Impact on Hostage Deal Negotiations</strong> Our next question comes from Instagram: Do you think that the assassination will hurt the hostage deal negotiations?</p>\n\n\n\n<p>You know, I was reminded of something important this week. I was fortunate enough to tour Israel with Mosab Hassan Yousef, the son of Hamas. He said that he knows from how he was raised that the other side only responds to firepower. They don&#8217;t respond to what they perceive as weakness. So maybe us applying maximum pressure, maybe the assassination of the leader of the genocidal rapist regime, will scare them into backing down a bit from their ridiculous demands.</p>\n\n\n\n<p><strong>IDF&#8217;s Progress</strong> Our next question comes from Bambu Sah on YouTube: At this time, is the IDF any closer to knowing where Yahya Sinwar is located?</p>\n\n\n\n<p>That&#8217;s a great question, and I wish I had a good answer for you. I don&#8217;t think that the IDF is any closer to knowing the location of Yahya Sinwar or being able to carry out an assassination on this incredibly important target. As we saw, though, nobody thought that Israel was going to be able to take out allegedly Ismail Haniyeh. So we might be surprised in the coming days with another assassination of a high-value target. We have to wait and see.</p>\n\n\n\n<p><strong>Potential Retaliation from Iran</strong> Our next question comes from T Fred: What do we expect in terms of retaliation from Iran?</p>\n\n\n\n<p>It&#8217;s a good question because everyone in the region is playing this game of wanting to have the last word, wanting to show strength, but not wanting to escalate into an all-out war that would damage both sides tremendously and irreparably. I think that what we can expect from Iran is probably, and just to be clear, this is only my speculation; I&#8217;m not getting this from any official source. I think that we can probably expect something serious like the rockets that we had in April to show their anger over the assassination of not one but two of its terror proxy leaders that were very high up in Iran&#8217;s chain of command. I do think that this is the time to be on high alert in Israel. We have not had any change in the Home Front Command instructions as of yet, but I do think that we all need to just be on high alert, not plan on going to Northern Israel anytime soon if avoidable, and just make sure that your bomb shelters are open and that you know how to handle yourself in case of emergency. So I think that we will see an escalation that we don&#8217;t want. I don&#8217;t think that we are going to be able to have the last word, unfortunately, but we will have to wait and see just how strong it is and if it will be something that will be impossible to walk back from or if we will be able to continue with the status quo.</p>\n\n\n\n<p><strong>Targeted Killing Justifications</strong> Our next question comes from Soul on YouTube live: Was the killing of Shukur in Beirut in response to Hezbollah&#8217;s killing of 12 children in the north of Israel, or was it simply seizing an opportunity?</p>\n\n\n\n<p>That&#8217;s a good question. I think it was both, but I do think that it was the direct response to the horrific massacre in Majdal Shams that we saw earlier this week. I don&#8217;t think that you can kill 12 innocent children that were just playing soccer in cold blood and get away with it. And I think Israel wanted to send that message directly and clearly to Hezbollah that if they have the terrible idea of striking in populated areas in northern Israel anytime soon again—it&#8217;s one thing to be shooting in open areas, and the damage that is being done to Israel is disgusting and horrific—but it&#8217;s another thing entirely to shoot directly into a soccer field full of children playing, children and teenagers that have nothing to do with this war. And I think Israel wanted to make very clear, yes, we had the opportunity and we took it, but I think we probably had the opportunity and didn&#8217;t take it because we didn&#8217;t want to escalate the situation more than it has already been escalated. But I think once Hezbollah crossed that very dramatic red line of massacring those 12 children and injuring several more, I think this was the response that Israel needed to show in order to, as I said, show that we are not weak, that we are strong, and to deter any future attacks of similar nature.</p>\n\n\n\n<p><strong>Operational Impact on Terrorist Organizations</strong> Our next question comes from YouTube live: Are the eliminations of Shukur and Haniyeh largely symbolic, or do you expect that they will have a significant impact on Hezbollah and Hamas&#8217;s operations?</p>\n\n\n\n<p>I think that they will have a significant impact on both Hezbollah and Hamas&#8217;s operations because a military is only as strong as its leaders. A military can only function when it&#8217;s getting instructions from somebody above that&#8217;s making those decisions. So I do think there are people who are going to be stepping up and taking their places, and there will be more people to take out when the time comes. But in the meantime, I think people in Hezbollah and in Hamas are kind of running around with their heads cut off thinking, &#8220;What do we do now? How do we proceed?&#8221; And that&#8217;s good for Israel. We want them to be scared of attacking us because they know that the response they&#8217;ll get from us is going to be serious. We&#8217;re not going to take this tit-for-tat little game anymore. So I do think that every major terrorist leader that is eliminated is a decisive victory for Israel and will actually have a tangible effect on how Hamas and Hezbollah operate.</p>\n\n\n\n<p><strong>Travel Safety</strong> Our next question comes from Simone on Instagram live: Is it still safe to travel to Israel? I&#8217;ve seen many airlines have already canceled flights.</p>\n\n\n\n<p>Yes, I do think that it is still safe to visit Israel. My mom is actually here with me right now; she just got here two weeks ago, and so far, so good. We have a bomb shelter in our building, and we know what to do in case the siren goes off. But besides that, we are living our lives. We are not letting the terrorists win. Not only are they trying to terrorize us with missiles and drones, lighting our fields on fire, and killing our children, but they&#8217;re trying to enact psychological terrorism every single day and disrupt the way that Israelis and Jews around the world live their lives. They want to instill in us fear of just living normally. We cannot let that be their victory. We have to continue visiting Israel and traveling around. Yeah, I would say that this is not the time to visit northern Israel, but I happened to have been in northern Israel just last week on a visit to Kiryat Shmona to see the damage being done to the biggest city in northern Israel. I was fortunate; there were no rockets during the time that I was visiting. There was a rocket attack an hour after I was visiting, and the people that I had been with stayed in the bomb shelter, and they were okay. So it does seem scary over here, but it is still Israel. We are still protecting ourselves. Israel is still the best country in the world to defend its citizens and its people. I would say if you want to come to Israel, this is still a great time.</p>\n\n\n\n<p><strong>Emergency Preparedness</strong> Our last question comes from JJR from New York on Instagram live: What should Israeli civilians and citizens do to prepare for emergencies due to any potential retaliations from hostile parties?</p>\n\n\n\n<p>To prepare for major escalations, I would say check the Home Front Command instructions and stay updated in that regard. But besides that, it&#8217;s always a good idea to stock up on bottled water, non-perishable food, and any other essential items that you might need, such as medications or charging all of your devices and external chargers. Make sure that if we lose electricity, you would be able to function for a few days or however long it might be. Prepare the same way that you would for a natural disaster: bottled water, food, medication, electronics, and having a plan with your loved ones to ensure that if you can&#8217;t reach each other, you have a plan.</p>\n\n\n\n<p>That&#8217;s all we have time for today. Thank you so much for tuning in, and please join us tomorrow at 3:00 p.m. Israel time, 8:00 a.m. Eastern time. Until then, stay safe.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Today’s briefing by spokeswoman <a  href=\"https://iron-swords.co.il/t/rachel-lester/\">Rachel Lester</a> covered the assassinations of <a  href=\"/hamas\">Hamas</a> leader Ismail Haniyeh and <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s Fa Shakur, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s response to regional threats, and the impact on hostage negotiations and regional stability. Lester emphasized Israel&#8217;s commitment to defense and encouraged international support, concluding with advice for Israeli civilians on emergency preparedness.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6962,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        498
    ],
    "class_list": [
        "post-6961",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-rachel-lester"
    ],
    "lang": "en",
    "translations": {
        "en": 6961,
        "ru": 6964
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6961",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6961"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6961/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6963,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6961/revisions/6963"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6962"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6961"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6961"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6961"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}