{
    "id": 6354,
    "date": "2024-07-17T15:00:00",
    "date_gmt": "2024-07-17T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6354"
    },
    "modified": "2024-08-16T11:41:27",
    "modified_gmt": "2024-08-16T08:41:27",
    "slug": "hamas-brags-about-its-crimes-and-denies-them-daily-briefing-with-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-brags-about-its-crimes-and-denies-them-daily-briefing-with-ruth-wasserman-lande/",
    "title": {
        "rendered": "Hamas Brags About Its Crimes (and Denies Them) | Daily Briefing with Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas Brags About Its Crimes (and Denies Them) | Daily Briefing with Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/jWKPXxKN7uU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I&#8217;m Ruth Wasserman Lande. It is July 17th, 2024, and this is the live Daily Briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on Instagram, X, YouTube, and LinkedIn. Please follow us on all our platforms and start submitting questions. I also invite you to follow me on my personal platforms, Ruth Wasserman Lande.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Abduction of Israeli Women by Hamas</h2>\n\n\n\n<p>Yesterday, the families of five Israeli women abducted by Hamas terrorists on October 7th released images showing their first days in captivity in Gaza. The images are difficult to look at. In one image, Liri Alag, Karina Arv, Agam Burger, and Daniela Gilboa are seen sitting on mattresses on the floor. Another image shows Nama Levi with a swollen eye and cuts on her face. The same Nama Levi who begged her captors to let her phone her friends in Gaza because she was a peace activist and was last seen being dragged out of a pickup truck in bloodied pants. These are signs of life that the Israeli public, until yesterday, had not seen. The images were reportedly taken from a Hamas video that the IDF obtained during operations in Gaza. The video, which had not been released, was first shown to the hostages&#8217; families just a few months ago.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Human Rights Watch Report on Hamas</h2>\n\n\n\n<p>I thought about these images as I read the new Human Rights Watch report on Hamas&#8217;s barbaric atrocities. We did not really need a Human Rights Watch report 9 months after October 7th to know that Hamas perpetrated barbaric atrocities. Since then, Human Rights Watch has done more than any other Western NGO to demonize Israel and to pressure it to end this war with the aggressor, Hamas, so that it may continue to fight again. But there is a part of the Human Rights Watch report you should read. Human Rights Watch sent questions to Hamas terrorists themselves about the October 7th massacre. A senior Hamas terrorist, Basam Naim, sent a reply. One sentence particularly stands out because it&#8217;s so ridiculous it&#8217;s almost funny. It says, &#8220;Hamas is committed to respecting international and human rights law.&#8221; It is a shocking claim that Hamas respects international law. Hamas terrorists gunned down hundreds of people at a music festival; which international law allows that? Hamas death squads went house to house in places like Kaza and B and massacred innocent people in their own homes; which international law allows for that? Hamas took 251 hostages back to Gaza; which international law allows that? I don&#8217;t think anyone in Hamas has ever read a single clause of a single international law. Article 34 of the Fourth Geneva Convention is clear: the taking of hostages is prohibited. Hamas took hostages, of course. Hamas is violating international law. Hamas sometimes claims that it is not holding hostages but, in fact, prisoners of war. These include two children who are still trapped in the terror dungeons, Ariel and Kir Bias. They can&#8217;t be considered prisoners of war, nor can their parents, Sheri and Yarden. They&#8217;re hostages. Even if we accept, for the sake of argument, the absurd claim that it is holding prisoners of war, Hamas has refused to allow the Red Cross to visit them. That is illegal. The Third Geneva Convention requires that parties to an armed conflict grant the Red Cross immediate access to all prisoners of war and the right to visit them wherever they are held. Hamas has refused to let the Red Cross visit a single hostage. It&#8217;s a clear violation of international law that Hamas claims to respect. Senior Hamas terrorist Basam Naim claims that Hamas respects international law. That is a lie. On October 7th, Kat Desad gunned down hundreds of people at a music festival, massacred families in their own homes, took 251 hostages back to Gaza, and committed unspeakable sexual atrocities. These crimes against humanity are blatant violations of international law. Hamas knows that it can lie about its crimes because it knows that its friends will remain quiet. Hamas knows that UNRWA will ignore its crimes because UNRWA is a Hamas front. Hamas knows that the World Health Organization will remain silent as it wages war out of hospitals. Hamas knows that students on American campuses will celebrate its atrocities as resistance by any means necessary. Hamas should not be able to get away with saying with a straight face that it respects international law while at the same time broadcasting its many crimes. Is that too much to ask? Please let me know in your comments, and I&#8217;d be more than happy to take any questions.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A Session</h2>\n\n\n\n<p><strong>Question from Rachel on Instagram Live:</strong> How close are we to dismantling Hamas, and how is the search for hostages going? Are we close?</p>\n\n\n\n<p><strong>Answer:</strong> Thank you so much, Rachel, for that question. First of all, the IDF is performing extraordinarily well. Urban warfare experts keep saying that what the IDF is doing will be studied in war colleges throughout the world for its precision in not harming civilians during combat. The successes in eliminating Hamas combatants are significant. Yet we still have Hamas combatants to kill. More or less half of the Hamas senior leadership has been eliminated; the rest are hiding underground in the tunnels and amid the civilian population, endangering their own people. Regarding the hostages, what Hamas is doing illegally is holding the hostages as human shields because they know that the Israeli IDF will not shoot if they know Israeli hostages are around senior Hamas officials. We are moving closer; we have taken down significant and senior Hamas leadership members, and I believe we shall reach them all.</p>\n\n\n\n<p><strong>Question from Jenning Five on Instagram:</strong> Has the Red Cross actually tried to access the hostages? Last I heard, they didn&#8217;t even try.</p>\n\n\n\n<p><strong>Answer:</strong> They say they have tried, but Hamas simply refused to let them close. At the beginning of the war, Hamas had complete control over the Gaza Strip. You couldn&#8217;t go anywhere if Hamas didn&#8217;t want you to. There were claims by senior people in the Red Cross that they tried and were refused. Did they try hard enough? No, they should have continued to try every single day. Their job is to ensure that hostages get the medical care they need. In the more advanced stages, Hamas has been weakened, and the Red Cross needs to continue to push. There are still 120 hostages in Gaza, and the Red Cross has not been allowed to visit a single one. This is unacceptable. The entire world needs to pressure Hamas to allow the Red Cross to see these hostages.</p>\n\n\n\n<p><strong>Question from Claudia Salam on Instagram:</strong> How do you answer to people saying that the IDF is killing innocent people in Gaza?</p>\n\n\n\n<p><strong>Answer:</strong> Thank you for that question. Urban warfare experts, including John Spencer, have said that the Israeli IDF standards of warfare are unprecedented. The number of civilians killed is tragically unavoidable in war, but every civilian death is a tragedy. Hamas knew that their actions would provoke retaliation. No country would allow a terrorist organization to massacre, rape, and murder its population. The IDF went into Gaza to eliminate the threat to its civilians. Hamas sits in schools, under hospitals, and in heavily populated civilian centers to gain international support. This is why civilian casualties occur.</p>\n\n\n\n<p><strong>Question from Iris at Work on Instagram:</strong> What is the current status of the ceasefire?</p>\n\n\n\n<p><strong>Answer:</strong> There isn&#8217;t a ceasefire in Gaza. Talks of a ceasefire are contingent on Hamas releasing all our hostages immediately. If they did that, there would be no war. There was no war on October 6. The blockade wasn&#8217;t enforced, UNRWA kept receiving funding, and restaurants were open. Hamas had better jobs and employment than other members of the population. The issue is that there is no ceasefire because Hamas still holds 120 hostages and continues to threaten Israeli civilians. Therefore, there is no ceasefire.</p>\n\n\n\n<p><strong>Question from John on Twitter:</strong> Hezbollah fired 100 rockets into Northern Israel last night. What is the situation there, and is the war intensifying?</p>\n\n\n\n<p><strong>Answer:</strong> Hezbollah, an arm of Iran, has been firing rockets at civilian targets and installations in Israel. This is an act of war. If Hezbollah and Iran continue to wage war against Israel, the government will have to ensure the security of its displaced citizens. There will likely be an escalation if this continues.</p>\n\n\n\n<p><strong>Question from Mel on Instagram:</strong> What is the best way for Americans to help in hostage release efforts?</p>\n\n\n\n<p><strong>Answer:</strong> The best way for Americans is to pressure worldwide organizations, NGOs, and countries to speak out against Hamas. Hamas does not respect human rights, international law, or basic humanity. This terrorist organization threatens not just Israel and the Jews but also the West and anyone who doesn&#8217;t align with their ideology. Americans need to understand the situation and pressure decision-makers, media outlets, and NGOs to stop supporting terrorist entities. This includes financial and media pressure. Thank you so much.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/ruth-wasserman-lande/\">Ruth Wasserman Lande</a>&#8216;s briefing covers the release of images showing Israeli women abducted by <a  href=\"/hamas\">Hamas</a>, critiques <a  href=\"https://iron-swords.co.il/t/human-rights/\">Human Rights</a> Watch&#8217;s report on <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> atrocities, discusses the IDF&#8217;s efforts against Hamas, addresses accusations against the IDF, and emphasizes the need for international pressure on Hamas for hostage release and adherence to international law.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6370,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-6354",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 6354
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6354",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6354"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6354/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6371,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6354/revisions/6371"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6370"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6354"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6354"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6354"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}