{
    "id": 6545,
    "date": "2024-07-18T15:00:00",
    "date_gmt": "2024-07-18T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6545"
    },
    "modified": "2024-08-16T11:41:17",
    "modified_gmt": "2024-08-16T08:41:17",
    "slug": "hamas-attacks-israeli-soldiers-guarding-aid-route-daily-briefing-with-ashley-waxman-bakshi",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hamas-attacks-israeli-soldiers-guarding-aid-route-daily-briefing-with-ashley-waxman-bakshi/",
    "title": {
        "rendered": "Hamas Attacks Israeli Soldiers Guarding Aid Route | Daily Briefing with Ashley Waxman Bakshi"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hamas Attacks Israeli Soldiers Guarding Aid Route | Daily Briefing with Ashley Waxman Bakshi\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/1V5vhiuZP4g?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>This morning, the IDF announced that it had eliminated Anas Murad, the commander of Islamic Jihad&#8217;s Naval forces in Gaza City, and Ahmed Al Masle, an Islamic Jihad terrorist who participated in the October 7th Massacre. It&#8217;s easy to read such an IDF announcement and see it as nothing out of the ordinary after 9 months of war, but there was something that stood out to me.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Islamic Jihad&#8217;s Objectives and Capabilities</h3>\n\n\n\n<p>Islamic Jihad, the name of the group, makes it clear what they stand for: the annihilation of Israel. A group that calls for the annihilation of Israel cannot be allowed to build up the ability to massacre Israelis. Israel can never again accept a situation where a radical Islamic terrorist group in Gaza has the ability to attack Israel. A terrorist group that has the ability to attack Israel will attack Israel. The concept of deterrence is not relevant here; that should be clear. We saw what happened on October 7th. Hamas invaded Israel not only by air and land but also by sea. Hamas frogmen swam a short distance north in the Mediterranean Sea before coming ashore on a beach inside Israel and massacring defenseless Israelis who were on the beach. Israel can never again allow such a threat to develop in Gaza, which is a short swim away from Israeli beaches. Israel cannot allow Hamas, Islamic Jihad, or any other terrorist group to regroup and rearm.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF Operations on the Israeli-Egypt Border</h3>\n\n\n\n<p>With this goal in mind, the IDF is continuing its operations in Raak along the Israeli-Egypt Border to locate and destroy tunnels.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Attack on Humanitarian Route in Gaza</h3>\n\n\n\n<p>Yesterday, an incident occurred along the humanitarian route in Gaza, which should have captured major international attention but did not. This route is typically used by aid trucks traveling from the Israeli border crossing into Gaza. Israeli soldiers are stationed along this road for protection. However, in a violent act, Hamas terrorists launched a missile attack on these soldiers, resulting in one injury. Consequently, the humanitarian corridor was temporarily shut down to ensure safety and security.</p>\n\n\n\n<p>Despite the seriousness of this attack, there was a notable absence of condemnation from the United Nations, raising questions about their response to the deliberate obstruction of humanitarian aid. Israel&#8217;s priority is to maximize the delivery of humanitarian aid to Gaza. Astonishingly, a significant volume of aid, approximated at 1,200 truckloads, is currently stagnating under the sun on the Gaza side of the border, unattended by the United Nations or other aid organizations. These entities have not only failed to facilitate the distribution of the aid but have also inaccurately accused Israel of impeding the aid process, even as Israeli soldiers risk their lives to safeguard the route.</p>\n\n\n\n<p>This lack of transparency and accountability obscures the truth and serves no one. It is imperative for the United Nations and all aid organizations operating in Gaza to demand that Hamas cease the ongoing conflict initiated on October 7th, release the hostages, and allow Israelis and Palestinians to collaboratively foster a more hopeful and peaceful future.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Regional War and Threats Beyond Gaza</h3>\n\n\n\n<p>The war that Hamas started on October 7th is not a local war between Hamas and Israel. Hezbollah in Lebanon joined the war on October 8th, and it became a regional war fought on seven fronts: Gaza, the West Bank, Lebanon, Syria, Iraq, Iran, and Yemen. There&#8217;s something about the threat from Yemen that is not getting enough attention. The Houthi terrorist army in Yemen, with Iran&#8217;s support, continues to threaten ships in the Red Sea that pass by Yemen. As a result of the threat of piracy, many shipping companies are not sending their ships through the Red Sea. The lack of shipping in the Red Sea is not just hurting Israeli businesses; it&#8217;s hurting businesses everywhere in the world, especially Egypt, whose economy relies on revenues from the Suez Canal at the end of the Red Sea. The head of Egypt&#8217;s Suez Canal Authority said that revenues fell by nearly 2 billion dollars, a drop of almost 25% in the latest fiscal year. That&#8217;s because ships in the Red Sea prefer to find a safer route that does not involve the chance of being hijacked by Islamic pirates in Yemen. Israel is on the front line of the October 7th War, but Israel is not the only country affected by the war that Iran&#8217;s proxies are fighting. The October 7th war is a regional war that requires regional solutions. The sooner more countries realize this, the faster we can build a more peaceful Middle East.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<h4 class=\"wp-block-heading\">Thoughts on the 30th Anniversary of the Jewish Community Center Bombing in Buenos Aires</h4>\n\n\n\n<p>Ashley: It&#8217;s 30 years to the day since the bombing of the Jewish Community Center in Buenos Aires, Argentina. We have many viewers in Argentina. What are your thoughts 30 years after this bombing, given what we now know about Iran and its place in the Middle East? Response: Iran ordered it, Hezbollah carried it out. They want to kill Jews and destroy Israel. They also bombed the Israeli Embassy two years before. The threat from Iran and Hezbollah is not new; it&#8217;s the same Iran and the same Hezbollah today. It&#8217;s just proof.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Similarities and Differences Between Hamas and Islamic Jihad</h4>\n\n\n\n<p>Instagram Live Question: Hamas and Islamic Jihad—what are their similarities and differences? Response: Both organizations want the same thing: the annihilation and destruction of the state of Israel. Between them, there is an internal struggle, but both are built on the same radical Islamist ideology that refuses to accept a Jewish state. Both aim to establish Sharia law and use their radical extremist religious ideologies to try to annihilate the state of Israel. Despite their power struggle, they are very similar in ideology.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Addressing Concerns About Civilian Casualties in Gaza</h4>\n\n\n\n<p>Hal: I agree Israel should defend itself, but how is carpet bombing children okay? Response: Israel is not carpet bombing children. Israel doesn&#8217;t have the capability to carpet bomb Gaza. The question goes deeper than that. Nobody wants to see children dying in war. Hamas is to blame for this, as they hide underneath and behind Palestinian children. Israel is not carpet bombing; Israeli soldiers are on foot, going door to door and tunnel to tunnel, endangering their lives to minimize civilian casualties.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Academic Background</h4>\n\n\n\n<p>Natasha: What&#8217;s your degree in? Response: My second degree is in counterterrorism and Homeland Security. My thesis was about the radical ideologies of the Muslim Brotherhood, which is the same ideology behind Hamas. I know quite a bit about this subject, and it&#8217;s not about borders or politics. It&#8217;s a fundamental radical ideology that refuses to accept a Jewish state.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Views on the Israeli Knesset Resolution Opposing the Two-State Solution</h4>\n\n\n\n<p>Social Media: What is your view on the Israeli Knesset passing a resolution opposing the two-state solution? Response: Let&#8217;s focus on substance rather than slogans. What would be the state that Israel would be sitting beside? Would it be democratic or a terrorist state run by radical ideologies? We can only move forward once we have a partner willing to accept that the Jewish state is here to stay.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Comments on Bella Hadid and Adidas Controversy</h4>\n\n\n\n<p>Instagram Live: What is the story with Bella Hadid? Response: Adidas chose Bella Hadid, a well-known anti-Semite, as the spokesperson for a new sneaker launch. This is ironic because the sneaker is a throwback to the Munich 1972 Olympics, where 11 Israeli athletes were massacred by Palestinian terrorists. It&#8217;s laughable and ironic.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hostage Situation Update</h4>\n\n\n\n<p>Instagram Live: Is there a hostage deal in the works? Response: We have very little information as the Red Cross is not allowed to visit, and we don&#8217;t have lists of who is alive. Negotiations for a deal are in advanced stages, and we hope it brings security to Israel. External pressure to make a deal happen is appreciated.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Volunteering in Israel</h4>\n\n\n\n<p>Instagram Stories: Does Israel need volunteers for farm work? Response: Israel is always looking for volunteers. Reach out through your local Jewish Community to find organizations where you can help. There are many opportunities to volunteer and experience the beauty and significance of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>I invite you to follow the Israeli spokesperson&#8217;s office and my own Instagram account, Ashley Wax Bakshi, for more updates. We will see you on Sunday at 3 PM Israel time, 8 AM Eastern time. Have a good weekend.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The IDF has targeted key Islamic Jihad figures in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, emphasizing the need to prevent such groups from threatening Israeli security. Despite ongoing efforts, including safeguarding humanitarian routes, global responses remain muted. <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> continues to push for regional collaboration to counter threats from <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s proxies, stressing the need for peace.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6549,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        490
    ],
    "class_list": [
        "post-6545",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ashley-waxman-bakshi"
    ],
    "lang": "en",
    "translations": {
        "en": 6545
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6545",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6545"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6545/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6550,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6545/revisions/6550"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6549"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6545"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6545"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6545"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}