{
    "id": 5843,
    "date": "2024-07-01T15:00:00",
    "date_gmt": "2024-07-01T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5843"
    },
    "modified": "2024-07-02T21:04:09",
    "modified_gmt": "2024-07-02T18:04:09",
    "slug": "hezbollah-our-war-is-with-the-us-daily-briefing-with-rachel-lester",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-our-war-is-with-the-us-daily-briefing-with-rachel-lester/",
    "title": {
        "rendered": "Hezbollah: &#8220;Our War is with the US&#8221; | Daily Briefing with Rachel Lester"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah: &quot;Our War is with the US&quot; | Daily Briefing with Rachel Lester\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/a1m1U4NksxM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h4 class=\"wp-block-heading\">Day 269 of the October 7th War</h4>\n\n\n\n<p>Today is day 269 of the October 7th War. Why did Hezbollah declare war on Israel nearly nine months ago? </p>\n\n\n\n<p>The warlord of Iran&#8217;s proxy Army in Lebanon, Hassan Nasrallah, said, &#8220;We are oppressed in the region and attacked by the great Satan and the Zionists. During this time we are blessed with the presence of Iran.&#8221; For anyone not in the know, Iran calls Israel the little Satan and the great Satan is the United States.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hezbollah&#8217;s Real Enemy: The United States</h4>\n\n\n\n<p>Hezbollah&#8217;s foreign policy chief was clear just this week: &#8220;This is not a war with Israel. Israel is merely a tool. Our real war is with America.&#8221; Think about that: Israel, Iran&#8217;s real war is with America, the great Satan. Iran is waging war on America by unleashing its proxy armies on Israel, the little Satan, and they&#8217;ve been doing so for nine months. Iran&#8217;s proxies in Yemen, the Houthi terror pirates, are attacking Western sailors and global shipping. Iran&#8217;s proxies in Iraq and Afghanistan, including Hezbollah, murdered thousands of US and Western troops. Hezbollah murdered hundreds of US and Western troops in Lebanon. Last week, Hezbollah threatened to attack Cyprus, an EU member.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Iranian Aggression and Global Threats</h4>\n\n\n\n<p>Iran&#8217;s warlords and their proxy armies attack Israel to attack the West because if they knock out the West&#8217;s strongest ally in the Middle East, the West is next. The free world must stand with Israel against Iranian aggression, not just because it&#8217;s the right thing to do and not even to stop Iran from taking over the region, but because Iran&#8217;s terrorist forces threaten all free nations. The world is starting to understand the threat posed by Iran and its terrorist proxies. The European Union took a positive step in slapping sanctions on firms and people channeling funds to Iran&#8217;s proxy forces in Lebanon because Iran has turned Lebanon into one giant launchpad for the 5,000 rockets, missiles, and drones that have been launched into Israel since October 8th, forcing 60,000 Israelis to flee from their homes. Some of the sanctioned people were directly passing Iranian funds on to Hamas rapists and murderers. Iran financed the barbarism of October 7th.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hamas and Human Shields</h4>\n\n\n\n<p>As Israel&#8217;s military continues to win against Hamas in the Gaza Strip, they&#8217;ve yet again found that Hamas operates in, you guessed it, schools, UN facilities, and medical offices. In this case, Hamas used a UN school to store weapons, a clinic to house a command center, and they placed a terror tunnel right by an UNRWA school. Iran&#8217;s proxy army in Gaza, Hamas, routinely violates the humanitarian protections these places should enjoy because Hamas is a death cult. Its strategy is to maximize civilian casualties on its own side because suffering breeds hate, and Hamas lives off hate. That&#8217;s why Iranian proxies like Hamas in Gaza and Hezbollah in Lebanon prefer to hide behind children to attack our children.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Audience Questions</h4>\n\n\n\n<p><strong>Karen on Instagram:</strong> &#8220;Doesn&#8217;t Hezbollah say that they are liberating Lebanese territory occupied by Israel?&#8221;</p>\n\n\n\n<p>Let me clear up some of the basic facts about Lebanon, Hezbollah, and Israel. In the year 2000, Israel completely withdrew from Southern Lebanon. There has been no Lebanese territory to liberate from Israel in 24 years. In 2006, after the second Lebanon war, the UN Security Council passed resolution 1701 requiring Hezbollah to disarm and stop hostilities between the newly established Blue Line and the Litani River, essentially making all of Southern Lebanon a no-go zone for Hezbollah. Has Hezbollah abided by that UN resolution? No, not at all. They are still using Southern Lebanon as a base to attack Northern Israel on a daily basis, endangering Israeli civilians and Lebanese civilians alike. Another thing worth noting is that in October 2022, Israel relinquished claims on gas-rich waters off its coast in favor of expanded Lebanese demands as part of a US-negotiated deal meant to avoid violence and allow for peaceful relations. Unfortunately, Hezbollah has made it perfectly clear that they don&#8217;t want peace; they just want to attack Israelis with rockets, UAVs, and suicide drones. So to sum up, it is Hezbollah that Lebanon needs to be liberated from. Southern Lebanon needs to be freed from Hezbollah so that 60,000 evacuated Israeli civilians can return to their homes and so that tens of thousands of Lebanese civilians can stop being forced to be human shields for a genocidal terrorist organization.</p>\n\n\n\n<p><strong>JJ on X:</strong> &#8220;I keep seeing videos and posts from people in Lebanon saying that they don&#8217;t like Hezbollah and that they don&#8217;t want war, so how is Hezbollah able to attack anyways?&#8221;</p>\n\n\n\n<p>You&#8217;re right. Lots of Lebanese people oppose Hezbollah. They remember the ruin Hezbollah brought them in 2006 on behalf of their Iranian overlords. Hezbollah is part of the government. They&#8217;ve partially taken over Lebanon just like Iran uses its proxies to influence other Arab countries. This week, the US tried negotiating with Lebanese politicians to end Hezbollah&#8217;s war. Those politicians are allies of Hezbollah and basically passed on Nasrallah&#8217;s and Iran&#8217;s message: no ceasefire with Iranian proxy Hezbollah in Lebanon unless Israel leaves the Iranian proxy Hamas alone in Gaza. It&#8217;s simply unacceptable.</p>\n\n\n\n<p><strong>Noom on Instagram Live:</strong> &#8220;Being from LA, what do you think the Jewish community in LA should do following the protest that happened last week in the Pico neighborhood?&#8221;</p>\n\n\n\n<p>The anti-Semitism that we&#8217;re seeing around the world right now is disgusting, heartbreaking, and infuriating. Last week in LA, a group of aggressive protesters showed up outside a synagogue on Pico, just down the block from where I grew up, under the guise of protesting Israeli policy. But really, what they did was harass Jews. My family members, my friends, and my neighbors were cursed out and sprayed with bear spray just for existing on Pico as a Jew. I live in Israel, a country under attack by a terrorist organization on seven fronts, and I&#8217;m now worrying every day about my loved ones in LA. That is not normal. In the last week, I&#8217;ve gotten a lot of comments and messages on Instagram saying that people in LA have the right to protest Israel-Palestine, and that&#8217;s true. They do. But here&#8217;s the difference between a legitimate protest about policy and harassment: legitimate protesters don&#8217;t come with mace and bear spray; legitimate protesters don&#8217;t shout incitements to violence like calling for an intifada, which is a word that specifically means killing uninvolved Jews; legitimate protesters don&#8217;t cover their entire faces specifically for the purpose of evading arrest; legitimate protesters don&#8217;t harass people about things they have no control over, and they don&#8217;t praise terrorist organizations or wave their flags or wear their headbands. But these protesters did all of those things, making them not legitimate protesters but a Jew-hating mob that needs to be stopped. My advice to the Jewish community is as follows: please get organized and mobilized to come out in numbers and show the Jew-hating mob that we&#8217;re not going anywhere. Support the police in doing better next time to keep the mob away from the Jewish community. If you can, volunteer to get trained with Magen Am, a civilian organization that needs more volunteers to keep the peace. Please stay calm but get prepared to show the world that us Jews are not going to be intimidated. Come out in numbers because we are not going anywhere.</p>\n\n\n\n<p><strong>Audience Questions Continued</strong> We&#8217;ve seen a lot of questions coming in on social media platforms about a similar topic. Can you tell us more about the 50 Gazans who were released today, including the Shifa hospital director?</p>\n\n\n\n<p>Yes. What we know so far is that today the IDF and the Shin Bet released 50 detainees from Gaza, including Muhammad Abu Samama, who is the director of Shifa Hospital. While it may be that he specifically was not involved in Hamas&#8217;s use of the Shifa hospital for Hamas&#8217;s terrorist objectives and anything that Hamas was doing over the last nine months, that does not take away from the fact that we know beyond a shadow of a doubt that Hamas used Shifa Hospital not only as a base for its terrorist attacks against Israel but as a holding point for Israeli hostages over various points in the last nine months. That does not change what we know: the Shifa Hospital is a legitimate point for Israel to be fighting Hamas because Hamas doesn&#8217;t respect Shifa Hospital at all.</p>\n\n\n\n<p><strong>John on X:</strong> &#8220;There&#8217;s an obvious problem with aid distribution in Gaza. What do you think can be done to solve that situation?&#8221;</p>\n\n\n\n<p>It&#8217;s a great question, and we&#8217;ve been talking about it non-stop here and on our personal social media accounts. The good news is that the world already has thousands and tens of thousands of protesters all around the world pretending to care about what&#8217;s going on in Gaza. Those people need to mobilize for the right cause and protest in the streets with signs that say, &#8220;UN, step up your logistics capabilities in Gaza. Bring more trucks into Gaza. Bring more trucks to the Kerem Shalom Crossing so that a thousand trucks worth of aid isn&#8217;t just sitting on the border for days on end, undistributed to the people of Gaza who need it.&#8221; If people around the world truly cared about Gaza, they would be calling on the UN in the streets, on social media, with their public officials, everywhere that they can, to step up their logistics capabilities, send more staff, and send more trucks, and make this a priority to bring the aid that is already in Gaza, that Israel has already brought to the Kerem Shalom Crossing, into the trucks that need to make it around Gaza.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Closing Remarks</h4>\n\n\n\n<p>That&#8217;s all the time we have today. Thank you so much for joining. Tune in tomorrow at 3:00 p.m. Israel time, 8:00 a.m. Eastern time on Twitter, Instagram, YouTube, and again, follow us on all of your podcast platforms after the fact. Thank you for joining and stay safe.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"/hezbollah\">Hezbollah</a>&#8216;s Hassan Nasrallah declared their primary war is with the US, using <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> as a proxy target. <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>’s proxies, including <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a> and <a  href=\"/hamas\">Hamas</a>, threaten regional and global stability. Despite global protests, genuine aid to <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> remains hampered. International unity against Iranian aggression and support for Israel is crucial.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5853,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5843",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5843
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5843",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5843"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5843/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5854,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5843/revisions/5854"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5853"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5843"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5843"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5843"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}