{
    "id": 5908,
    "date": "2024-07-04T15:00:00",
    "date_gmt": "2024-07-04T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5908"
    },
    "modified": "2024-07-05T23:39:37",
    "modified_gmt": "2024-07-05T20:39:37",
    "slug": "hezbollah-shoots-100s-of-rockets-at-israel-daily-briefing-with-ashley-waxman-bakshi",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/hezbollah-shoots-100s-of-rockets-at-israel-daily-briefing-with-ashley-waxman-bakshi/",
    "title": {
        "rendered": "Hezbollah Shoots 100s of Rockets at Israel | Daily Briefing with Ashley Waxman Bakshi"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Hezbollah Shoots 100s of Rockets at Israel | Daily Briefing with Ashley Waxman Bakshi\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/wOVhK8n9_qM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h2 class=\"wp-block-heading\">October 7th War: Day 272 Update</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Current Situation</h3>\n\n\n\n<p>Today is day 272 of the October 7th War. We are interested in peace; we do not want war. That was the message Lebanon&#8217;s foreign minister passed on to Israel. Israel is also interested in peace. Israel also does not want war, but Hezbollah fired at least 100 rockets from Lebanon within 1 hour last night. This morning, sirens wailed in 60 locations across Israel, warning of drones incoming from Lebanon. Firefighters are, as I speak, battling blazes caused by Hezbollah&#8217;s barrages in Israel&#8217;s north because Iran&#8217;s Terror Army in Lebanon, Hezbollah, does want war, and they&#8217;ve been fighting that war against Israel for nearly nine months.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Aggression</h3>\n\n\n\n<p>Since October 8th, Hezbollah has launched 5,000 rockets, missiles, and drones at Israel. They forced 60,000 Israelis to flee their homes. Israel&#8217;s foreign minister replied, &#8220;We need to return our residents to their homes. If it is not through a diplomatic solution, it will be through war because Israel has no choice. We&#8217;ve had peaceful relations with the people of Lebanon before; we&#8217;d like peace with Lebanon right now, but Iran&#8217;s terror agents want death, destruction, and chaos on the backs of innocents in Israel and Lebanon.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Political Situation in Lebanon</h3>\n\n\n\n<p>Politicians in Lebanon this week spoke of the need to cut loose Hezbollah&#8217;s grip on the state. Hezbollah isn&#8217;t just entangling Lebanon in its war against Israel; it is blocking Lebanon&#8217;s presidential election. A popular Lebanese TV host this week outlined her people&#8217;s tragedy: Lebanon&#8217;s institutions are powerless, while Hezbollah&#8217;s Iranian weapons are the only remaining power in the country. She described the people of Lebanon as Hezbollah&#8217;s hostages, like the passengers on airliners hijacked by Al-Qaeda on 9/11 who faced certain death as weapons in an evil plot to murder innocents. As we&#8217;ve mentioned in the past, Hezbollah fights Israel from behind the people of Lebanon, as in the massive Iranian weapon stockpile that they&#8217;re hiding in Lebanon&#8217;s international airport.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hope for Peace</h3>\n\n\n\n<p>We truly hope that Lebanon can take control back from Iran and that Hezbollah backs off and ends its war with Israel before Israel is forced to end the war.</p>\n\n\n\n<h3 class=\"wp-block-heading\">UN and Humanitarian Issues</h3>\n\n\n\n<p>By now, you&#8217;ve heard about the false famine claims and how they were quickly, quietly retracted. You heard about the UN; you heard about how the UN couldn&#8217;t count and hid the numbers showing how much food was actually entering the Gaza Strip. Before the UN manufactures new allegations about Israel blocking food, you should know for the past three weeks, the UN has refused to collect and distribute aid from the main humanitarian crossing, Kim Shalom. The UN has, in part, blamed the pause on gin&#8217;s hijacking aid, and I&#8217;m glad they finally admit that that is happening. But Israel has offered multiple alternatives, including changing the truck routes, changing warehouse locations, changing delivery hours, as well as private security solutions. And for three weeks, as aid sits in the hot sun, the UN has done nothing but wait.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Senior Official&#8217;s Statement</h3>\n\n\n\n<p>There&#8217;s more. A senior official at the UN&#8217;s World Food Program, one of the groups playing along with the false famine lies, was asked how they got it so wrong. Did he apologize? Did he make an excuse? No, he had the audacity to say it didn&#8217;t matter if there was actually a famine. To quote, &#8220;It&#8217;s not the point.&#8221; Maybe he&#8217;s right, but not for the reason he thinks. But because there&#8217;s even more food in Gaza today than before the war that Hamas launched on October 7th. But accountability from the UN might be too much to hope for.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Actual Tragedy Highlighted</h3>\n\n\n\n<p>Another UN report points out an actual tragedy. In many conflict zones, humanitarian aid distribution can lead to sexual exploitation of aid recipients by aid workers. As a result, some women and children in the Gaza Strip are avoiding getting aid so as to minimize the risk of sexual abuse. Unfortunately, the UN says that talking about the problem is bad because media attention could lead to uncontrolled political manipulation. So the UN hushes up actual problems like sexual exploitation of God and women because they would look bad but have no problem amplifying lies against Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p>Alright, let&#8217;s take some questions from our audience watching live now on the various social media platforms. Please continue to submit your questions as I answer.</p>\n\n\n\n<p><strong>Question from Karen on Instagram Live:</strong> What is Lebanon going to do to help stop Hezbollah, and are the other Arab countries going to stop help them too? <strong>Response:</strong> That&#8217;s an excellent question. I believe Lebanon has a responsibility to the Lebanese people to do everything in its power to stop Hezbollah. We&#8217;ve seen how, unfortunately, agreements that were signed in the past, for example, UN Resolution 1701, were not withheld by the Lebanese government and also the United Nations. Nobody enforced it, so we are really hoping and pressuring the Lebanese government and everybody around the world should come together, like you said, including Arab countries around, to come together to find a good resolution that would ensure Israel&#8217;s security as well as the safety of the Lebanese people living on the other side of the border.</p>\n\n\n\n<p><strong>Question from Matan on Instagram Live:</strong> How much aid actually got into Gaza? Can you give us an update? <strong>Response:</strong> Well, there have been thousands and thousands of trucks and dozens of thousands of tons of aid. In fact, I want to just point out something that I&#8217;ve been seeing on social media over the past few weeks. There are videos of restaurants that had closed down that are now opening up again. Shawarma stands, the markets are full and flooded with food as you have seen. Just yesterday, I saw an image of chicken all over the ground that was just being thrown out to the trash because there is so much food going into Gaza that they don&#8217;t even know what to do with it.</p>\n\n\n\n<p><strong>Question from Jacob on Instagram Live:</strong> Can you tell me a bit about what happened yesterday in Carel, and is it part of the fighting going on with Lebanon? <strong>Response:</strong> Okay, so yesterday, good question. Yesterday, a one-man terrorist, an Israeli citizen, stabbed two soldiers in a shopping center in Israel. Luckily, one of the soldiers was able to neutralize the terrorist, and unfortunately, one of the soldiers was killed. This is not a direct part of what is happening in Gaza, but this just shows that Israel is dealing with many threats on many different borders and even from within its borders. What is essential to understand here is that some Arab leadership here in Israel has come out and condemned it, which is great because I believe that partnership between Jews and Arabs within Israel is the only way forward. It just shows that they understand that the radical ideologies that are being infiltrated into Israeli Arab minds, as well as minds all over the world through social media, are not only creating a problematic ideology but people are picking up weapons and turning that into real violence. So we need to be vocal around the world as well as in Israel to not allow radical ideologies to be disseminated online.</p>\n\n\n\n<p><strong>Question from X from Lisa:</strong> Are the media reports about a hostage deal real? Can you give me an update? <strong>Response:</strong> So, of course, there are things happening. You know, I myself am a family member of a hostage, Gam Bellel, who is 19. So, of course, even when we don&#8217;t hear things on the media, there are all the time initiatives and hoping to find ways. Right now, the government is trying to figure out if we can match our demands and Hamas&#8217; demands somehow. Of course, we should be praying; this is a time to pray that somehow we will find a way to bring home the hostages and also ensure Israel&#8217;s security and safety in the future going forward. So there are things going on. I also don&#8217;t think personally that it is responsible to speak about the details of the negotiations on social media platforms as well as on traditional media because sometimes leaked information like that can actually sabotage an agreement and can sabotage bringing the hostages home.</p>\n\n\n\n<p><strong>Question from Katherine:</strong> She is wondering about the situation with Egypt. She has two questions. One is, was Egypt complicit in the smuggling of weapons and activities taking place in the tunnels through Rafah? Her second question is, why didn&#8217;t Egypt open up the Sinai to allow Gaza refugees to enter? <strong>Response:</strong> So Egypt is trying to play a two-faced game. On the one hand, we have peace with Egypt, and there is partnership on certain things. Egypt itself fought off the radical ideologies of the Muslim Brotherhood that was infiltrating Egypt as well. I&#8217;m going to jump to the second question first. The reason why Egypt is not opening its borders is that it doesn&#8217;t want to allow radical ideologies coming out of the Gaza Strip to infiltrate into their country as well. But for your first question, I&#8217;m not entirely sure at this point which of the following is true: Did Egypt actively help smuggle in weapons, or were they just turning a blind eye? In either circumstance, Egypt has a responsibility to not allow terrorist organizations like Hamas to get weapons because it is very clear why they want those weapons and what their intention is, as we&#8217;ve been seeing over the past 17 years. So it&#8217;s a tricky question. One day, we will know exactly how involved Egypt was.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>Thank you very much. That&#8217;s all the time we have today. Make sure you&#8217;re following us on all the social platforms, and we will see you again tomorrow at 3:00 PM Israel time, 8:00 AM Eastern Standard Time. Have a good day.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Today is day 272 of the October 7th War. Despite peace efforts, <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s aggression continues, launching numerous rockets and drones into <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>. <a  href=\"https://iron-swords.co.il/t/the-un/\">The UN</a> faces criticism for mishandling aid distribution and downplaying issues of sexual exploitation. Lebanon struggles with <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>&#8216;s influence, complicating peace and stability in the region.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5911,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5908",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5908
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5908",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5908"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5908/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5910,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5908/revisions/5910"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5911"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5908"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5908"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5908"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}