{
    "id": 6551,
    "date": "2024-07-21T15:00:00",
    "date_gmt": "2024-07-21T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6551"
    },
    "modified": "2024-08-16T11:40:54",
    "modified_gmt": "2024-08-16T08:40:54",
    "slug": "houthis-found-out-price-of-attacking-israel-daily-briefing-with-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/houthis-found-out-price-of-attacking-israel-daily-briefing-with-ruth-wasserman-lande/",
    "title": {
        "rendered": "Houthis Found out… Price of Attacking Israel | Daily Briefing with Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<p><a href=\"https://www.youtube.com/@IsrCitizenSpox\"></a></p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Houthis Found out… Price of Attacking Israel | Daily Briefing with Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/GM3gFqWDAOY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hi everyone, I&#8217;m Citizen Spokeswoman Ruth Werman Lande. It is July 21st, 2024. This is the live Daily Briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on Instagram, X, YouTube, and LinkedIn, and available afterwards wherever you get your podcasts. Please start submitting your questions in the chat and like and subscribe to help us reach a wider audience.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Context and Current Events</h3>\n\n\n\n<p>Today is Day 289 of the October 7th War and the Hamas hostage crisis. 220 is the number of times Iran&#8217;s terror pirates in Yemen, the Houthis, tried to murder innocents in Israel with drones and missiles as part of Iran&#8217;s war on the Jewish State since October 7th. Over nine months, nearly every attack was intercepted, which is probably why you may not have heard about them. If they hadn&#8217;t been stopped, the Houthis might have murdered hundreds, even thousands, of innocents in Israel, a second October 7th Massacre.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Recent Incident</h3>\n\n\n\n<p>On Thursday night, an Iran-made drone got through and narrowly missed the US Embassy Annex, exploding into a residential apartment block in central Tel Aviv. The Houthis proudly took credit for murdering an innocent man in bed and attempting to murder his neighbors. On Saturday, the Houthis found out they cannot murder an Israeli and simply get away from it. After nine months of restraint in the face of unrelenting Houthi attacks, Israel reached out and touched them in the aptly named Operation Longarm. Israel&#8217;s military struck a Houthi base in Yemen nearly 2,000 kilometers (1,200 miles) from Israel&#8217;s borders. The fire in Yemen is being watched across the Middle East. It sends a clear message to Israel&#8217;s enemies: no one gets away with murdering our people. No one.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Message to Israel&#8217;s Enemies</h3>\n\n\n\n<p>These attacks on Israel on seven fronts since October 7th should make everybody pay close attention. Israel seeks no conflict with Yemen, Iraq, Syria, or Lebanon. But if the Houthis, whose banner reads &#8220;Death to Israel, Curse upon the Jews,&#8221; or Iran&#8217;s other terror proxies continue their war on Israel, if they try to commit murder in our cities, we shall stop them.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Broader Implications</h3>\n\n\n\n<p>Iran and its proxies aren&#8217;t only making war on Israel. The Houthis have attacked global shipping for months. Their banner also reads &#8220;Death to America,&#8221; and they&#8217;ve many times tried to murder American naval personnel. Their attempts to blockade the Red Sea have diverted ships away from Egypt&#8217;s Suez Canal, raising global costs and denying crucial income to the largest Arab country. We&#8217;ve previously mentioned Iranian arms smuggling and its attempts to destabilize Jordan. Hamas, also an Iran proxy, launched its rape and murder rampage on October 7th. Another Iran proxy, Hezbollah, hasn&#8217;t just been attacking Israel but has been destabilizing Lebanon too. It also murdered hundreds of US and Western soldiers. The same is true of Iran&#8217;s proxies in Syria and Iraq. The Houthis have attacked Saudi Arabia and the United Arab Emirates with Iranian drones and missiles. The Houthi attack on Israel is part of a multi-front war on the Jewish state and a multi-front war on stability in the Middle East and part of Iran&#8217;s global campaign against the West. Israel&#8217;s strike against the Houthis defends Israel, but it also defends Middle East stability and the West.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Call to Action</h3>\n\n\n\n<p>Stand with Israel. Stand for peace and stability. Now, let&#8217;s take some questions from our audience watching live on social media.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p><strong>Luca on YouTube Live:</strong> <em>How did the Houthi drone manage to get into Tel Aviv, and is Tel Aviv safe?</em></p>\n\n\n\n<p><strong>Ruth Werman Lande:</strong> As I have mentioned, Luca, there were many hundreds of attempts to target Israel, and they were intercepted by Israel&#8217;s technological means. One of them missed. It’s very interesting to note that countries like Yemen do very little to protect their own civilians. When Israel, after intercepting approximately 200 of those attempted attacks, responded, people got hurt because the Yemenis do nothing to protect their own people. In contrast, Israel invests significantly in protecting its civilians, which is why many attacks go unnoticed globally. However, no air defense system is 100% effective, but in most cases, Israeli Defense Forces do intercept the attacks.</p>\n\n\n\n<p><strong>Sarah on YouTube:</strong> <em>Is there any news of a more active involvement against the Houthis by international forces in the Red Sea?</em></p>\n\n\n\n<p><strong>Ruth Werman Lande:</strong> Sarah, more and more countries are realizing this threat to international stability and commerce. Egypt has been badly hurt financially by Houthi attacks on ships going through the Suez Canal. This should concern the entire region and the United States because destabilizing a country with 110 million people can have severe regional and global repercussions. Countries like Saudi Arabia, the UAE, and the US have been intercepting Houthi attempts to destabilize the region. The Houthis’ slogan reads &#8220;Death to America,&#8221; and they&#8217;ve waged war against Saudi Arabia and the UAE. This isn’t just an Israeli-Yemeni war but part of a larger plan to destabilize the region.</p>\n\n\n\n<p><strong>Benny on Instagram:</strong> <em>Will Israel launch a similar attack on Hezbollah in Lebanon to send a message that enough is enough?</em></p>\n\n\n\n<p><strong>Ruth Werman Lande:</strong> Israel seeks no war and has no intention of warring with Lebanon, Yemen, or any other nation. However, these proxies of Iran target Israeli civilians regularly. There is a red line, and while I won’t disclose it, Israel will retaliate if necessary. Israel will not allow the security of its civilians to be compromised. If Hezbollah continues its attacks, they will face consequences.</p>\n\n\n\n<p><strong>Joel on X:</strong> <em>What does the ICJ ruling mean for Israel?</em></p>\n\n\n\n<p><strong>Ruth Werman Lande:</strong> Joel, the ICJ ruling means absolutely nothing as it is non-binding and has no operative consequences. However, Israel takes such rulings seriously but will not compromise its citizens&#8217; safety. If the world is peaceful towards Israel, Israel will reciprocate with peace and stability. Israel seeks economic prosperity and peace but will defend itself against unprecedented attacks like those on October 7th.</p>\n\n\n\n<p><strong>AKA on Instagram Live:</strong> <em>What are your thoughts on the Israeli athletes participating in the Olympic Games in France? Is it important that they attend?</em></p>\n\n\n\n<p><strong>Ruth Werman Lande:</strong> Sports are a wonderful mechanism to bring people closer. However, the demonstrations of extreme Islamists in France shouting against Israel and France itself should be a warning sign. This is not just about Israel or Jews but a broader threat against the West. Despite this, Israeli athletes should participate in the Olympics as part of the international community, but we must remain vigilant about the broader threats.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you so much for all of your questions. We hope to see you tomorrow, same time, same channels.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Ruth Werman Lande discussed <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s defensive actions against <a  href=\"/houthis\">Houthi</a> attacks, the broader implications of <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s proxy wars, and Israel&#8217;s commitment to protecting its civilians. She also addressed international involvement in the Red Sea, the ICJ ruling, and the significance of Israeli athletes participating in the Olympics amid global threats.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6553,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        492
    ],
    "class_list": [
        "post-6551",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ruth-wasserman-lande"
    ],
    "lang": "en",
    "translations": {
        "en": 6551
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6551",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6551"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6551/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6554,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6551/revisions/6554"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6553"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6551"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6551"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6551"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}