{
    "id": 6615,
    "date": "2024-07-25T18:00:00",
    "date_gmt": "2024-07-25T15:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6615"
    },
    "modified": "2024-07-25T19:45:55",
    "modified_gmt": "2024-07-25T16:45:55",
    "slug": "idf-spokesman-update-25-07-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-25-07-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 25.07, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 25.07, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/3Fa12_RJQjo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div><figcaption class=\"wp-element-caption\"><strong>Statement on Rescue Operation</strong></figcaption></figure>\n\n\n\n<p><strong>Introduction</strong> Good evening, last night in a complex operation, IDF forces, alongside the Shin Bet, rescued five hostages who were killed and fell in battle on October 7th. The hostages were:</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Names of the Hostages</strong></h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Maya Goren, Advanced Staff Sergeant in Reserves</li>\n\n\n\n<li>Raviv Aryeh Katz, Master Sergeant in Reserves</li>\n\n\n\n<li>Oren Goldin, First Sergeant in Reserves</li>\n\n\n\n<li>Tomer Yaakov Achimas, First Sergeant</li>\n\n\n\n<li>Kirill Bebrodski, Sergeant</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Details of the Hostages</strong></h2>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Maya Goren</strong>: Aged 56, a member of Nir Oz Kibbutz, a mother of four, and married to Leonard, who was also killed in the same attack. Maya worked as a dedicated and beloved kindergarten teacher, caring for the infants and children of the kibbutz for many years. On October 7th, she was brutally murdered while hiding in the baby house and was taken to Gaza.</li>\n\n\n\n<li><strong>Raviv Aryeh Katz</strong>: Aged 51, a member of Nir Oz Kibbutz, a father of three, and partner to Revital. He was an educator by profession, dedicating his life to educating future generations. He was part of the emergency team in the kibbutz and fought bravely alongside his friends on the morning of the attack. Raviv fell in battle defending his family, community, and homeland, and was taken to Gaza.</li>\n\n\n\n<li><strong>Oren Goldin</strong>: Aged 34, a member of Nir Yitzhak Kibbutz. He grew up in the kibbutz and chose to establish his family there with his wife Oshrit and twin sons, Aviv and Ilai, aged three. Oren managed the kibbutz garage in recent years and was part of the emergency team. On October 7th, with the first signs of attack, Oren rushed towards the fire spots in the kibbutz, fighting bravely and falling in defense of his home and family. He was taken to Gaza.</li>\n\n\n\n<li><strong>Tomer Yaakov Achimas</strong>: Aged 19 from Ramat Gan, served as the driver for the commander of the Southern Brigade. He showed leadership throughout his life, loved the country, and wanted to contribute through his military service.</li>\n</ol>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Rescue Operation Details</strong> </h2>\n\n\n\n<p>The complex rescue operation took place in the heart of the Gaza parking areas. Forces raided the area and located the underground hideout based on precise intelligence from multiple sources, guided by the Shin Bet and Military Intelligence. The hostages were found hidden behind a wall in a tunnel. In recent weeks, an intelligence team from the Hostages Headquarters, alongside the Shin Bet, conducted intensive research to locate and identify the hostages&#8217; bodies hidden in the Gaza area. The 998th Division, which had already operated there, began its activity again in the area at the beginning of the week. So far, the division&#8217;s forces have killed many terrorists and damaged infrastructure in the area. Commando and Diamond Brigade forces operated alongside Shin Bet fighters in the field, shoulder to shoulder. The Shin Bet fighters provided guidance until they reached the area where the hostages&#8217; bodies were hidden in a complex tunnel, approximately 200 meters long and 20 meters underground. The forces performed complex engineering tasks on-site and managed to rescue them.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Post-Rescue Actions</strong> </h2>\n\n\n\n<p>After returning to Israeli territory, representatives from the Personnel Division, alongside the National Center for Forensic Medicine and the Israeli Police, quickly identified the hostages and notified the families as quickly as possible. We are determined to bring all hostages back, dead or alive. Currently, 115 hostages are held by Hamas. It is our moral duty to bring them back. We understand the urgency given the increasing concern for their health and mental state as time passes.</p>\n\n\n\n<p><strong>Ongoing Efforts</strong> IDF forces continue fighting in Khan Yunis, Rafah, and northern Gaza, attacking from the air and ground, applying all necessary pressure to create conditions for the hostages&#8217; quick return. The IDF, Shin Bet, and Mossad continue their efforts to fulfill the primary mission of bringing all hostages back home as quickly as possible.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Announcement of Fallen Soldier</strong>s</h2>\n\n\n\n<p>A short while ago, it was announced that Noam Doak, a tank soldier, fell in battle in Gaza. We express our condolences to his family and embrace them. Alongside the war in Gaza, IDF forces continue to operate on all fronts to thwart terrorism and ensure the security of Israeli citizens. On the northern border, we are fighting at high intensities, killing more terrorists trying to fire into Israeli territory, performing targeted assassinations. We do not forget the distress of northern residents, with IDF forces deployed in the air, sea, and land to defend the north while preparing for the next phase of the battle.</p>\n\n\n\n<p>Yesterday, Captain Ariel Topaz, an intelligence officer who was seriously injured in a vehicular attack two weeks ago at Nir Tzvi Junction, passed away. We express our condolences to his family and will continue to support them in these difficult times and beyond.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Questions and Answers Session</strong></h2>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Question from Dana Yarktsi, Kan 11</strong>:\n<ul class=\"wp-block-list\">\n<li><strong>Q</strong>: Despite public criticism and bereaved families, Major General Shlomi Binder was promoted to Major General and is expected to enter the position of Head of Military Intelligence. How is such an appointment made when no answers have been given to the public or the bereaved families?</li>\n\n\n\n<li><strong>A</strong>: Major General Shlomi Binder is a valuable officer who has contributed greatly to Israel&#8217;s security. In a formal process conducted by the Chief of Staff, along with the Minister of Defense and in coordination with the Prime Minister, Shlomi Binder was appointed to his next role. This matter is also part of a petition in the High Court of Justice where we have presented our case. Shlomi received his rank today and is expected to assume his role. We are committed to presenting our investigations, including those from the Operations Division, and will disclose them to the public.</li>\n</ul>\n</li>\n\n\n\n<li><strong>Question about Muhammad Deif</strong>:\n<ul class=\"wp-block-list\">\n<li><strong>Q</strong>: Is there confirmation of the assassination of Muhammad Deif?</li>\n\n\n\n<li><strong>A</strong>: During my last statement, I mentioned increased signs of Muhammad Deif&#8217;s death in our operation. We confirmed significant strikes in the area, which coincided with the timing of the attacks. We have confirmed intelligence on the death of Raf Al-Salama and will await further confirmation before informing the public about Muhammad Deif.</li>\n</ul>\n</li>\n\n\n\n<li><strong>Question about Hezbollah Drone</strong>:\n<ul class=\"wp-block-list\">\n<li><strong>Q</strong>: How are you preparing to deal with threats like the drone that filmed Ramat David Airbase?</li>\n\n\n\n<li><strong>A</strong>: The drone that filmed the airbase is a serious incident. We do not intend for Hezbollah drones to operate within Israeli territory. However, these small drones pose challenges in identification and interception. This morning, we intercepted a similar drone attempting to enter Israeli territory from Nahariya via the sea using the Iron Dome system. We will continue to counter Hezbollah&#8217;s threats and enhance our capabilities to better intercept aerial threats.</li>\n</ul>\n</li>\n\n\n\n<li><strong>Question from Nir Yaron, Srugim</strong>:\n<ul class=\"wp-block-list\">\n<li><strong>Q</strong>: The Government Activities in the Territories (COGAT) released a video showing bustling markets in Al-Bureij. What is the purpose of presenting this video?</li>\n\n\n\n<li><strong>A</strong>: While I haven&#8217;t seen the video, COGAT works tirelessly on many efforts, including humanitarian ones. We follow the political leadership&#8217;s instructions to manage the humanitarian effort, which allows us to continue fighting. We deliver food, water, and medicines to civilians while distinguishing between Hamas and the civilian population.</li>\n</ul>\n</li>\n\n\n\n<li><strong>Question about Soldier Filming Hostages</strong>:\n<ul class=\"wp-block-list\">\n<li><strong>Q</strong>: A reservist who filmed the bodies of hostages was sentenced to prison and dismissed from service, while no officers have been held accountable for the largest failure in IDF history. How do you explain this discrepancy?</li>\n\n\n\n<li><strong>A</strong>: The reservist acted out of emotion, but his actions were very serious. Filming during an operation with forces on the ground and capturing the bodies of hostages before notifying the families is unacceptable. Regarding the comparison to other commanders or soldiers, we conduct investigations and derive conclusions. Where personal consequences are necessary, they will be applied.</li>\n</ul>\n</li>\n\n\n\n<li><strong>Question from Ynet</strong>:\n<ul class=\"wp-block-list\">\n<li><strong>Q</strong>: When will the next investigations be presented to the public, and will the Operations Division investigation be presented before Shlomi Binder&#8217;s role?</li>\n\n\n\n<li><strong>A</strong>: The focus of the Biri investigation was on community interaction. We plan to apply the same standard to other investigations. Some investigations, like the battle of Bani Arouz, require additional information before being presented. We aim to present investigations on intelligence, defense concepts, and the events of that night to fill the gaps in our understanding.</li>\n</ul>\n</li>\n</ol>\n\n\n\n<p><strong>Closing Remarks</strong> </p>\n\n\n\n<p>Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF and Shin Bet rescued five <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a> killed on October 7th; ongoing efforts continue to locate and return all hostages.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-6615",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 6615
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6615",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6615"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6615/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6618,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6615/revisions/6618"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6615"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6615"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6615"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}