{
    "id": 6950,
    "date": "2024-07-31T03:00:00",
    "date_gmt": "2024-07-31T00:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6950"
    },
    "modified": "2024-07-31T09:46:52",
    "modified_gmt": "2024-07-31T06:46:52",
    "slug": "idf-spokesman-update-07-31-night",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-07-31-night/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 07/31, night"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 31.07, לילה\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Qb4-6L0QvN4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good evening. Tonight, the IDF conducted a focused operation and eliminated Fouad Shukor, also known as Saad Mohsen, the senior military commander of Hezbollah and the head of the organization&#8217;s strategic array. Mohsen also served as the right-hand man and war planning and management advisor to Hezbollah Secretary General Hassan Nasrallah. Mohsen was responsible for the attack on children in Majdal Shams and the deaths of many Israeli and foreign civilians over the years, especially in recent months of fighting.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Public Safety and Defense Measures</h3>\n\n\n\n<p>At this stage, it is important for the public to know that there is no change in the Home Front Command&#8217;s defense policy. I remind you that we have very good air defense systems, but the protection is not hermetic. Therefore, it is crucial to continue adhering to Home Front Command&#8217;s guidelines. We ask the public to remain vigilant. We are currently conducting a continuous situation assessment for the home front. If there are any changes, we will update the public immediately on all platforms and through the Home Front Command channels. I will update here every hour as needed.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Rocket Attack on Majdal Shams</h3>\n\n\n\n<p>There is no change in the Home Front Command&#8217;s instructions. On Saturday evening, Hezbollah launched an Iranian-made Fajr rocket towards Majdal Shams, hitting a football field where dozens of children were playing. Twelve children were murdered. We extend our condolences to the families and wish a speedy recovery to all the injured. The IDF will continue to do everything to protect the citizens of the State of Israel. We will protect ourselves and will not allow the murder of children and Hezbollah&#8217;s presence near the border.</p>\n\n\n\n<h3 class=\"wp-block-heading\">War Readiness</h3>\n\n\n\n<p>We are not looking for war, but we are well-prepared for it. On October 8, Hezbollah joined Hamas in the conflict with Israel. We are fighting with determination, targeting Hezbollah operatives and the organization&#8217;s infrastructure. Hezbollah is a terrorist organization that does not hesitate to murder civilians, including Druze, Jews, Bedouins, Christians, and Muslims. Hezbollah is dragging Lebanon and the entire Middle East into escalation. Residents of the north, we have not forgotten for a moment how your daily life was disrupted on October 8, and since then you have been far from your homes, living in great uncertainty. We are determined to continue fighting and enable the residents of the north to return to their homes safely.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Fighting in Gaza and Hostage Situation</h3>\n\n\n\n<p>Alongside the fighting in the north, we continue to fight in Gaza, where there are still 115 hostages, and we are working and will continue to work in all ways to create the conditions for their release. We are prepared on all fronts with strong defense and high readiness for any scenario. We will continue to act with determination and responsibility to protect the citizens of the State of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p><strong>Question from Ynet News:</strong> &#8220;Is the IDF planning another reserve call-up in light of the tension, and is there an intention to reinforce settlements in the Galilee tonight?&#8221;</p>\n\n\n\n<p><em>Answer:</em> &#8220;We have been at war since October 8. There was a reserve call-up, which is adjusted according to the situation assessment, and reinforcements are sent where needed. In short, we are in a situation assessment, and we will update on any decisions after it ends.&#8221;</p>\n\n\n\n<p><strong>Question from Channel 12 News:</strong> &#8220;Will there be camps or trips tomorrow, and why haven&#8217;t the Home Front guidelines changed?&#8221;</p>\n\n\n\n<p><em>Answer:</em> &#8220;We will change the guidelines when we understand it is necessary. We are now conducting an intelligence and operational situation assessment with the Home Front Command, and we are monitoring the situation. If required, we will change the policy according to areas and provide instructions. We will update on all platforms, and I will address the public here if needed. At this stage, there is no change in the Home Front Command&#8217;s guidelines. All that is needed is vigilance for information and updates. Check in the morning for any updates or changes, and we will inform the public immediately.&#8221;</p>\n\n\n\n<p><strong>Question from Kan 11:</strong> &#8220;From Israel&#8217;s perspective, is this the end of the response to the murder of the children in Majdal Shams?&#8221;</p>\n\n\n\n<p><em>Answer:</em> &#8220;We are in a continuous situation assessment and a multi-front war with Hamas and Hezbollah, and other fronts. Our actions are focused on achieving war objectives, and we will continue to operate accordingly.&#8221;</p>\n\n\n\n<p><strong>Question from Kan Now 14:</strong> &#8220;Is the IDF waiting for Hezbollah&#8217;s response, or will we see continued strikes in Lebanon?&#8221;</p>\n\n\n\n<p><em>Answer:</em> &#8220;We have been acting continuously and decisively against Hezbollah since October 2. The incident in Majdal Shams was severe, and we acted and will continue to act against Hezbollah to achieve war objectives, including the safe return of northern residents to their homes.&#8221;</p>\n\n\n\n<p><strong>Question from Channel 24:</strong> &#8220;How is the IDF preparing for Hezbollah&#8217;s retaliation, and is there coordinated regional defense with the Americans?&#8221;</p>\n\n\n\n<p><em>Answer:</em> &#8220;We are very strong in defense, especially on the northern border, but we are well-prepared on all borders and throughout the country for any scenarios around the clock. We will reinforce where needed. Regarding the U.S., it is our most important ally, and we are in constant communication with them and our security partners, including CENTCOM, since the beginning of the war and tonight as well.&#8221;</p>\n\n\n\n<p><strong>Question from Channel 13 News:</strong> &#8220;Is there an expectation of rocket fire towards the center?&#8221;</p>\n\n\n\n<p><em>Answer:</em> &#8220;Once we know something, we will update the public systematically through Home Front Command&#8217;s guidelines. I ask for vigilance; we are at war, and incidents can occur not necessarily from the northern front. This has happened before in Tel Aviv. We monitor air defense 24/7 in all areas. Regarding the northern front, there is no change in Home Front Command&#8217;s guidelines. We are in a continuous situation assessment. Check the platforms in the morning for updates, and I will address the public here if needed.&#8221;</p>\n\n\n\n<p><strong>Question from Israel Hayom:</strong> &#8220;Will Israel respond to attacks on cities or sensitive installations, or will there be a response to any attack on Israel?&#8221;</p>\n\n\n\n<p><em>Answer:</em> &#8220;I won&#8217;t discuss our actions or plans publicly. We have plans for all scenarios on all fronts, and our readiness is very high.&#8221;</p>\n\n\n\n<p><strong>Question from Makor Rishon:</strong> &#8220;What is the IDF&#8217;s assessment of the continuation of the fighting in the north following this assassination, and how will it affect Hezbollah? When does the IDF think northern residents will be able to return home?&#8221;</p>\n\n\n\n<p><em>Answer:</em> &#8220;Our goal is to achieve all war objectives, including dismantling Hamas and creating the conditions for the return of the hostages. Our goal is to ensure the safe return of northern residents. We must work towards this, and it&#8217;s not possible to set dates or timelines now. We need to achieve the war objectives as defined by the political leadership.&#8221;</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The IDF eliminated a senior <a  href=\"/hezbollah\">Hezbollah</a> leader, maintains high defense readiness, and continues to fight on multiple fronts, ensuring civilian safety.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-6950",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 6950,
        "ru": 6952
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6950",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6950"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6950/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6953,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6950/revisions/6953"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6950"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6950"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6950"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}