{
    "id": 6811,
    "date": "2024-07-27T20:00:00",
    "date_gmt": "2024-07-27T17:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6811"
    },
    "modified": "2024-07-28T10:56:46",
    "modified_gmt": "2024-07-28T07:56:46",
    "slug": "idf-spokesman-update-07-27-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-07-27-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 07.27, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 27.07, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/GvEBJzbjHLE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>This evening, in a severe and very difficult disaster, three Israeli children were killed, and around 20 were injured due to a rocket fired by the Hezbollah terrorist organization that hit a soccer field in the center of Majdal Shams. The victims were all children aged 10 to 20. We share the grief of the bereaved families and embrace the entire Druze community in this difficult time. We extend our support to the injured and wish them a speedy recovery.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Initial Investigation</h3>\n\n\n\n<p>From an initial investigation of the event, a warning was activated, but it was an immediate and very short warning. According to the Air Force investigation, it is currently believed that it was a single rocket. We are now thoroughly investigating this and will release the details transparently to the public. We are in contact with local authorities in Majdal Shams, as we have been throughout the past few months, and have been accompanying them in the past few hours.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Government and Military Response</h3>\n\n\n\n<p>The Minister of Defense and the Chief of Staff are holding several situation assessments with the participation of the head of the Shin Bet, the head of the Mossad, and members of the General Staff Forum, and these are ongoing at this stage.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Current Instructions</h3>\n\n\n\n<p>At this time, there are no changes in the Home Front Command instructions. If there are any changes, we will update through communication channels and the official channels of the IDF and Home Front Command.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Hezbollah&#8217;s Responsibility</h3>\n\n\n\n<p>Hezbollah denies its responsibility for the event, but our intelligence is clear: Hezbollah is responsible for the killing of innocent children, 10-year-old children. Once again, the cruelty of Hezbollah as a terrorist organization is revealed. This is a very serious event, and we will act accordingly. The IDF will do everything to protect the citizens of the State of Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Media Questions</h3>\n\n\n\n<h4 class=\"wp-block-heading\">Kan 11 Question:</h4>\n\n\n\n<p><strong>Question:</strong> Is it not time to also attack the infrastructure of the State of Lebanon and not just the targets of the Hezbollah terrorist organization?</p>\n\n\n\n<p><strong>Answer:</strong> We are currently holding situation assessments. This is a very serious event, a difficult disaster, the most severe incident affecting civilians since October 7th. We are conducting a joint situation assessment with the Chief of Staff, the Minister of Defense, and the heads of organizations to make decisions. We will make decisions together with the political echelon and act accordingly.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Additional Question:</h4>\n\n\n\n<p><strong>Question:</strong> In light of the disaster, might the Chief of Staff&#8217;s current support for a hostage deal change?</p>\n\n\n\n<p><strong>Answer:</strong> I do not address negotiations from here. That is a position of the security establishment regarding the negotiations, which are conducted in the relevant places. I came up for this important statement to address the severe disaster that has struck the entire Druze community, the killing of children. We embrace the Druze community and focus on this issue while simultaneously dealing with all the other important matters in the war arena, including the negotiations for the release of the hostages.</p>\n\n\n\n<h4 class=\"wp-block-heading\">News 12 Question:</h4>\n\n\n\n<p><strong>Question:</strong> Should the public prepare for an escalation in the coming days? Are there any special instructions?</p>\n\n\n\n<p><strong>Answer:</strong> As I said, there is no change in the Home Front Command instructions at this stage. We are conducting a situation assessment. We are in a multi-front war: Gaza, Lebanon, and other arenas affecting us simultaneously. At this moment, I am giving the event and the details related to the event that happened in Lebanon. We will hold a situation assessment, update the public, make decisions, and act accordingly.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Ynet Yedioth Ahronoth Question:</h4>\n\n\n\n<p><strong>Question:</strong> Did the IDF recommend at any point in the war to intensify attacks in the north and was it blocked? And a second question, did Hezbollah target civilians or seek a military target?</p>\n\n\n\n<p><strong>Answer:</strong> The IDF&#8217;s recommendations and the security establishment are given in closed war cabinets where decisions are made. Since October 7th, we have been in very intense fighting in the north, and tonight&#8217;s event is the most severe incident affecting innocent civilians, children. A disaster has struck the Druze community and the citizens of the State of Israel. We embrace them at this moment but also conduct a situation assessment because our job is to protect the citizens of the State of Israel, and we will act accordingly.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>3 Israeli children killed and 20 injured by a <a  href=\"/hezbollah\">Hezbollah</a> rocket in Majdal Shams. IDF and authorities investigating.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-6811",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 6811,
        "ru": 6823
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6811",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6811"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6811/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6813,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6811/revisions/6813"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6811"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6811"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6811"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}