{
    "id": 6286,
    "date": "2024-07-11T20:00:00",
    "date_gmt": "2024-07-11T17:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6286"
    },
    "modified": "2024-07-16T18:28:02",
    "modified_gmt": "2024-07-16T15:28:02",
    "slug": "idf-spokesman-update-11-07-evening",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/idf-spokesman-update-11-07-evening/",
    "title": {
        "rendered": "IDF spokesman update &#8211; 11.07, evening"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עדכון דובר צה&quot;ל - 11.07, ערב\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Sal7b0bMKM4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good evening. Today, we began the process of presenting the military investigations concerning the events of October 7. On that day, the IDF failed in its mission to protect Israeli citizens. We were not prepared for the murderous Hamas terror attack, involving thousands of terrorists who infiltrated the country at numerous points simultaneously, launching a spree of killing, shooting, and kidnapping in the southern settlements and IDF outposts.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Accountability and Investigation</h2>\n\n\n\n<p>We bear the responsibility and duty to investigate what happened, understand where we failed, and determine what needs to be corrected. We must draw the necessary lessons and immediately implement them in our defense methods and combat plans. This responsibility and duty led us, months ago, to initiate a series of operational investigations during the ongoing war, aimed at examining the events of October 7 and the preceding incidents.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Transparency and Findings</h2>\n\n\n\n<p>As we committed, we intend to present the findings transparently and humbly in the coming months. The public deserves answers, and we owe it to the residents and bereaved families to face them directly and answer the most painful and difficult questions. Today, we presented the investigation of the battle at Kibbutz Be&#8217;eri, sharing the findings this morning with the kibbutz residents evacuated to the Dead Sea for the past nine months and with the bereaved families.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Initial Investigation Focus</h2>\n\n\n\n<p>I know some of you may wonder why we are presenting this particular investigation first. It is important for me to explain. We are in the midst of a comprehensive and extensive investigation process, examining deeply the operational and intelligence concepts of the IDF, the senior command&#8217;s conduct on the night of October 7, and the management of battles in the southern settlements. We are presenting the investigations based on their readiness to provide answers to the residents, bereaved families, and families of the hostages who want to know what happened that day. Also, to adjust our defense methods and combat tactics immediately. This investigation is not the end but the beginning.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Kibbutz Be&#8217;eri Incident</h2>\n\n\n\n<p>Kibbutz Be&#8217;eri is home to one of the largest communities in the western Negev region. The kibbutz lost 101 members, 30 of whom were kidnapped, including two additional hostages who found refuge from the Nova party and were kidnapped from the kibbutz. Eleven of them are still held in Gaza. The kibbutz was attacked by dozens of terrorists from multiple entry points, with the number reaching about 30 terrorists by noon on October 7. The fighting lasted three days, during which our forces overcame the terrorists, but at a very high cost. Thirty-one security personnel and members of the emergency response team, IDF soldiers, and police officers fell in the battle.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Heroism and Errors</h2>\n\n\n\n<p>The forces fought bravely, demonstrating extraordinary courage and heroism. Almost no unit involved in the battles emerged without losing a soldier or commander. Alongside acts of heroism and bravery, serious mistakes and errors were made, which were examined in the investigation, and we must acknowledge them. The investigation in Be&#8217;eri was led by Major General (res.) Miki Edelstein. Miki and the investigation team spent hundreds of hours with members of the Be&#8217;eri emergency response team, kibbutz residents, security forces, and commanders who operated in the field. Additionally, thousands of pieces of evidence and materials about the fighting in the kibbutz were collected.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Investigation Conclusions</h2>\n\n\n\n<p>The investigation&#8217;s conclusions are clear: October 7 is one of the hardest days Israel has known since its establishment. The IDF failed in its mission to protect the residents of Kibbutz Be&#8217;eri. It pains me deeply to say this. The IDF should have protected the residents of Kibbutz Be&#8217;eri, but unfortunately, we were not there for many long hours of the fighting. For many hours, Be&#8217;eri residents defended their families with their bodies, facing terrorists alone. Their exceptional courage and resourcefulness helped shape the defense line in the first hours of the fighting, preventing the expansion of the terrorist attack to other parts of the kibbutz. Alongside the emergency response team, the community&#8217;s emergency team also acted bravely, aiding the forces, forming an operational picture, and assisting the residents.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Key Findings</h2>\n\n\n\n<p>After examining the situation, the investigation team presented a series of lessons and conclusions. I would like to briefly describe the main conclusions of the investigation team this evening. The full findings were published this evening on the IDF website and are accessible to every citizen directly and without mediation. From the conclusions, it emerges that in the first seven hours of the fighting, Be&#8217;eri residents fought almost alone against the enemy. Many mistakes by IDF commanders and security forces stemmed from a lack of understanding of the magnitude of the event, lack of an operational picture, and a force deployment built on a scenario that did not match the harsh reality on the ground.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Operational Challenges</h2>\n\n\n\n<p>Despite the accumulation of forces, which at some point reached about 700 IDF soldiers and security personnel, the fighting in the area until late afternoon lacked command and control, coordination, and order among the different forces and units. This caused several incidents where security forces gathered at the entrance to the kibbutz and did not immediately enter the fight. This disorder characterized many combat points during October 7 and is being investigated within the general investigation, which will also be released to the public.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hostage Incident in Be&#8217;eri</h2>\n\n\n\n<p>I want to address the hostage situation at the home of Fassi Cohen, of blessed memory, an event that took a significant place in the Israeli media. It was an extreme siege event involving dozens of terrorists with many hostages in the heart of a combat zone. An event we had not encountered before. The hostages were held by ruthless terrorists who planned to take them to Gaza, and those who failed debated whether to kill the hostages and commit suicide. The investigation team determined that under the complex and difficult circumstances, the Yamam (special police unit), Shin Bet, and IDF acted professionally and orderly, making professional and responsible decisions. They ceased negotiation efforts with the terrorists only after the situation deteriorated and all negotiation attempts to rescue civilians were exhausted.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Tactical Decisions and Outcomes</h2>\n\n\n\n<p>The forces made the decision to use tank fire in a joint decision to try to exert pressure on the terrorists. The decision to attempt a rescue under fire was made after all attempts to negotiate the release of the hostages failed and after a long burst of gunfire was heard from inside the house, raising suspicions that the terrorists were killing the hostages. We conducted an in-depth investigation with the police, Yamam, and Shin Bet, following which we presented our assessment of the circumstances of the hostages&#8217; deaths to the families. The team determined that from the information examined so far, to the best of our knowledge, no civilians inside the building were harmed by tank fire. The team noted that it appears most of the hostages inside the house were murdered by the terrorists. Additionally, one case where hostages outside the building were injured by tank shrapnel, with a high probability that one of them was killed by it.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Future Investigations and Accountability</h2>\n\n\n\n<p>Family members raised difficult questions, and additional cases that need to be investigated were identified. We will investigate these cases together with the families and reach a full understanding of the circumstances. Regarding the performance of the senior commanders at the scene, the investigation team found that they acted in coordination and professionally under particularly difficult circumstances and did everything possible to save the civilians. Unfortunately, the event ended with severe results.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Continued Transparency and Learning</h2>\n\n\n\n<p>These are just some of the conclusions. As mentioned, any citizen who wishes can access and read the findings themselves. It is important to emphasize that this is a developing investigation, meaning any new information will be examined and checked. We understand there will be additional questions and answers that we will need to provide as we move forward. We will be there to provide answers. At this stage, the IDF is implementing the lessons learned from the investigation. The findings remind us of the supreme and clear commandment that every IDF soldier must protect civilians as a top priority, strive for contact, and act as a barrier between civilians and terrorists. We must re-embed this in the best possible way throughout the IDF.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Heroic Acts and Continued Efforts</h2>\n\n\n\n<p>It is important to reiterate the heroism of commanders, soldiers, and police officers in face-to-face battles with terrorists, sacrificing their lives to save the residents of the kibbutz. We will publish all investigations transparently, while maintaining the security of our forces and information where required. This is indeed only the first investigation among many, but it is the beginning of a long and important process of correction and rebuilding trust between the IDF and the public. At the end of the investigation processes, which will allow the formation of a complete picture of the events, decisions will be made, and meanings will be derived.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Ongoing Commitment and Public Trust</h2>\n\n\n\n<p>Beyond the immediate operational conclusions, what stands before us is public trust, reaching the truth, and the duty to create better protection. Israeli citizens deserve better protection. Even at this moment, the IDF is in the midst of a complex multi-front war in the north, in Gaza, in Judea and Samaria, on land, in the air, and at sea. Investigations and reaching the truth are a central value in the IDF to avoid past mistakes and fight better in the present and future.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Questions from the Press</h2>\n\n\n\n<p><strong>IDF Spokesperson&#8217;s Questions:</strong></p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Regarding the House of Fassi Cohen</strong>:\n<ul class=\"wp-block-list\">\n<li><strong>Question</strong>: Was Brigadier General Barak Hiram completely cleared in the investigation, and from the IDF&#8217;s perspective, is he expected to continue to advance to the position of Gaza Division Commander?</li>\n\n\n\n<li><strong>Answer</strong>: This investigation&#8217;s goal was not to exonerate Barak Hiram. Its goal was to investigate the operational investigation of the battle in Be&#8217;eri. All commanders, including Barak, made mistakes like many other commanders, and the investigation addressed that.</li>\n</ul>\n</li>\n\n\n\n<li><strong>Yoav Borowitz from Kan 11</strong>:\n<ul class=\"wp-block-list\">\n<li><strong>Question</strong>: Why does the investigation not address the use of the Air Force on October 7?</li>\n\n\n\n<li><strong>Answer</strong>: This investigation addresses everything that happened in the battle in Be&#8217;eri. The entire use of the Air Force in the battle was discussed in detail and presented in all its components. There will be a full Air Force investigation presented at the General Staff level on all Air Force components on October 7, and it will also be presented to the public.</li>\n</ul>\n</li>\n\n\n\n<li><strong>Future Personal Conclusions</strong>:\n<ul class=\"wp-block-list\">\n<li><strong>Question</strong>: Despite the clear failure in Be&#8217;eri, we have not seen personal conclusions. Are personal sanctions against senior commanders expected?</li>\n\n\n\n<li><strong>Answer</strong>: This is an operational investigation. It contains facts, lessons, and conclusions. In the future, things will be examined, and personal conclusions will be drawn.</li>\n</ul>\n</li>\n\n\n\n<li><strong>Oren Peleg from Haaretz</strong>:\n<ul class=\"wp-block-list\">\n<li><strong>Question</strong>: In light of the Defense Minister&#8217;s speech tonight and the different voices in Israeli society, do the IDF and the General Staff believe a state commission of inquiry should be established to investigate the events of October 7 and the IDF&#8217;s failure that day?</li>\n\n\n\n<li><strong>Answer</strong>: The IDF is committed to conducting operational investigations since its establishment. It is committed to seeking the truth, which is a central value. In many of Israel&#8217;s wars, there were external review committees, and it is appropriate that this be examined externally as well.</li>\n</ul>\n</li>\n\n\n\n<li><strong>Nirn Weinstein from Srugim</strong>:\n<ul class=\"wp-block-list\">\n<li><strong>Question</strong>: Major General Daniel Hagari, The New York Times published in December an investigation claiming that Barak Hiram ordered the tank to fire, even at the cost of civilian casualties. The investigation was widely cited in the Arab media and used as ammunition against the IDF. According to the IDF investigation you presented today, it turns out to be fake news. Were steps taken against The New York Times?</li>\n\n\n\n<li><strong>Answer</strong>: I apologized to the residents of Be&#8217;eri today for giving interviews to the media before the completion of the operational investigation. It was not appropriate, and hurtful remarks were made for the kibbutz residents. I regret that mistake. We should have waited for the end of the operational investigation and presented the findings as I am doing now before the public after the community and the bereaved families received answers from us.</li>\n</ul>\n</li>\n</ol>\n\n\n\n<p><strong>Final Notes</strong>: We revealed summaries and details from the investigation on the IDF website and in your briefing. These are parts of the full report, and the materials on which it is based, including testimonies, will be made available to the public. The investigation team, led by Major General Miki Edelstein, will prepare a final report, which will first be presented to the residents of Be&#8217;eri and the bereaved families. Following that, we will publish what we can, maintaining information security on the IDF website, fully and transparently. Regarding the possibility of an external review committee investigating the IDF, it will receive the investigation reports and materials as conducted in past wars.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The IDF&#8217;s investigation into the October 7 attack highlights failures, heroism, and necessary improvements in defense and operational strategies.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 2764,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-6286",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 6286
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6286",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6286"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6286/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6288,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6286/revisions/6288"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/2764"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6286"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6286"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6286"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}