{
    "id": 5893,
    "date": "2024-07-03T15:00:00",
    "date_gmt": "2024-07-03T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5893"
    },
    "modified": "2024-07-04T10:21:52",
    "modified_gmt": "2024-07-04T07:21:52",
    "slug": "iran-is-trying-to-destroy-jordan-daily-briefing-with-ruth-wasserman-lande",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/uncategorized-en/iran-is-trying-to-destroy-jordan-daily-briefing-with-ruth-wasserman-lande/",
    "title": {
        "rendered": "Iran is Trying to Destroy Jordan | Daily Briefing with Ruth Wasserman Lande"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Iran is Trying to Destroy Jordan | Daily Briefing with Ruth Wasserman Lande\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/LVq-RyUSmAc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hi everyone, I&#8217;m citizen spokeswoman Ruth Wasserman Lande. This is the daily briefing of the Israeli citizen spokesperson&#8217;s office. We are live on YouTube, Instagram, and X. Please begin submitting questions in the chat. Our briefings are now available shortly after broadcast as podcast episodes. Search for the Israeli citizen spokesperson&#8217;s office on Apple Podcasts, Spotify, Amazon Music, and all major podcast platforms.</p>\n\n\n\n<h2 class=\"wp-block-heading\">War Status Update</h2>\n\n\n\n<p>Today, I remind you, is day 271 of the October 7th War. Iran is trying to destroy Jordan. That&#8217;s right, the Arab Kingdom next to Israel is in Iran&#8217;s crosshairs because Iran doesn&#8217;t only seek to destroy the Jewish State. The mullahs have been trying and succeeding in taking over the entire region to establish an Iranian Islamic empire, leaving behind a bloody trail of failed states and launch pads for even more Iranian terror. Iran has already destabilized four Arab countries: Iraq, Syria, Lebanon, and Yemen. These efforts have resulted in devastated cities, hundreds of thousands dead, and millions of refugees. Iran&#8217;s theocratic regime funds and trains the brutal proxy armies behind the barbaric violence in those countries. Jordan is Iran&#8217;s next victim, and this has been happening for some years now.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Influence in Jordan</h2>\n\n\n\n<p>Iran has been pumping arms into Jordan and smuggling thousands of weapons, from rifles and pistols to sophisticated explosives, to Iran&#8217;s Palestinian Islamic Jihad and Hamas agents in the West Bank. The drive-by shootings and terrorist bombs meant to maim and murder people in Israel are only part of Iran&#8217;s evil plan. For Iran, using spies and criminals to sneak weapons through Jordan&#8217;s border is the goal—a perfect way to undermine and collapse Jordan&#8217;s own government, just like in the failed states surrounding it.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Recent Events in Jordan</h2>\n\n\n\n<p>Last year, Jordan prosecuted a member of its own parliament caught smuggling over 200 guns into Israel. Last month, an Amman neighborhood was evacuated completely as Jordanian security forces detonated an explosive stockpile they had found there. Some of the guns are for use inside Jordan against the Hashemite regime. Jordanian sources have long complained of foreign-backed militants sneaking in with rocket launchers and explosives to carry out acts of sabotage against them.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Jordan&#8217;s Response</h2>\n\n\n\n<p>This May, Jordan&#8217;s king publicly called out the smuggling for the first time in front of some of the leaders complicit with Iran. He said, &#8220;We should confront armed militant groups who commit crimes, especially smuggling drugs and arms, which is what Jordan has been thwarting for years.&#8221;</p>\n\n\n\n<h2 class=\"wp-block-heading\">Regional Impact</h2>\n\n\n\n<p>Jordan&#8217;s royal family has always faced challenges ruling its Palestinian majority population. Now, Jordan also houses over half a million Syrian refugees and, despite major supplies of water from Israel, Jordan is always thirsty. It is now low-hanging fruit for Iran. But Jordan is not Iran&#8217;s only target. Iran has been causing chaos across the entire Arab world. Egypt, for example, has expelled the Iranian ambassadors multiple times over the years on charges of espionage. Bahrain cut ties with Iran and blamed them for riots so severe that Saudi troops had to help restore order. Saudi Arabia has been directly attacked by drones and missiles from Iran&#8217;s Yemeni proxies, the Houthis.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Regional Ambitions</h2>\n\n\n\n<p>It&#8217;s no coincidence that most of those countries also have relations with Israel. In Iran&#8217;s April 2024 aerial attack on Israel, Iran&#8217;s proxies across the Middle East joined in the attack, but many of the Arab countries targeted by Iran joined in Israel&#8217;s defense. If Jordan falls, Iran will have yet another front against Israel and the Arab states standing against it. If Jordan falls, Iran will have territorial continuity as it practically already owns large parts of Iraq too.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The October 7th War</h2>\n\n\n\n<p>On October 7th, Iran&#8217;s proxy Hamas declared war on Israel, barbarically raping and murdering festival goers and Israeli families in their own homes in the south of Israel. On October 8th, Iran&#8217;s proxy Hezbollah joined that war with 5,000 rockets, missiles, and drone attacks across Israel&#8217;s north, forcing 60,000 to flee their homes. But the current war of the Islamic Republic of Iran against Israel is only one part of its bloody campaign to take over the region and, in fact, the entire world.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Global Ambitions</h2>\n\n\n\n<p>Yes, it sounds a little bit like a Hollywood production, but unfortunately, it is what it is. The mullahs&#8217; extreme Shiite ideology dictates that they must rule a worldwide Shiite caliphate, which includes taking over the US, Europe, Canada, Australia, and the rest of the non-Islamic world as well as the Sunni Arab world.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Audience Questions</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Ed Hughes on X</h3>\n\n\n\n<p><strong>Q:</strong> Can Israel win over the minds of Gazans and motivate the population to realize Hamas is no longer the answer? How can Israel offer Gazans a way toward prosperity and peace?</p>\n\n\n\n<p><strong>A:</strong> Thank you for that wonderful question. I think the first and foremost issue is to get rid of the extreme factors within the Gaza Strip. When we have extreme factors like Hamas, Islamic Jihad, and so on, they brainwash the population, take away their freedoms, and indoctrinate them. Therefore, as long as they are there, Israel cannot instill any other sentiments. The West cannot instill any good emotions or sentiments in the hearts of the population either. So, the first thing that needs to be done is to get rid of the Islamic extremists like Hamas and Islamic Jihad in the Gaza Strip. The second most important thing is education—re-educating the people in a normal, inclusive, human way, teaching them sciences, humanities, and values that we hold dear in the West, not just death and killing and anti-Semitic and anti-West sentiments. This will take a long time, but it is necessary.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Andrea on YouTube Live</h3>\n\n\n\n<p><strong>Q:</strong> If Jordan and Israel are on the same side, then why doesn&#8217;t Jordan support Israel openly?</p>\n\n\n\n<p><strong>A:</strong> Brilliant question. This brings me to the duality of the policies of Arab countries, which is correct for both Jordan and Egypt. They have populations that are inherently antagonistic to Israel historically and traditionally, and their educational systems enforce and enhance that sentiment. They don&#8217;t want to confront the anti-Israel masses and risk them revolting against the regime. Therefore, they feed the hatred, which is a very dangerous game. They speak one way but act another. They educate the masses against Israel yet signed peace treaties with Israel. It is time to demand that the educational systems be changed for the good of the West, the regimes in those countries, and the people themselves. One example is the United Arab Emirates, which changed its entire educational system recently, and it is working. This takes time, but it is a start.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from YouTube Live</h3>\n\n\n\n<p><strong>Q:</strong> How is Hamas actually being resupplied with ammunition during this time?</p>\n\n\n\n<p><strong>A:</strong> Thank you for that question. This is a very big issue. Many tunnels have been found in the Rafah Crossing from Gaza to Egypt. The Egyptians have allowed or turned a blind eye to Hamas smuggling weapons and parts into Gaza. This is why the IDF had to take over Rafah, to close that smuggling route. Additionally, bodies like UNRWA receive money from Qatar, the UN, and the West, and give that money to Hamas, aiding their smuggling attempts. Hamas had significant underground storage, which the IDF is now destroying. This is slowly cutting off their supply.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Cindy on Instagram Live</h3>\n\n\n\n<p><strong>Q:</strong> I&#8217;ve seen a lot of coverage about the protests happening about the topic of compulsory draft of ultra-Orthodox Jewish men. What do you think about this and how is it affecting Israel?</p>\n\n\n\n<p><strong>A:</strong> As a believing Jew, I think praying to God has kept the Jewish people throughout the centuries. However, military service is compulsory for women and men. The fact that a huge number of ultra-Orthodox and some Arab Israelis do not serve in the army is unequal. A mother of a secular Jewish boy knows he will go to combat, whereas an ultra-Orthodox mother does not. If someone is a true scholar of Jewish thought, it&#8217;s important to continue that tradition. But not all ultra-Orthodox children need to be exempt from the military. This inequality needs to be addressed.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question from Rachel on Instagram Live</h3>\n\n\n\n<p><strong>Q:</strong> If the time comes to it, will Israel be ready to fight on multiple fronts if Iran sends all of its proxies into a joint attack on Israel?</p>\n\n\n\n<p><strong>A:</strong> Rachel, the challenges Israel faces are huge, but this is an existential war. We will fight and win with God&#8217;s help and our brave soldiers. We are already fighting on several fronts—in the West Bank, Gaza Strip, and the north with Hezbollah sending rockets and missiles. We don&#8217;t want more war, but if necessary, we will be ready to fight on multiple fronts.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>Thank you so much for being with us today. I hope you continue to join us tomorrow at 3 p.m. as always.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Ruth Werman Lande, citizen spokeswoman, addresses <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s regional destabilization, highlighting its threats to Jordan and other Arab states. She emphasizes <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s ongoing multi-front war and the need for <a  href=\"https://iron-swords.co.il/t/education/\">education</a> reforms in Arab countries. Audience questions cover <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>&#8216;s future, Jordan&#8217;s stance, <a  href=\"/hamas\">Hamas</a>&#8216;s resupply, and Israel&#8217;s military readiness.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5895,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 209,
        "footnotes": ""
    },
    "categories": [
        180,
        209
    ],
    "tags": [],
    "class_list": [
        "post-5893",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "category-uncategorized-en"
    ],
    "lang": "en",
    "translations": {
        "en": 5893
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5893",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5893"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5893/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5896,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5893/revisions/5896"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5895"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5893"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5893"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5893"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}