{
    "id": 6889,
    "date": "2024-07-30T15:00:00",
    "date_gmt": "2024-07-30T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6889"
    },
    "modified": "2024-07-30T17:34:26",
    "modified_gmt": "2024-07-30T14:34:26",
    "slug": "iran-tells-hezbollah-keep-attacking-israel-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/iran-tells-hezbollah-keep-attacking-israel-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "Iran Tells Hezbollah: Keep Attacking Israel | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Iran Tells Hezbollah: Keep Attacking Israel | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/UTHlBAVp5gM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I&#8217;m Citizen Spokesman Alon Leevy. It is July 30th, 2024. This is the live Daily Briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on Instagram, Twitter, YouTube, and LinkedIn, and available afterwards wherever else you get your podcasts. Please stop submitting questions in the chat. Like and subscribe to help us reach a wider audience.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Current Situation</h2>\n\n\n\n<p>It is day 298 of the October 7th War and the Hamas hostage crisis. All eyes are on Beirut. Flights are cancelled, foreign citizens ordered to leave Lebanon, diplomats warning of Israel&#8217;s response. Hezbollah murdered 12 Israeli children with an Iranian rocket. As Israel&#8217;s prime minister said, Israel will not and cannot let this pass. Our response will come and it will be harsh. That rocket was one of a barrage of 100, one of 6,500 rockets, missiles, and drones launched by Iran&#8217;s Terror Army in Lebanon at the people of Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Tragedy of the Maj Al-Am&#8217;s Massacre</h2>\n\n\n\n<p>There is no overstating the tragedy of the Maj Al-Am&#8217;s Massacre. Those child victims join dozens in Israel who have been murdered since Hezbollah launched its war on October 8th in solidarity with Hamas&#8217;s death squads. Tens of thousands of Israelis have fled their homes and are still displaced. Everyone in Israel lives under the threat of the 200,000 Hezbollah rockets aimed at their families.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Potential Catastrophic Escalation</h2>\n\n\n\n<p>Israel and Hezbollah are on the brink of a potentially catastrophic escalation because the world has failed to stop Iran&#8217;s proxy army in 10 months of constant attacks on Israel. Whatever happens next, it won&#8217;t be the end if Hezbollah and Iran&#8217;s other proxy armies continue their war on seven fronts, which is exactly what Iran says they will do.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Threat and International Response</h2>\n\n\n\n<p>Iran&#8217;s new president, Masud Pesan, met with Hezbollah&#8217;s number two, as well as the head of Palestinian Islamic Jihad and the leadership of Hamas, all of whom took part in the October 7th Massacre. He pledged that supporting these proxy armies is, and I quote, a legitimate duty and one of Iran&#8217;s basic policies. Pesan also threatens serious consequences if Israel acts to stop Hezbollah&#8217;s attacks against its people. Iran wants to destroy Israel. October 7th was the opening shot of a regional war on seven fronts led by a terrorist regime pursuing nuclear weapons and on the way to destroying Israel. Iran will burn Gaza, burn Lebanon, burn Yemen, just as they did to Syria and Iraq. Iran&#8217;s axis of terror will not stop unless it is stopped. The world needs to act now to contain Iran&#8217;s aggression.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israel&#8217;s Stance and International Expectations</h2>\n\n\n\n<p>Israel wants peace with Lebanon, but we are not going to allow it to export Iran&#8217;s bloody war against us. Those watching Beirut must look at Tehran and demand that Iran and its proxy armies end their war against the Jewish state on seven fronts. Tehran is also watching, and not just Beirut, but Washington, Paris, and London. Tehran is watching whether and how the West stands with Israel and against Iran&#8217;s wars on seven fronts. What it sees is key to how Iran will continue fighting its bloody war, including in Lebanon.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The UK&#8217;s Position and International Responsibility</h2>\n\n\n\n<p>The new British government has hinted that it could stop selling Israel some of the weapons that Israel needs to protect its people and to fight the war that Iran and its proxy armies are fighting against it on seven fronts. The new UK Foreign Secretary, David Lammy, said last week that Israel is a country surrounded by people who would love to see its annihilation, and so, in his view, Israel does still need defensive weapons and it wouldn&#8217;t be right to impose a blanket embargo on weapon sales to Israel. But the implication is still disturbing that Britain might still deny Israel some of the offensive weapons it needs to fight its enemies.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israel&#8217;s Need for Support</h2>\n\n\n\n<p>Israel&#8217;s allies know that it is fighting for its life against Iran and its proxy armies on seven fronts against people who seek its annihilation. Israel&#8217;s allies know that it is surrounded by dangerous terrorists who want to kill us all and are pursuing nuclear weapons, and they need to take that to its logical conclusion. It&#8217;s not enough to block the terrorist rockets. Israel needs to be able to destroy their launchers too. War is terrible. Nobody wants an end to war more than Israel, a country that did not start this war, did not want this war, did not expect this war, certainly not the brutal attacks of October 7th and nearly 10 months of constant attacks on our people. Denying Israel the tools it needs to destroy the enemies who want to annihilate it will not bring peace. When Iran sees Israel&#8217;s allies denying its support, it sees a green light for Hezbollah, the Houthis, Hamas, and their other proxy armies to keep trying to murder people in Israel. Rockets and drones got through Israel&#8217;s defenses these last weeks with a bloody, tragic cost in innocent lives. Does the West want Iran to try again? Iran is attacking Israel through its proxy armies and threatening destruction if Israel defends its people. If the West wants to end Iran&#8217;s war because Iran is an enemy of the West, an enemy of the Free World, an enemy of all democracies, then Western countries must back Israel in containing Iran&#8217;s aggression and make sure that Iran sees clearly where they stand.</p>\n\n\n\n<h2 class=\"wp-block-heading\">How You Can Help</h2>\n\n\n\n<p>We will now take some questions. Just a word for those asking how you can help us: please go into the links in the description wherever you are watching, and in the link in bio on our social media accounts, there will be a link to the JAG Give charity campaign, where we warmly invite you to contribute to the Israeli Citizen Spokesperson&#8217;s Office. Those donations are critical for us to be able to continue the fight. And please also sign up to our email list. I promise that we won&#8217;t spam you, but we do want to build a community of people who are committed to helping share the truth and help Israel fight against its enemies in the information war. So we&#8217;ll now take some questions from our audience watching live on social media. Please submit questions wherever you are watching.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A Session</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Question 1: Diplomatic Solution in Northern Israel</h3>\n\n\n\n<p><strong>Golda Schmidt on Instagram:</strong> Do you think a diplomatic solution is possible in Northern Israel?</p>\n\n\n\n<p><strong>Alon Leevy:</strong> Golda, we definitely hope that a diplomatic solution is possible to get Hezbollah away from the border. Because if Hezbollah does not back away, Israel is going to have to push it away. Israel wants to push Hezbollah away from the border to stop the constant rockets on Northern Israel, but more importantly, so people can go home safely without fearing another October 7th-style massacre and hostage-taking event, just like happened in Gaza on October 7th. Israel&#8217;s citizens need to know that they can go to sleep safely in their beds and not wake up in Lebanon in their pajamas. That&#8217;s why Israel is demanding that Hezbollah be pushed away from the northern border past the Litani River, where the United Nations has ordered Hezbollah to go, under resolution 1701 that ended the 2006 war. That war ended with a promise that Hezbollah would back away from the border, and all Israel is asking for now is the implementation of a UN Security Council resolution. Now, this isn&#8217;t going to happen if countries around the world continue to tell Israel to exercise restraint and not to retaliate after Hezbollah murdered 12 Israeli children. It will only happen if there is a serious threat of an Israeli military response, because that&#8217;s creating pressure inside Lebanon where the Lebanese people are going to Hezbollah and saying, &#8220;What the hell do you think you&#8217;re doing attacking Israel from southern Lebanon? Get away from the border, we don&#8217;t want a war.&#8221; So if there is any hope for a diplomatic resolution, it&#8217;s going to be by putting more pressure on Hezbollah to back away from the border. Because we don&#8217;t want to see a war, but need to get our people safely back to their homes. We need to end the war that Hezbollah declared against us on October 8th, one way or another.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question 2: International Community Sanctions</h3>\n\n\n\n<p><strong>Multiple Viewers:</strong> Is there any effort by the International Community to sanction Lebanon for harboring Hezbollah?</p>\n\n\n\n<p><strong>Alon Leevy:</strong> The short answer is no, and I&#8217;ll tell you it&#8217;s been frankly quite frustrating to see the media coverage in recent days that seems to suggest that the rockets are falling out of the sky or coming from nowhere, instead of pointing the finger at Hezbollah and at the Lebanese state. You know, I feel sorry for the Lebanese people because their country has been destroyed by Iran. Hezbollah has taken over Lebanon like a cancer. But Israel needs to hold the Lebanese state responsible for acts of aggression emanating from its soil, and we need allies around the world to demand that Lebanon order Hezbollah to retreat from the border and exercise sovereignty in areas within the Lebanese state. Those attacks will not be tolerated anymore. It&#8217;s not enough to try to sanction Lebanon; it&#8217;s a poor state that has itself been taken over by Hezbollah. We need tough sanctions on Iran. Hezbollah is an Iranian proxy army. It is funded by Iran. It is funded by sanctions relief on Iran that has allowed Iran to become the region&#8217;s dominant power, even though that&#8217;s exactly what supporters of the nuclear deal said would not happen if they sent more money to Iran. So we need world leaders to put more pressure on Iran, more sanctions on Iran, to choke off the funding that they are giving to their terrorist armies. Not only Hezbollah in Lebanon, but also Hamas and Islamic Jihad in Gaza, the Houthis in Yemen, and the militias in Syria, Iraq, and the West Bank as well.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question 3: Impact of Volunteerism from Jews in the Diaspora</h3>\n\n\n\n<p><strong>Adam Dzuker on Instagram Live:</strong> What impact has the volunteerism from Jews in the diaspora had in Israel? Is it just to make us feel good or has it had a real impact?</p>\n\n\n\n<p><strong>Alon Leevy:</strong> Adam, that&#8217;s a great question. The solidarity that Israel has experienced from Jews around the diaspora has made a critical difference because this is a country whose economy has been upended by the war. Just think of all the agricultural workers from around the world who are no longer here. Simply coming to Israel to pick avocados or lemons or peppers or potatoes or whatever it is helps struggling farmers who do not have the manpower to man their fields and keep their businesses afloat. So it&#8217;s really important that people keep coming to Israel on solidarity missions. It&#8217;s not just about making you feel good, it&#8217;s also about helping people in Israel who need all the help they can get, whether it&#8217;s the hostage families or farmers, or it can be something as simple as helping to babysit the children of a woman who now finds herself effectively a single mother because her husband has been in reserve duty for 10 months and that&#8217;s been putting some serious strain on their family life. Just coming and babysitting or taking the dog out for a walk can help them keep their family units together. I&#8217;ve heard from so many people who have come to Israel on solidarity missions that they came to give strength and they leave feeling strengthened. And you know what, if all it does is give you more motivation to keep fighting the good fight for Israel and to keep fighting for the hostages and telling people about what is happening here in Israel and how it is under attack by Iran and its proxy army on seven fronts, then it will be absolutely worth it. I strongly encourage everyone who can come to visit, come visit now.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question 4: Turkey and NATO</h3>\n\n\n\n<p><strong>Call Me Kimmy on Instagram:</strong> Can you talk about Turkey and NATO?</p>\n\n\n\n<p><strong>Alon Leevy:</strong> Hello Kimmy, or Call Me Kimmy. Turkey is a member of NATO. NATO is an international alliance based on the concept of collective security. What that means is that the countries promise to protect each other. If one of them comes under attack, it will be regarded as an attack on all of them, and in theory, they should all come to each other&#8217;s defense. Turkey is the biggest army in NATO after the United States, but it is a deeply problematic country. Just yesterday, Turkey&#8217;s president Erdogan threatened Israel with an invasion, no less. That&#8217;s after his country&#8217;s own rogue military intervention in Libya and its invasion of Northern Syria, which has displaced hundreds of thousands of people and caused immense destruction there. Israel&#8217;s foreign minister has demanded that Turkey be kicked out of NATO. It is unacceptable for the United States and France and Britain and other Western countries to be in a collective security pact together with a country that is threatening Israel with an invasion. It&#8217;s important to understand that Turkey is a deeply problematic actor that is not strengthening regional security in the region but is instead actively hosting Hamas&#8217;s leaders, treating wounded Hamas fighters in its hospitals, and now threatening to join the war that Iran and its proxy armies are waging against Israel on seven fronts. Outrageous statements like this by Turkey&#8217;s leader cannot go unanswered by the international community, or his threats will only escalate. The more countries he threatens to attack, the weaker NATO will be. The more Turkey&#8217;s president goes rogue, the weaker the Western security alliance that is supposed to keep Europe and the United States safe from their common enemies.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question 5: Drews in the North</h3>\n\n\n\n<p><strong>What I Just Said on Instagram:</strong> How are Drews in the north feeling about the IDF response to the attack? Are they satisfied or still threatened to take matters into their own hands?</p>\n\n\n\n<p><strong>Alon Leevy:</strong> The Drews in the north are rightly furious that 12 children were murdered by an Iranian rocket fired by Iran&#8217;s proxy army in Lebanon. But Israel&#8217;s response has not yet come. There has been a back and forth, there have been sirens in the north, Israel has attacked certain Hezbollah targets in Lebanon, but this event is not over. After a drone managed to enter Tel Aviv from Yemen and killed one of my neighbors in Tel Aviv, Israel sent warplanes all the way to Yemen and bombed the port of Hodeidah where the Houthis had terrorist infrastructure. Israel is now vowing that there will be a serious response to Hezbollah, but that has not come yet. As we said in today&#8217;s briefing, other countries are already warning citizens to leave Lebanon and flights have been cancelled because of the expectation that Israel will need to retaliate in a significant manner in order to send a very clear message to Hezbollah that no one gets to murder Israeli children and get away with it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question 6: Media Coverage of Rocket Attacks</h3>\n\n\n\n<p><strong>Jared Ha on Instagram:</strong> How do you explain the headlines about rockets falling out of the sky from the direction of Lebanon without pointing at Hezbollah?</p>\n\n\n\n<p><strong>Alon Leevy:</strong> Jared, that&#8217;s an excellent question. It really is an excellent question why media outlets around the world can&#8217;t point the finger firmly at Hezbollah. I think it has to do with the fact that many governments around the world aren&#8217;t pointing the finger clearly at Hezbollah. You know, the British foreign secretary was right to say that Israel is surrounded by enemies that want its annihilation. Name them. Go tell your governments, go tell your leaders that they need to name and shame Iran and Hezbollah and not be afraid of confronting them and saying, &#8220;You must stop your aggression against Israel because you are dragging the Middle East into a war.&#8221; But if that&#8217;s not the message that we&#8217;re hearing from world leaders, then it&#8217;s not the message we&#8217;re going to hear from the media, when unfortunately many have already fallen into a pattern of trying to present things as if Israel is to blame for everything that&#8217;s wrong in the Middle East, instead of understanding that it is responding to serious, sustained aggression by its enemies on seven different fronts.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>Okay, that&#8217;s all we have time for today. Thank you very much, everyone. Please follow us on all the social media platforms. If you&#8217;re watching on Instagram, follow us on Twitter. If you&#8217;re following on LinkedIn, follow us on YouTube. Please remember, we are also available in podcast format. If you&#8217;re not watching live, please, please, please download the podcast. Send it to your friends and family so they can listen on the train on the way to work or while they&#8217;re driving. Give us 10 minutes of your time, no more each day, so we can arm you with the information, the sound bites, and the talking points that you need in order to keep telling the truth and fighting for Israel as it comes under attack by Iran and its proxy armies on seven fronts. And of course, keep fighting for the freedom of the hostages trapped in the Hamas terror dungeons. Thank you very much, everyone. We&#8217;ll be back tomorrow. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Citizen Spokesman Alon Leevy addresses the ongoing October 7th War and <a  href=\"/hamas\">Hamas</a> hostage crisis. He highlights <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s attacks, <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s support for proxy armies, and the need for global action against Iran&#8217;s aggression. Leevy urges international support for <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and emphasizes the importance of <a  href=\"https://iron-swords.co.il/t/sanctions/\">sanctions</a> and diplomatic pressure.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6890,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-6889",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 6889
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6889",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6889"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6889/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6892,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6889/revisions/6892"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6890"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6889"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6889"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6889"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}