{
    "id": 5855,
    "date": "2024-07-02T15:00:00",
    "date_gmt": "2024-07-02T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5855"
    },
    "modified": "2024-07-02T21:16:01",
    "modified_gmt": "2024-07-02T18:16:01",
    "slug": "iran-proxy-hamas-preys-on-the-weak-daily-briefing-with-doron-spielman",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/iran-proxy-hamas-preys-on-the-weak-daily-briefing-with-doron-spielman/",
    "title": {
        "rendered": "Iran-proxy Hamas Preys on the Weak | Daily Briefing with Doron Spielman"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Iran-proxy Hamas Preys on the Weak | Daily Briefing with Doron Spielman\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/VSuZMvV53C8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I am Doron Spielman, and this is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on social media platforms Instagram, X, and YouTube. Wherever you are watching, you can submit questions into the live chat. These daily briefings are available shortly after broadcast as podcast episodes. Search for the Israeli Citizen Spokesperson&#8217;s Office on Apple Podcast, Spotify, Amazon Music, and all major podcast platforms and find a link across our social media.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Day 270 of the October 7th War</h4>\n\n\n\n<p>Today is day 270 of the October 7th War. Do you know how a terrorist sees the world? They don&#8217;t want to fight battles against soldiers. No, terrorists like Hamas prey on the weak. They look for sleeping families or festival-goers, as they did in the massacre of October 7th. They shoot at innocent people, just like the other Iran-sponsored terror army, Hezbollah, has been doing across Israel&#8217;s north. Terrorists, wherever you find them, are cowards. They don&#8217;t want to fight actual soldiers on the battlefield, and if they do, it&#8217;s only so they can get past those soldiers to cruelly harm unarmed families. This is one of the reasons that Hamas is losing so badly in Gaza. But Hamas, along with the other arms of Iran&#8217;s global terror campaign, is always looking for an opening to find more innocent people to harm.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Weapons Interceptions</h4>\n\n\n\n<p>That is why there are numerous reports of weapons being intercepted on their way to Judea and Samaria, also known as the West Bank. The hundreds of thousands of Israelis that live in Judea and Samaria are the perfect target for Hamas. In fact, that&#8217;s where Hamas has been attacking, targeting families as they drive their children to school, commute to their jobs, and go about their daily lives. It&#8217;s like a subdivision in a neighborhood surrounding any other city, and that&#8217;s why Israeli soldiers are there right now, searching for the terrorists hiding in the hills around Jerusalem and Tel Aviv, just like they hide underneath the sands of Gaza.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Underground Rocket Factory</h4>\n\n\n\n<p>Speaking of the sands of Gaza, just yesterday, Israel released a video of its soldiers who uncovered a massive underground rocket factory hidden beneath Rafah, the Gazan city on the Egyptian border. You might remember the dramatic announcements from around the world telling Israel not to go after the terrorists in Rafah. Foreign ministers of Canada, Germany, France, Italy, Japan, the UK, Australia, Denmark, Finland, the Netherlands, New Zealand, South Korea, and Sweden warned of catastrophic consequences on civilians if Israel&#8217;s military entered Rafah and targeted terrorists. While the world issued warnings against Israel not to go into Rafah, deep beneath the feet of the Gazan people who were settling there, Hamas was assembling the very rockets used to target Tel Aviv and the rest of Israel. They were no doubt smiling and laughing as the world was asking Israel not to go into Rafah, playing directly into their hands, giving them more time to produce and fire more and more rockets against Israeli families.</p>\n\n\n\n<h4 class=\"wp-block-heading\">European Union&#8217;s Stance</h4>\n\n\n\n<p>The European Union said if Israel didn&#8217;t stop its action in Rafah, there would be a heavy strain on their ties. Even the United States claimed that moving Gazans out of Rafah would take months and cause massive civilian deaths. But Israel, despite the stark predictions, successfully evacuated over a million people in how long? Ten days. Not a single civilian was hurt. Our soldiers went into Hamas&#8217; last major stronghold after these civilians were taken out of the way, and there we&#8217;ve been taking apart Hamas&#8217; final battalions in the Gaza Strip. In Rafah alone, in recent days, a thousand identified Hamas terrorists have been neutralized. Israel is finishing the job. Israel is winning.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Consequences of Inaction</h4>\n\n\n\n<p>But what if the pleas and the demands of other countries were heeded? What if Israel had held off? Today, those 1,000 Hamas terrorists who raped and murdered would be planning more October 7ths, more rape and more murder. Hamas leaders continue to reject a ceasefire. It&#8217;s absurd. They&#8217;re even announcing that any future government, not just in the Gaza Strip but in Judea and Samaria and the West Bank, will have to include them. Why? Because just like the Hamas operatives that were hiding under Rafah in the months before Israel entered, months when they heard the constant warnings and threats from around the world demanding Israel back off, Hamas hears the same ultimatums being given against Israel today, and that is proof to them that they can continue to get away with murder as long as the world pressures Israel to stop our actions. Hamas uses these openings to target innocent civilians. The world must understand we must not feed the beast called Hamas. How is that done? By threatening Israel not to go after Hamas. If we do that, if the world does that, Hamas will always take advantage of that opportunity and target innocent civilians.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Iran&#8217;s Proxy Army Hezbollah</h4>\n\n\n\n<p>Iran&#8217;s terror army in Lebanon, Hezbollah, hears the same messages that Hamas hears, which is why they continue to bombard Israel&#8217;s north with 5,000 rockets, missiles, and drones, and why 60,000 Israelis, that is 60,000 men and women, cannot return to their home and have not been there for nine months. Can you imagine leaving your home nine months before, not being able to go back, not being able to go back and save your belongings, see your children&#8217;s bedroom, living in some camp because Hezbollah is constantly targeting your home? While Iran is a country, they fight like terrorists wherever they are. They never brave Israel on the battlefield. Rather, they use their proxies to fight against the innocent. But just as Israel has made it clear that Iran&#8217;s proxy Hamas is finished in Gaza, it will also make clear to Iran&#8217;s proxy in the north, Hezbollah, that their war on Israel will not succeed. Our office and the spokespersons will continue to share analyses about these issues on social media.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Audience Questions</h4>\n\n\n\n<p><strong>Sharon from Instagram Stories:</strong><br>&#8220;How serious do you think the threat is in the north, and should Israel stop going after Hezbollah?&#8221;</p>\n\n\n\n<p>Sharon, I can tell you it&#8217;s a very serious threat. In fact, this is not hypothetical. In the last few days, dozens and dozens of rockets, guided rockets, have struck Israel from the north. Again, this is not Israel&#8217;s north like the United States where you have thousands of miles separating you from the north. From any place in Israel, from Jerusalem and Tel Aviv, the north is an hour and a half drive. You have rockets falling an hour and a half from your major population centers on homes of people who are living in villages. Can we imagine what would happen if we were to aid to Hezbollah and not go after them? Do we actually think that they would just fold up their arms and wave a flag of peace? Of course not. Because Hezbollah is an arm of Iran. They are an arm of terror. They look for innocence and they look for the vulnerable. If we were to let them think that we&#8217;re vulnerable, not to go after them, I guarantee you they would not be waving a flag of peace. They would be waving a Kalashnikov or an anti-tank weapon and firing it at Israeli people. We have no choice. Just as you would protect your own home with your family living inside of it, to go after Hezbollah and remove this threat from our borders. We didn&#8217;t ask for this. No one woke up in Israel on October 6th and said let&#8217;s go to war against the north. But when your home is under attack, you&#8217;ll do anything to protect your family. In Israel, the Israeli people are our family, and we&#8217;re here to protect them.</p>\n\n\n\n<p><strong>X User:</strong><br>&#8220;We don&#8217;t see a lot of coverage where we live about the situation about Israelis who have been evacuated in the north. We only hear this news from official Israeli spokespeople. How is Israel making sure that important topics like these make it into the mainstream news and in general, how is Israel fighting the information war?&#8221;</p>\n\n\n\n<p>That is an excellent question. We are trying to get the messages of Israel&#8217;s north out. That&#8217;s why I&#8217;m speaking about them. That&#8217;s why you see other Israelis speaking about them. However, Hezbollah also knows this, and that means that no one can go to the north to report on these. Why? Because Hezbollah is targeting everyone in the north. It is no man&#8217;s land to keep people out of the way. And we know that there is a global reign of terror that&#8217;s not only taking place on Israel throughout the Middle East, it&#8217;s taking place on social media. And the focus is again and again playing into all these terror armies, all of their fighters, all of their terrorists, and what they claim to be their civilians, which they&#8217;re blaming on Israel. We know that, in fact, the reason that these civilians are being targeted everywhere around Israel is because of Hamas and Hezbollah. But the campaign is very much in your hands. We need more people around the world to echo the travesty that Israel&#8217;s north has been taken hostage by Hezbollah. Again, as I said before, this isn&#8217;t a thousand miles away from Israel&#8217;s centers. This is 90 miles from Tel Aviv and Jerusalem. That is where Hezbollah is acting. And I ask everyone out there, this has got to be a grassroots initiative where people understand this travesty, adopt it, and take it to the world. That is your job. We can&#8217;t do everything. That&#8217;s why we call on the people around the world that are watching this to take a stand. In a silent room, it only takes 10 people to stand up and make slurs against Israel. There needs to be 20 of you to stand up and let the real news reach the rest of the world.</p>\n\n\n\n<p><strong>Instagram Stories User:</strong><br>&#8220;What&#8217;s the current situation with Egypt and how are the relations between Israel and Egypt?&#8221;</p>\n\n\n\n<p>The situation with Egypt is incredibly complicated. It&#8217;s no secret to the world that one of the things that we found when we went into Rafah were dozens and dozens of tunnels leading from Gaza into Egypt. Now, these aren&#8217;t tunnels that you crawl through. These are tunnels that you can bring a semi-truck through. These are massive tunnels, and the way that Gaza and Hamas were armed, all of those arms came from Egypt. The smuggling from Egypt into Gaza reached the highest echelons of the Egyptian administration, and this was how Hamas compiled their arms, gathered their arms over the last 15 years. So, Israel&#8217;s relationship with Egypt, there is what we call a cold peace. However, we are looking with very open eyes at what&#8217;s happened, and we&#8217;re waiting for Egypt to take action to make sure that this never ever happens again.</p>\n\n\n\n<p><strong>Hillary on Instagram Live:</strong><br>&#8220;Is it possible that the hostages are no longer in Gaza? Do you think that maybe they could have been smuggled out to Egypt and now they could be anywhere in the world?&#8221;</p>\n\n\n\n<p>Hillary, thank you for the question. It&#8217;s certainly a very big fear. We have to understand these hostages, they are not just the children and mothers and fathers of a specific family. These are the children, mothers, and fathers of the entire state of Israel. We are all beating with one heart right now. The story of a hostage, God forbid found dead, shocks this nation. And when there was this heroic rescue of four hostages just two weeks ago, the entire nation celebrated. These are our own family members. From our intelligence, the vast majority of the hostages are inside the Gaza Strip, and that is the premise that Israel is taking by going after Hamas and putting so much military pressure on Hamas that they have no choice but to return Israeli hostages. I&#8217;m not going to say for sure until we bring all of our hostages home that all of them are in Gaza, but I can tell you wherever our hostages are, Israel will never ever sleep until every one of those people, wherever they are being kept in dungeons by Hamas murderers and rapists, is brought home.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Conclusion</h4>\n\n\n\n<p>Thank you very much for joining me on the Israeli Citizen Spokesperson&#8217;s Office. We&#8217;re here every single day bringing you live updates at 3 p.m. Israel time, 8 a.m. Eastern Standard Time. We&#8217;re across all social media platforms. Stay tuned. We&#8217;ll be bringing you more information tomorrow.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/he/t/doron-spielman/\">Doron Spielman</a> addresses <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>-proxy <a  href=\"/hamas\">Hamas</a> and <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s attacks on Israeli civilians, emphasizing their cowardice and reliance on targeting innocents. Despite global warnings, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> successfully evacuates civilians and dismantles terrorist strongholds. The discussion includes questions about <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hezbollah/\">Hezbollah</a>&#8216;s threat in the north, Egypt&#8217;s relations, and concerns for <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>&#8216; safety.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5857,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5855",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5855
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5855",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5855"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5855/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5858,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5855/revisions/5858"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5857"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5855"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5855"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5855"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}