{
    "id": 6256,
    "date": "2024-07-14T15:00:00",
    "date_gmt": "2024-07-14T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6256"
    },
    "modified": "2024-08-16T11:42:47",
    "modified_gmt": "2024-08-16T08:42:47",
    "slug": "mohammed-deif-a-ticking-bomb-daily-briefing-with-daniel-rubenstein",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/mohammed-deif-a-ticking-bomb-daily-briefing-with-daniel-rubenstein/",
    "title": {
        "rendered": "Mohammed Deif: A Ticking Bomb | Daily Briefing with Daniel Rubenstein"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Mohammed Deif: A Ticking Bomb | Daily Briefing with Daniel Rubenstein\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/fRKjaFxHc-k?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I&#8217;m Daniel Rubenstein. Today is July 14th, 2023, and this is the daily briefing of the Israeli citizen spokesperson&#8217;s office. We are live on social media platforms YouTube, Instagram, LinkedIn, and Twitter. You can start submitting questions in the chat. I&#8217;ll get to as many as I can at the end, and if I don&#8217;t get to your question in this briefing, you can tag my personal accounts on whichever platform you&#8217;re watching, and I&#8217;ll try to answer you after this broadcast is over.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Assassination Attempt on Former President Donald Trump</h3>\n\n\n\n<p>Israelis woke up to the news of an assassination attempt on former President Donald Trump. The people of Israel are following the story closely, but our attention is also focused on a crater in the ground outside the city of Khan Yunes in Gaza as we wait to hear the fate of Hamas October 7th mastermind, Muhammad Da.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF Air Strike on Hamas Warlords</h3>\n\n\n\n<p>Yesterday, the IDF carried out a precise air strike against two of Hamas&#8217;s most dangerous warlords in the Gaza Strip. One of the senior Hamas targets was Muhammad Daif.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Who is Muhammad Daif?</h4>\n\n\n\n<p>Muhammad Daif was the terrorist mastermind of the October 7th massacre in Israel&#8217;s most wanted man for three decades. Daif is Hamas&#8217;s number two warlord in Gaza after Yahya Sinwar. The other senior target in the Israeli air strike was Rafat Sal, the commander of Hamas&#8217;s Khan Yunes Brigade. Sources in Hamas confirmed that Sal was killed. We&#8217;re still waiting to hear about Muhammad Daif. Muhammad Daif is the head of Hamas&#8217;s army of terror. He is the commander-in-chief of Hamas&#8217;s terrorist military, the Izz ad-Din al-Qassam Brigades. It was Muhammad Daif who ordered 3,000 Hamas terrorists to invade Israel on October 7th. It was Muhammad Daif who sent Hamas death squads to massacre hundreds of people at a music festival, to gun down people in their cars, to burn families alive in their homes, and to take toddlers and grandmothers as hostages. It was Muhammad Daif who planned the bloodiest massacre of Jews since the Holocaust. It was Muhammad Daif who urged Palestinians on October 7th to rise up and murder Israelis wherever they found them. Soon after Hamas launched its invasion on October 7th, Al Jazeera aired an audio recording of Daif. He announced the beginning of the operation named Al-Aqsa Flood. He said, &#8220;I say to our pure mujahedin, this is the day that you make this criminal enemy understand that its time is up. Kill them wherever you may find them.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Muhammad Daif&#8217;s History</h3>\n\n\n\n<p>Muhammad Daif has been massacring Israelis since the mid-1990s. He was responsible for suicide bombings that killed dozens of innocent civilians. Saying Muhammad Daif has blood on his hands is an understatement; his hands are soaked in blood. Daif is the ticking time bomb of all ticking time bombs. If Israel managed to eliminate him, it will have dealt a major blow to Hamas&#8217;s army of terror and mark a turning point in Israel&#8217;s war to destroy it. Israel must bring home all of the hostages and bring down the masterminds of the October 7th massacre. Israel&#8217;s enemies must know Israel will go to the ends of the Earth to bring its people home to safety and their tormentors to justice.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Reports and Media Coverage</h3>\n\n\n\n<p>I&#8217;ve seen reports that the IDF air strike took place in an area that the IDF had designated a humanitarian zone for civilians in Gaza. We must be very clear: Israel has never said that Hamas terrorists are immune from attack if they enter a civilian zone. Hamas terrorists are legitimate military targets. If it is true that Muhammad Daif and other Hamas terrorists were hiding in a designated humanitarian zone, it shows that Hamas sees civilians in Gaza not only as human shields but as human sacrifices. Muhammad Daif has survived multiple assassination attempts in the past. It remains to be seen if he survived the most recent attempt to target him. Israeli Prime Minister Benjamin Netanyahu said yesterday, &#8220;The Hamas murderers are dead men walking. From the first of them to the last, we will settle accounts with them.&#8221; It&#8217;s not only Israel that wants to settle accounts with Daif. Daif is on the US State Department&#8217;s list of specially designated global terrorists. He is responsible for the murder of dozens of American citizens, including on October 7th. I&#8217;m sure many of you have heard President Biden and other Americans who have warned Israel not to repeat the mistakes that the United States made in the aftermath of the 9/11 attacks. Israel is doing its best to take the advice. It took the United States 10 years to hunt down Osama Bin Laden after the 9/11 attacks and five years to reach ISIS leader Abu Bakr al-Baghdadi. If it is confirmed that Daif was removed from the battlefield yesterday, Israel can say that it only took nine months to target the mastermind of Israel&#8217;s 9/11.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Casualties and Media Reporting</h3>\n\n\n\n<p>In the hours after Israel&#8217;s strike on the two Hamas arch-terrorists, Hamas published a statement saying that 71 people were killed in the strike and 290 were injured. Hamas did not mention how many Hamas combatants were killed or who they were. You&#8217;d think that&#8217;s a relevant detail, but major news outlets like the Associated Press, the BBC, and CNN reported Hamas&#8217;s claims without criticism and sent out push notifications about 71 killed to millions of people. Senior editors at major news outlets simply don&#8217;t care that the organization feeding them information on casualties in Gaza is the same organization that carried out the October 7th massacre. Hamas is not a credible source. Hamas&#8217;s claims should not be amplified via push notifications. It seems like the mainstream media has a different opinion about this. They want the clicks; they want the outrage; they want the attention. They don&#8217;t appear to be open to criticism or to common sense. That&#8217;s why it&#8217;s important that people like you tell the truth about Hamas when everyone else seems happy to amplify misinformation.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p>Let&#8217;s take some questions from our live audience. Again, we&#8217;re on YouTube, Instagram, LinkedIn Live, and also Twitter/X. Be happy to hear from some people who have questions now.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Beit on Instagram Stories</h4>\n\n\n\n<p>She&#8217;s wondering, is Muhammad Daif really dead?</p>\n\n\n\n<h4 class=\"wp-block-heading\">Answer</h4>\n\n\n\n<p>We are still waiting on news to find out the fate of Muhammad Daif. Hamas has not made any announcement, nor has the Israel Defense Forces, who I&#8217;m sure is trying to monitor the situation on the ground to pick up any Hamas communications. But right now, we simply don&#8217;t know. We have not heard anything, and we are waiting.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Clara</h4>\n\n\n\n<p>Do we think that the assassination attempt on Muhammad Daif will hinder the hostage deal?</p>\n\n\n\n<h4 class=\"wp-block-heading\">Answer</h4>\n\n\n\n<p>It remains to be seen. I have seen mixed communication from Hamas on this. There was one report that Hamas said it was ending negotiations, another report that said it was not true. There is a deal that remains on the table, President Biden&#8217;s framework, which Israel has accepted, and it&#8217;s time that Hamas accepts this deal, ends the war that it started, and releases the Israeli hostages that it&#8217;s been holding in its terror dungeons for more than nine months.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Follow-up Question about the Hostages</h4>\n\n\n\n<p>How many hostages are estimated to still be alive?</p>\n\n\n\n<h4 class=\"wp-block-heading\">Answer</h4>\n\n\n\n<p>The last number that I saw is 120 total hostages in Gaza. As far as the number alive, again, I&#8217;ve seen different reports ranging from an estimated 50 to 100. There are a number of hostages that have been confirmed dead, but their bodies are still being held by Hamas in Gaza, and Hamas is still demanding a price for them to be returned home. It is Israel&#8217;s policy, its mission, and its goal to return home every hostage, dead or alive, whether for a proper funeral or we hope reunification with their family and friends back in Israel.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Ariel on Instagram Live</h4>\n\n\n\n<p>Do we have any idea if Sinwar is still in Gaza, or is it possible that he has escaped, possibly through a tunnel leading to Egypt?</p>\n\n\n\n<h4 class=\"wp-block-heading\">Answer</h4>\n\n\n\n<p>There has not been any official report or confirmation about Sinwar&#8217;s location. There have been many guesses that perhaps he has left Gaza and entered Egypt, perhaps he is deep underground in Khan Yunes. The working assumption is that Sinwar remains in Gaza. It is not clear how communications are reaching him or how his communications reach the outside world, but our working assumption is that he remains in Gaza until we discover something else.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Eli on Instagram Live</h4>\n\n\n\n<p>What is Israel going to do in order to safely return its citizens from the north to their homes since it seems clear that Hezbollah is not interested in joining any peace agreements?</p>\n\n\n\n<h4 class=\"wp-block-heading\">Answer</h4>\n\n\n\n<p>Thank you, Eli. You raised an important issue that is often neglected in the international media because it&#8217;s not immediately visible. But on October 8th, this is one day after October 7th, Hezbollah joined the war that Hamas started. Hezbollah almost every day since October 8th has fired anti-tank missiles, rockets, and suicide drones into Israel. What this means for the people living in Northern Israel within range of these anti-tank missiles, which are direct and accurate, is that these people need to evacuate their homes. So we have had about 60,000 Israelis in Northern Israel who have been evacuated from their homes to safer areas. They are waiting for some type of solution that will allow them to return to their homes. Israel has been saying that Hezbollah must move back from the border or it will be pushed back. What we are hoping for is a diplomatic solution. I know the Americans are involved in mediating between Lebanon, between Hezbollah and Israel, but if a diplomatic solution cannot be found, a military solution will have to be applied that allows Israelis to return to their homes safely without fearing that Hezbollah will carry out another October 7th massacre with very little warning.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Final Question from Instagram Live</h4>\n\n\n\n<p>I&#8217;m wondering if Israel will be capable of the deradicalization process of Gaza after the war is finished?</p>\n\n\n\n<h4 class=\"wp-block-heading\">Answer</h4>\n\n\n\n<p>That&#8217;s the million-dollar question. The &#8220;day after&#8221; is what people are referring to. What is the plan for Gaza the day after? Who&#8217;s willing to step in? Who is going to govern Gaza? Who is going to deradicalize Gaza? I don&#8217;t think this is something that Israel can do by itself. It needs the cooperation of its partners in the region, and Israel does have many partners in the region. They don&#8217;t always show themselves in the media, but I can assure you that there are many countries in the Middle East that are looking for solutions in Gaza. Israel&#8217;s partners in the Abraham Accord, such as the UAE, Bahrain, and quietly Saudi Arabia, are in a much better position to deradicalize Gaza after the war, to have a better education system, to promote peace, to promote coexistence. This is something that I hope will be part of a grand bargain in the region, a bigger deal that ends the war in Gaza and in the north. It&#8217;s important to think about the day after, but our focus, unfortunately, is that the war is still going on. Hamas is continuing to fight. Hamas is continuing to target Israelis, to plan attacks. It has not stopped for one moment the war that it started on October 7th. It continues to hold 120 Israeli hostages in its terror dungeons. So while we&#8217;re thinking about the day after, we&#8217;re living the day of, and this is our reality.</p>\n\n\n\n<p>One thing I will add is just as we were going live, I saw news of a terror attack in central Israel, a car ramming where a terrorist used his car as a weapon and drove into Israelis at a bus stop. I saw four people were wounded, two seriously. This is something that is not new. We have seen this activity in the past where some type of lone wolf terrorist becomes inspired to kill Israelis. This is something that is happening in addition to the multiple fronts that Israel is dealing with from Gaza and the West Bank and Syria and the militias in Iraq and Lebanon and Yemen and Iran itself. Even within Israel, there are people who are committed to carrying out terrorist attacks, and unfortunately, Israelis have to remain vigilant at all times.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>That is the end of today&#8217;s daily briefing. I thank you for tuning in. Again, if you want to follow me personally on my social media platforms and follow up with me on Instagram, my name is Ruby Guides Israel, R-U-B-Y Guides Israel. On Twitter/X, you can find me at Paul Rubin, P-A-L-R-U-B-I-N. If you&#8217;ve watched this far, thank you so much. Thanks for following, and we&#8217;ll see you back tomorrow live at 3 PM Israel time, 8:00 AM on the East Coast of the United States. Thank you again and be well.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>In a daily briefing, <a  href=\"https://iron-swords.co.il/he/t/daniel-rubenstein/\">Daniel Rubenstein</a> addresses an assassination attempt on former President Trump, IDF airstrikes on <a  href=\"/hamas\">Hamas</a> leaders, and the ongoing conflict. He provides <a  href=\"https://iron-swords.co.il/c/updates/\">updates</a> on Muhammad Daif&#8217;s status, hostage negotiations, and <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s actions. Rubenstein emphasizes the importance of media accuracy and answers audience questions on various issues.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6258,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1312
    ],
    "class_list": [
        "post-6256",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-daniel-rubenstein"
    ],
    "lang": "en",
    "translations": {
        "en": 6256
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6256",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6256"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6256/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6259,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6256/revisions/6259"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6258"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6256"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6256"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6256"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}