{
    "id": 5928,
    "date": "2024-07-06T15:34:47",
    "date_gmt": "2024-07-06T12:34:47",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5928"
    },
    "modified": "2024-07-06T15:34:51",
    "modified_gmt": "2024-07-06T12:34:51",
    "slug": "neturei-karta-the-ultra-orthodox-anti-zionist-group",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/neturei-karta-the-ultra-orthodox-anti-zionist-group/",
    "title": {
        "rendered": "Neturei Karta: The Ultra-Orthodox Anti-Zionist Group"
    },
    "content": {
        "rendered": "\n<p>Neturei Karta (NK), an international ultra-Orthodox anti-Zionist group with a significant base in the U.S., positions itself as a religious authority on Zionism and Israel. The group claims to “pray for the peaceful dismantlement of the state of Israel.”</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Origins and Beliefs</strong></h4>\n\n\n\n<p>Founded in 1938, “Neturei Karta” (Aramaic for “Guardians of the Gates”) opposes the modern state of Israel. They believe that only God can restore Jewish sovereignty in the land of Israel by bringing the Messiah, hence they reject the Jewish people&#8217;s right to self-determination in the current political state.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Controversial Alliances and Activities</strong></h3>\n\n\n\n<p>Neturei Karta (NK) is known for its extreme anti-Zionist stance and controversial alliances. The group has often aligned itself with international anti-Semites, Islamic extremists, and organizations advocating violence against Israel. Leaders of NK have met with Iranian President Mahmoud Ahmadinejad multiple times in both New York and Tehran, as well as with leaders of Hamas in Gaza and Hezbollah in Lebanon.</p>\n\n\n\n<p>One of the most notable instances of their controversial activities was in December 2006, when NK members attended a “Holocaust Review” conference in Tehran, which was attended by numerous Holocaust deniers. During this conference, Rabbi Yisroel Dovid Weiss affirmed the reality of the Holocaust but controversially claimed that Zionists had &#8220;collaborated with the Nazis&#8221; and &#8220;thwarted efforts to save Jews.&#8221;</p>\n\n\n\n<p>In 2012, NK leaders continued their controversial engagements. They met with high-ranking Hezbollah officials on at least two occasions. In March, they participated in a “Global March to Jerusalem” and laid a wreath at the tomb of Hezbollah terrorist Imad Mugniyeh. In June, they attended a conference in Lebanon on the Israeli-Palestinian conflict, where they met with Hezbollah leader Sheikh Nabil al-Kauk. More recently, in 2023, NK members met with Iranian President Ebrahim Raisi, expressing gratitude for Iran&#8217;s treatment of its Jewish community.</p>\n\n\n\n<p>These actions have drawn significant condemnation from other Jewish groups and mainstream Jewish organizations. Many view NK&#8217;s actions as extreme and damaging, highlighting the group&#8217;s willingness to associate with some of the most radical and hostile elements against Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Media Presence and Ideology</strong></h3>\n\n\n\n<p>Leaders of Neturei Karta (NK), such as Dovid Feldman and Yisroel Dovid Weiss, frequently appear on networks like Al-Jazeera and Iran’s Press TV, proclaiming that Jews do not support Israel. In a 2012 interview with Al-Jazeera, Weiss stated, “Zionism has created rivers of blood&#8230;this is against the will of the Almighty and this is not what it means to be a Jew.”</p>\n\n\n\n<p>Despite their media presence, the broader Jewish community, including many ultra-Orthodox groups, disavows and repudiates Neturei Karta. Their views do not represent the majority of Jews, who largely reject NK&#8217;s ideology. Nonetheless, their visible presence at anti-Israel protests often gives the mistaken impression that their views are more widely held.</p>\n\n\n\n<p>In the U.S., NK leaders, primarily based in Brooklyn and Monsey, New York, regularly participate in anti-Israel demonstrations. At these events, they often use vitriolic rhetoric, likening Israelis to Nazis, calling Israel a “cancer,” and accusing Zionists of controlling the media. NK’s motto, “Judaism does not equal Zionism,” reflects their belief that supporting Zionism strips a Jewish person of their Jewish identity. During a protest in July 2010, members chanted, “Netanyahu is not a Jew!” to emphasize their stance.</p>\n\n\n\n<p>Additionally, NK leaders engage in various anti-Israel programs on campuses, participating in events like Israeli Apartheid Week and protests during Israeli military operations. They often serve as the &#8220;Jewish representatives&#8221; at interfaith events organized by pro-Palestinian student groups.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Neturei Karta (NK), an international ultra-Orthodox anti-Zionist group with a significant base in the U.S., positions itself as a religious authority on Zionism and <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>. The group claims to “pray for the peaceful dismantlement of the state of Israel.”</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5930,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [],
    "class_list": [
        "post-5928",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts"
    ],
    "lang": "en",
    "translations": {
        "en": 5928
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5928",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5928"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5928/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5931,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5928/revisions/5931"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5930"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5928"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5928"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5928"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}