{
    "id": 6065,
    "date": "2024-07-09T15:00:00",
    "date_gmt": "2024-07-09T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6065"
    },
    "modified": "2024-07-09T20:46:07",
    "modified_gmt": "2024-07-09T17:46:07",
    "slug": "pressure-hamas-to-free-hostages-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/pressure-hamas-to-free-hostages-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "Pressure Hamas to Free Hostages | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Pressure Hamas to Free Hostages | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/ZNH2U_m-vCM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I&#8217;m citizen spokesman Eylon Levy. This is the daily briefing of the Israeli citizen spokesperson&#8217;s office. We are live on YouTube, Instagram, and Twitter. Please begin submitting questions in the chat. Search for the Israeli citizen spokesperson&#8217;s office on all major podcast platforms for an audio-only version each day and please like and subscribe to help us reach a wider audience.</p>\n\n\n\n<h2 class=\"wp-block-heading\">War Context</h2>\n\n\n\n<p>Today is day 277 of the October 7th War, just over 9 months since Hamas declared war on Israel with its brutal massacre and since Hezbollah joined its fellow Iranian proxy army with daily attacks on Northern Israel from Lebanon. Iran isn&#8217;t a threat just to Israel; it&#8217;s a threat to the whole free world.</p>\n\n\n\n<h2 class=\"wp-block-heading\">NATO Summit</h2>\n\n\n\n<p>Today, 38 national leaders are meeting at NATO&#8217;s Summit in Washington. They&#8217;ll focus on the carnage in Ukraine on NATO&#8217;s Eastern flank, discuss the fighting in Gaza and Lebanon, and the attacks on their ally Israel. They must remember there is a link between these wars: that link is Iran.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Threat</h2>\n\n\n\n<p>The war that Hamas brutally declared on the people of Israel on October 7th and the war that Hezbollah has been waging on Israel&#8217;s North since October 8th are only two parts of Iran&#8217;s multi-front campaign. Iran is trying to take over the Middle East and it&#8217;s sowing terror throughout the world. Iran&#8217;s proxy armies have destabilized four Arab countries: Iraq, Syria, Lebanon, and Yemen, and Iran is using those countries as launchpads for even more terror.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Proxy Armies</h2>\n\n\n\n<p>Iran is behind years of attacks on troops of NATO States, they&#8217;ve killed hundreds, even thousands. Just two weeks ago, Hezbollah, Iran&#8217;s terror army in Lebanon, threatened to attack Cyprus, an EU member state and home to thousands of British troops. Iran, together with authoritarian regimes like China and North Korea, has been supplying weapons, some of the same rockets, missiles, and drones launched against Israel, to Russia for its war against the people of Ukraine.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Missile Threat</h2>\n\n\n\n<p>Iran&#8217;s massive ballistic missile attack on Israel in April was the biggest in history after only Russia&#8217;s attack in the first hours of the Ukraine war. Russia is attacking Ukraine with missiles; Iran and its proxies are attacking Israel with missiles, and Iran is supplying weapons to Russia. Israel has long been warning about Iran&#8217;s nuclear weapons program and about the long-range missiles that Iran is developing to carry those bombs. Iran&#8217;s missiles are estimated to reach up to 2,000 km – that&#8217;s as far as Greece, Romania, Bulgaria, and Ukraine. Up to 3,000 km – that&#8217;s the heart of Europe. Israel and NATO face a common threat in Iran. Standing with Israel means standing for a secure Middle East, a secure Europe, and a secure free world.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Pressure Works</h2>\n\n\n\n<p>An AP report highlights what we&#8217;ve been saying since Hamas declared war on Israel on October 7th: Israel is crushing Hamas&#8217;s terrorist army and forcing it to drop its demands. Israel secured the first hostage release deal in November because Hamas was getting clobbered and was begging for a breather. Now the AP reports heavy battlefield losses are pushing Hamas leaders in Gaza to submit to another hostage release and pause the fighting.</p>\n\n\n\n<h2 class=\"wp-block-heading\">IDF Actions</h2>\n\n\n\n<p>In just the last few days, the IDF has taken major steps to dismantle the Hamas terrorist army in Shia. It&#8217;s killed over 150 terrorists and destroyed six terror cells, finding a whole branch system with underground command centers. It raided a compound with a school and clinic, finding mortars and machine guns, and Hamas intelligence documents next to uniforms in civilian buildings. Hamas wants to keep fighting forever, and Israel is dismantling its terrorist army so that it can&#8217;t and is forced to free the hostages.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hostage Release Efforts</h2>\n\n\n\n<p>The Hamas terrorists who burned whole families alive are not going to release the hostages in their terror dungeons if the world asks them nicely. World leaders should remember the only way to free the hostages is to pressure the hostage takers to free them. Anything that weakens Israel strengthens Hamas and makes a hostage deal less likely. The 120 hostages trapped in the terror dungeons need pressure on Hamas and its backers Iran, Qatar, and Turkey. They need the world to back Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Criticism of EU Policy Chief</h2>\n\n\n\n<p>Some world leaders are helping Hamas. One of them is Joseph Burell, the EU foreign policy chief. I saw a tweet of his that said he was appalled at an Israeli air strike on an UNRWA school. He tweeted &#8220;UN premises must not be misused or targeted by attacks.&#8221; Really? Why isn&#8217;t he appalled that Hamas is using UN facilities as military bases? Why isn&#8217;t he appalled UN staff for turning a blind eye to Hamas waging war out of their buildings? Why isn&#8217;t he appalled Hamas is systematically violating humanitarian law and using its own civilians as human sacrifices? Pretty appalling. Civilians must be protected. He&#8217;s right, from Hamas. You can&#8217;t say don&#8217;t abuse UN premises but don&#8217;t target them for attacks if they&#8217;re being abused, because Burell is telling Hamas terrorists if you fight out of UN buildings you get immunity. Nobody is allowed to touch you. Keep shooting at Israel, international law will keep you safe.</p>\n\n\n\n<h2 class=\"wp-block-heading\">UK&#8217;s New Government</h2>\n\n\n\n<p>It&#8217;s being reported that Britain&#8217;s new Labour government will stop supporting Israel at the ICC. Now, that would be a shameful betrayal of a key ally fighting against a common enemy, Iran. It&#8217;s a signal to Hamas that Israel is under pressure, not Hamas. If the UK government turns on Israel, it will strengthen Hamas and make a hostage deal less likely, condemning them to the terror dungeons. We need you around the world to call on your leaders to stand with Israel against Hamas. Don&#8217;t bury the hostages deeper underground by giving Hamas breathing space. Tell your governments to tell Hamas to let them go.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Questions from Social Media</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Question 1: Middle East Israel NATO Coalition</h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Gon Hart asks on Instagram Live:</strong> How do we get a Middle East Israel NATO coalition against dangers from Iran?</li>\n\n\n\n<li><strong>Answer:</strong> That&#8217;s an excellent question. NATO is based on the notion of collective self-defense. If one country is attacked, it&#8217;s seen as being an attack on everyone. If countries around the world wanted Israel to make territorial withdrawals, promising that it would make it safe, here&#8217;s an idea: why don&#8217;t we join NATO? Why don&#8217;t we agree that in exchange for Israel pulling out of Gaza, pulling out of Lebanon back then, countries will come to its defense if it&#8217;s attacked? The reason that won&#8217;t happen is that countries around the world understand exactly what Israel is up against. Israel is surrounded by terrorist armies that want to destroy it and will take advantage of any withdrawal that Israel performs to continue attacking Israeli communities. That&#8217;s why we&#8217;re not likely to see any sort of NATO commitment to Israel&#8217;s security because those countries know that Israel is surrounded by implacable foes that think Israel has no right to exist and will continue to attack it. But it&#8217;s essential that we deepen connections between Israel and NATO allies on mutual defense, even if it&#8217;s not a mutual defense pact, based on a recognition of this simple fact: we face the same enemy. Israel is fighting for its life against Iran and its proxy armies on seven fronts. The same Iran that is now stepping up its ballistic missile capability that will allow it to reach the heart of Europe and export weapons to Russia that are being used to murder innocent Europeans on the soil of Ukraine. We face the same enemy. We have to face those challenges together.</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">Question 2: Concern about UK Labour Government</h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>M Golding asks:</strong> Are you worried about having a Labour government in the UK?</li>\n\n\n\n<li><strong>Answer:</strong> We are not going to get into domestic British politics, but it&#8217;s important to send a very clear message. As we said in the briefing, we need countries to strengthen Israel and weaken Hamas because that is the only way we are going to get a hostage deal. Anything that weakens Israel and strengthens Hamas makes a hostage deal less likely. That&#8217;s the lens through which you have to understand everything. We need Britain to stand together with Israel, not try to pivot towards more balance between Israel and the Hamas terrorist army. Make it clear: Israel is the UK&#8217;s chief ally in the region, and it needs Britain&#8217;s full support.</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">Question 3: Iran&#8217;s Funding Sources</h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Stephie Goods asks on Instagram Live:</strong> Where does Iran get its funding?</li>\n\n\n\n<li><strong>Answer:</strong> Iran has several sources of funding. One is the black market. Its proxies are deeply embedded in South America and the drugs and the narcotics trade, in money laundering through all forms of black market criminal activity in Europe. It is also a massive exporter of petroleum. It is a natural resource giant and a very powerful country. Iran is able to use both criminal gangs and its natural resources to continue funding its proxy armies around the Middle East instead of supporting its people at home. The people of Israel really stand in solidarity with the people of Iran who&#8217;ve been protesting against their own government. You&#8217;ve seen people in protest in Iran chanting against Hamas and Hezbollah because they are angry that Iran has taken its natural resources and used that money to support its proxy armies instead of investing in the people of Iran.</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">Question 4: Agricultural Impact around Gaza</h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Jason Shine asks from Instagram:</strong> How are the crops and livestock from the surrounding kibbutzim around Gaza? Are they complete losses?</li>\n\n\n\n<li><strong>Answer:</strong> Much of the region around the Gaza Strip is still depopulated. For nine months now, the residents of the kibbutzim who tended to the agriculture in southern Israel have been displaced in hotels, guest houses, and temporary accommodation around the country. There is a long way to go to rebuild their homes. Some of them don&#8217;t want to go back. We had here on the State of the Nation podcast Jonathan Dehen from Nir Oz. His son Sagi is still a hostage of Hamas in Gaza, and he told us movingly that he doesn&#8217;t want to go back to Nir Oz because the place is haunted. There is a memory of the neighbor who was murdered, and another neighbor burned alive in their home. It&#8217;s too painful. Israel is embarking on a major project, by the way, the diaspora is heavily involved as well with serious philanthropic money to rebuild the South. But for people to return safely to their homes and to make the South bloom again, the Hamas terror regime cannot be their neighbor. These people cannot go home if there is any fear that Hamas might wake up one morning, invade their communities, burn people alive, and take hostages back into Gaza.</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">Question 5: Information War and Hasbara Ministry</h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Al Thinkink asks:</strong> When will Israel have a proper Hasbara Ministry which can consistently present to the world towards winning this crucial info war?</li>\n\n\n\n<li><strong>Answer:</strong> We don&#8217;t think that the government of Israel is taking the information war with sufficient seriousness. We have had nine months since the October 7th war to begin building a serious information machine to fight this information war around the world. That hasn&#8217;t happened, and that means a lot of the work is falling on ordinary people like us, ordinary citizens who do not represent the government, having to grab the bull by the horns and say we will explain our country to you if our country will not explain itself. We understand the stakes of this war and that is why we&#8217;re dedicated to supporting Israel. I&#8217;ve been spending a lot of my efforts speaking in the Israeli media to raise awareness of the importance of public diplomacy. This isn&#8217;t a question about whether a few more people in Canada are going to like us; this is about concrete diplomatic military support that we need in order to face down our enemies. We&#8217;re trying to not only improve the case for Israel around the world but also shift public opinion inside Israel towards taking the information war seriously and making sure that next time Israel finds itself in such a crisis, it won&#8217;t be caught unprepared.</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">Question 6: Best Site for IDF Information</h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Frank via YouTube Live asks:</strong> What is the best site for IDF-related information?</li>\n\n\n\n<li><strong>Answer:</strong> If you want information from the IDF, the IDF spokesperson&#8217;s unit has actually been very effective and very transparent in getting information out on any platforms you want – on Twitter, on Instagram, on Telegram, on WhatsApp as well. There is no other army in the world that is required to account for the velocity of every bullet as it&#8217;s being shot, and the IDF has gone further than any army in history in terms of giving real-time updates about its operations. So, the IDF search rate on Telegram and WhatsApp has regular updates, and of course here at the citizen spokesperson&#8217;s office, we will bring you the most important updates to keep you up to speed with what you need to know.</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">Question 7: Iran and Russia Cooperation</h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Gavin on Instagram Live asks:</strong> Are Iran and Russia working together?</li>\n\n\n\n<li><strong>Answer:</strong> Yes, Iran and Russia are working together, together with China and North Korea. Those are the evolving battle lines of the world order. There is a free world, and against the free world is Iran that wants to destroy Israel, Russia that wants to destroy Ukraine, and China that wants to destroy Taiwan. These are the battle lines of the 21st century. Iran has been supplying Russia with the drones that it has been using to murder innocent Europeans in Ukraine. They&#8217;re working very much together, and it is a reminder that the security threats to Israel are intimately connected with the security threats to Europe, and underscores the importance of our countries working together.</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">Question 8: Hamas Future Attacks</h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Cecile on Instagram Live asks:</strong> Is it true that Hamas is planning an even bigger attack?</li>\n\n\n\n<li><strong>Answer:</strong> At the moment, Hamas doesn&#8217;t have the capability to perpetrate a much bigger attack or an attack like it did on October 7th because Israel has spent the last months systematically dismantling its terrorist army, reducing it from an organized fighting force capable of staging an invasion like it did on October 7th to an insurgency. But there is no doubt that if Israel were forced to withdraw from the Gaza Strip and certainly if it were to hand over the border with Egypt that Hamas has used for smuggling, Hamas would regroup, reconstitute, and attack us again. How do we know that? Because straight after the October 7th massacre, they said that they want to do this again and again until Israel is destroyed. They say that if they could go back in time, they would do this again and again. That&#8217;s why it&#8217;s so important that this war ends not only with the safe release of all the hostages but with Hamas dismantled and, most importantly, not capable of reconstituting, or there will be a next time. It will be worse, and it will be worse because Hamas will think that the free world and leaders like Joseph Burell, the EU foreign policy chief who&#8217;s been giving political cover for Hamas, will step in to save it, and we can&#8217;t allow that to happen.</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">Question 9: Destroying Hezbollah</h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Itai on Instagram asks:</strong> What is stopping Israel from destroying Hezbollah in order for the north citizens to return to their homes?</li>\n\n\n\n<li><strong>Answer:</strong> Since October 8th, when Hezbollah declared war on Israel, Israel has been fighting to degrade Hezbollah&#8217;s capabilities. It&#8217;s killed about half of their senior commanders in southern Lebanon and is warning that Hezbollah must back off or we will have to push it away. But it&#8217;s important to understand that the risks of an all-out war with Hezbollah are of catastrophic damage. Hezbollah has upwards of 200,000 rockets – I&#8217;ll say it again, 200,000 rockets – that&#8217;s in addition to suicide drones and other weapons. That makes it by far more powerful than most NATO militaries. It has the ability to fire thousands of rockets at Israel every day, many of them precision-guided and with warheads of half a ton or a ton. It has the ability to overwhelm the Iron Dome missile defense system. All-out war with Hezbollah means a threat of multiple simultaneous mass casualty events, and that is why Israel is being cautious with Hezbollah and is not rushing head-first into a war. A war is, of course, a last resort because the damage will be immense. But Israel is warning: a war with Hezbollah could be damaging in Israel, it would be even more destructive for Lebanon. If Israel is forced to take action to prevent simultaneous mass casualty events in the Israeli home front, it is not too late to avoid an all-out war with Hezbollah. All it takes is upholding international law. The UN said back in 2006 at the end of the second Lebanon war that Hezbollah must withdraw beyond the Litani River. That hasn&#8217;t happened. We need a diplomatic deal that will see Iran&#8217;s proxy army in Lebanon withdraw away from the Israeli border and stop its daily attacks using rockets and suicide drones against Israeli civilians because Israel has a duty to get its people back to their homes and to stop this aggression. If Hezbollah doesn&#8217;t back away, you know the answer already: Israel will have to put it away.</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>That&#8217;s all we have time for today. Please follow us on all these social media platforms. Please, one request: forward the link to one friend you think will benefit from watching the daily briefing every day, and together we&#8217;ll continue to get the message out. Thank you very much, everyone. Keep safe. We&#8217;ll be back tomorrow at 3:00 with a different citizen spokesman. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Citizen spokesman <a  href=\"https://iron-swords.co.il/t/eylon-levy/\">Eylon Levy</a> daily briefing covers the ongoing October 7th War, <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s threats, NATO&#8217;s Summit, and IDF actions against <a  href=\"/hamas\">Hamas</a>. He emphasizes global unity against Iran, criticizes some EU and UK policies, and highlights the need for international support for <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s security and hostage negotiations.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6066,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-6065",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 6065
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6065",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6065"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6065/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6068,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6065/revisions/6068"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6066"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6065"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6065"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6065"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}