{
    "id": 6881,
    "date": "2024-07-25T15:00:23",
    "date_gmt": "2024-07-25T12:00:23",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6881"
    },
    "modified": "2024-07-30T17:36:33",
    "modified_gmt": "2024-07-30T14:36:33",
    "slug": "pro-hamas-mob-burns-us-flags-in-us-capital-daily-briefing-with-ashley-waxman-bakshi",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/pro-hamas-mob-burns-us-flags-in-us-capital-daily-briefing-with-ashley-waxman-bakshi/",
    "title": {
        "rendered": "Pro Hamas Mob Burns US Flags In US Capital | Daily Briefing with Ashley Waxman Bakshi"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Pro Hamas Mob Burns US Flags In US Capital | Daily Briefing with Ashley Waxman Bakshi\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/J_JOzENTFzQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I am citizen spokesperson Ashley Waxman Baky. It is July 25th, 2024. This is the live Daily Briefing of the Israeli citizen spokesperson&#8217;s office. We are live on Instagram, on X, on YouTube, and on LinkedIn, and available afterward wherever you get your podcasts. Please start submitting questions in the chat. Like and subscribe to help us reach a wider audience.</p>\n\n\n\n<h3 class=\"wp-block-heading\">War Update</h3>\n\n\n\n<p>Today is day 293 of the October 7th War and the Hamas hostage crisis. Yesterday, two visions of the future were put forward in the American capital, Washington DC: a vision of peace and a vision of never-ending war. Israel&#8217;s Prime Minister Benjamin Netanyahu spoke before the joint chambers of the US legislature. This was his fourth time speaking before Congress, unprecedented for a foreign leader. The Prime Minister spoke of victory over the Hamas rapists and murderers and of removing their ability to again harm the people of Israel. He spoke of Hamas&#8217;s Iranian backers and the wider war of Iran&#8217;s radical mullahs against Israel and against stability and moderation in the Middle East. He spoke of peace on Israel&#8217;s borders, demilitarization and deradicalization in the Gaza Strip, cooperation with peaceful Arab states in the region, and expanding the Abraham Accords into the Abraham Alliance. He reminded Americans that the same forces that threaten Israel also threaten America. Israel&#8217;s enemies are America&#8217;s enemies. Our triumph over hate will be America&#8217;s victory. As Prime Minister Netanyahu again put it, &#8220;When we fight Hamas, we fight Iran. When we fight Hezbollah, we fight Iran. When we fight the Houthis, we fight Iran. When we fight Iran, we are fighting the most radical and murderous enemy of the United States of America. We are not only protecting ourselves, we are protecting you.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Outside the Capitol</h3>\n\n\n\n<p>As if on cue, much of what Israel&#8217;s leader described was on display right outside the building where America&#8217;s leadership was gathered. Outside, masked mobs projected their vision of rejecting peace and embracing war. Hate, death, and destruction for America, for Israel, and for the Jewish people. They waved jihadist flags and those of banned terror groups like Hamas, Hezbollah, and PFLP. They glorified Hamas&#8217;s rape and murder of innocents on October 7th. They defaced monuments to America&#8217;s liberties with spray-painted slogans and an ominous threat that Hamas is coming, together with red triangles banned in Berlin that Hamas marks those they target for murder in America&#8217;s capital city. They took down America&#8217;s flags from flagpoles and replaced them with Palestinian flags. They burned America&#8217;s flag while chanting &#8220;Allah Akbar&#8221; and &#8220;From the river to the sea&#8221; and violently hurled police officers to the ground. Some American commentators characterized Netanyahu&#8217;s speech as like one delivered by an American president. The crowd outside can only be characterized as one trying to destroy America. Tell your leaders those who attempt to destroy the Jewish state are also aiming for the entire West. As Israel&#8217;s leaders said it best, &#8220;We meet today at a crossroads of history. Our world is in upheaval. In the Middle East, Iran&#8217;s axis of terror confronts America, Israel, and our Arab friends. This is not a clash of civilizations; it&#8217;s a clash between barbarism and civilization. It&#8217;s a clash between those who glorify death and those who sanctify life. For those forces of civilizations to triumph, America and Israel must stand together because when we stand together, something very simple happens: we win, and they lose.&#8221;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Questions from the Audience</h3>\n\n\n\n<p><strong>Question from Elias on Instagram Live:</strong><br><em>A few days ago, citizen spokesman Alon Levy spoke about rockets falling inside the Gaza Strip and hitting a school, and that it could have hurt people there. Do we know what happened?</em><br>Thanks for the question. So, I haven&#8217;t heard more details about that, but I can tell you that yesterday, other rockets hit another school. These rockets were fired out of the humanitarian zone in the Gaza Strip. Hamas is obviously once again firing from behind its own people and trying to make sure that nowhere is safe for people in Gaza. Even worse, the rockets killed at least two people and injured many more. Israel worked together with the World Health Organization to evacuate the people injured by the Hamas rockets to a field hospital for medical treatment.</p>\n\n\n\n<p><strong>Question from Jackie on YouTube:</strong><br><em>Why were Hamas and Fatah meeting in China and what does it mean for the future?</em><br>As we know, Hamas took over the Gaza Strip from Fatah in a bloody coup in 2007. Hamas literally threw Fatah officials off the roofs to their death, and to say that they don&#8217;t like each other is an understatement. But Hamas is losing the war, and they&#8217;re looking for any lifeline to be able to survive so that they can continue to murder innocent people here in Israel on another day in the future. They are hoping for an agreement that will help them basically remain in power. Whether this agreement signed in China lasts or not remains to be seen, but don&#8217;t expect it to change the Hamas rapists and murderers who promise another October 7th. And also, don&#8217;t forget the rampant incitement that Hamas continues to employ, the glorification of murdering Jewish people, and the millions of dollars in pay-to-slay that they pay out to Hamas and Fatah murderers of Israelis.</p>\n\n\n\n<p><strong>Question from Cindy Morris on Instagram Live:</strong><br><em>The mainstream media here in the US did not post the flag burning and Hamas chants, reporting the protest as peaceful. How can we change this reporting?</em><br>I think my best answer for you is, one, reach out to the networks and you know, petitions. And secondly, just get this information out on social media as much as you can. Even if you think that you don&#8217;t have many followers, you sharing and posting something means your friends might share it too, and you don&#8217;t know the trickle-down effect on where those tentacles can reach. We have, unlike in the past where we had to rely on traditional media for our information, today we luckily have social media. So use your voice, use your platform, even if you think no one is following. Ask your family and friends to share. That&#8217;s what we can do from a civilian standpoint, and that&#8217;s what I try to do on my social media every day.</p>\n\n\n\n<p><strong>Question from Lisa Smith on Instagram Live:</strong><br><em>Where are we with the hostage negotiations?</em><br>That&#8217;s a great question. Basically, the negotiations are still ongoing. I hope you know I&#8217;m a family member of a hostage. My cousin, Agam Berger, she&#8217;s 19 years old and she is one of the hostages still held so brutally in captivity by Hamas. We are hoping that Benjamin Netanyahu&#8217;s visit to Congress and those meetings, those side meetings that are happening now, can help push forward a deal. There are still certain aspects that Israel needs to ensure that it is securing its security and defense in order to make that deal happen, but I honestly believe that we are the closest we have ever been. Let us just continue to pray that a deal will happen very shortly.</p>\n\n\n\n<p><strong>Question from Abe on YouTube Live:</strong><br><em>Where was Kamala Harris during last night&#8217;s address by Prime Minister Netanyahu? Her duty was to preside over the address.</em><br>Kamala, as you know, was not there, and Nancy Pelosi was also not there. I try not to get into internal American politics; I&#8217;m an Israeli. As an Israeli, I feel that it was a mistake that she was not there. Maybe one day she could be the future president of America, and America and Israel are still the closest allies. We are a strategic ally for the United States of America, and I would have liked to see Kamala, Nancy, and all of their friends there, but unfortunately, we did not.</p>\n\n\n\n<p><strong>Question from Yel on X:</strong><br><em>I know this question gets asked a lot, but are there any changes happening on the northern border? Has anything changed in the situation with Hezbollah?</em><br>The straight answer is no, unfortunately. There is no news on that front other than the fact that we are still receiving thousands of rockets daily. They are still bombarding our north with rockets. Our civilians are still displaced. As Netanyahu said yesterday, Israel prefers a diplomatic solution, but if all else fails, Israel will be forced to militarily resolve this problem and ensure security and safety for Israeli civilians to be able to return to their homes in the north of Israel.</p>\n\n\n\n<p><strong>Question from Shir on Instagram Live:</strong><br><em>Do you have a message for the Israeli athletic delegation who will start their Olympic journey tomorrow night?</em><br>Good luck! We know it&#8217;s a difficult time to be anyone who is representing Israel abroad, whether it&#8217;s culturally or in sports. We wish them the best of luck. I am really hoping that we see a few gold medals and show the world that we won&#8217;t be silenced, we won&#8217;t be boycotted, and we will continue to participate in all cultural events and all sporting events. I encourage you to be loud and proud wherever you are in the world, supporting the Israeli Olympic team. I will be there myself.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>Thank you very much. That is all the time we have for today. As always, we will be here again next week, starting on Sunday, 3 AM Israel time, 8 AM Eastern Standard Time. Have a wonderful weekend.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>On July 25, 2024, Ashley Waxman Baky presented the live Daily Briefing, discussing the October 7th War, Prime Minister Netanyahu&#8217;s speech to the US Congress, and ongoing conflicts. She addressed questions on <a  href=\"/hamas\">Hamas</a> rockets, hostage negotiations, and <a  href=\"/hezbollah\">Hezbollah</a>, encouraging public support and social media activism for <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s causes.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6882,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        490
    ],
    "class_list": [
        "post-6881",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-ashley-waxman-bakshi"
    ],
    "lang": "en",
    "translations": {
        "en": 6881
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6881",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6881"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6881/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6884,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6881/revisions/6884"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6882"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6881"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6881"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6881"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}