{
    "id": 6260,
    "date": "2024-07-14T22:18:38",
    "date_gmt": "2024-07-14T19:18:38",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6260"
    },
    "modified": "2024-07-14T22:18:42",
    "modified_gmt": "2024-07-14T19:18:42",
    "slug": "statement-of-the-idf-chief-of-staff-14-7",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/idf-spokesperson/statement-of-the-idf-chief-of-staff-14-7/",
    "title": {
        "rendered": "Statement of the IDF Chief of Staff 14.7"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"הצהרת הרמטכ&quot;ל 14.7\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/f2SZ7OOP4rc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Good evening. I am just coming from a meeting with the commanders and fighters of Sheldag, one of the IDF units that have been fighting for nine months in the war that was forced upon us following the murderous attack by Hamas on October 7. I see the work of Sheldag&#8217;s fighters and commanders throughout the war and in all theaters, and the citizens of Israel need to know that there is a generation of exemplary fighters and commanders.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Military Operations in Gaza</h2>\n\n\n\n<p>We do not stop, we do not stop fighting. We have been operating throughout the Gaza Strip with different combat methods for about two months. We are maneuvering in Rafah and achieving significant military gains, killing more and more terrorists, destroying Hamas&#8217;s terror infrastructure, and damaging its capabilities. Yesterday, in a joint operation of the IDF and the Shin Bet, we attacked a compound in Khan Yunis where Muhammad Deif, the commander of Hamas&#8217;s military wing, who planned and ordered the attack on October 7, was hiding. Alongside him, Raf, the commander of the Khan Yunis Brigade, and other terrorists were also present. This attack is the result of operational capability we have built, combining advanced intelligence capabilities of the Shin Bet and the Military Intelligence Directorate (Aman) with very high-quality planning and execution capabilities of the Air Force.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Clarification on Hostages</h2>\n\n\n\n<p>According to the intelligence we had at the time of the attack, there were no hostages in the compound. According to the information that emerged after the attack, no hostages were harmed in the attack. It is very important for me to clarify this. It is still too early to summarize the results of the attack, which Hamas is trying to hide. We are determined to continue pursuing Hamas leaders who planned and carried out the massacre of October 7 and dedicated their lives to the murder of innocent people. Deif was afraid to die, so he hid in a way that even hindered his ability to command. He hid and sacrificed his men and the civilians around him who were in danger.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Military Strategy</h2>\n\n\n\n<p>Few were harmed. We found him, and we will find the next ones. These eliminations are part of the ongoing and changing military pressure that the IDF applies in all parts of the Gaza Strip. Every day, there are many Hamas casualties. Ground forces attack bravely, pilots attack with great precision and high quality, and they evacuate wounded from the area using a lot of trickery. All these are wrapped in high-quality and up-to-date intelligence. This is important for the systematic dismantling of the Hamas terrorist organization.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Importance of Agreements</h2>\n\n\n\n<p>It is also very important for creating the conditions for the agreement to recognize the hostages. An agreement for the return of the hostages is an urgent moral and value imperative to save lives. The IDF generates all the necessary pressure to create the best conditions for such an agreement, and this is how we have acted since the end of the previous agreement. The IDF knew how to abide by any agreement approved by the political echelon and also, at the end of a ceasefire, to return and fight with great intensity. The IDF will not stop working to free these hostages, for whom the clock is ticking with great difficulty. We will not give up on continuing to harm Hamas until this goal is achieved, and of course, we will not give up on achieving security for the citizens of the State of Israel.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Northern Front</h2>\n\n\n\n<p>We are at high levels of fighting in the north alongside increasing achievements in harming Hezbollah. We do not for a moment forget the plight of the residents of the north in the past nine months. We feel the pain every moment of the dead and injured from Hezbollah attacks. In the last few days, I was in one of the settlements adjacent to the border, of course not for the first time. I saw the damage, met with the local leadership, and heard difficult things from them. We translate this difficulty into determination in fighting and continuing real solutions and a safe return to their homes. We are ready and are preparing for the next phase in Lebanon alongside the continuation of the fighting.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Investigation of October 7 Events</h2>\n\n\n\n<p>These days, we are investigating the events of October 7 and what led to them. This is a necessary process in order to learn, correct, and mainly ensure the return of the residents of the south to their homes safely. Last week, we presented the investigation of the battle at Kibbutz Be’eri to the kibbutz community and the bereaved families. There were reasons why we presented this investigation first. Controversial events in this battle kept many awake at night. This is an essential step in building renewed trust between the IDF and the communities of the southern settlements, and it goes through a thorough and professional investigation, as we did. The findings of the investigation are difficult and painful, alongside many acts of bravery and spirit of residents, fighters, and many commanders who defended the kibbutz members with their bodies while risking their lives without limit. To the fighters who fought on October 7, I have nothing but immense appreciation. I salute them and the bravery they showed during long hours of fighting in very difficult conditions and with great complexities. Within this complex fighting, mistakes were made, and some of them were fateful decisions from which we will learn. It is not possible to operate in such a reality without making mistakes. I am very proud to be the commander of those fighters and commanders who went forward to fight to save. Every act of heroism they did is theirs.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Comprehensive Investigations</h2>\n\n\n\n<p>As far as we can, this includes the intelligence perceptions, the operational perceptions, the defense response, the decision-making the night before the attack, as well as the conduct of the IDF officers and my conduct. All of these are in the process of a deep and fundamental investigation. The claim that someone in the IDF knew what was going to happen that morning and hid it is unfounded. We are investigating this in depth. The purpose of the operational investigation is to go there to find out who it is. It is not a substitute for an external inspection mechanism. Needless to say, we will fully cooperate with such a mechanism, and the operational investigation will be able to contribute a lot, as it was in past wars. When we finish all the investigations, we will have the overall picture. We can summarize all the lessons and also personal conclusions. These are days of war for our existence here and for our future. We do not have the right to stop for a moment. We have the determination and the patience.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A Session</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Responsibility and Resignation</h3>\n\n\n\n<p><strong>Reporter:</strong> In the recent period, senior commanders in the IDF have announced their intention to leave following the failures of October 7. At the same time, we have received criticism from senior IDF officials who called on you to take responsibility and announce your retirement from the army. My question is, do you also intend to announce that you are implementing the responsibility you took upon the outbreak of the war? If so, when?</p>\n\n\n\n<p><strong>Commander:</strong> Criticism is a very, very important thing, especially when we are dealing with an event whose results are so difficult and the complexities within it are very important in terms of decisions and timing. I have been in the army for nearly 40 years, since I was 18 years old, doing nothing but focusing on one thing: the security of the State of Israel and the bravery of the citizens of Israel. Not one moment in my service was spent sitting in a chair or seeking power. I am currently busy with the tasks of dismantling Hamas, returning the hostages, and creating security for the residents at the borders. I have expressed my responsibility for the events on October 7 on several occasions, and these details also have practical meaning, which is very clear to me. When we complete the tasks, because tasks are not abandoned in the middle, the pen will come, and I will make my decisions. I will also pay close attention to the words of my subordinates.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Inquiry Commission</h3>\n\n\n\n<p><strong>Reporter:</strong> The Chief of Staff, Security, said this week after your investigation that he demands a state commission of inquiry. Do you also want to declare a state commission of inquiry already, and do you think it should start working?</p>\n\n\n\n<p><strong>Commander:</strong> I am very supportive of a thorough and high-quality review of the events of October 7 and what led to them. The most correct method of investigation or inquiry is not something that an officer in uniform should express himself about. The state leadership will choose the appropriate mechanism to investigate these events. The IDF is already moving forward, investigating thoroughly to learn, and it will share the results of the investigations with any entity that the state leadership chooses to appoint to investigate these events.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Service Extension and Recruitment</h3>\n\n\n\n<p><strong>Reporter:</strong> Today, the government decided to extend mandatory service by four additional months retroactively for those serving now. Young people who were supposed to start their lives in the coming days and be released will have their service extended, likely in exchange for a higher amount of money, a few thousand shekels per month. Is it acceptable to you that for an additional payment, combat soldiers will serve another four months, the burden on them will increase, and can the army afford to say it is only able to recruit 3,000 or 4,000 ultra-Orthodox youth compared to tens of thousands of secular and religious youth per year?</p>\n\n\n\n<p><strong>Commander:</strong> First, regarding the extension of service, I want to express great appreciation. Look, I meet many of the fighters in the field. I also met recruitment rounds that are already in the evaluation stage. Most of the young people I meet knew they were supposed to have already completed their service, but they identify with the goal, are determined, want to fight, and understand the magnitude of the issue at hand. Out of our responsibility and the confidence we are receiving, we asked the government to extend the service. Protecting with more forces and providing a better response is part of the answer to the bad things that happened to us on October 7. For this matter, it is correct to extend the service by the four months in question. I think that giving compensation and recognition to those serving in combat service, especially those who appreciate the service, is appropriate. The state tells them, you are doing something significant. The state appreciates this very much and therefore gives you recognition that will also help you in the future. Recruiting the ultra-Orthodox is a different but related issue. We see a need today. The IDF needs more battalions today. Establishing an ultra-Orthodox battalion that holds a sector can save the recruitment of 12 reserve battalions over an annual cycle. This is significant in terms of war readiness, the burden on reservists, and the impact on the Israeli economy. Therefore, it should be done. Why are we only recruiting 3,000 in the coming year? The IDF is at war. The IDF does not know how to bring another 20,000 people into its ranks overnight. We want not only to recruit successfully but to succeed in the recruitment so that it will be something that moves forward with us and works well in the IDF. We are now preparing to bring people, create the training, create the professions. We will grow by 3,000 in the coming year. This is almost twice what we recruited in recent years, and we will ensure to grow every year after that. If we could recruit many at once, it would be right to do so. This is the healthy and correct way to develop, so that in five or ten years, we can look back and say that at this point in time, we did something significant.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Controlling Philadelphia Axis</h3>\n\n\n\n<p><strong>Reporter:</strong> The IDF&#8217;s position is that it is impossible to make a hostage deal unless Israel controls the entire Philadelphia axis. Control of the Philadelphia axis is very important. Gaza is surrounded by three types of Mediterranean territory: the border with Israel and the border with Egypt. Both the border with Egypt and the border with Israel are very important. Today, in this situation, our control of the Philadelphia axis is very important. We are operating today in the Philadelphia axis with great determination, with many forces to destroy underground tunnels there that were used by Hamas. We are also doing this in cooperation with other parties. This is not the place to go into details, so I think that when we enter into the discussion of what agreement to make, how to do it, and what the solutions are, these things should be discussed in a closed room and not spread out here in front of the camera and the public. We will discuss and decide with responsibility, and we will give the best security advice we know.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Accountability for October 7</h3>\n\n\n\n<p><strong>Reporter:</strong> Commander, with your permission, I have two families: one from Sheldag, which you already answered, but I would like to hear your reference to the fact that they are very angry that much of the responsibility for October 7 was placed on their shoulders, and the other family is in the Gaza periphery. The question is, how do we restore security to these residents, considering they are starting to return, and the fighting is still quite intense?</p>\n\n\n\n<p><strong>Commander:</strong> Regarding the investigations, it is very important for me to be clear. As I said before, we first conducted the investigation on Be&#8217;eri because of specific code issues that existed there, a quick and in-depth investigation. Things that have already come out are correct and incorrect, and it was right to clarify and create a stable reality and version based on the facts and very much connected to the truth. I want it to be very clear that in the IDF, we did not start by investigating the forces in the field and then the senior officers. We will present the senior officers&#8217; investigations as soon as possible. I see, as I said earlier, every fighter in the IDF who acted bravely, even if he made a mistake. It is my responsibility to embrace and support him, and we also take care of him. We did not send anyone into the investigations. We have investigations that aim to give the community of Be&#8217;eri, which lost 101 of its people, difficult answers to difficult things that happened. The priority is first to give direct answers to the residents and then to the fighters. Indeed, I spoke a little while ago with these fighters. I heard from them things that inspire pride—who they are, their moral level, how they see things. I think and hope that I explained, and I saw on their faces that they understood. I think the IDF will continue to be very strong, to investigate bravely, to learn, and this is also what will build security for the residents. I see no other way for trust between the IDF and the residents to build forward this security. Our real victory at the end of the road, after all the military processes, will be to see the settlements in the Gaza periphery, which had a little over 60,000 people before October 7, growing, thriving, and blooming. The IDF will be a loyal partner and will do everything to reach this very important result.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Question on Targeted Killings</h3>\n\n\n\n<p><strong>Reporter:</strong> Good evening, Chief of Staff. Yesterday, you carried out the same incident in Khan Yunis, in which at least one senior terrorist was killed, and apparently also Muhammad Deif. We saw the incident this morning at the Tzrifin junction, and there is an assessment that there is a connection between the act and the result. Are there additional warnings about this? We also see the policy in the north of targeted killings and the responses weeks later from Hezbollah. Is there a reassessment regarding the effectiveness of these targeted killings in light of the injuries we suffer when missiles and rockets are fired at the north and other areas throughout the country?</p>\n\n\n\n<p><strong>Commander:</strong> We are examining our decisions and actions all the time continuously, and we also put question marks. We also frequently change the way we operate. The targeted killings of senior figures are very significant in the war. In the chain of command of Hamas and the chain of command of Hezbollah, we hit many commanders, including many senior officials. The killing yesterday of these two commanders is very significant not only for what they did in the past but also for the continuation of the fighting. We knew yesterday after this attack that the probability of response attacks was very high, and immediately after that, we prepared with many forces at all the state&#8217;s borders and internal sectors, together with the Shin Bet and the Israel Police, to provide good intelligence as much as possible, to give warnings, and to provide very good protection to the citizens of Israel. Unfortunately, this morning near Tzrifin, there was an attack by a group we did not know about in advance, and we were not able to prevent it. Many attacks are prevented every day. We will continue to give very good protection. If we do not attack the enemy with great determination, we will not learn. Therefore, these hits are very important, and after them, we deal a lot with defense.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Closing Remarks</h2>\n\n\n\n<p>Friends, thank you very much. Good evening. Thank you very much. Good evening.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>IDF commander details ongoing operations in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, emphasizes determination to defeat <a  href=\"/hamas\">Hamas</a>, ensure security, and address October 7 events.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6262,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-idf-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 197,
        "footnotes": ""
    },
    "categories": [
        197
    ],
    "tags": [],
    "class_list": [
        "post-6260",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-idf-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 6260
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6260",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6260"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6260/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6263,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6260/revisions/6263"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6262"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6260"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6260"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6260"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}