{
    "id": 6002,
    "date": "2024-07-12T07:47:38",
    "date_gmt": "2024-07-12T04:47:38",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6002"
    },
    "modified": "2024-07-12T07:48:04",
    "modified_gmt": "2024-07-12T04:48:04",
    "slug": "the-story-of-the-murdered-people-from-the-blue-car-in-beeri",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/victims/story/the-story-of-the-murdered-people-from-the-blue-car-in-beeri/",
    "title": {
        "rendered": "The story of the murdered people from the blue car in Be&#8217;eri"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"&quot;כבר לא שואל למה&quot;: סיפורם של הנרצחים מהרכב הכחול בבארי\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/sZtomKa2pEc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Each visit to the site of the tragic event brings a wave of memories for the families of those lost. They gather branches in remembrance, placing them in a special corner of their cafeteria alongside photos and personal belongings of their loved ones.</p>\n\n\n\n<p>This is Mor’s hat, a gift from his commander, which he never took off. I found it here, and we want to capture this moment. Right here, at the entrance hole, there&#8217;s a surreal feeling. Why did so much good leave this world? Why them? I stopped asking why, or I&#8217;ll go crazy. There&#8217;s no more why; it&#8217;s over. Why didn’t they turn right? Why didn’t they leave ten minutes later?</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Unanswered Questions and Last Moments</strong></h2>\n\n\n\n<p>What went through Beni, Yonatan, and Mor&#8217;s minds in those final moments? Did they know about the terrorist infiltration into Israel? What did they see before being shot in the blue Mazda they were traveling in? These are questions their fathers will never stop asking, but they will never know the answers.</p>\n\n\n\n<p>Look at the stains on the road. It’s a lot from that day, water on the road, some soot too. Innocent people had no idea what they were getting into. My heart races thinking about it. Why didn’t he decide to turn left instead of right? I didn’t understand why. What really happened there? Did they know? Were they scared? Did they see? These thoughts live in my mind every day, every minute, even nine months later. Time doesn’t heal; those who say it does don’t know what they’re talking about. I always say an outsider won’t understand; those who haven’t experienced it won’t know.</p>\n\n\n\n<p>This is the first time they are driving on this road together: Eli, Beni&#8217;s father; Yehuda, Yonatan&#8217;s father; and Oren, Mor&#8217;s father, reliving the last moments of their sons, who were close friends heading to celebrate at the Nova party that Saturday. Did any of you manage to talk to your son on the way? I talked to Mor at 4:47 AM. He told me he would make me a video, something he never did. He showed me half his face and said they were leaving, then the call ended. After that, I talked to him twelve minutes later at five to seven, and that was it.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Friends and Families: A Bond Forged in Music</strong></h2>\n\n\n\n<p>Mor Graziani and Yonatan Samrano had known each other since kindergarten in the Bitzaron neighborhood of Tel Aviv. Their families grew close over the years, and the fathers became friends. They met Beni during adulthood, and what connected the three of them most was their love for music, rhythm, instruments, and pure joy.</p>\n\n\n\n<p>On October 7, just before 7 AM, everything was cut short. Terrorists tried to get under the yellow gate, pushing with their bodies. They ambushed the first car that arrived. One of them called the guard at the gate. As the gate opened, they jumped on the car. The security cameras of Kibbutz Beeri documented those fatal moments. Within minutes, it was Beni&#8217;s car. They shot them here, here, here.</p>\n\n\n\n<p>The gate started to open and got stuck. They hit it to open it because it’s electric. The car rolled here. The terrorists pulled the bodies of Beni, Yonatan, and Mor from the car near the kibbutz gate, drank from their water bottles, and stole the Mazda. Two hours later, another group of terrorists arrived at the kibbutz in a UNRWA car. One of them, a social worker for the organization, pointed at Yonatan, and another terrorist loaded his body into the car and took it to Gaza. A video of the kidnapping was spread worldwide, leading to Hila&#8217;s fight against the UN, proving that many of its employees were and still are terrorists. Everything was recorded on these cameras. It reached Kobi via Telegram. On Monday, Kobi told me there were videos. The car entered. He didn’t want to send them to me. I argued with him on the phone. He told me I didn’t need to see them. I knew it was over. They were shot. Eli, it’s been nine months since October 7, and you still haven’t watched these videos? No, I just couldn’t watch them. I wasn’t able to see them. They didn’t want us to see them, to avoid hurting us.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>A Place of Remembrance</strong></h2>\n\n\n\n<p>Do you know where each of them was found? Where each of their photos is? I think so. They made some changes here. Yes, they replaced the pictures and added more posts. Someone saw a guitar here. Mor had a guitar. There should be a shirt. Where is Beni? Here he is. There’s the guitar. And Mor is here. Yes, here with the hat. Correct. In New York, where is Yonatan? Here he is.</p>\n\n\n\n<p>The last place where Beni, Yonatan, and Mor danced and celebrated, the party area in the forest, has turned into a memorial site in the past nine months, like a home for the flowers that once bloomed. A shirt that his friends made for him says, &#8220;Prove to be happy in joy,&#8221; was Mor&#8217;s motto. He was a child of love and happiness. This shirt has his eyes, crazy eyes. This is the hat I mentioned that he never took off. Do you want to come closer? I&#8217;ll play it for you. Between us, I thought of my dear and beloved father. I miss you. This was the connection between Mor and me. Only later did I realize how much he idolized me. I knew, but I didn’t know to what extent. These are messages saved on my phone, birthday wishes, always with a red heart. He truly knew how to appreciate everything.</p>\n\n\n\n<p>He would tell all his friends how much he loved his dad, how much he loved him, wanting to be with him all the time. Respecting parents was a significant value for him. We have never seen anything like it. His life was music; he only wanted to play guitar. It was just the beginning. He played flutes and brought a flute here. He was a talented musician. Yonatan didn’t like being in the sun, so he got the shady spot. The first time I came here, I was very angry. I broke down here and even now, I am a bit broken. I had a lot of anger. They took my child and gave me a post. It’s not too much to ask for him back, for him to return.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Coping with Loss</strong></h2>\n\n\n\n<p>Only after bringing his firstborn, Yonatan, back to be buried in Israel, will Kobi try to cope with the loss and the immense pain that every parent who lost their most precious one in the ongoing war feels. This article is overwhelming. Today will make me go home, lay down, and be in a real low for a couple of days. It’s surreal. Everything brings me back to October 7 and 10. I don’t have the privilege to stop. I must keep doing everything to bring my son back here.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Families of October 7th victims revisit the tragic scene where their loved ones were ambushed by terrorists. They recount last conversations, relive painful memories, and struggle with unanswered questions. A memorial site now stands where friends once celebrated, symbolizing their enduring love and the profound loss they continue to endure.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6003,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 380,
        "footnotes": ""
    },
    "categories": [
        380
    ],
    "tags": [],
    "class_list": [
        "post-6002",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-story"
    ],
    "lang": "en",
    "translations": {
        "en": 6002
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6002",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6002"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6002/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6214,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6002/revisions/6214"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6003"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6002"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6002"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6002"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}