{
    "id": 6249,
    "date": "2024-07-13T18:18:46",
    "date_gmt": "2024-07-13T15:18:46",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6249"
    },
    "modified": "2024-07-13T18:18:51",
    "modified_gmt": "2024-07-13T15:18:51",
    "slug": "the-untold-story-of-company-a-at-kibbutz-kfar-hazen",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/victims/story/the-untold-story-of-company-a-at-kibbutz-kfar-hazen/",
    "title": {
        "rendered": "The Untold Story of Company A at Kibbutz Kfar HaZen"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"עשו מה שלא נעשה 50 שנה: מסע הגבורה של הטנקיסטים להצלת כפר עזה\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/0NrRrVTFg04?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>In the annals of extraordinary bravery and sacrifice, the story of Company A of the 401st Brigade stands out as a beacon of heroism. This narrative, brought to light through firsthand accounts and vivid footage, chronicles their rapid mobilization and courageous actions to save Kibbutz Kfar HaZen from a terrorist attack on Simchat Torah.</p>\n\n\n\n<p>The tranquility of Simchat Torah was abruptly shattered for the members of Company A as explosions echoed through the central area. Golan, one of the soldiers, received a cryptic phone call instructing him to organize the company immediately. Despite the initial confusion, the urgency of the situation quickly became clear. With no available trucks to transport their tanks, the company had to improvise, navigating narrow bicycle paths and unconventional routes to reach their destination.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Heroic Journey</h4>\n\n\n\n<p>The journey to Kibbutz Kfar HaZen was fraught with challenges. The convoy, consisting of tanks and support vehicles, had to maneuver through tight spaces, often leaving the edges of sidewalks intact. As they approached the besieged kibbutz, the reality of their mission set in. This was not just a military operation; it was a race against time to save lives.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Kibbutz Under Siege</h4>\n\n\n\n<p>Kibbutz Kfar HaZen was in the grip of terror. The Elon family, like many others, had taken refuge in secure rooms, enduring hours of terror as terrorists occupied their home. The kibbutz had been transformed into a battlefield, with homes serving as makeshift field hospitals for the wounded and the dying. The gravity of the situation was underscored by the personal accounts of those trapped inside, hearing the sounds of fighting and breaking glass, and fearing for their lives.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Arrival of Company A</h4>\n\n\n\n<p>The arrival of Company A marked a crucial turning point. Their presence brought hope and a fighting chance for the besieged residents. Tanks rumbled into position, and soldiers quickly engaged the terrorists. The company&#8217;s swift and decisive actions provided much-needed support, rescuing families and securing the kibbutz. Their mission was not just about eliminating the threat but also about protecting and saving the innocent lives caught in the crossfire.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Personal Accounts of Bravery</h4>\n\n\n\n<p>The personal accounts of survivors are both harrowing and inspiring. Mika, a member of the Elon family, described hiding under a bed for hours, while others spoke of holding doors against attackers. The fear and uncertainty were palpable, but so was the determination to survive. One particularly moving moment captured on camera shows soldiers forming a protective wall around the Elon family, shielding them with their bodies. This act of selflessness and bravery is a testament to the soldiers&#8217; commitment to their mission and their comrades.</p>\n\n\n\n<h4 class=\"wp-block-heading\">A Symbol of Resilience</h4>\n\n\n\n<p>The story of Company A is more than just a military operation; it is a symbol of resilience and unity. The soldiers&#8217; actions provided a lifeline to the residents of Kibbutz Kfar HaZen, offering hope in a moment of despair. Their courage and dedication serve as an enduring reminder of the strength of the human spirit in the face of adversity.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Conclusion</h4>\n\n\n\n<p>The harrowing events at Kibbutz Kfar HaZen highlight the extraordinary heroism and sacrifice of Company A of the 401st Brigade. Their story is a powerful narrative of courage, resilience, and unity, reminding us of the critical importance of protecting and supporting each other in times of crisis. As we reflect on their actions, we honor their bravery and the indomitable spirit of the community they saved. This story will be remembered not just as a tale of war, but as a testament to the enduring power of hope and humanity.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Company A of the <a  href=\"https://iron-swords.co.il/t/401st-brigade/\">401st Brigade</a> heroically saved Kibbutz Kfar HaZen from a terrorist attack, showcasing extraordinary bravery, sacrifice, and resilience.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6250,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 380,
        "footnotes": ""
    },
    "categories": [
        380
    ],
    "tags": [],
    "class_list": [
        "post-6249",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-story"
    ],
    "lang": "en",
    "translations": {
        "en": 6249
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6249",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6249"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6249/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6251,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6249/revisions/6251"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6250"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6249"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6249"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6249"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}