{
    "id": 6252,
    "date": "2024-07-13T18:25:49",
    "date_gmt": "2024-07-13T15:25:49",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6252"
    },
    "modified": "2024-07-13T18:25:53",
    "modified_gmt": "2024-07-13T15:25:53",
    "slug": "the-heroic-battle-for-the-pega-outpost",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/victims/story/the-heroic-battle-for-the-pega-outpost/",
    "title": {
        "rendered": "The heroic battle for the &#8220;Pega&#8221; outpost"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"&quot;בלי הלוחמים - היו פי מאה נרצחים&quot;: הקרב ההירואי על מוצב &quot;פגה&quot;\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/DNdbfXZ5rjo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>The story of the Pega outpost during the Simchat Torah holiday in October is a gripping tale of heroism, sacrifice, and resilience. This account highlights how a small group of soldiers from the 13th Battalion of the Golani Brigade defended the outpost against overwhelming odds, demonstrating extraordinary bravery.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Calm Before the Storm</h4>\n\n\n\n<p>Simchat Torah at the Pega outpost, also known as Magen Bari, began as a routine holiday eve. Situated 300 meters from the Gaza border, the outpost was manned by 25 fighters and one officer. As they went about their usual activities, the tranquility was shattered by the sound of live fire, signaling the beginning of an unprecedented attack.</p>\n\n\n\n<h4 class=\"wp-block-heading\">A Sudden Assault</h4>\n\n\n\n<p>The attack came without warning. Soldiers, many caught off guard in their casual attire, quickly armed themselves and took defensive positions. Live fire erupted, and within moments, the outpost was under siege. The commander, Dekal Suisa, immediately took charge, organizing the defense and instructing soldiers to hold their ground.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Fierce Defense and Improvisation</h4>\n\n\n\n<p>The situation rapidly escalated as waves of terrorists breached the perimeter. Dekal Suisa, displaying remarkable leadership, coordinated the defense, directing soldiers to critical positions and personally engaging the attackers. Despite the chaos and the overwhelming number of terrorists—estimated at around 150—Dekal and his men held their ground.</p>\n\n\n\n<p>One poignant moment involved a soldier who was killed while attempting to deliver a missile. Dekal, undeterred, moved the body to the dining room and continued to fight. The soldiers improvised defenses, using grenades and whatever ammunition they had, despite being low on supplies.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Fight for Survival</h4>\n\n\n\n<p>The intensity of the battle was overwhelming. At one point, an RPG struck a wall, injuring soldiers and further compromising their position. Despite the injuries and the seemingly insurmountable odds, the soldiers continued to fight, moving to a guard tower to gain a better defensive position.</p>\n\n\n\n<p>As the terrorists advanced, the soldiers&#8217; resolve did not waver. They faced relentless attacks, including snipers and grenades. The outpost was engulfed in smoke, and the defenders had to contend with near-constant gunfire. In one desperate moment, a soldier made a recording on WhatsApp, pleading for reinforcements and detailing the dire situation.</p>\n\n\n\n<h4 class=\"wp-block-heading\">A Miraculous Escape</h4>\n\n\n\n<p>After hours of relentless fighting, a patrol team arrived to rescue the remaining soldiers. The arrival of reinforcements allowed the defenders to leave the outpost. Dekal Suisa&#8217;s efforts were instrumental in this escape; his leadership and bravery cleared a path through the terrorists. The soldiers, exhausted and battered, managed to run four kilometers to safety, narrowly avoiding further attacks.</p>\n\n\n\n<h4 class=\"wp-block-heading\">The Aftermath</h4>\n\n\n\n<p>The toll of the battle was immense. Fourteen soldiers and one officer fell, including Dekal Suisa and Ohad&#8217;s three best friends: Idan Raz, Shalv Bronze, and Iti Glisko. The battle, however, was not in vain. The Pega outpost was not captured, and the defenders&#8217; bravery ensured that the kibbutzim nearby were spared from even greater carnage.</p>\n\n\n\n<p>The story of the Pega outpost is one of unyielding bravery, where a small group of soldiers faced overwhelming odds and held their ground. Their sacrifice and heroism will be remembered for generations, a testament to the enduring spirit of the Golani Brigade and the incredible courage of those who defend their homeland.</p>\n\n\n\n<p>The Battle of Pega Outpost is a powerful narrative of courage and sacrifice. The soldiers of the 13th Battalion of the Golani Brigade displayed extraordinary resilience and bravery, holding their ground against overwhelming forces. Their story serves as a poignant reminder of the human spirit&#8217;s capacity for heroism in the face of unimaginable adversity.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p><a  href=\"https://iron-swords.co.il/t/golani-brigade/\">Golani Brigade</a>&#8216;s 13th Battalion heroically defended Pega Outpost against 150 terrorists on Simchat Torah, showcasing extraordinary bravery and resilience.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6254,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 380,
        "footnotes": ""
    },
    "categories": [
        380
    ],
    "tags": [],
    "class_list": [
        "post-6252",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-story"
    ],
    "lang": "en",
    "translations": {
        "en": 6252
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6252",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6252"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6252/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6255,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6252/revisions/6255"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6254"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6252"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6252"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6252"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}