{
    "id": 6688,
    "date": "2024-07-25T15:00:00",
    "date_gmt": "2024-07-25T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6688"
    },
    "modified": "2024-08-16T11:40:34",
    "modified_gmt": "2024-08-16T08:40:34",
    "slug": "the-hamas-rapist-regime-must-fall-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/the-hamas-rapist-regime-must-fall-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "The Hamas Rapist Regime Must Fall | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"The Hamas Rapist Regime Must Fall | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/-qo52kQsZL4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Note to our audience: Today&#8217;s session will cover subjects of sexual violence that may be difficult for some to hear.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Survivor&#8217;s Testimony</h3>\n\n\n\n<p>This week, a survivor of Hamas&#8217;s October 7th rape and murder rampage came forward on television. His face was hidden, and his voice distorted. He described on camera how Hamas&#8217;s elite death squads caught him as he fled from the Nova Music Festival massacre. What he shared was truly horrific:</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;You try to resist. They take off your clothes, laugh at you, humiliate you, spit on you, touch your private parts, rape you.&#8221;</p>\n</blockquote>\n\n\n\n<p>He was rescued by Israeli soldiers, one of the lucky ones to escape Hamas&#8217;s inhumanity with his life. Many of those raped were also murdered, as dead men tell no tales. This is convenient for those cynical Hamas cheerleaders who justify and even celebrate Hamas&#8217;s attack on October 7th while denying Hamas&#8217;s barbarity, akin to modern Holocaust denial. They claim with a straight face that Hamas are religious men who would never violate their faith by murdering civilians in cold blood, raping men, women, and children, especially not Jewish ones.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Denial of Atrocities</h3>\n\n\n\n<p>In response to overwhelming evidence of Hamas&#8217;s atrocities, senior Hamas official Basam Naim cited Islamic principles that forbid any sexual relationship outside of marriage as proof that such actions simply weren&#8217;t possible. After all, Hamas is an acronym in Arabic for Islamic Resistance Movement, the Palestinian branch of the Sunni Islamist sect, the Muslim Brotherhood. But the rape and wholesale slaughter of Jews on October 7th isn&#8217;t enough for the Hamas death cult. Hamas continues to prosecute inhumane atrocities against even their own people. Recently discovered Hamas documents reveal their protocols for finding and punishing homosexual people inside Gaza. Hamas interrogators are instructed on aggressive questioning focused solely on sexual preferences, and those suspected of homosexuality are routinely executed.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Documentation of Atrocities</h3>\n\n\n\n<p>Other Hamas documents, some found on the bodies of October 7th rapists and murderers, reveal the true face of Hamas: phrase books with Arabic translations of Hebrew for &#8220;take off your clothes,&#8221; &#8220;strip,&#8221; or &#8220;take off your pants.&#8221; Hamas&#8217;s Shura Council issued fatwas (Islamic legal rulings) giving religious permission for murder, mutilation, and sexual crime, especially for October 7th. Captured Hamas terrorists said they were ordered to murder women and children, crush their heads, cut them off, and rape corpses.</p>\n\n\n\n<p>Much of these atrocities were gleefully documented by these inhuman beasts with their own cameras set up to catalog every atrocity in excruciating detail. Nearly 10 months after Hamas declared war, after months of tender fathers and talking heads contextualizing October 7th, we must remember that October 7th was the deadliest day for the Jewish people since the Holocaust. Hamas murdered over a thousand men, women, children, and even infants. Their rape, mutilation, and murder were systemic and premeditated, and they still hold 120 people hostage, including babies. All barbarity is permitted in Hamas&#8217;s goal of destroying the Jewish state and committing genocide against its people. This is the enemy we in Israel still face today.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<p><strong>Camille on YouTube Live:</strong> What is a Philadelphia Corridor and why does Israel want to control it?</p>\n\n\n\n<p><strong>Response:</strong> The Philadelphia Corridor is a key strip of land bordering the southern part of the Gaza Strip from Egypt. It has been traditionally used as a base of control for those looking to get access in and out of Egypt to provide supplies, whether humanitarian, construction, or other affairs. Control of this corridor enables the IDF and Israel to prevent the import of non-humanitarian goods or goods that may be misused by Hamas, Islamic Jihad, and others for non-humanitarian purposes into the strip. This is why it is so important for Israel to maintain control in the area.</p>\n\n\n\n<p><strong>X on Instagram Live:</strong> What should we expect from BB&#8217;s speech in the United States and what do you think the American response will be?</p>\n\n\n\n<p><strong>Response:</strong> Benjamin Netanyahu&#8217;s speech in Congress is expected to emphasize the importance of the Israel-US relationship, transcending partisan politics. The key message will likely advocate for the strength of this relationship as liberal democracies fighting against tyrannical terror groups. This relationship must be maintained across all political landscapes.</p>\n\n\n\n<p><strong>Stella on Instagram Live:</strong> What has been Russia&#8217;s role in the war so far and what do you think will happen going forward?</p>\n\n\n\n<p><strong>Response:</strong> Russia, while prosecuting its own war in Ukraine, has aligned with Iran on various issues, including support for the Assad regime in Syria. Russia&#8217;s involvement reflects its interests rather than a commitment to liberal democracy. It is crucial for the US to continue supporting Israel as the only liberal democracy in the Middle East.</p>\n\n\n\n<p><strong>Instagram Live:</strong> What is the current situation and update with the Houthis in Yemen?</p>\n\n\n\n<p><strong>Response:</strong> The Houthis, serving as an Iranian proxy, continue to commit resources to conflicts far from their borders, such as the recent drone strike in Tel Aviv. This distracts from the dire needs of their own people, who suffer from starvation and lack of resources. The Houthis&#8217; actions highlight their priorities in promoting Iran&#8217;s interests over their own people&#8217;s welfare.</p>\n\n\n\n<p><strong>Instagram Live:</strong> Has there been sufficient support from the French to ensure the safety of Jewish Olympians and the Israeli team in the Olympics?</p>\n\n\n\n<p><strong>Response:</strong> As the Olympics approach, ensuring the safety of Israeli athletes is paramount, especially considering past tragedies like the 1972 Munich massacre. France, as a key ally, is likely aware of the need for increased security to protect Israeli athletes and their supporters. The hope is for a peaceful and secure Olympic Games.</p>\n\n\n\n<p><strong>Ashley Waxman Bakshi on Instagram Live:</strong> What do you say to Jews around the world who are removing their mezuzahs from their homes?</p>\n\n\n\n<p><strong>Response:</strong> It is a sad state of affairs when Jews feel the need to hide their identity. This is a call for the Jewish community to stand strong, support one another, and remain united. Jews around the world should work together at a grassroots level, providing support and care for each other, especially for the elderly and infirm. It&#8217;s a time to be alert and protective of one another while fostering a sense of community and solidarity.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>That is all we have time for in today&#8217;s Daily Briefing. Thank you for listening. Please tune in on YouTube, LinkedIn, Twitter, Instagram, or any platform at 3 PM Israel time, 8 AM Eastern. Your support is invaluable. Like, subscribe, and stay informed. Thank you for watching.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>A survivor of <a  href=\"/hamas\">Hamas</a>’s October 7th attack described the horrific abuse he endured. Despite overwhelming evidence, <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a> officials deny such actions, citing religious principles. The session also addressed strategic issues like the Philadelphia Corridor, <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>-US relations, Russia&#8217;s involvement, the Houthis, Olympic security, and Jewish unity amidst rising antisemitism.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6691,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306
    ],
    "class_list": [
        "post-6688",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans"
    ],
    "lang": "en",
    "translations": {
        "en": 6688,
        "ru": 6694,
        "he": 6697
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6688",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6688"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6688/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6692,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6688/revisions/6692"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6691"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6688"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6688"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6688"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}