{
    "id": 6047,
    "date": "2024-07-08T15:00:00",
    "date_gmt": "2024-07-08T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6047"
    },
    "modified": "2024-08-16T11:43:20",
    "modified_gmt": "2024-08-16T08:43:20",
    "slug": "todays-anti-israel-libel-daily-briefing-with-rachel-lester",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/todays-anti-israel-libel-daily-briefing-with-rachel-lester/",
    "title": {
        "rendered": "Today&#8217;s Anti-Israel Libel | Daily Briefing with Rachel Lester"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Today&#039;s Anti-Israel Libel | Daily Briefing with Rachel Lester\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/yOGYqDEuc1g?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I am citizen spokeswoman Rachel Lester. This is the daily briefing of the Israeli citizen spokesperson&#8217;s office. We are live on YouTube, Instagram, and X, so please begin submitting questions in the chat. Search for the Israeli citizen spokesperson&#8217;s office on all major podcast platforms for an audio-only version every day, and please like and subscribe as it really helps us reach a wider audience.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Current Events Update</h2>\n\n\n\n<p><strong>Status of the October 7th War</strong></p>\n\n\n\n<p>Today is day 276 of the October 7th War, just over 9 months since Hamas declared war on Israel with its brutal massacre and exactly 9 months since Hezbollah joined its fellow Iranian proxy with near-daily attacks on Northern Israel.</p>\n\n\n\n<p><strong>False Narratives Against Israel</strong></p>\n\n\n\n<p>A vicious lie is being manufactured against Israel right now in real time. Supposedly, the medical journal The Lancet says 186,000 Gazans have died because of Israel, not the 35,000 claimed by Hamas, but over five times more. Those who love to hate Israel are gleefully running with this false narrative. Social media posts by UN Special Rapporteur Francesca Albanese, UK Labour parliamentarian Zara Sultana, and pro-Iran lobbyist Trita Parsi have been shared tens of thousands of times since last night. The story has also been widely shared by some of the biggest promoters of anti-Israel conspiracy theories on the far left and the far right.</p>\n\n\n\n<p>For months and for years, they&#8217;ve been telling everyone who&#8217;d listen just how evil the Jewish state is, but five times as evil as even Hamas has been saying is incredible. It didn&#8217;t matter before and won&#8217;t matter after that The Lancet did not say that or anything at all. The letter, which the Lancet should have never run in the first place, predicts future deaths which might have been caused indirectly by the war. By definition, they haven&#8217;t happened. Its speculation is built on debunked claims about lack of aid, number of destroyed buildings, and pretending there are 10,000 unidentified Gazan bodies. The letter isn&#8217;t fact-checked or peer-reviewed science; it&#8217;s basically an opinion piece of fortune-tellers. It shouldn&#8217;t come as a surprise that one of the authors even shared an image of the bloody rallying of Israelis and seems to justify that kind of violence. But for Francesca and those like her, they share the lie and don&#8217;t care about the truth.</p>\n\n\n\n<p>This isn&#8217;t the first libel against the Jewish state, and even when they&#8217;re exposed, they don&#8217;t face consequences for lies about Israel. Francesca, for one, hasn&#8217;t hidden her feelings on Israel. She wrote earlier this year that October 7th wasn&#8217;t anti-Jewish and that Israel has no right to defend itself, and she still fills a UN role, though perhaps now she&#8217;ll finally have to answer for alleged financial misconduct. People like her are happy to throw up any lie they can about Israel again and again because, like all anti-Semitic libels throughout history, their goal is to demonize and delegitimize. Once they brazenly lied about the Jewish people, and now they brazenly lie about the Jewish state.</p>\n\n\n\n<h2 class=\"wp-block-heading\">News on the Ground</h2>\n\n\n\n<p><strong>IDF Operations in Gaza</strong></p>\n\n\n\n<p>Now let&#8217;s talk about the news on the ground. For the first time since January, IDF troops and tanks, with air support, have reinvaded Gaza City in what looks to be a major military maneuver. Israel is showing the Hamas rapist murderers that it can enter any part of the Gaza Strip at any time of its choosing. While details are still sparse, there have been reports of finding and destroying significant Hamas terror infrastructure, Hamas and Islamic Jihad terrorists, weapons, and investigation and detention rooms, including in the UNRWA headquarters. That&#8217;s right, even more cynical use of what should be protected humanitarian facilities by the rapists and murderers of October 7th.</p>\n\n\n\n<p>Israeli soldiers on the ground also engaged with and killed over 30 terrorists in the Rafah area. Israel warned civilians to get out of the way, as always, and organized an evacuation route for them to reach safety. Israel&#8217;s Air Force also intercepted aerial targets incoming from the Red Sea and from Lebanon. Yesterday, Israel transferred 272 trucks of humanitarian goods to the Gaza Strip, including six tankers of fuel and four of cooking gas. That brings the total amount of humanitarian aid delivered to Gaza to 38,870 truckloads since the beginning of the war. Right now, there are still approximately 1,150 trucks sitting on the Gazan side of the border, waiting to be picked up by the UN.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A Session</h2>\n\n\n\n<p><strong>Question from Julia on Instagram Live</strong></p>\n\n\n\n<p><strong>Q: Why does Hamas keep using UNRWA facilities over and over again?</strong></p>\n\n\n\n<p>A: Hamas has two main goals: attack Israel however possible and make Israel look bad to the international world however possible. For goal number one, using UNRWA facilities as a place to hide their weapons, build their tunnels, or even launch rockets at Israel is basically a no-brainer. Being UN&#8217;s responsibility gives those places, and by extension Hamas, more protection than other places in Gaza. Therefore, it&#8217;s easier to attack Israel without getting spotted or struck by the IDF. For goal number two, when the IDF does strike the Hamas weapons or tunnels or terrorists hiding in those UNRWA facilities, Hamas knows that 99% of the news coverage is going to be spun in a way to make Israel look bad for attacking the UN without any context that Hamas made it necessary. So for Hamas, taking advantage of UNRWA is basically a two-for-one terrorism bonus.</p>\n\n\n\n<p><strong>Question from Filipe on X</strong></p>\n\n\n\n<p><strong>Q: With everything going on in the US lately, do you think it&#8217;s time for American Jews to make Aliyah?</strong></p>\n\n\n\n<p>A: Yes and no. Yes, Israel is always going to be here for Jews around the world who want to be here, and ironically, every time these anti-Semitic protesters do what they&#8217;re doing, they&#8217;re only proving why exactly it&#8217;s so necessary that Israel, a strong and safe country for Jews, exists in the first place. But is it time to run away from this anti-Semitism? No, absolutely not. It&#8217;s time for American Jews to get organized and get stronger, to show the anti-Semites that we are not going anywhere. Let the anti-Semites keep burning American flags and showing the US exactly what their true colors are. Let the anti-Semites keep getting arrested, like six of them did in Philadelphia on the 4th of July. Let the anti-Semites keep giving the FBI reasons to investigate them, like they are now after the incident in LA two weeks ago. While the anti-Semites and Israel haters are showing the world, law enforcement, and elected officials exactly who they are, American Jews should continue to show the world that we&#8217;re on the right side.</p>\n\n\n\n<p><strong>Question from Mion on X</strong></p>\n\n\n\n<p><strong>Q: Are the lies from the terror Islamic Hamas and Iran winning the world over?</strong></p>\n\n\n\n<p>A: Well, Iran and Hamas are certainly trying their hardest, and as I said earlier in the briefing, people, especially people in power, are sharing them every single day. They have been for the last nine months; they&#8217;ve been doing it for our entire lives, to be honest. That&#8217;s why it&#8217;s so important that people like us and people like you watching continue to fight and share the truth every single day. It&#8217;s crucial to fact-check these lies and libels that are being spread to make us look bad so that they can delegitimize and demonize us. Every single day, we need to show the world that they&#8217;re wrong and that we&#8217;re on the right side.</p>\n\n\n\n<p><strong>Question from Erman on Instagram Live</strong></p>\n\n\n\n<p><strong>Q: When will the textbooks in UNRWA schools be exchanged for peaceful content?</strong></p>\n\n\n\n<p>A: I guess whenever the US, the UK, the UN, and leaders around the world decide to pressure Hamas into doing so or to say, you know, Hamas, it&#8217;s really not up to you anymore, and to change the textbooks themselves. That&#8217;s why it&#8217;s so important to constantly be talking to your elected officials, constantly be voting for people in power who are going to make the right decisions about the Middle East and the messaging that people in Gaza are growing up with. As far as when it&#8217;s going to happen, I can only hope that it&#8217;ll be tomorrow, but you know, one day at a time.</p>\n\n\n\n<p><strong>Question from Many Viewers</strong></p>\n\n\n\n<p><strong>Q: Can you please give any updates on the hostage deal that may or may not be on the table right now?</strong></p>\n\n\n\n<p>A: I don&#8217;t have much to say about the hostage deal right now. On Friday and Saturday, it looked like we had some promising signs from Hamas, and it looked like Israel was really reaching its goals in weakening Hamas and putting military pressure on them to acknowledge that we are not going to end the war until our hostages are home. At the moment, we don&#8217;t have exact updates on what&#8217;s going on because sharing updates can often sabotage the deals or make Hamas pull back or make any number of things go wrong. For the meantime, all we can do is pray that what the hostages deserve happens soon, which is that they&#8217;ll all be brought home as soon as possible.</p>\n\n\n\n<p><strong>Question from Paul Salts on Instagram Live</strong></p>\n\n\n\n<p><strong>Q: Why is Israel&#8217;s response to Hezbollah attacks so limited?</strong></p>\n\n\n\n<p>A: That&#8217;s a great question and one that I&#8217;ve been asking myself every day for the exactly nine months that these have been going on. Israel&#8217;s response has been limited because nobody really wants a full-out war with Hezbollah. The Israeli people don&#8217;t want a full-out war because it would be a disaster for us internally, and the Lebanese people don&#8217;t want a war because it would be a disaster for them internally. Likewise, we don&#8217;t want to have to bring Lebanon back to the brink of the disaster that Hezbollah brought on them in the Second Lebanon War in 2006. So, I think the answer to that is Israel has been walking this crazy line between response and no response to mitigate Hezbollah&#8217;s capabilities and prevent them from being able to attack more and more Israelis every single day, but also not escalating things so that we&#8217;re in a full-out war that none of us want. Especially because if we are the ones to launch a full-out war, then the world&#8217;s support, as limited as it already is, would be against us even more. So, Israel&#8217;s really playing this crazy game, walking this crazy fine line that no other country in the world would ever be expected to walk as we are between response and no response to address Hezbollah&#8217;s capability as best we can without escalating it into a full-on war.</p>\n\n\n\n<p><strong>Question from Benji LS on Instagram Live</strong></p>\n\n\n\n<p><strong>Q: Do we have any idea of when Hamas might be totally destroyed &#8211; weeks, months, years?</strong></p>\n\n\n\n<p>A: I wish I had an answer for you, and I think it depends on the way that the world continues to support or put pressure on what&#8217;s going on in the Middle East right now. Unfortunately, I don&#8217;t have an exact timeline.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Closing Remarks</h2>\n\n\n\n<p>Thank you so much for joining. Please tune in tomorrow at 3 p.m. Israel time, 8 a.m. Eastern time. Continue sending your questions to us in the DMs or wherever you&#8217;re watching and stay safe.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Israeli citizen spokeswoman <a  href=\"https://iron-swords.co.il/t/rachel-lester/\">Rachel Lester</a> addresses false narratives about the October 7th War and recent IDF operations in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>. She responds to questions on <a  href=\"/hamas\">Hamas</a> using UN facilities, the safety of American Jews, combating anti-Semitic lies, and the limited response to <a  href=\"/hezbollah\">Hezbollah</a> attacks, urging continued support and vigilance.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6048,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        498
    ],
    "class_list": [
        "post-6047",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-rachel-lester"
    ],
    "lang": "en",
    "translations": {
        "en": 6047,
        "he": 6052
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6047",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6047"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6047/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6051,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6047/revisions/6051"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6048"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6047"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6047"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6047"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}