{
    "id": 6052,
    "date": "2024-07-09T20:14:48",
    "date_gmt": "2024-07-09T17:14:48",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6052"
    },
    "modified": "2024-07-11T13:46:57",
    "modified_gmt": "2024-07-11T10:46:57",
    "slug": "todays-anti-israel-libel",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/he/israeli-citizen-spokesperson/todays-anti-israel-libel/",
    "title": {
        "rendered": "הוצאת דיבה אנטי-ישראלית של היום | תדרוך יומי עם רייצ&#8217;ל לסטר"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Today&#039;s Anti-Israel Libel | Daily Briefing with Rachel Lester\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/yOGYqDEuc1g?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>שלום לכולם, אני הדוברת האזרחית רחל לסטר. זהו התדרוך היומי של משרד הדוברות האזרחי של ישראל. אנחנו בשידור חי ביוטיוב, אינסטגרם ו-X, אז אנא התחילו להגיש שאלות בצ&#8217;אט. חפשו את משרד הדוברות האזרחי של ישראל בכל הפלטפורמות הגדולות של הפודקאסטים לגרסת אודיו בלבד בכל יום, ואנא עשו לייק והרשמו לערוץ כי זה באמת עוזר לנו להגיע לקהל רחב יותר.</p>\n\n\n\n<h2 class=\"wp-block-heading\">עדכון אירועים נוכחיים</h2>\n\n\n\n<p><strong>מצב המלחמה מ-7 באוקטובר</strong></p>\n\n\n\n<p>היום הוא היום ה-276 של מלחמת ה-7 באוקטובר, קצת יותר מ-9 חודשים מאז שחמאס הכריז מלחמה על ישראל עם טבח אכזרי, ובדיוק 9 חודשים מאז שחזבאללה הצטרף לאחיו המייצג האיראני עם תקיפות יומיות על צפון ישראל.</p>\n\n\n\n<p><strong>נרטיבים כוזבים נגד ישראל</strong></p>\n\n\n\n<p>כרגע מייצרים נגד ישראל שקר אכזרי בזמן אמת. לכאורה, כתב העת הרפואי &#8220;לנסט&#8221; טוען כי 186,000 עזתים מתו בגלל ישראל, ולא 35,000 שטוען חמאס, אלא פי חמישה יותר. אלה שאוהבים לשנוא את ישראל נהנים לרוץ עם הנרטיב השקרי הזה. פוסטים במדיה החברתית מאת הדיווחית המיוחדת של האו&#8221;ם פרנצ&#8217;סקה אלבאנזי, חברת הפרלמנט הבריטית זארה סולאנה ולוביסט פרו-איראני טארה פארסי חולקו עשרות אלפי פעמים מאז אתמול בערב. הסיפור גם חולק באופן רחב על ידי מקדמי תיאוריות קונספירציה נגד ישראל מהשמאל והימין הקיצוניים.</p>\n\n\n\n<p>כבר חודשים ושנים שהם מספרים לכל מי שמוכן לשמוע כמה המדינה היהודית רעה, אבל פי חמישה יותר ממה שאפילו חמאס טוען זה מדהים. זה לא משנה לפני ולא משנה אחרי שהלנסט לא אמר את זה או כל דבר בכלל. המכתב, שהלנסט לא היה צריך לפרסם מלכתחילה, חוזה מקרי מוות עתידיים שעשויים להיגרם בעקיפין על ידי המלחמה. על פי ההגדרה, הם לא קרו. ההשערות מבוססות על טענות שהוכחו כלא נכונות על חוסר סיוע, מספר הבניינים שנהרסו ועמידה על כך שיש 10,000 גופות עזתים לא מזוהות. המכתב אינו מבוקר עובדתית או מדעי שנבדק על ידי עמיתים; זה בעצם מאמר דעה של חוזי עתידות. אין להתפלא שאחד הכותבים אף שיתף תמונה של לינץ&#8217; בישראלים ומצדיק את סוג האלימות הזה. אבל פרנצ&#8217;סקה והאנשים כמותה, הם משתפים את השקר ולא אכפת להם מהאמת.</p>\n\n\n\n<p>זה לא השקר הראשון נגד המדינה היהודית, וגם כשהם נחשפים, הם לא מתמודדים עם השלכות לשקרים על ישראל. פרנצ&#8217;סקה, למשל, לא הסתירה את רגשותיה כלפי ישראל. היא כתבה מוקדם יותר השנה ש-7 באוקטובר לא היה אנטי-יהודי ושאין לישראל זכות להגן על עצמה, והיא עדיין ממלאת תפקיד באו&#8221;ם, למרות שאולי עכשיו היא סוף סוף תצטרך לענות על עבירות כלכליות לכאורה. אנשים כמותה שמחים להעלות כל שקר על ישראל שוב ושוב, כי כמו כל הליבלים האנטישמיים לאורך ההיסטוריה, מטרתם היא להדגיש ולגיטימציה. פעם הם שיקרו בברכה על העם היהודי, ועכשיו הם משקרים בברכה על המדינה היהודית.</p>\n\n\n\n<h2 class=\"wp-block-heading\">חדשות מהשטח</h2>\n\n\n\n<p><strong>פעולות צה&#8221;ל בעזה</strong></p>\n\n\n\n<p>עכשיו בואו נדבר על החדשות מהשטח. לראשונה מאז ינואר, חיילי צה&#8221;ל וטנקים עם סיוע אווירי נכנסו מחדש לעיר עזה במה שנראה כמהלך צבאי משמעותי. ישראל מראה לרוצחי האונס של חמאס שהיא יכולה להיכנס לכל חלק מרצועת עזה בכל זמן שתרצה. בעוד הפרטים עדיין מעורפלים, יש דיווחים על מציאת והשמדת תשתיות טרור משמעותיות של חמאס, מחבלים של חמאס והג&#8217;יהאד האסלאמי, נשק וחדרי חקירות ומעצר, כולל במטה אונר&#8221;א. נכון, אפילו שימוש ציני יותר במתקנים הומניטריים מוגנים לכאורה על ידי הרוצחים והאנסים של ה-7 באוקטובר.</p>\n\n\n\n<p>חיילי ישראל בשטח גם התעמתו והרגו מעל 30 מחבלים באזור רפיח. ישראל הזהירה את האזרחים לצאת מהדרך, כרגיל, וארגנה נתיב פינוי כדי להגיע למקום מבטחים. חיל האוויר של ישראל גם יירט מטרות אוויריות שהגיעו מהים האדום ומלבנון. אתמול, ישראל העבירה 272 משאיות של סחורות הומניטריות לרצועת עזה, כולל שש מכליות דלק וארבע של גז בישול. זה מביא את סך הסחורות ההומניטריות שהועברו לעזה ל-38,870 משאיות מאז תחילת המלחמה. כרגע יש כ-1,150 משאיות שיושבות בצד העזתי של הגבול, מחכות להילקח על ידי האו&#8221;ם.</p>\n\n\n\n<h2 class=\"wp-block-heading\">שאלות ותשובות</h2>\n\n\n\n<p><strong>שאלה מג&#8217;וליה ב-Instagram Live</strong></p>\n\n\n\n<p><strong>ש: למה חמאס ממשיך להשתמש במתקני אונר&#8221;א שוב ושוב?</strong></p>\n\n\n\n<p><strong>ת:</strong> לחמאס יש שני מטרות עיקריות: לתקוף את ישראל בכל דרך אפשרית ולהציג את ישראל באור רע בפני העולם הבינלאומי בכל דרך אפשרית. למטרה הראשונה, שימוש במתקני אונר&#8221;א כמקום להסתיר את נשקיהם, לבנות את מנהרותיהם או אפילו לשגר רקטות על ישראל הוא בסיסי מאוד. היותם באחריות האו&#8221;ם מעניקה לאותם מקומות, ולחמאס בהמשך, יותר הגנה מאשר במקומות אחרים בעזה. לכן, קל יותר לתקוף את ישראל מבלי להיחשף או להיפגע על ידי צה&#8221;ל. למטרה השנייה, כאשר צה&#8221;ל תוקף את נשק חמאס או את מנהרותיו או את המחבלים המסתתרים במתקני אונר&#8221;א, חמאס יודע ש-99% מהדיווחים התקשורתיים יסובבו כדי להציג את ישראל באור רע על התקיפה ללא הקשר שחמאס הפך את זה לנחוץ. לכן, לחמאס ניצול אונר&#8221;א הוא בונוס טרור כפול.</p>\n\n\n\n<p><strong>שאלה מפליפה ב-X</strong></p>\n\n\n\n<p><strong>ש: עם כל מה שקורה לאחרונה בארצות הברית, האם לדעתך הגיע הזמן שיהודים אמריקאים יעשו עלייה?</strong></p>\n\n\n\n<p><strong>ת:</strong> כן ולא. כן, ישראל תמיד תהיה כאן עבור יהודים ברחבי העולם שרוצים להיות כאן, ובאירוניה, כל פעם שהמפגינים האנטישמיים עושים את מה שהם עושים, הם רק מוכיחים מדוע בדיוק זה כל כך נחוץ שישראל, מדינה חזקה ובטוחה ליהודים, קיימת מלכתחילה. אבל האם זה הזמן לברוח מהאנטישמיות הזו? לא, בהחלט לא. זה הזמן ליהודים אמריקאים להתארגן ולהתחזק, להראות לאנטישמיים שאנחנו לא הולכים לשום מקום. תנו לאנטישמיים להמשיך לשרוף דגלים אמריקאים ולהראות לארצות הברית בדיוק מה הצבעים האמיתיים שלהם. תנו לאנטישמיים להמשיך להיעצר, כמו שישה מהם שנעצרו בפילדלפיה ב-4 ביולי. תנו לאנטישמיים להמשיך לתת ל-FBI סיבות לחקור אותם, כמו שהם עושים עכשיו לאחר התקרית בלוס אנג&#8217;לס לפני שבועיים. בעוד האנטישמיים ושונאי ישראל מראים לעולם, לרשויות האכיפה ולפקידים הנבחרים בדיוק מי הם, יהודים אמריקאים צריכים להמשיך להראות לעולם שאנחנו בצד הנכון.</p>\n\n\n\n<p><strong>שאלה ממיון ב-X</strong></p>\n\n\n\n<p><strong>ש: האם השקרים מהטרור האיסלאמי חמאס ואיראן מנצחים את העולם?</strong></p>\n\n\n\n<p><strong>ת:</strong> ובכן, איראן וחמאס בהחלט מנסים הכי חזק שלהם, וכפי שאמרתי מוקדם יותר בתדרוך, אנשים, במיוחד אנשים בעמדות כוח, משתפים אותם כל יום. הם עשו את זה במשך תשעת החודשים האחרונים; הם עשו את זה כל חיינו, אם נהיה כנים. לכן חשוב כל כך שאנשים כמונו ואנשים כמוכם הצופים ימשיכו להילחם ולשתף את האמת כל יום. זה קריטי לבדוק עובדות של השקרים והלבולים האלה שמפיצים כדי להציג אותנו באור רע כדי שהם יוכלו לדלגיטימציה ולדמוניזציה אותנו. כל יום, אנחנו צריכים להראות לעולם שהם טועים ושאנחנו בצד הנכון.</p>\n\n\n\n<p><strong>שאלה מהרמן ב-Instagram Live</strong></p>\n\n\n\n<p><strong>ש: מתי יוחלפו ספרי הלימוד בבתי הספר של אונר&#8221;א לתוכן של שלום?</strong></p>\n\n\n\n<p><strong>ת:</strong> אני מניחה שמתי שארצות הברית, בריטניה, האו&#8221;ם ומנהיגים ברחבי העולם יחליטו ללחוץ על חמאס לעשות זאת או לומר, אתם יודעים חמאס, זה באמת לא תלוי בכם יותר, ולהחליף את ספרי הלימוד בעצמם. לכן חשוב כל כך כל הזמן לדבר עם הפקידים הנבחרים שלכם, כל הזמן להצביע לאנשים בעמדות כוח שיעשו את ההחלטות הנכונות לגבי המזרח התיכון והמסרים שאנשים בעזה גדלים איתם. לגבי מתי זה יקרה, אני יכולה רק לקוות שזה יקרה מחר, אבל אתם יודעים, יום אחד בכל פעם.</p>\n\n\n\n<p><strong>שאלה שמגיעה מהרבה מהצופים שלנו בפלטפורמות שלנו</strong></p>\n\n\n\n<p><strong>ש: האם יש עדכונים לגבי עסקת השבויים שייתכן או לא על השולחן כרגע?</strong></p>\n\n\n\n<p><strong>ת:</strong> אין לי הרבה מה לומר על עסקת השבויים כרגע. ביום שישי ובשבת, נראה היה שהיו סימנים מבטיחים מחמאס, ונראה היה שישראל באמת משיגה את מטרותיה בהחלשת חמאס ולחץ צבאי עליהם להכיר בכך שלא נסיים את המלחמה עד שכל השבויים שלנו יחזרו הביתה. כרגע, אין לנו עדכונים מדויקים על מה קורה כי שיתוף עדכונים יכול לעיתים קרובות לחבל בעסקאות או לגרום לחמאס לסגת או לגרום לכל מספר של דברים להשתבש. אז בינתיים, כל מה שאנחנו יכולים לעשות זה להתפלל שהשבויים יקבלו את מה שמגיע להם בקרוב, שזה שהם יוחזרו הביתה בהקדם האפשרי.</p>\n\n\n\n<p><strong>שאלה מפול סלטס ב-Instagram Live</strong></p>\n\n\n\n<p><strong>ש: למה תגובת ישראל לתקיפות חזבאללה כל כך מוגבלת?</strong></p>\n\n\n\n<p><strong>ת:</strong> זו שאלה מצוינת ואחת ששאלתי את עצמי כל יום בדיוק תשעת החודשים הללו שזה קורה. התגובה של ישראל מוגבלת כי אף אחד באמת לא רוצה מלחמה כוללת עם חזבאללה. העם הישראלי לא רוצה מלחמה כוללת כי זו תהיה אסון עבורנו פנימית, והעם הלבנוני לא רוצה מלחמה כי זו תהיה אסון עבורם פנימית. כמו כן, אנחנו לא רוצים להביא את לבנון חזרה אל סף האסון שחזבאללה הביא עליה במלחמת לבנון השנייה ב-2006. אז אני חושבת שהתשובה לכך היא שישראל הלכה על הקו הדק הזה בין תגובה לא תגובה כדי למנוע את יכולות חזבאללה ולמנוע מהם לתקוף יותר ויותר ישראלים כל יום, אבל גם לא להסלים את הדברים למלחמה כוללת שאף אחד מאיתנו לא רוצה. במיוחד כי אם אנחנו נהיה אלה שיתחילו מלחמה כוללת, אז התמיכה העולמית, כפי שהיא מוגבלת כרגע, תהיה נגדנו עוד יותר. אז ישראל באמת משחקת את המשחק המטורף הזה, הולכת על הקו הדק הזה שאף מדינה אחרת בעולם לא תהיה מצופה ללכת עליו כמו שאנחנו בין תגובה לא תגובה כדי לטפל ביכולת חזבאללה בצורה הכי טובה שנוכל מבלי להסלים את זה למלחמה כוללת.</p>\n\n\n\n<p><strong>שאלה מבנג&#8217;י אלס ב-Instagram Live</strong></p>\n\n\n\n<p><strong>ש: האם יש לנו מושג מתי חמאס עשוי להיות מושמד לחלוטין &#8211; שבועות, חודשים, שנים?</strong></p>\n\n\n\n<p><strong>ת:</strong> הלוואי שהייתה לי תשובה בשבילך, ואני חושבת שזה תלוי בדרך שבה העולם ממשיך לתמוך או ללחוץ על מה שקורה במזרח התיכון כרגע. לצערי, אין לי תשובה מדויקת.</p>\n\n\n\n<h2 class=\"wp-block-heading\">סיכום</h2>\n\n\n\n<p>תודה רבה שהצטרפתם. בבקשה הצטרפו מחר בשעה 3 בצהריים שעון ישראל, 8 בבוקר שעון מזרחי. המשיכו לשלוח את השאלות שלכם אלינו בהודעות פרטיות או בכל מקום שאתם צופים, ושמרו על עצמכם.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>רחל לסטר, הדוברת האזרחית של ישראל, עדכנה בנוגע למלחמת ה-7 באוקטובר, חשפה נרטיבים כוזבים נגד ישראל, ודיווחה על פעולות צה&#8221;ל בעזה. היא ענתה לשאלות בנושאים כמו שימוש חמאס במתקני אונר&#8221;א, אנטישמיות בארה&#8221;ב, תגובת ישראל לחזבאללה, והתקדמות בעסקת השבויים.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6048,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 367,
        "footnotes": ""
    },
    "categories": [
        367
    ],
    "tags": [
        369
    ],
    "class_list": [
        "post-6052",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "he",
    "translations": {
        "he": 6052,
        "en": 6047
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6052",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6052"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6052/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6054,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6052/revisions/6054"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6048"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6052"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6052"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6052"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}