{
    "id": 6190,
    "date": "2024-07-11T15:00:00",
    "date_gmt": "2024-07-11T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6190"
    },
    "modified": "2024-07-12T07:27:32",
    "modified_gmt": "2024-07-12T04:27:32",
    "slug": "un-aid-being-attacked-by-gazans-daily-briefing-with-eylon-levy",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/un-aid-being-attacked-by-gazans-daily-briefing-with-eylon-levy/",
    "title": {
        "rendered": "UN: Aid Being Attacked by Gazans | Daily Briefing with Eylon Levy"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"UN: Aid Being Attacked by Gazans | Daily Briefing with Eylon Levy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/VfAtPTaCYHY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Today marks day 279 of the October 7th War and the hostage crisis, nine months after the October 7th Massacre. Hamas is still fighting out of civilian buildings and areas. It started this war and chose to turn schools and hospitals into battlefields. Hamas doesn&#8217;t see Palestinian civilians as human shields; it sees them as human sacrifices. Hamas wants civilians to get killed, so it hides behind them. Israel wants civilians to live, so it&#8217;s organizing evacuations for their own safety, even though their own government wants them dead.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Evacuations in Gaza City</h3>\n\n\n\n<p>Israel is urging all residents of Gaza City to evacuate south for their own safety. Israel is dropping leaflets urging people to leave what will be a dangerous combat zone via designated safe routes. It’s odd that Israel is the side organizing and facilitating evacuations of Palestinian civilians, not their own government—that&#8217;s Hamas. Everyone takes for granted that Hamas will do everything it can to keep civilians in danger. We need to call that out. Israel is going above and beyond what international law expects in keeping civilians safe.</p>\n\n\n\n<h3 class=\"wp-block-heading\">International Law and Precautions</h3>\n\n\n\n<p>There&#8217;s a principle in international law called precaution, which involves warning of upcoming military activity when possible. That&#8217;s what Israel is doing. UN officials may condemn Israel for the evacuation orders, calling them forced displacement. They are trying to criminalize evacuations and keep Palestinian civilians as cannon fodder for Hamas while Israel tries to save them. It’s crucial to call out the UN for turning a blind eye to terrorists fighting out of their own buildings, supporting Hamas&#8217;s strategy.</p>\n\n\n\n<h3 class=\"wp-block-heading\">IDF Operations</h3>\n\n\n\n<p>Just this week, the IDF conducted a counterterror operation against Hamas and Islamic Jihad terrorists fighting out of the UNRWA headquarters in Gaza City—a UN building. We cannot accept that the UN is aiding and abetting a terrorist army that wants to murder Jews, Israelis, and destroy a UN member state. Hamas is responsible for every death in this war since it invaded Israel on October 7th. If UN officials obstruct the evacuation of civilians from a dangerous combat zone, they will also have blood on their hands.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Aid and Distribution Issues</h3>\n\n\n\n<p>The UN has admitted that trucks are getting into Gaza, but Gazans are smashing them up. For months, the UN blamed Israel for aid shortages. Israel is allowing unlimited amounts of aid by air, land, and sea, but the UN is struggling to distribute it, and the aid is getting hijacked by Hamas and criminal gangs. Israel is flooding Gaza with aid, yet the UN is blaming Israel to cover up for Hamas. The UN has undercounted the aid trucks going into Gaza by about 8,000.</p>\n\n\n\n<h3 class=\"wp-block-heading\">UN Spokesman Statement</h3>\n\n\n\n<p>UN spokesman Sean Judar said just yesterday, &#8220;Palestinian men with sticks are waiting for trucks to leave the Karam Shalom Crossing into Gaza.&#8221; The aid is getting in, but Gazans are smashing up the trucks. This happens because Israel is targeting Hamas, and until now, the UN relied on Hamas for police protection. The New York Times reported that organized crowds are looting aid trucks to steal cigarettes smuggled inside. UN officials say these attacks are a major obstacle to aid distribution.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Aid Mismanagement</h3>\n\n\n\n<p>There’s so much food entering Gaza that UN officials are reporting bags of flour being thrown by the side of the street—not what you’d expect if there were genuine starvation. Over 1,000 aid trucks&#8217; contents have been stuck for weeks inside Gaza on the Garen side of Karam Shalom. Israel has taken major steps to help the UN distribute aid, but the UN needs to scale up its operations, call out the gangs looting the aid trucks, and stop blaming Israel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Levi Golding</h4>\n\n\n\n<p><strong>Q:</strong> Is the war with Lebanon going to happen, and if so, when?</p>\n\n\n\n<p><strong>A:</strong> There is already a war with Lebanon. On October 8th, Hezbollah, Iran&#8217;s proxy army in Lebanon, declared war on Israel. Since then, it has fired 6,000 rockets and suicide drones at Israel, forced 60,000 Israelis to flee their homes, and subjected northern Israel to constant rocket sirens and UAV alerts. Israel has been taking action in Lebanon, including air strikes to degrade Hezbollah&#8217;s capabilities. The war is already happening; the question is whether it will escalate into an all-out war.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question about the Iron Dome</h4>\n\n\n\n<p><strong>Q:</strong> How come the two Israelis who were unfortunately killed yesterday by Hezbollah weren&#8217;t saved by the Iron Dome?</p>\n\n\n\n<p><strong>A:</strong> The Iron Dome system is not 100% airtight; it has a 95% effectiveness rate. It becomes more effective the further away the rockets are launched. When rockets are launched at a very short range, sometimes they can get through. This shows that Israel cannot rely solely on the Iron Dome and must end the war with Hamas in Gaza by destroying its military and governing capabilities.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Michelle</h4>\n\n\n\n<p><strong>Q:</strong> How do we change the narrative online? The disinformation war is so difficult and the algorithms are so strong and hard to fight. What do you recommend?</p>\n\n\n\n<p><strong>A:</strong> The social media battle is difficult because it’s a numbers game. There are far fewer of us than there are of them, and algorithms promote already popular content. We&#8217;re getting slaughtered online, especially on platforms like TikTok. However, the real world isn&#8217;t just social media. We need to take information and have difficult conversations with friends, family, and colleagues in the real world. This is the purpose of the citizen spokesperson&#8217;s office: to arm you with the information and arguments to have these conversations outside social media.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>That’s all we have time for today. We’ll be back on Sunday at 3:00 PM Israel time (8:00 AM Eastern) with our team of citizen spokespeople. Please subscribe, follow on all social media platforms, and share with one more friend who will find these briefings useful. Thank you and Shabbat Shalom.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Today marks day 279 of the October 7th War. <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> is urging <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a> City residents to evacuate south for safety as <a  href=\"/hamas\">Hamas</a> continues to use civilians as shields. <a  href=\"https://iron-swords.co.il/t/the-un/\">The UN</a> faces criticism for mismanaging aid and hindering evacuations. The war with <a  href=\"/hezbollah\">Hezbollah</a> in Lebanon is ongoing, with escalating tensions in the north.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6191,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        181
    ],
    "class_list": [
        "post-6190",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-eylon-levy"
    ],
    "lang": "en",
    "translations": {
        "en": 6190
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6190",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6190"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6190/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6192,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6190/revisions/6192"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6191"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6190"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6190"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6190"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}