{
    "id": 6555,
    "date": "2024-07-22T15:00:00",
    "date_gmt": "2024-07-22T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6555"
    },
    "modified": "2024-08-16T11:40:44",
    "modified_gmt": "2024-08-16T08:40:44",
    "slug": "un-court-rules-jews-get-out-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/un-court-rules-jews-get-out-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "UN Court Rules: Jews Get Out | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"UN Court Rules: Jews Get Out | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/c7IEXZXYeFc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Well, it is official. The Jews have been told to get out. The International Court of Justice, the UN court, has given an advisory opinion that Israel must evacuate the territories it conquered from Egypt and Jordan back in 1967, including, wait for it, the Old City of Jerusalem. This is the same UN court chaired by Lebanese diplomat Naav Salam, despite his massive and obvious conflict of interest. Salam wants you to think it&#8217;s a violation of international law for Jews to live in the Jewish Quarter of the Old City of Jerusalem, that Israel must ethnically cleanse them and hand over the Western Wall to a fictitious Palestinian state. The law he claims demands it. This opinion is coming 80 years after the Holocaust and the ethnic cleansing of Jews from Europe. The UN&#8217;s top court is calling for the ethnic cleansing of Jews from the Jewish homeland. This immoral opinion is frankly absurd but not really surprising. The same UN&#8217;s Human Rights Council spends most of its time bashing the Jewish state while being chaired by the world&#8217;s worst human rights violators. The same UN continues to launder money for Hamas through UNRWA while indoctrinating Palestinian children to reject peace and turning a blind eye to Hamas terrorists as they fight out of UN schools.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Understanding the International Court of Justice</h3>\n\n\n\n<p>Let&#8217;s understand a little bit more about how the ICJ works because, despite the name, the ICJ doesn&#8217;t actually operate anything close to an actual court. The ICJ&#8217;s ruling is only advisory, not legally binding, and the court doesn&#8217;t use some of the most basic legal practices, including rules of evidence. Instead of verified facts, it&#8217;s basing itself on talking points from partisan anti-Israel organizations. Court members aren&#8217;t selected based on legal experience but by the same political voting as the rest of the UN. And that&#8217;s why Naav Salam can be the court&#8217;s president even though, as Lebanon&#8217;s ambassador to the UN, he many times attacked Israel in partisan vitriolic ways. Salam also has his eye on higher office back in Lebanon, something that must influence his rulings. So, in any real court of justice, Naav Salam would have to recuse himself. The whole trial would be thrown out as a mistrial because you cannot fairly judge a defendant if you&#8217;ve spent your whole career attempting to prosecute them.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Vice President Julia Sebutinde&#8217;s Perspective</h3>\n\n\n\n<p>It&#8217;s absurd to call Jews in Israel settler colonialists, but don&#8217;t just take our word for it. That&#8217;s what the ICJ&#8217;s Vice President Julia Sebutinde actually said. Sebutinde, the first African woman to sit on the ICJ, ripped into her colleagues&#8217; opinion, tearing it to shreds and calling for ongoing efforts to resolve the conflict through a negotiation framework instead of simply trying to ignore the history and context as so many of her colleagues seemed eager to do. Her dissent highlighted simple facts:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Historical Presence:</strong> The Jewish people have been in Jerusalem for 3,000 years. Jerusalem, whose name is in the Hebrew language, has since then been a focal point of Jewish life, culture, and religious belief. Their bond to the land has persisted despite the adversities, persecution, and diaspora the Jewish people have faced over millennia.</li>\n\n\n\n<li><strong>Conflict Nature:</strong> The Arab-Israeli conflict is not actually about land. Since the October 7th massacre, it has become clear that the conflict has always been about the denial of Israel&#8217;s existence and legitimacy as an independent non-Arab state in a region perceived as belonging exclusively to the Arabs.</li>\n</ol>\n\n\n\n<p>Israel continues to weaken Hamas, defends its people against Hezbollah&#8217;s 6,000 rockets, missiles, and drones launched out of Lebanon, strikes back against the Houthis in Yemen, and continues to stand against Iran&#8217;s proxy armies and all those who try to murder the Jewish people in their homeland. Israel continues to stand against those like the UN who seek to ignore the need for negotiations on the ground and seek simply to expel the Jewish people from territory by decree. Israel believes in justice, not this kangaroo court, and believe me, I&#8217;m an Australian, I know what a kangaroo court looks like.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Audience Q&amp;A Session</h3>\n\n\n\n<p><strong>YouTube Live Question:</strong> Why did Israel announce that people need to leave part of the humanitarian zone in Gaza?</p>\n\n\n\n<p><strong>Answer:</strong> This is part of a sad reality that exists in the current state of play in the Gaza Strip right now. Israel is attempting to set up designated humanitarian zones which are intended to be places for civilians to seek safety and security, not as places for Hamas or Islamic Jihad operatives to operate out of. Unfortunately, as these humanitarian zones are set up, Hamas operatives and their ilk like to pop up in these same areas, continue to perform attacks, move resources, and ignore the supposed nature of a humanitarian zone. Israel has to manage the reality on the ground from a strategic military standpoint as it attempts to dismantle Hamas, Islamic Jihad, and any other terrorist operations occurring inside the Gaza Strip. They must inform Gazan civilians to get out of the way so Israel can operate cleanly to remove these operatives.</p>\n\n\n\n<p><strong>LinkedIn Live Question:</strong> Is Muhammad Deif still alive, and if he has been eliminated, won&#8217;t somebody else just take his place?</p>\n\n\n\n<p><strong>Answer:</strong> As it stands right now, it is not 100% clear whether Muhammad Deif is alive or was killed in the recent attempt to take him out. However, Deif is like no other operative, having operated for decades and masterminded many attacks against Israel. While other operatives may attempt to take his place, removing a mastermind like Deif is strategically and militarily valuable to weakening Hamas and their interests in Gaza and beyond.</p>\n\n\n\n<p><strong>YouTube Live Question:</strong> What about the announcement recently about President Biden&#8217;s decision to not run for reelection? How will this impact US-Israel relations and the ongoing war?</p>\n\n\n\n<p><strong>Answer:</strong> US politics aside, the US has been and should continue to support Israel in its role as a western liberal democracy fighting against the likes of Hamas, Islamic Jihad, Hezbollah, and the Iranian regime. Israel seeks to maintain and continue its strong connection with the US, and it is assumed that the US will continue to support one of its key strategic allies, Israel, in its fight to stabilize the region, ensure security, and return hostages.</p>\n\n\n\n<p><strong>Instagram Live Question:</strong> How can we put more pressure on Qatar?</p>\n\n\n\n<p><strong>Answer:</strong> Qatar has been a key funder and supporter of Hamas, providing resources, shelter, and supplies. To put pressure on Qatar, a coalition of strong partners, liberal democracies, must work together to ensure fair, legal, and peaceful sovereignty throughout the region. This requires cooperation with allies such as the US, Europe, and others to hold Qatar accountable and push for a peaceful solution in Israel.</p>\n\n\n\n<p><strong>Instagram Live Question:</strong> Has the UN or UNRWA ever confirmed that Hamas used schools and other properties as bases to launch rocket and missile offenses?</p>\n\n\n\n<p><strong>Answer:</strong> There have been claims and evidence of UNRWA facilities being used to facilitate Hamas activities. However, clear and strong condemnation from UNRWA or the UN is often lacking. Israel frequently faces accusations despite the reality that civilian infrastructure is used by Hamas for military purposes. The credibility of these organizations is questioned due to their failure to address these abuses directly.</p>\n\n\n\n<p><strong>Instagram Live Question:</strong> Is there any security concern given the Olympic Games happening in Paris?</p>\n\n\n\n<p><strong>Answer:</strong> Yes, there are security concerns, especially given Israel&#8217;s history of attacks on its athletes, such as the 1972 Munich Olympics. Security apparatuses are being put in place, and Israel is ensuring the safety of its athletes. Despite these concerns, Israel will continue to participate on the international stage proudly.</p>\n\n\n\n<p><strong>Instagram Live Question:</strong> Given the Houthi attack on Tel Aviv this past weekend and Israel&#8217;s response, do you think there will be an escalation in the war?</p>\n\n\n\n<p><strong>Answer:</strong> The Houthis have escalated their attacks, and Israel has responded firmly to show that such actions will not be tolerated. Israel will continue to defend its people and sovereignty against such attacks and will respond vigorously to any further aggression.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion</h3>\n\n\n\n<p>That is all the time we have today on the daily briefing for the Israeli Citizen Spokesperson&#8217;s Office. Thank you for viewing. Please like, subscribe, and share this with friends, peers, and colleagues. It is crucial to spread the message about the reality on the ground in Israel. I&#8217;ve been Ash Westrop-Evans, thanks for watching.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The International Court of Justice has issued an advisory opinion demanding <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> evacuate territories taken in 1967, including <a  href=\"https://iron-swords.co.il/t/jerusalem/\">Jerusalem</a>&#8216;s Old City. This decision, criticized for conflicts of interest and lack of legal rigor, is seen as unjust and disregards historical and current geopolitical realities, calling for further scrutiny and debate.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6558,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306
    ],
    "class_list": [
        "post-6555",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans"
    ],
    "lang": "en",
    "translations": {
        "en": 6555
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6555",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6555"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6555/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6557,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6555/revisions/6557"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6558"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6555"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6555"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6555"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}