{
    "id": 5973,
    "date": "2024-07-07T15:00:00",
    "date_gmt": "2024-07-07T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=5973"
    },
    "modified": "2024-07-07T22:27:44",
    "modified_gmt": "2024-07-07T19:27:44",
    "slug": "un-schools-hamas-favorite-hideout-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/un-schools-hamas-favorite-hideout-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "UN Schools – Hamas&#8217; Favorite Hideout | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"UN Schools – Hamas&#039; Favorite Hideout | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/u0J4a-axJhs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I am citizen spokesperson Asher Westropp-Evans, and this is the daily briefing of the Israeli citizen spokesperson&#8217;s office. We&#8217;re live on YouTube, Instagram, and X, so please start submitting questions in the chat. Search for the Israeli citizen spokesperson&#8217;s office on all major podcast platforms for an audio-only version each day. Please like and subscribe, as it really helps us reach a wider audience of those who need to hear our message.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Current Events Update</h4>\n\n\n\n<p>Today is day 2075 of the October 7 War, nine months since Hamas declared war with its brutal massacre. Israel has struck a UN school; actually, Israel has struck three UN schools since Thursday. Since October 7th, Israel has acted in and around multiple UN facilities, clinics, mosques, and even hospitals. While this may cause a gut reaction of aversion, in truth, there is no question as to why.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Recent Strikes on UN Schools</h4>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>July 6th</strong>: Israel struck the Al Jauni UNRWA school in central Gaza because Hamas was launching attacks from this UNRWA school.</li>\n\n\n\n<li><strong>July 4th</strong>: Israel struck two UNRWA schools, Alaha School in Al Fukan and Musa School in Daraj Tua, because Hamas terrorists were launching attacks from both schools.</li>\n\n\n\n<li><strong>June 30th</strong>: Israel found dozens of Hamas weapons, grenades, and valuable intelligence in a school in Chaya. The same day, they found communications and observation gear along with intelligence in a medical clinic being used by Hamas as a command center.</li>\n\n\n\n<li><strong>June 29th</strong>: A tunnel under the UNRWA school was found in Rafa.</li>\n\n\n\n<li><strong>June 24th</strong>: Hamas terrorists, including some who took part in the October 7th massacre, were struck in northern Gaza schools in Shati and Daraj Tua.</li>\n\n\n\n<li><strong>June 7th</strong>: Israel struck Hamas murderers meeting in a shipping container on the grounds of the Asma UNRWA school in Shati, northern Gaza, stopping an imminent attack.</li>\n\n\n\n<li><strong>June 6th</strong>: Israel struck an UNRWA school in Nerat in central Gaza, killing at least 17 Hamas and Islamic Jihad terrorists, including some who took part in the October 7th massacre.</li>\n</ul>\n\n\n\n<p>This is just a sample from the last month. The list of schools goes on and on, and Hamas doesn&#8217;t just use UN schools.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Historical Context</h4>\n\n\n\n<p>Going back to February, Hamas Intel HQ, including servers, was found underneath the UN&#8217;s Gaza headquarters, with wires running from UNRWA&#8217;s facility to the Hamas base. Hamas has been using this playbook for years because it keeps working. Rockets were found in tunnels underneath UN locations before October 7th, including three separate incidents of rockets discovered in July 2014. Other discoveries were reported in October 2017, April 2020, May 2021, and November 2022.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Hamas&#8217; Tactics</h4>\n\n\n\n<p>Hamas are terrorists exploiting resources allocated to help civilians. They have lied for years about the numbers and identities of people who have been killed in Gaza as a result of their violent and heinous actions. They lie every single day about why schools, mosques, hospitals, and all manner of UN facilities are being struck. The Hamas terrorist organization systematically and strategically operates in what should be protected humanitarian sites. Why? Because it&#8217;s a win-win for the Iran proxy: if they succeed in murdering Israelis, win. If international organizations and media accuse Israel of attacks on schools, win. Never mind that Hamas endangers Gazans in their hospitals, mosques, and schools; these key pieces of infrastructure lose to the needs of Hamas.</p>\n\n\n\n<p>This has been the Hamas MO for years, and anyone repeating Hamas&#8217; propaganda only encourages them to keep up this heinous practice of using UN facilities and civilian infrastructure as part of their war against Israel and others.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h3 class=\"wp-block-heading\">Q&amp;A Session</h3>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Leanne on Instagram Live</h4>\n\n\n\n<p><strong>Q</strong>: It&#8217;s been nine months since October 7th, and at least a dozen women are still held hostage by Hamas. What is Israel going to do if what we all fear comes true regarding the speculation of pregnancies among Israeli women who are held hostage?</p>\n\n\n\n<p><strong>A</strong>: Thank you, Leanne, for that question. Nine months is certainly an auspicious number, marking enough time for a woman to bear a child and for children to live their entire youth in the midst of this ongoing war. This is a terrible situation, and we always plead for all hostages to be brought back home now. Hamas must release these hostages immediately. The situation is utterly intolerable, and this nine-month mark serves as a critical symbol for all those who believe in the release of the hostages. We hope and pray that these women are not facing the heinous atrocities that we can imagine, and we will see what happens as more people are hopefully brought home soon.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Social Media</h4>\n\n\n\n<p><strong>Q</strong>: What can you tell us about the hostage deal on the table? Will Israel agree to the deal?</p>\n\n\n\n<p><strong>A</strong>: The latest information indicates that Hamas has moved somewhat on their key requirement that Israel declare an end to the war in perpetuity before coming to the table for a ceasefire negotiation. However, much of what we hear is speculative and subject to change. It is difficult to lay down a concrete timeline, as much depends on ongoing diplomacy involving multiple nations. What we do know is that the hostages must be brought home, alive or deceased, as a precursor to any deal. This is critical for Israel and its people.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Shulie on Instagram Live</h4>\n\n\n\n<p><strong>Q</strong>: Over the past nine months, there have been many crimes committed by the UN or UNRWA against Israel. How can other world nations continue to be members of the United Nations?</p>\n\n\n\n<p><strong>A</strong>: Shulie, the question of the UN&#8217;s actions is undoubtedly one that needs to be held to account. These institutions need to be scrutinized for their actions, whether it be using schools, hospitals, and mosques as cover for Hamas or their actions in the UN General Assembly. Individual world leaders need to stand up and advocate for better UN policies and take unilateral actions to support Israel. This is the forum available for world leaders, and they need to ensure that Israel can defend its people and sovereignty.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Benji on Inam Live</h4>\n\n\n\n<p><strong>Q</strong>: There have been many elections around the world, including the recent victory by the British Labour Party. How does Israel feel about this victory?</p>\n\n\n\n<p><strong>A</strong>: The Labour Party now leads the UK government. It&#8217;s not for us to weigh in on the domestic politics of another nation, but regardless of who is in charge, Israel needs the support of the UK and other liberal democracies. Israel is a liberal democracy and must be protected by like-minded nations. The support of these nations is critical for Israel to defend its people and sovereignty, regardless of who is in power.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Enrique on YouTube Live</h4>\n\n\n\n<p><strong>Q</strong>: Can you give an update on the situation in the north of Israel since last week?</p>\n\n\n\n<p><strong>A</strong>: Enrique, thank you for your question. Hezbollah maintains positions south of the Lani River in violation of the UN Security Council resolution, posing a threat to Israel and the communities in the north. Over 60,000 internally displaced people cannot return to their homes. The situation is untenable and must change. Hezbollah must pull back, or it will be pushed back by Israel. We must return to the UN Security Council resolution to create peace along the northern border.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Question from Deborah on Instagram Live</h4>\n\n\n\n<p><strong>Q</strong>: Given the hostage deal on the table, how can Israel honestly negotiate in good faith with terrorists?</p>\n\n\n\n<p><strong>A</strong>: Deborah, this is a question faced daily by Israelis. It is difficult to negotiate in good faith with those who have given us nothing but bad faith. However, Israel must do everything it can to bring the hostages home. This may mean dealing with bad faith actors, but the pragmatic facts on the ground require us to bring the hostages home. Israel is attempting to do this every day, despite the challenges.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h3 class=\"wp-block-heading\">Closing Remarks</h3>\n\n\n\n<p>Alright, that&#8217;s all we have time for today. I&#8217;ll remind everyone to please continue watching at 3 p.m. Israel time each working day and 8 a.m. on the US East Coast. Please like and subscribe on Twitter, YouTube, X, TikTok, and LinkedIn. It is important to get our message out to as wide a community as possible. Thank you for joining, and I appreciate your support. I&#8217;ve been Asher Westropp-Evans.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Israeli citizen spokesperson Asher Westropp-Evans reports on <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>&#8216;s strikes on <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a> schools used by <a  href=\"/hamas\">Hamas</a> for attacks. He highlights <a  href=\"https://iron-swords.co.il/c/know-your-enemies/hamas/\">Hamas</a>&#8216; exploitation of civilian infrastructure and addresses questions on <a  href=\"https://iron-swords.co.il/t/hostages/\">hostages</a>, international diplomacy, and security concerns in northern Israel. The focus remains on Israel&#8217;s efforts to protect its citizens.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 5975,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [],
    "class_list": [
        "post-5973",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson"
    ],
    "lang": "en",
    "translations": {
        "en": 5973
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5973",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=5973"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5973/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 5976,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/5973/revisions/5976"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/5975"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=5973"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=5973"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=5973"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}