{
    "id": 6601,
    "date": "2024-07-24T23:21:15",
    "date_gmt": "2024-07-24T20:21:15",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6601"
    },
    "modified": "2024-07-24T23:21:20",
    "modified_gmt": "2024-07-24T20:21:20",
    "slug": "unity-and-resolve-benjamin-netanyahus-historic-address-to-congress",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/facts/unity-and-resolve-benjamin-netanyahus-historic-address-to-congress/",
    "title": {
        "rendered": "Unity and Resolve: Benjamin Netanyahu&#8217;s Historic Address to Congress"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"לקול תרועות חברי הקונגרס: הנאום ההיסטורי של רה&quot;מ בנימין נתניהו | צפו\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/YxKk4oAFM9I?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Senator Ben Carden, Minority Leader Hakeim Jeff, Senate Majority Leader Chuck Schumer, Senate Minority Leader Mitch McConnell, Senators, members of Congress, distinguished guests, Mr. Speaker, I want to thank you for giving me the profound honor of addressing this great Citadel of democracy for the fourth time.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Crossroads of History</h2>\n\n\n\n<p>We meet today at a Crossroads of History. Our world is in upheaval in the Middle East. Iran&#8217;s axis of Terror confronts America, Israel, and our Arab friends. This is not a clash of civilizations; it&#8217;s a clash between barbarism and civilization. It&#8217;s a clash between those who glorify death and those who sanctify life. For the forces of civilization to triumph, America and Israel must stand together because, when we stand together, something very simple happens: we win, they lose. My friends, I came to assure you today of one thing: we will win.</p>\n\n\n\n<h2 class=\"wp-block-heading\">A Day of Infamy</h2>\n\n\n\n<p>Ladies and gentlemen, like December 7th, 1941, and September 11th, 2001, October 7th is a day that will forever live in infamy. It was the Jewish holiday of Simchat Torah. It began as a perfect day, not a cloud in the sky. Thousands of young Israelis were celebrating at an outdoor music festival. Suddenly, at 6:29 a.m., as children were still sleeping soundly in their beds in the towns and kibbutzim next to Gaza, heaven turned into hell. Three thousand Hamas terrorists stormed into Israel. They butchered 1,100 people from 41 countries, including 39 Americans. Proportionately, compared to our population size, that&#8217;s like 29/11s in one day. These monsters raped women, beheaded men, burned babies alive, and killed parents in front of their children and children in front of their parents. They dragged 255 people, both living and dead, into the dark dungeons of Gaza. Israel has already brought home 135 of these hostages, including seven who were freed in daring rescue operations.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Heroic Rescues and Personal Stories</h2>\n\n\n\n<p>One of those freed hostages, Noa Gaman, is here in the gallery, sitting near my wife Sarah. On the morning of October 7th, the entire world saw Noa&#8217;s look of desperation as she was violently abducted to Gaza on the back of a motorcycle. I met Noa&#8217;s mother, Leora, a few months ago. She was dying of cancer. She said to me, &#8220;Prime Minister, I have one final wish: I wish to hug my daughter Noa one last time before I die.&#8221; Two months ago, I authorized a breathtaking commando rescue operation. Our special forces, including a heroic officer named Arnon Mora, who fell in this battle, rescued Noa and three other hostages. Noa, I think it&#8217;s one of the most moving things when Noa was reunited with her mother, Leora, and her mother&#8217;s last wish came true. Noa, we&#8217;re so thrilled to have you with us today. Thank you.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hostage Families</h2>\n\n\n\n<p>Many hostage families are also here with us today, including El Bibas. El Bibas is the grandfather of those two beautiful redheaded boys, the Bibas boys, toddlers, and they were taken hostage with their mother. The entire family was taken hostage: two beautiful red-haired children taken hostage by monsters. With us also is Sim, whose son Yam bravely escaped Hamas captivity with two other Israelis and, tragically, they were killed making their way back to our lines. We also have the families of American hostages here. The pain these families have endured is beyond words. I met with them again yesterday, and I promised them this: I will not rest until all their loved ones are home, all of them. As we speak, we&#8217;re actively engaged in intensive efforts to secure their release, and I&#8217;m confident that these efforts can succeed. Some of them are taking place right now. I want to thank President Biden for his steadfast efforts on behalf of the hostages and for his efforts to the hostage families as well. I thank President Biden for his heartfelt support for Israel after the savage attack on October 7th. He rightly called Hamas &#8220;sheer evil.&#8221; He dispatched two aircraft carriers to the Middle East to deter a wider war, and he came to Israel to stand with us during our darkest hour—a visit that will never be forgotten.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israel&#8217;s Brave Soldiers</h2>\n\n\n\n<p>President Biden and I have known each other for over 40 years. I want to thank him for half a century of friendship to Israel and for being, as he says, a proud Zionist. Actually, he says a proud Irish American Zionist. My friends, for more than nine months, Israel&#8217;s soldiers have shown boundless courage. With us today is Lieutenant Aruen AB, an officer in the Israeli paratroopers. His family immigrated to Israel from Ethiopia. In the early hours of October 7th, Aruen heard the news of Hamas&#8217;s bloody rampage. He put on his uniform, grabbed his rifle, but he didn&#8217;t have a car, so he ran eight miles to the front lines of Gaza to defend his people. You hear that right: he ran eight miles, came to the front lines, killed many terrorists, and saved many, many, many lives. We all honor your remarkable heroism.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Heroes Among Us</h2>\n\n\n\n<p>Another Israeli is with us here today, standing next to Lieutenant Aruen. This is Master Sergeant Ash Al Bakiri. Ashraf is a veteran soldier from the Israeli Muslim community of Rahat. On October 7th, Ashraf also killed many terrorists. First, he defended his comrades in the military base, and then he rushed to defend the neighboring communities, including the devastated community of Kibbutz Be&#8217;eri. Like Ashraf, the Muslim soldiers of the IDF fought alongside their Jewish, Druze, Christian, and other comrades in arms with tremendous bravery. A third hero, Lieutenant Asa Sopur, is also here with us. Asa fought as an officer in the tank corps and was wounded in battle. He lost his right arm and the vision in his left eye. He&#8217;s recovering and, incredibly, will soon return to active duty as a commander of a tank company. I just learned there is a fourth hero here, Lieutenant Jonathan Benun, who lost a leg in Gaza and continued to fight.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Spirit of the IDF</h2>\n\n\n\n<p>My friends, these are the soldiers of Israel: unbowed, undaunted, unafraid. As the Bible says, &#8220;They shall rise like lions.&#8221; They have risen like lions, the Lions of Judah, the Lions of Israel. Ladies and gentlemen, the men and women of the IDF come from every corner of Israeli society, every ethnicity, every color, every creed, left and right, religious and secular. All are imbued with the indomitable spirit of the Maccabees, the legendary Jewish warriors of antiquity. With us today is Yakir, the father of one of those Maccabees. Yakir&#8217;s father escaped the Holocaust and found refuge in America. As a young man, Yakir moved to Israel and raised a family of eight children. He named his son Moshe after his late father. Moshe became an exemplary officer in one of our commando units. He served with distinction for two decades while raising six beautiful children of his own. On October 7th, Moshe volunteered to return to combat. Four weeks later, he was killed when a booby-trapped mine exploded in a tunnel shaft right next to a mosque.</p>\n\n\n\n<h2 class=\"wp-block-heading\">A Pledge to the Families</h2>\n\n\n\n<p>At his son&#8217;s funeral, Yakir said this: &#8220;If the state of Israel had not been established after the Holocaust, the image engraved in our collective memory would have been the photograph of that helpless Jewish boy in the Warsaw Ghetto holding his hands up in the air with Nazi rifles pointed at him. But because of the birth of Israel,&#8221; Yakir continued, &#8220;because of the courage of soldiers like my son Moshe, the Jewish people are no longer helpless in the face of our enemies.&#8221; Please rise so we can honor your son&#8217;s sacrifice. And I pledge to you and to all the bereaved families of Israel, some of whom are in this hall today: the sacrifice of your loved ones will not be in vain. It will not be in vain because, for Israel, &#8220;never again&#8221; must never be an empty promise. It must always remain a sacred vow. And after October 7th, &#8220;never again&#8221; is now.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Battle of Good and Evil</h2>\n\n\n\n<p>My friends, defeating our brutal enemies requires both courage and clarity. Clarity begins by knowing the difference between good and evil. Yet incredibly, many anti-Israel protesters choose to stand with evil. They stand with Hamas; they stand with rapists and murderers. They stand with people who came into the kibbutzim, into a home where parents hid their children in the attic, in a secret attic. They murdered the parents, found the secret latch to the hidden attic, and then murdered the babies. These protesters stand with them. They should be ashamed of themselves. They refuse to make the simple distinction between those who target terrorists and those who target civilians, between the democratic state of Israel and the terrorist thugs of Hamas.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Role</h2>\n\n\n\n<p>We recently learned from the Director of National Intelligence that Iran is funding and promoting anti-Israel protests in America. They want to disrupt America, so these protesters burn American flags even on the 4th of July. I wish to salute the fraternity brothers at the University of North Carolina who protected the American flag against these anti-Israel protesters. For all we know, Iran is funding the anti-Israel protests that are going on right now outside this building—not that many, but they&#8217;re there—and throughout the city. I have a message for these protesters: When the tyrants of Tehran, who hang gays from cranes and murder women for not covering their hair, are praising, promoting, and funding you, you have officially become Iran&#8217;s useful idiots. Some of these protesters hold up signs proclaiming &#8220;Gays for Gaza.&#8221; They might as well hold up signs saying &#8220;Chickens for KFC.&#8221; These protesters chant &#8220;From the river to the sea,&#8221; but many don&#8217;t have a clue what river and what sea they&#8217;re talking about. They not only get an F in geography, but they also get an F in history. They call Israel a colonialist state. Don&#8217;t they know that the land of Israel is where Abraham, Isaac, and Jacob prayed, where Isaiah and Jeremiah preached, and where David and Solomon ruled? For nearly 4,000 years, the land of Israel has been the homeland of the Jewish people. It&#8217;s always been our home, and it will always be our home.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Misguided Academics</h2>\n\n\n\n<p>It&#8217;s not only the campus protesters who get it wrong; it&#8217;s also the people who run those campuses. Eighty years after the Holocaust, the presidents of Harvard, Penn, and, I&#8217;m ashamed to say, my alma mater MIT, couldn&#8217;t bring themselves to condemn the calls for the genocide of Jews. You remember what they said. They said it depends on the context. Well, let me give these befuddled academics a little context: anti-Semitism is the world&#8217;s oldest hatred. For centuries, the massacre of Jews was always preceded by wild accusations. We were accused of everything from poisoning wells to spreading plagues to using the blood of slaughtered children to bake Passover matzos. These preposterous anti-Semitic lies led to persecution, mass murder, and ultimately to history&#8217;s worst genocide, the Holocaust. Now, just as malicious lies were leveled for centuries at the Jewish people, malicious lies are now being leveled at the Jewish state. The outrageous slanders that paint Israel as racist and genocidal are meant to delegitimize Israel, to demonize the Jewish state, and to demonize Jews everywhere.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Rising Anti-Semitism</h2>\n\n\n\n<p>No wonder we&#8217;ve witnessed an appalling rise in anti-Semitism in America and around the world. My friends, whenever and wherever we see the scourge of anti-Semitism, we must unequivocally condemn it and resolutely fight it without exception. And don&#8217;t be fooled when the blood libels against the Jewish state come from people who wear fancy silk robes and speak in lofty tones about law and justice. Here&#8217;s a case in point: the prosecutor of the International Criminal Court has shamefully accused Israel of deliberately starving the people of Gaza. This is utter, complete nonsense. It&#8217;s a complete fabrication. Israel has enabled more than 40,000 trucks to enter Gaza, that&#8217;s half a million tons of food, and that&#8217;s more than 3,000 calories for every man, woman, and child in Gaza. If there are Palestinians in Gaza who aren&#8217;t getting enough food, it&#8217;s not because Israel is blocking it; it&#8217;s because Hamas is stealing it.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israel&#8217;s Conduct in War</h2>\n\n\n\n<p>The ICC accuses Israel of deliberately targeting civilians. What in God&#8217;s green earth is he talking about? The IDF has dropped millions of flyers, sent millions of text messages, made hundreds of thousands of phone calls to get Palestinian civilians out of harm&#8217;s way. But at the same time, Hamas does everything in its power to put Palestinian civilians in harm&#8217;s way. They fire rockets from schools, from hospitals, from mosques. They even shoot their own people when they try to leave the war zone. A senior Hamas official, Fathi Hammad, boasted, listen to this, he boasted that Palestinian women and children excel at being human shields. His words: excel at being human shields. What monstrous evil. For Israel, every civilian death is a tragedy; for Hamas, it&#8217;s a strategy. They actually want Palestinian civilians to die so that Israel will be smeared in the international media and be pressured to end the war before it&#8217;s won. This would enable Hamas to survive another day, and as they&#8217;ve vowed, to carry out October 7th again and again and again. Well, I want to assure you, no matter what pressure is brought to bear, I will never allow that to happen.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Support for Israel</h2>\n\n\n\n<p>The vast majority of Americans have not fallen for this Hamas propaganda. They continue to support Israel, and I want to say thank you, America, and thank you, senators and house members who continue to support us, continue to support Israel, continue to support the truth, and see through the lies. But as for the minority that may have fallen for Hamas&#8217;s con job, I suggest you listen to Colonel John Spencer. John Spencer is head of Urban Warfare Studies at West Point. He studied every major urban conflict in history. Israel, he said, has implemented more precautions to prevent civilian harm than any military in history and beyond what international law requires. That&#8217;s why, despite all the lies you&#8217;ve heard, the war in Gaza has one of the lowest ratios of combatants to non-combatants casualties in the history of urban warfare. And you want to know where it&#8217;s lowest in Gaza? It&#8217;s lowest in Rafah. In Rafah. Remember what so many people said, if Israel goes into Rafah, there&#8217;ll be thousands, maybe even tens of thousands of civilians killed. Well, last week I went into Rafah. I visited our troops as they finished fighting Hamas&#8217;s remaining terrorist battalions. I asked the commander there, how many terrorists did you take out in Rafah? He gave me an exact number: 123. I asked him, how many civilians were killed? He said, Prime Minister, practically none. With the exception of a single incident where shrapnel from a bomb hit a Hamas weapons depot and unintentionally killed two dozen people, the answer is practically none. You want to know why? Because Israel got the civilians out of harm&#8217;s way, something people said we could never do. But we did it. These heroes here today, the heroic soldiers of Israel, should not be condemned for how they&#8217;re conducting the war in Gaza; they should be commended for it.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The ICC&#8217;s Dangerous Lies</h2>\n\n\n\n<p>I want to thank all of you here today who forcefully opposed the false accusations of the ICC and stood up for the truth. These lies are not only lies; they&#8217;re downright dangerous. The ICC is trying to shackle Israel&#8217;s hands and prevent us from defending ourselves. And if Israel&#8217;s hands are tied, America is next. And I&#8217;ll tell you what else is next: the ability of all democracies to fight terrorism will be imperiled. That&#8217;s what&#8217;s on the line. So let me assure you, the hands of the Jewish state will never be shackled. Israel will always defend itself.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran: The Root of Terror</h2>\n\n\n\n<p>My friends, in the Middle East, Iran is virtually behind all the terrorism, all the turmoil, all the chaos, all the killing. And that should come as no surprise. When he founded the Islamic Republic, Ayatollah Khomeini pledged, &#8220;We will export our revolution to the entire world.&#8221; Now ask yourself, which country ultimately stands in the way of Iran&#8217;s maniacal plans to impose radical Islam on the world? And the answer is clear: it&#8217;s America, the guardian of Western civilization and the world&#8217;s greatest power. That&#8217;s why Iran sees America as its greatest enemy. Last month, we heard a revealing comment, ostensibly about the war in Gaza but about something else. It came from the foreign minister of Iran&#8217;s proxy Hezbollah, and he said this: &#8220;This is not a war with Israel. Israel,&#8221; he said, &#8220;is merely a tool. The main war, the real war, is with America.&#8221; Iran&#8217;s regime has been fighting America from the moment it came to power in 1979. It stormed the American Embassy, it held scores of Americans hostage for 444 days. Since then, Iran&#8217;s terrorist proxies have targeted America in the Middle East and beyond. In Beirut, they killed 241 US servicemen. In Africa, they bombed American embassies. In Iraq, they supplied explosives to maim and kill thousands of American soldiers. In America, they actually sent death squads here to murder a former Secretary of State and a former National Security Adviser. And as we recently learned, they even brazenly threatened to assassinate President Trump.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Fight Against Iran</h2>\n\n\n\n<p>But Iran understands that to truly challenge America, it must first conquer the Middle East. And for this, it uses its many proxies, including the Houthis, Hezbollah, and Hamas. Yet in the heart of the Middle East, standing in Iran&#8217;s way is one proud pro-American democracy: my country, the state of Israel. That&#8217;s why the mobs in Tehran chant &#8220;Death to Israel&#8221; before they chant &#8220;Death to America.&#8221; For Iran, Israel is first; America is next. So when Israel fights Hamas, we&#8217;re fighting Iran. When we fight Hezbollah, we&#8217;re fighting Iran. When we fight the Houthis, we&#8217;re fighting Iran. And when we fight Iran, we&#8217;re fighting the most radical and murderous enemy of the United States of America. And one more thing: when Israel acts to prevent Iran from developing nuclear weapons, nuclear weapons that could destroy Israel and threaten every American city, every city that you come from, we&#8217;re not only protecting ourselves; we&#8217;re protecting you. My friends, if you remember one thing from this speech, remember this: our enemies are your enemies, our fight is your fight, and our victory will be your victory.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israel&#8217;s Commitment</h2>\n\n\n\n<p>Ladies and gentlemen, that victory is in sight. Israel&#8217;s defeat of Hamas will be a powerful blow to Iran&#8217;s axis of terror. Another part of that axis, Hezbollah, attacked Israel on October 8th, a day after the Hamas attack. It has launched thousands of missiles and drones against us. Eighty thousand of our citizens in northern Israel evacuated their homes, becoming effectively refugees in their own land. We are committed to returning them home. We prefer to achieve this diplomatically, but let me be clear: Israel will do whatever it must do to restore security to our northern border and return our people safely to their homes.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Recent Attacks and Responses</h2>\n\n\n\n<p>Last Friday, a third Iranian proxy, the Houthis, attacked Tel Aviv with a deadly drone. It exploded a few hundred feet from the American Consulate, killing one person and injuring nine. On Saturday, I authorized a swift response to that attack. All our enemies should know this: those who attack Israel will pay a very heavy price. And as we defend ourselves on all fronts, I know that America has our back, and I thank you for it.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Military Assistance and Cooperation</h2>\n\n\n\n<p>For decades, America has provided Israel with generous military assistance, and a grateful Israel has provided America with critical intelligence that saved many lives. We&#8217;ve jointly developed some of the most sophisticated weapons on Earth that help protect both our countries, and we also help keep American boots off the ground while protecting our shared interests in the Middle East. I deeply appreciate America&#8217;s support, including in this current war. But this is an exceptional moment. Fast-tracking US military aid can dramatically expedite an end to the war in Gaza and help prevent a broader war in the Middle East. In World War II, as Britain fought on the front lines of civilization, Winston Churchill appealed to Americans with these famous words: &#8220;Give us the tools, and we&#8217;ll finish the job.&#8221; Today, as Israel fights on the front line of civilization, I too appeal to America: give us the tools faster, and we&#8217;ll finish the job faster.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Vision for Gaza</h2>\n\n\n\n<p>My dear friends, the war in Gaza could end tomorrow if Hamas surrenders, disarms, and returns all the hostages. But if they don&#8217;t, Israel will fight until we destroy Hamas&#8217;s military capabilities, end its rule in Gaza, and bring all our hostages home. That&#8217;s what total victory means, and we will settle for nothing less. The day after we defeat Hamas, a new Gaza could emerge. My vision for that day is of a demilitarized and deradicalized Gaza. Israel does not seek to resettle Gaza, but for the foreseeable future, we must retain overriding security control there to prevent the resurgence of terror and to ensure that Gaza never again poses a threat to Israel. Gaza should have a civilian administration run by Palestinians who do not seek to destroy Israel. That&#8217;s not too much to ask; it&#8217;s a fundamental thing that we have a right to demand and to receive. A new generation of Palestinians must no longer be taught to hate Jews, but rather to live in peace with us.</p>\n\n\n\n<h2 class=\"wp-block-heading\">A Vision for the Broader Middle East</h2>\n\n\n\n<p>Those twin words, demilitarization and deradicalization, those two concepts were applied to Germany and Japan after World War II, and that led to decades of peace, prosperity, and security. Following our victory, with the help of regional partners, the demilitarization and deradicalization of Gaza can also lead to a future of security, prosperity, and peace. That&#8217;s my vision for Gaza. Now, here&#8217;s my vision for the broader Middle East. It&#8217;s also shaped in part by what we saw in the aftermath of World War II. After that war, America forged a security alliance in Europe to counter the growing Soviet threat. Likewise, America and Israel today can forge a security alliance in the Middle East to counter the growing Iranian threat. All countries that are at peace with Israel, and all those countries who will make peace with Israel, should be invited to join this alliance.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Abraham Alliance</h2>\n\n\n\n<p>We saw a glimpse of that potential alliance on April 14th. Led by the United States, more than half a dozen nations worked alongside Israel to help neutralize hundreds of missiles and drones launched by Iran against us. Thank you, President Biden, for bringing that coalition together. This new alliance I envision would be a natural extension of the groundbreaking Abraham Accords. Those Accords saw peace forged between Israel and four Arab countries, and they were supported by Republicans and Democrats alike. We could call this new alliance the Abraham Alliance.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Acknowledging President Trump</h2>\n\n\n\n<p>I want to thank President Trump for his leadership in brokering the historic Abraham Accords. Like Americans, Israelis were relieved that President Trump emerged safe and sound from that dastardly attack on him, an attack on American democracy. There is no room for political violence in democracies. I also want to thank President Trump for all the things he did for Israel, from recognizing Israel&#8217;s sovereignty over the Golan Heights to confronting Iran&#8217;s aggression to recognizing Jerusalem as our capital and moving the American Embassy there. That&#8217;s Jerusalem, our eternal capital, never to be divided again.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Hope for the Future</h2>\n\n\n\n<p>My dear friends, Democrats and Republicans, despite these times of upheaval, I am hopeful about the future. I&#8217;m hopeful about Israel because my people, the Jewish people, emerged from the depths of hell, from dispossession and genocide, and against all odds, we restored our sovereignty in our ancient homeland. We built a powerful and vibrant democracy, a democracy that pushes the boundaries of innovation for the betterment of all humanity. I&#8217;m hopeful about America because I&#8217;m hopeful about Americans. I know how much the people of this country have sacrificed to defend freedom. America will continue to be a force for light and good in a dark and dangerous world. For free peoples everywhere, America remains the beacon of liberty its extraordinary founders envisioned back in 1776.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>Working together, I&#8217;m confident that our two nations will vanquish the tyrants and terrorists who threaten us both. As Israel&#8217;s Prime Minister, I promise you this: no matter how long it takes, no matter how difficult the road ahead, Israel will not relent. Israel will not bend. We will defend our land, we will defend our people, we will fight until we achieve victory—victory of liberty over tyranny, victory of life over death, victory of good over evil. That&#8217;s our solemn commitment, and we will continue to work with the United States and our Arab partners to transform a troubled region from a backwater of repression, poverty, and war into a thriving oasis of dignity, prosperity, and peace. In this noble mission, as in many others, Israel will always remain America&#8217;s indispensable ally. Through thick and thin, in good times and in bad, Israel will always be your loyal friend and your steadfast partner.</p>\n\n\n\n<p>On behalf of the people of Israel, I came here today to say thank you, America. Thank you for your support and solidarity. Thank you for standing with Israel in our hour of need. Together, we shall defend our common civilization. Together, we shall secure a brilliant future for both our nations. May God bless Israel, may God bless America, and may God bless the great alliance between Israel and America forever. Thank you.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>In a historic address to Congress, Israeli Prime Minister <a  href=\"https://iron-swords.co.il/t/benjamin-netanyahu/\">Benjamin Netanyahu</a> emphasized the unity between <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a> and the United States against threats from <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a> and its proxies. He honored the courage of Israeli soldiers, expressed gratitude for U.S. support, and called for continued collaboration to secure peace, prosperity, and mutual security.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6603,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "wds_primary_category": 53,
        "footnotes": ""
    },
    "categories": [
        53
    ],
    "tags": [
        412
    ],
    "class_list": [
        "post-6601",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-facts",
        "tag-benjamin-netanyahu"
    ],
    "lang": "en",
    "translations": {
        "en": 6601
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6601",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6601"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6601/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6608,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6601/revisions/6608"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6603"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6601"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6601"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6601"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}