{
    "id": 6265,
    "date": "2024-07-15T15:00:00",
    "date_gmt": "2024-07-15T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6265"
    },
    "modified": "2024-08-16T11:42:38",
    "modified_gmt": "2024-08-16T08:42:38",
    "slug": "unrwa-makes-peace-impossible-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/unrwa-makes-peace-impossible-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "UNRWA Makes Peace Impossible | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"UNRWA Makes Peace Impossible | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/vl8FqyMCxpA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h2 class=\"wp-block-heading\">Daily Briefing Introduction</h2>\n\n\n\n<p>This is the daily briefing of the Israeli citizen spokesperson&#8217;s office. We&#8217;re live on all social media platforms: YouTube, Instagram, Twitter, and LinkedIn. Please like and subscribe across all our platforms and to my personal platforms at Asher Westrop. It really helps to spread the message. You can start submitting questions in the chat, and I&#8217;ll get to as many as I can at the end of the briefing.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israeli Air Force Strike in Gaza</h2>\n\n\n\n<p>Last night, the Israeli Air Force targeted a number of Hamas terrorists operating in an UNRWA school in the town of Ner At in central Gaza. The IDF announced the strike in a press release, but it attracted very little media attention. Hamas uses UNRWA facilities so often that it is no longer considered news. The idea that UNRWA is an asset utilized by Hamas is an uncomfortable truth that many simply prefer to ignore.</p>\n\n\n\n<h2 class=\"wp-block-heading\">IDF Raid on UNRWA Headquarters</h2>\n\n\n\n<p>Three days ago, the IDF received intelligence that Hamas and Islamic Jihad were using UNRWA&#8217;s Gaza headquarters as a military base. The IDF raided the complex and captured Hamas terrorists who tried to escape. Inside UNRWA&#8217;s headquarters, the IDF found drones, war rooms used for surveillance operations, rockets, machine guns, mortars, bombs, and grenades.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Silence from UNRWA Leadership</h2>\n\n\n\n<p>It&#8217;s incredible that the head of UNRWA, Philippe Lazzarini, said nothing about Hamas taking over UNRWA&#8217;s headquarters in Gaza and turning it into a military base. Instead, Lazzarini was begging UN donors to give more money to UNRWA. Similarly, the Secretary-General of the United Nations, Antonio Guterres, had nothing to say about Hamas using UN&#8217;s headquarters as a military base. Instead, he too was asking for more donations for UNRWA.</p>\n\n\n\n<h2 class=\"wp-block-heading\">UNRWA&#8217;s Role and Impact</h2>\n\n\n\n<p>Nine months after the October 7 Massacre and all we&#8217;ve learned about how UNRWA is a front for Hamas, it should be clear that UNRWA provides no hope and no stability. UNRWA exacerbates despair and incitement and is an obstacle to peace. UNRWA teaches Palestinians that their conflict with Israel should continue until there is no Israel, perpetuating a forever war. The UN&#8217;s mandate tells the grandchildren and great-grandchildren of Palestinian refugees from 76 years ago that they receive free healthcare and education courtesy of European and American donations until they have the right to immigrate to Israel and change the country&#8217;s name to Palestine. Frankly, it&#8217;s absurd that donors would want to pay for these ideas. UNRWA exists to make resolving this conflict impossible.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Call for Dismantling UNRWA</h2>\n\n\n\n<p>There cannot be a solution to the Israeli-Palestinian conflict if UNRWA continues to exist. UNRWA should be completely dismantled, and whatever services it provides to Palestinians should be provided by the Palestinian Authority, the Jordanian government, or international aid agencies that do not have terrorists on their payroll.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israeli Foreign Ministry&#8217;s Demand</h2>\n\n\n\n<p>Earlier this month, the Israeli Foreign Ministry sent a letter to UNRWA Chief Philippe Lazzarini listing 108 UNRWA employees known to be Hamas or Palestinian Islamic Jihad terrorists. The Israeli Foreign Ministry demanded that these employees be fired immediately. We should all be asking how there are so many terrorists on the UN payroll, whether these terrorists will be fired, and why it is so hard for so many people to accept the truth about UNRWA.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Q&amp;A Session</h2>\n\n\n\n<h3 class=\"wp-block-heading\">UNRWA&#8217;s Current Operations</h3>\n\n\n\n<p><strong>Robin on Instagram Live asks:</strong> Is UNRWA still in operation? Are there still people drawing paychecks, and if so, what are they doing? Has the UN suspended them or punished them in any way?</p>\n\n\n\n<p><strong>Response:</strong> Thank you for asking that question, Robin. As I&#8217;ve just mentioned, UNRWA is very much still in operation and is being defended by Secretary-General Antonio Guterres, UNRWA head Philippe Lazzarini, and many others who say that UNRWA is the only solution and the status quo must be maintained. Despite its 76-year-old mission continuing to be a failure, they support a status quo misaligned with the reality in Gaza and for Palestinians in general. The idea that they can return as refugees to a land that no longer exists and remove Israel is frankly ludicrous. Israel is here to stay, and this needs to be recognized.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Anti-Jewish Conspiracy Theories</h3>\n\n\n\n<p><strong>Twitter Direct Message:</strong> In the aftermath of the near assassination of former President Trump, there has been a proliferation of anti-Jewish conspiracy theories online. Do you have any thoughts on this and what can be done to combat such hatred?</p>\n\n\n\n<p><strong>Response:</strong> This is nothing new. When societies struggle, it has become common to blame the Jews. This ancient hatred, known as anti-Semitism, is something we must continue to fight. As the Jewish people, the people of Israel, and our allies, it is critical to stand together, define and defend the truth, and not fall prey to these conspiracies. We must work from grassroots positions and positions of power to push back against these baseless conspiracy theories, and we will continue to do so.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Stance on Hezbollah</h3>\n\n\n\n<p><strong>EAI on Instagram Live writes:</strong> Has Israel given a deadline to Hezbollah to back away until it will get backed away by force for the safe return of the North&#8217;s citizens to their homes?</p>\n\n\n\n<p><strong>Response:</strong> The situation in Israel&#8217;s North is incredibly complex. Hezbollah stands at Israel&#8217;s borders with hundreds of thousands of rockets, drones, missiles, and other weapons aimed at Israel and its people. While it is critical for Hezbollah to move back behind the Litani River, setting concrete deadlines is nearly impossible. Israel is trying its best to ensure the safety and security of its people and will act accordingly to protect them.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Humanitarian Aid to Gaza</h3>\n\n\n\n<p><strong>Sarah via Instagram Stories asks:</strong> What is the situation with humanitarian aid going into Gaza? Are the border crossings still open? How much is going in, and what are Israel&#8217;s priorities in dealing with the humanitarian situation in Gaza at this time?</p>\n\n\n\n<p><strong>Response:</strong> The latest reports indicate efforts to clear the backlog at the Kerem Shalom crossing, improving medical services and sanitation in Gaza. Yesterday, 211 trucks entered Gaza. Despite Hamas&#8217;s failures as the de facto government in Gaza, Israel continues to provide humanitarian aid. Over 1.2 billion pounds of food aid have been provided since the start of the war. However, the distribution mechanisms by UNRWA and others are failing, making it difficult for Israel to do more than it can.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Status of Hostages</h3>\n\n\n\n<p><strong>Instagram Live:</strong> There are a lot of questions about the hostages. What do we know about them?</p>\n\n\n\n<p><strong>Response:</strong> Unfortunately, we do not have new information about the hostages. The CFI negotiations with Hamas continue, but we have not had Red Cross access to the hostages to determine their status. The key goal is to return the 120 hostages still held inside Gaza. This is a precondition for any negotiations with Hamas, and we will continue to fight day and night for their return.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Future of Jews in France</h3>\n\n\n\n<p><strong>Rachel on Twitter writes:</strong> The Paris Grand Synagogue Rabbi says there&#8217;s no future for Jews in France. Do you think the Jews in Paris should leave and come to Israel or stay and fight?</p>\n\n\n\n<p><strong>Response:</strong> I believe a country like France, with its deep history with the Jewish people, should not forgo that history. Jewish diaspora communities are a critical part of the Jewish experience and connection to the world. It is essential to build and strengthen Jewish communities worldwide and fight against anti-Semitism. Jews should stand together, whether in Israel or the diaspora, and fight for our rights and community strength.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>That is all the questions we have time for today. Please like and subscribe to everything we do across multiple platforms. It is crucial to help us get this message out and spread it far and wide. Thank you for watching. I&#8217;ve been Asher Westrop Evans.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The Israeli citizen spokesperson&#8217;s office discussed IDF operations against <a  href=\"/hamas\">Hamas</a> using <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a> facilities, criticized UNRWA and its leadership for supporting terrorists, and called for its dismantling. They addressed the proliferation of anti-Jewish conspiracy theories, the complex situation with <a  href=\"/hezbollah\">Hezbollah</a>, humanitarian aid to <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, and the need for global Jewish solidarity.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6279,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306
    ],
    "class_list": [
        "post-6265",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans"
    ],
    "lang": "en",
    "translations": {
        "en": 6265
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6265",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6265"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6265/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6280,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6265/revisions/6280"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6279"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6265"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6265"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6265"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}