{
    "id": 18497,
    "date": "2024-07-31T22:22:00",
    "date_gmt": "2024-07-31T19:22:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=18497"
    },
    "modified": "2024-11-05T09:16:19",
    "modified_gmt": "2024-11-05T07:16:19",
    "slug": "unrwas-deception-the-farce-of-neutrality-and-lazzarinis-failure",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/know-your-enemies/unrwa/unrwas-deception-the-farce-of-neutrality-and-lazzarinis-failure/",
    "title": {
        "rendered": "UNRWA&#8217;s Deception: The Farce of &#8220;Neutrality&#8221; and Lazzarini&#8217;s Failure"
    },
    "content": {
        "rendered": "\n<p>Six months have dragged on since the damning revelations of UNRWA&#8217;s complicity with Hamas broke into the public sphere, and what has been done? Absolutely nothing. UNRWA Commissioner-General Philippe Lazzarini continues his charade, misleading donor nations while the organization remains infested with members of terrorist groups. His recent, half-hearted declaration in late June that “membership in any militant or armed group” is prohibited for UNRWA employees is too little, too late, and nothing short of an insult to intelligence.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Lazzarini&#8217;s Lip Service and Meaningless Words</h3>\n\n\n\n<p>Even in making this belated statement, Lazzarini failed to specify what UNRWA considers a &#8220;militant or armed group.&#8221; Why? Because just months ago, the UN’s own humanitarian chief revealed that for the UN, “Hamas is not a terrorist group; it is a political movement.” Such a stance renders Lazzarini&#8217;s statement impotent and void of any real meaning. If he had the will to act truthfully, he would have explicitly stated that Hamas and Islamic Jihad are prohibited organizations within UNRWA. This lack of clarity only serves to perpetuate a facade of neutrality while protecting operatives of terror.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Actions Speak Louder than Words—Lazzarini Has Done Neither</h3>\n\n\n\n<p>The Commissioner-General has not lifted a finger to ensure that membership in an armed group results in termination. Revised UNRWA staff rules, issued in June, absurdly fail to classify membership in a terrorist organization as &#8220;serious misconduct,&#8221; which would empower the Commissioner-General to dismiss offenders. Where is the integrity in that? Lazzarini has made no move to dismiss staff known to be part of terrorist factions. The so-called &#8220;Action Plan&#8221; he presented is a joke: it relies solely on the honesty of applicants during recruitment and minor revisions to hiring contracts.</p>\n\n\n\n<p>Lazzarini received a list of 100 UNRWA employees identified by Israel as military operatives of Hamas and PIJ. What did he do? Nothing. Not a single suspension, not one investigation. Israel, sharing critical intelligence with trusted partners, provided this information to help ensure transparency and action. But Lazzarini ignored it, choosing instead to bury these truths under bureaucratic stonewalling and willful inaction.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Donor Nations, Wake Up!</h3>\n\n\n\n<p>It is time for donor nations to realize that continued funding of UNRWA without holding Lazzarini accountable equates to funding terrorism. His calculated evasions betray his unwillingness to acknowledge the plain truth: UNRWA is compromised. This organization, under Lazzarini’s guidance, maintains links with Hamas, actively or passively supporting its agenda under the guise of humanitarian aid. Even more galling, Lazzarini has reportedly intervened to reinstate a dismissed UNRWA employee in Lebanon known to be a high-ranking Hamas member. This is not negligence—it is tacit approval of terror.</p>\n\n\n\n<h3 class=\"wp-block-heading\">UNRWA Must Be Replaced</h3>\n\n\n\n<p>Israel has consistently argued that the UN is incapable of running an operation of this scale in Gaza without it becoming infiltrated by terrorist groups. UNRWA’s structure, which relies almost entirely on local staff, makes it a perfect Trojan horse for Hamas. This isn’t conjecture; it’s an established pattern proven time and again by uncovered scandals, from hidden military installations under UNRWA facilities to personnel participating in massacres.</p>\n\n\n\n<p>The time has come to phase out UNRWA in Gaza and replace it with organizations that can maintain strict oversight, ensuring that humanitarian assistance remains untainted by terror. The current UNRWA leadership, especially Philippe Lazzarini, is not only complicit but also a barrier to genuine reform.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Stop Funding Terror</h3>\n\n\n\n<p>Governments and taxpayers must stop being deceived by Lazzarini&#8217;s smoke and mirrors. Without decisive action to root out terrorist affiliations within UNRWA, any further funding of this organization is nothing short of indirect support for Hamas and PIJ. The facts are clear, and the choice is simple: end the charade or acknowledge your complicity in funding terror.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Six months on, <a  href=\"https://iron-swords.co.il/c/know-your-enemies/unrwa/\">UNRWA</a> Commissioner-General Lazzarini continues misleading donors, ignoring <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>’s evidence of terrorist infiltration, failing necessary action.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 18499,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "wp-custom-template-unrwa",
    "format": "standard",
    "meta": {
        "wds_primary_category": 1342,
        "footnotes": ""
    },
    "categories": [
        1342
    ],
    "tags": [
        1663,
        1340
    ],
    "class_list": [
        "post-18497",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-unrwa",
        "tag-philippe-lazzarini",
        "tag-the-un"
    ],
    "lang": "en",
    "translations": {
        "en": 18497
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18497",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=18497"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18497/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 18500,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/18497/revisions/18500"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/18499"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=18497"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=18497"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=18497"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}