{
    "id": 6159,
    "date": "2024-07-10T15:00:00",
    "date_gmt": "2024-07-10T12:00:00",
    "guid": {
        "rendered": "https://iron-swords.co.il/?p=6159"
    },
    "modified": "2024-08-16T11:43:08",
    "modified_gmt": "2024-08-16T08:43:08",
    "slug": "us-iran-funding-tentifadas-daily-briefing-with-asher-westropp-evans",
    "status": "publish",
    "type": "post",
    "link": "https://iron-swords.co.il/israeli-citizen-spokesperson/us-iran-funding-tentifadas-daily-briefing-with-asher-westropp-evans/",
    "title": {
        "rendered": "US: Iran Funding Tentifadas | Daily Briefing with Asher Westropp-Evans"
    },
    "content": {
        "rendered": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"US: Iran Funding Tentifadas | Daily Briefing with Asher Westropp-Evans\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/L6BCGMDVjc0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Hello everyone, I am citizen spokesperson Asher Westrop Evans, and this is the daily briefing of the Israeli Citizen Spokesperson&#8217;s Office. We are live on YouTube, Instagram, and Twitter. Please begin submitting questions in the chat and search for the Israeli Citizen Spokesperson&#8217;s Office on all major podcast platforms for an audio-only version each and every day. Please like and subscribe to help us reach a wider audience—it genuinely helps us get our message out to the people.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Day 278 of the October 7th War</h2>\n\n\n\n<p>Today is day 278 of the October 7th War, just over 9 months since Hamas declared war on Israel with its brutal massacre and since Hezbollah joined its fellow Iranian proxy army with daily attacks on Northern Israel. Iran is trying to hijack American democracy. We&#8217;ve seen tentafathers rise up on college campuses across the US, and they are explicitly pro-Hamas, anti-Jewish, and increasingly anti-American as well.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Influence on American Protests</h2>\n\n\n\n<p>Calls for global interf, which let&#8217;s not be muddled here means targeted violence against Israelis and Jews and glory to the martyrs meaning Hamas terrorists, are heard alongside calls to dismantle the United States. In scenes reminiscent of those seen in Iran, cheering crowds are not only trashing America&#8217;s top ally, they&#8217;re burning American flags. And now we know why—Iran is funding the tentafathers. This information comes from the US Director of National Intelligence who announced, and I quote, &#8220;actors tied to Iran&#8217;s government are posing as activists, encouraging protests, and funding protesters.&#8221; The Islamic Republic isn&#8217;t embracing democracy or free expression; it brutally crushes public protests inside its own borders and enforces strict religious rule.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Strategy and Threats</h2>\n\n\n\n<p>Iran has long sought to destroy America&#8217;s allies abroad and is trying to destabilize America now at home. Ali Khamenei, Iran&#8217;s supreme leader, called the US student protests that he is funding &#8220;a branch of the resistance front,&#8221; the same as banned terror groups Hamas, Hezbollah, and the Houthis. Iran doesn&#8217;t just want Americans applauding its proxies; it sees the protests as an anti-democratic proxy army. When tentafathers activists chant &#8220;globalize the interf,&#8221; Iran knows that this is a thinly veiled dog whistle for &#8220;kill the Jews,&#8221; and when they chant &#8220;from the river to the sea,&#8221; Iran knows that they mean &#8220;destroy Israel.&#8221; Iran wants to kill the Jews and destroy Israel, and that&#8217;s why it wants to destabilize America from within.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Iran&#8217;s Historical Aggressions</h2>\n\n\n\n<p>Just as the resistance front violently destabilized Iraq, Syria, Lebanon, and Yemen and is working to destroy America&#8217;s allies abroad, Iran&#8217;s American tentafather proxy is attempting to tear apart the fabric of the American people at home. The same Iran whose proxies murdered thousands of Americans in Iraq and Afghanistan and blew up hundreds of Americans in Lebanon, who right now are firing on American ships from Yemen, is, per the US intelligence official, &#8220;seeking to stoke discord and undermine confidence in our democratic institutions, as we have seen them do in the past, including in prior election cycles.&#8221; This is part of their playbook. There should be no doubt as to who is Iran&#8217;s target now.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Threat to American Democracy</h2>\n\n\n\n<p>Iran refers to Israel as the &#8220;little Satan&#8221; but refers to America as the &#8220;great Satan.&#8221; Iran&#8217;s terror army in Lebanon, Hezbollah, last week said that their real war is with America. Everyone who took allegations of Russian election interference in 2016 as a serious threat, those who recognize the ways American democracy could be undermined by an enemy, should be very concerned by Iran. Iran is a threat to American democracy. American democracy is sacred, and it is being abused by a regime that treats real democracy as a sin.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Standing Up Against Iran</h2>\n\n\n\n<p>Standing up to Iran&#8217;s proxy armies isn&#8217;t just about protecting an ally on the front lines of the Free World; it&#8217;s about standing up for the Free World. Stopping Iran from building a proxy in America is about protecting Americans and American values around the world and at home.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Recent Attacks and Israel&#8217;s Response</h2>\n\n\n\n<p>Meanwhile, Iran&#8217;s terror army in Lebanon, Hezbollah, has murdered two more people in Israel. Noah and Neil Baranes from Kibbutz Otal, both aged 46, were driving near their home in Northern Israel when a Hezbollah rocket hit their car. They are survived by three children, now orphans. Their deaths bring the number of civilians killed in Israel by Hezbollah since the terror army declared war on Israel on October 8th to 12. Since last October, Hezbollah has launched nearly 6,000 rockets, missiles, and suicide drones from Lebanon into Israel, forcing 60,000 Israelis to flee their homes. Hezbollah has over 200,000 rockets aimed at towns across Israel, and Israel cannot and will not tolerate this state of affairs. If Hezbollah doesn&#8217;t back off and end its war, Israel will end the war by backing it off.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Israel&#8217;s Actions in Gaza</h2>\n\n\n\n<p>Meanwhile, Israel is breaking what&#8217;s left of Hamas with surprise raids wherever they may be inside Gaza. As always, Hamas terrorists continue to cynically abuse what should be protected humanitarian locations for terror operations. Myself and our team of spokespeople here have mentioned several incidents in the past week where Hamas utilized UNRWA facilities for their own terror purposes. Now, Israel has reportedly called for more civilian evacuations from Gaza City, and that is what they&#8217;re supposed to do when possible in order to try to protect civilians inside Gaza.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Criticism of Evacuation Notices</h2>\n\n\n\n<p>Yet some have criticized the evacuation notices as displacement. But what is the alternative? What do these critics actually prefer? Civilians to be caught in the crossfire, or that Hamas has more human shields to hide behind? What critics are really saying, whether they realize it or not, is that terror groups like Hamas should continue to attack from inside civilian populations, and no one should be allowed to stop them. We here at the Israeli Citizen Spokesperson&#8217;s Office think that that is bad for civilians.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Humanitarian Aid to Gaza</h2>\n\n\n\n<p>While Israel, which actually cares about Gazan civilians, this week has transferred over 18 tons of baby formula into Gaza, sufficient to support the nutritional needs of infants there for over 6 months, Israel also sent 30,000 vaccines for diphtheria and tetanus donated by UNICEF. This is in addition to over 2 million vaccines for other diseases. Yesterday, 224 trucks of humanitarian goods entered the Gaza Strip, but 115 trucks are still waiting to be collected by the UN from the Gazan side of the Kerem Shalom Crossing into the Gaza Strip. This is the state of affairs as it stands right now.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Audience Questions</h2>\n\n\n\n<p>Let&#8217;s take some questions from our audience watching live on the various social media platforms. Please do continue to submit questions as we go along, as we do refer to them and answer them whenever possible.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Displaced People in Northern Israel</h3>\n\n\n\n<p>Our first few questions come from Instagram Live. People are wondering about the displaced people in the North of Israel. Amanda is asking, &#8220;How are the displaced people managing?&#8221; and Tai is wondering, &#8220;Is there a way that Israel can assure a safe return for the citizens in the north without having an all-out war with Hezbollah?&#8221; That is an incredibly important question and one which Israel is grappling with every day.</p>\n\n\n\n<p>Firstly, to speak of the 60,000 internally displaced people that we are seeing inside Israel, they have been moved from their homes in the north, taken out from a buffer zone in the North of Israel, and forced to move into other parts of the country, often staying now, as we said earlier, for a 9-month period. At best, they are staying in hotels where available; at worst, with family, friends, or others in the community that are able to support them. But this is a difficult and trying time. If you viewers can imagine at home being removed from your home with little to no notice, left for nine months with no certain date of return—the indefinite ongoing period for people who cannot continue their lives, cannot pick their crops, return to their kibbutz or moshav, or any of the towns in which they live. This situation is frankly intolerable, and as we&#8217;ve said, if Hezbollah will not pull back from the border, it will be backed off by Israel.</p>\n\n\n\n<p>To ultimately answer the second half of that question—what Israel can do about this situation—that is the answer. The UN Security Council Resolution 1701, which said that Hezbollah needs to be back behind the Litani River line inside Lebanon, would help provide some sense of buffer zone, some sense of safety to those who could maybe consider returning at that point. But until that situation changes, it&#8217;s hard to imagine how these people are going to be able to return home with 200,000 rockets aimed at them. The situation is intolerable and it does need to change, and 9 months in, unfortunately, we don&#8217;t see a clear answer yet to what the policy is ahead. But as we&#8217;ve said so many times, this situation is intolerable, it needs to be changed, and if Hezbollah will not back off, it will be backed off.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Israel&#8217;s Strategy in Gaza</h3>\n\n\n\n<p>Our next question comes from YouTube Live. Sophie is wondering, &#8220;Why does Israel keep reinvading different parts of the Gaza Strip, and do you think that we&#8217;re winning?&#8221; This is an important question that really comes to the terms of what the goals are of Israel there inside the Gaza Strip.</p>\n\n\n\n<p>When it comes to the first part of your question about reinvading, it&#8217;s not so much reinvading; it is trying to squash the bug that is Hamas as they pop up out of the ground. Hamas has been regrouping in various parts of Northern Gaza, back in the South, reappearing in the humanitarian zones that are meant to be set aside for civilians, and it makes it increasingly difficult for Israel to try and weed out the last remnants of this group. There has been amazing success by Israel in breaking down so much of Hamas&#8217;s key infrastructure inside the strip, whether that be tunnels, weapons caches that are often hidden inside mosques, clinics, schools, hospitals, UN facilities, and more. These facilities are being taken apart, these processes are being broken down, but at the end of the day, it is an incredibly difficult battle with the hundreds of thousands of kilometers of tunnels that Hamas has built inside the Gaza Strip. The IDF is constantly seeking to find, destroy, and remove that infrastructure that makes it harder for Hamas to continue fighting and continue to threaten the populations both of Israel and the civilians inside the Gaza Strip. But at the end of the day, it is an ongoing process, and until there is some sort of change to the status quo inside Gaza, it is unlikely that this is going to come to a complete end in any form anytime soon.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Security of the Suez Canal</h3>\n\n\n\n<p>Our next question is from YouTube Live: &#8220;Given how important the trade route is along Egypt&#8217;s Suez Canal, why aren&#8217;t more countries joining the effort to defend this route against the Houthis?&#8221; This is an absolutely critical question because, as we just pointed out, the Suez Canal is one of the pivotal trade routes for the globe to access the Mediterranean, one of the key trading bases in the world. It is absolutely critical that the Red Sea and the Suez Canal be protected from the likes of the Houthis, who have been fighting and threatening ships and transport all through that region for so many months now, ostensibly under the guise of trying to fight for the rights of Palestinian people. But in fact, as we can see, when they arbitrarily target ships under the country flags of numerous different nations around the world, it is really just to get themselves back in the PR machine, back in the propaganda, back on the front pages of global headlines, and help to bolster their causes as an Iran proxy there in the region, in Yemen and beyond.</p>\n\n\n\n<p>Fortunately, there are some countries, such as the US, UK, France, and other allies, that are playing their part, but this really is a global effort to ensure that free rights to shipping, free movement of goods and people throughout the globe are maintained, and that the Suez Canal, a key point of transport for Egypt into the Mediterranean and around the world, is protected. Without this resource, we really take ourselves back many decades in terms of shipping, freight, and movement capabilities. It raises costs, raises difficulty, and threatens lives and opportunities for so many around the world. It is something that more governments should be made aware of and should be actively seeking to hunt out and destroy, because the arbitrary firing of missiles at ships across the sea is something that Israel deals with every day on all sorts of matters, but for those around the world in the shipping world and beyond, this is a reality that needs to be broken and changed as a status quo cannot continue as is.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Iran&#8217;s Intervention and Progressive Views</h3>\n\n\n\n<p>Our next question comes from Instagram Live. Mik is asking, &#8220;For many of your listeners around the world, it&#8217;s really clear about the situation of Iran&#8217;s intervention, but why is it that progressives around the world aren&#8217;t seeing it? What do you think is blocking their view from seeing the truth?&#8221;</p>\n\n\n\n<p>Mik, I think there are a number of people who are deluding themselves about the role of Iran and other negative state actors around the world. As we said, referring back to the 2016 elections in the US with accusations of Russian interference, now Iran is playing from that same playbook, looking to destabilize democracies and democratic principles in liberal democracies around the world. This is precisely where the liberal democracies of the world should be uniting as allies and like-minded peoples to join together to fight against those desperate authoritarians and fascists, whoever they may be, who want to break down the values of democracy and liberal democracy, and to weaken them the world over. Whether that be in America, Israel, the UK, France, or anywhere else in the world, my home country of Australia, it doesn&#8217;t matter where these particular threats to democracy are coming from; they need to be taken seriously as outside state actors are using the infrastructure of the modern digital world and modern digital experience to really attack and drive home interfering influences into fair democratic elections, which, as I said earlier in my briefing, in Iran and in other such countries, is regarded as a sin. Free and fair democracy is a sin, and it is one that we must fight against, because we all know in liberal democracies that it is certainly not a sin. It is the right of free peoples, and one we will fight for to the last breath.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Travel Safety in Israel</h3>\n\n\n\n<p>Our next question comes from Instagram. Lotem is wondering, &#8220;Given the situation and the war right now in Israel, do you think it&#8217;s safe for us to travel? I&#8217;ve heard it&#8217;s lovely to come in the summer, but I&#8217;m feeling worried.&#8221;</p>\n\n\n\n<p>Thank you so much for your question. If I understand correctly, you&#8217;re talking about travel inside Israel. If that is the case, then certainly Ben Gurion Airport is open. I myself have traveled inside and outside the country a number of times, and I can assure you, for those based here in Tel Aviv and in other parts of the country, it is broadly safe. Now, of course, we all recognize the neighborhood we&#8217;re in. As we spoke earlier about the 60,000 displaced people in the North of Israel facing threats from Hezbollah, unfortunately, I wish I could say that it is entirely safe, but as it stands right now, there are always risks.</p>\n\n\n\n<p>That being said, Israel has an incredible security apparatus. The Iron Dome system that manages to defend and keep Israelis safe in their beds night after night, day after day, is an incredible system. The entire weight and strength of the IDF and the people of Israel—let&#8217;s not forget the strength of the community of Israel—are here helping to fight and make sure that people feel safe and secure in their own homes, are free to move where possible. I can assure you that, although it is perhaps a little bit warm, it is a wonderful time to visit Israel at the moment, to visit its beautiful cities, parks, beaches, cafes, clubs, and so much more. Israel is alive, Israel is vibrant, Israel is functioning, and will continue to be so for the foreseeable future. That&#8217;s exactly what we&#8217;re fighting for.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Jewish Community in France</h3>\n\n\n\n<p>Our last question today comes from somebody on X. The chief Rabbi of France told the Jews that they no longer have a future there and that they should move to Israel or other safe countries around the world. &#8220;How does the Jewish community in France and other diaspora communities recognize when they should stay and fight or when they should save themselves and come to Israel?&#8221;</p>\n\n\n\n<p>This is such an important question. I know I&#8217;ve said this a few times today, but this really is a critical one, because as much as Jews in Israel and those who have made Aliyah and come to this country or lived here for many generations are critical to the right of the Jewish people to have a homeland here in the state of Israel, it is also critical that the Jews around the world do not break down their presence there, do not break down the communities that have existed for generations, for decades, if not hundreds of years in these communities, and to keep fighting for the rights to continue to be represented around the world. Israel is a critical part of the modern Jewish experience, but the diaspora community also plays a critical role. We could not do it without you. Without Jews being represented, fighting, advocating around the world for Jews everywhere, we would not have the sort of vibrant, flourishing Jewish community that we have today.</p>\n\n\n\n<p>Speaking to the French experience, it is important that the Jews there all speak and fight as a community to unify around what they have built and what right they have. It is such a vibrant Jewish community. The French Jewish community is critical, and it should continue in some form in France as a key part of the history of the Jewish people. I would say one could only feel when it is right to make Aliyah or not, to come to Israel or not, when you feel it in your own heart. But in the meantime, while you do stay in France or any other country of the diaspora around the world, you continue to work with your community to bring it to the grassroots, to join together with other Jews and other supporters of Israel, and others of like mind, to fight for those communities all around the world because they are so critical to the modern Jewish experience. I don&#8217;t think we would be the same people without you.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n\n\n\n<p>Alright, well that is all that we have time for today. I want to thank you so much for taking the time to listen. As I said, please catch us at the same time tomorrow, 3:00 p.m. Israel time or 8:00 a.m. Eastern. Please like and subscribe, share the Israeli Citizen Spokesperson&#8217;s Office Daily Briefing with a couple of people you may know. This message needs to get out; more people need to hear it. We cut this into a highlights clip just one minute long. Feel free to share that for those who don&#8217;t have the time to sit through the full briefing, but if you do, we share critical messages here each and every day, and we so value having you with us. Thanks so much. I&#8217;ve been Asher Westrop Evans. Thanks for watching.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Asher Westrop Evans, Israeli Citizen Spokesperson, briefs on the ongoing October 7th War, <a  href=\"https://iron-swords.co.il/c/know-your-enemies/iran/\">Iran</a>&#8216;s interference in American democracy, and <a  href=\"/hezbollah\">Hezbollah</a>&#8216;s attacks on Northern <a  href=\"https://iron-swords.co.il/t/israel/\">Israel</a>. He highlights Israel&#8217;s military responses, humanitarian efforts in <a  href=\"https://iron-swords.co.il/t/gaza/\">Gaza</a>, and the need for global awareness and action. Questions from social media address safety and geopolitical issues.</p>\n",
        "protected": false
    },
    "author": 1,
    "featured_media": 6161,
    "comment_status": "closed",
    "ping_status": "closed",
    "sticky": false,
    "template": "israeli-citizen-spokesperson",
    "format": "standard",
    "meta": {
        "wds_primary_category": 180,
        "footnotes": ""
    },
    "categories": [
        180
    ],
    "tags": [
        1306
    ],
    "class_list": [
        "post-6159",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-israeli-citizen-spokesperson",
        "tag-asher-westropp-evans"
    ],
    "lang": "en",
    "translations": {
        "en": 6159
    },
    "pll_sync_post": [],
    "_links": {
        "self": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6159",
                "targetHints": {
                    "allow": [
                        "GET",
                        "POST",
                        "PUT",
                        "PATCH",
                        "DELETE"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/users/1"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/comments?post=6159"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6159/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 6164,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/posts/6159/revisions/6164"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media/6161"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://iron-swords.co.il/wp-json/wp/v2/media?parent=6159"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/categories?post=6159"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://iron-swords.co.il/wp-json/wp/v2/tags?post=6159"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}